{
  "last_updated": "2026-01-12T07:49:23.295827Z",
  "event_count": 223,
  "events": [
    {
      "title": "Sudan: After 1,000 days of war, millions of civilians still bearing brunt",
      "description": "Aid agencies marked 1,000 days of war in Sudan on Friday with a grim reminder that the conflict has created the world’s biggest hunger crisis and largest displacement emergency. Every day, civilians have been “paying the price for a war they did not choose”, said UN aid coordination office, OCHA.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166730",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Opposition ‘deeply sceptical’ of Labor bill – as it happened",
      "description": "This blog is now closed PM recalls parliament to fast-track hate speech and gun laws in wake of Bondi terror attack Get our breaking news email , free app or daily news podcast Victoria premier returns to Bendigo home after evacuating during fires The Victorian premier, Jacinta Allan , has posted a video on social media returning to her home in Bendigo, after she was among thousands forced to evacuate on Friday evening due to bushfires. You can see here that the fire is still in the landscape across Mount Alexander, and just on the other side of that ridge line is the beautiful community of Harcourt. It’s where the kids went to kinder. A lot of homes that have been lost, there’s going to be a big rebuild ahead. It’s heartbreaking. Like, I’m standing here in my back yard, right? Fire’s really close. My home’s still standing and my family is safe. To get a warning to be told that it is too dangerous to stay in your own home, that you must leave, and you must leave now, it’s gut-wrenching. It’s sickening. Every time I think of this, I also think of the woman I met at the relief centre in Seymour, where she showed me on her phone the photo of her house that has been destroyed in the fires around Longwood. My heart breaks for her and everyone else who’s lost their homes. There are plenty of tough, strong people out there, not just on the fire ground, but their backup crews at the staging area, in the incident control centres, in the relief centres. We got the best of Victoria on display, the stories I’ve heard, the generosity, the support, the friendship, that is really the best of us. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/12/victoria-bushfires-adelaide-festival-writers-week-board-chair-resigns-anthony-albanese-labor-sussan-ley-coalition-ntwnfb",
      "published": "Mon, 12 Jan 2026 07:01:50 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s driver charged with dangerous driving after fatal crash in Nigeria",
      "description": "British boxer was injured in collision that killed his personal trainer Latif Ayodele and strength coach Sina Ghami Nigerian police have charged Anthony Joshua’s driver with causing death by dangerous driving after a fatal crash that killed two people. Adeniyi Mobolaji Kayode, 46, was also charged with driving without a valid driving licence and “driving without due care and attention, causing bodily harm and damage to property”. He is due to appear in court on 20 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/anthony-joshuas-driver-charged-with-dangerous-driving-after-fatal-crash-in-nigeria",
      "published": "Fri, 02 Jan 2026 17:54:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Bride and groom among 8 killed in gas cylinder blast at wedding in Pakistan",
      "description": "A gas cylinder explosion hours after a wedding reception in Pakistan's capital has killed at least eight people, including the bride and groom, and injured seven others",
      "url": "https://abcnews.go.com/International/wireStory/bride-groom-8-killed-gas-cylinder-blast-wedding-129098967",
      "published": "Sun, 11 Jan 2026 03:45:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN human rights chief ‘deeply disturbed’ by protest-related violence",
      "description": "The UN human rights chief has called for an independent and transparent investigation into reports of deaths and widespread arrests during ongoing nationwide protests in Iran, amid mounting concerns over the use of force by security forces.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166733",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "PM recalls parliament to fast-track hate speech and gun laws in wake of Bondi terror attack",
      "description": "MPs to return next week to debate new racial vilification offence, ‘hate preachers’ crackdown and gun buyback Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Anthony Albanese will push the Coalition and the Greens to support urgent legislation establishing tougher hate speech laws and gun reform, bringing MPs back to Canberra next Monday to debate laws proposed in the wake of the Bondi terror attack. Recalling parliament two weeks early, the prime minister said the new hate speech and anti-vilification laws would be considered in the same legislation as provisions to establish the biggest gun buyback program since the Port Arthur massacre. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/12/pm-recall-parliament-hate-speech-reform-bondi-terror-attack-ntwnfb",
      "published": "Mon, 12 Jan 2026 05:38:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Armed Iranian protesters battle police in Tehran streets as Trump warns of forceful US response",
      "description": "Protests in Iran turn more violent with 65 reportedly killed by Friday and over 2,300 arrested as authorities imposed an internet blackout amid nationwide anti-regime unrest.",
      "url": "https://www.foxnews.com/world/armed-iran-protesters-battle-police-tehran-streets-trump-warns-forceful-us-response",
      "published": "Sat, 10 Jan 2026 17:18:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Who is Reza Pahlavi? The exiled prince urging Iranians to ‘seize cities’",
      "description": "The exiled prince calls on Iranians to 'seize city centres' as Tehran accuses him of leading 'terrorist' war.",
      "url": "https://www.aljazeera.com/features/2026/1/12/who-is-reza-pahlavi-the-exiled-prince-urging-iranians-to-seize?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 07:14:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "After Venezuela, is the world order shifting from diplomacy towards aggression?",
      "description": "NPR's Sacha Pfeiffer talks with Peter Krause of Boston College about the Trump Administration's willingness to act unilaterally against other countries and what this means for international relations.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5671132/after-venezuela-is-the-world-order-shifting-from-diplomacy-towards-aggression",
      "published": "Sun, 11 Jan 2026 08:05:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Global economy shows signs of steady but subdued growth",
      "description": "The global economy has shown resilience amid turbulence during the past year, including shifting trade policies – yet growth remains subdued and far below pre-pandemic levels, the UN said in a landmark report published on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166717",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Two weeks on, questions linger over targeting and impact of US airstrikes in Nigeria",
      "description": "Very little information has been shared about strikes in Sokoto state Two weeks after the US carried out Christmas Day airstrikes in north-west Nigeria on what it described as Islamic State fighters, questions remain over the specific group that was targeted and the operation’s impact. In the aftermath of the strikes, Donald Trump said in a post on his Truth Social platform that “ISIS Terrorist Scum in Northwest Nigeria , who have been targeting and viciously killing, primarily, innocent Christians” were hit with “numerous perfect strikes”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/questions-targeting-impact-us-airstrikes-in-nigeria",
      "published": "Thu, 08 Jan 2026 05:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly avalanche claims 2 snowmobilers in Washington state backcountry, 2 rescued",
      "description": "Two snowmobilers were killed in an avalanche near Longs Pass in Washington's Okanogan-Wenatchee National Forest. Two survivors were rescued after a distress call.",
      "url": "https://www.foxnews.com/us/deadly-avalanche-claims-2-snowmobilers-washington-state-backcountry-2-rescued",
      "published": "Sun, 11 Jan 2026 21:12:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran flips ‘kill switch’ to hide alleged crimes as death toll rises amid protests",
      "description": "Iran protests spread to 180 cities as authorities allegedly use lethal force against demonstrators, with human rights activists in Iran reporting 65 killed and 2,300 arrested.",
      "url": "https://www.foxnews.com/world/iran-flips-kill-switch-hide-alleged-crimes-death-toll-rises-amid-protests",
      "published": "Sat, 10 Jan 2026 20:51:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns US troops and Israel will be targets if America strikes over protests as death toll rises",
      "description": "Iran's parliament speaker warned the U.S. military and Israel would be \"legitimate targets\" if America strikes the Islamic Republic, as threatened by President Donald Trump.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5673845/iran-us-israel-targets-protests",
      "published": "Sun, 11 Jan 2026 02:46:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Hundreds killed in protests in Iran, rights group says",
      "description": "Hundreds of protesters have been killed in demonstrations over the past two weeks, according to rights groups and local sources in Iran, FRANCE 24 Observers journalist Ershad Alijani reported, noting that it remains difficult to gauge the exact number of victims because of the information blackout in the country. In an attempt to thwart the protests, Iranian authorities have shut down the internet and cut off phone lines.",
      "url": "https://www.france24.com/en/hundreds-killed-in-protests-in-iran-rights-group-says",
      "published": "Sun, 11 Jan 2026 16:30:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns it will retaliate if US attacks, as hundreds killed in protests",
      "description": "President Trump said on Sunday that the US military was considering \"very strong options\" in Iran.",
      "url": "https://www.bbc.com/news/articles/cm2jek15m8no?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 02:40:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "From Guatemala to Panama: US affairs in Latin America",
      "description": "The US attack on Venezuela is part of a long history of military interventions and political influence by the United States in Latin America. Here are five such examples since World War II.",
      "url": "https://www.dw.com/en/from-guatemala-to-panama-us-affairs-in-latin-america/a-75421929?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 12:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns US troops and Israel will be targets if America strikes over protests",
      "description": "Protests challenging Iran’s theocracy have reached the two-week mark, with demonstrators flooding the streets in Tehran and Mashhad",
      "url": "https://abcnews.go.com/International/wireStory/death-toll-2-week-protests-challenging-irans-theocracy-129098403",
      "published": "Sun, 11 Jan 2026 02:18:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Rescuers race to find dozens missing in deadly Philippines landfill collapse",
      "description": "The landslide happened when a mountain of rubbish collapsed at a landfill site in the central Philippines.",
      "url": "https://www.bbc.com/news/articles/cn42jqlqy4xo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 11:32:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: US launches retaliatory strikes against Islamic State",
      "description": "Another round of US strikes has reportedly hit targets belonging to the militant Islamist group believed to be behind an attack that killed two US soldiers in Syria in December.",
      "url": "https://www.dw.com/en/syria-us-launches-retaliatory-strikes-against-islamic-state/a-75462852?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 22:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "The week in pictures: ICE protests, Aleppo clashes and skiing in Paris",
      "description": "The fatal shooting of a woman in Minneapolis by a federal immigration agent sparked angry protests in cities across the US on a week that also saw demonstrations sweep Iran, renewed clashes break out in Syria's Aleppo, and a deadly cold snap bring travel chaos and heavy snow across much of Europe. FRANCE 24 looks back at the week's most striking images.",
      "url": "https://www.france24.com/en/americas/20260111-the-week-in-pictures-ice-protests-aleppo-clashes-and-skiing-in-paris",
      "published": "Sun, 11 Jan 2026 14:12:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Aurora terrorized by Venezuelan gang as dictator Maduro let Tren de Aragua seize power",
      "description": "How government failure in Venezuelan prison system created transnational criminal organization now facing federal charges in multiple U.S. states.",
      "url": "https://www.foxnews.com/us/aurora-terrorized-venezuelan-gang-dictator-maduro-let-tren-de-aragua-seize-power",
      "published": "Sat, 10 Jan 2026 18:00:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Trump warns of “very strong options” amid Iran unrest",
      "description": "Trump said the US is considering “very strong options,” over the deaths of protesters in Iran.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/12/trump-warns-of-very-strong-options-amid-iran-unrest?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 07:24:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘shocked’ by reports of excessive force against protesters in Iran",
      "description": "The UN Secretary-General is shocked by reports of violence and excessive use of force by Iranian authorities against protesters across the country, urging restraint and the immediate restoration of communications as unrest enters its third week.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166739",
      "published": "Sun, 11 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan war leaves millions hungry and displaced as health system nears collapse",
      "description": "Sudan’s protracted conflict has spiralled into one of the world’s most severe humanitarian crises, with hunger, displacement and the collapse of basic services exacting a daily toll on civilians.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166738",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian supreme leader says protesters 'ruining their own streets' to please Trump",
      "description": "Iran reportedly cuts nationwide internet as protests intensified and President Donald Trump threatens intervention if peaceful demonstrators face violence.",
      "url": "https://www.foxnews.com/world/iranian-supreme-leader-says-protesters-ruining-own-streets-please-trump",
      "published": "Fri, 09 Jan 2026 07:37:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "More than $200k raised in a day for hero Bondi Junction police officer after ‘rare’ cancer diagnosis",
      "description": "Amy Scott, who confronted Joel Cauchi alone during the April 2024 Westfield attack, has been diagnosed with ‘aggressive’ breast cancer Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Amy Scott, the New South Wales police officer who pursued and shot the perpetrator of the Bondi Junction stabbing attack, has been diagnosed with an “aggressive form of breast cancer”. Joel Cauchi killed six people in a mass stabbing attack on 13 April 2024 at the Bondi Westfield shopping centre and wounded another 10. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/12/amy-scott-bondi-junction-stabbing-hero-police-officer-cancer",
      "published": "Mon, 12 Jan 2026 07:05:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "More than 500 killed in Iran, rights group says, as Trump and US military weighing 'strong options'",
      "description": "The number of people killed in anti-government protests across Iran has risen dramatically to more than 500, according to the US-based Human Rights Activists News Agency.",
      "url": "https://news.sky.com/story/more-than-500-killed-in-iran-us-rights-group-says-as-president-accuses-terrorists-of-starting-chaos-and-disorder-13493084",
      "published": "Sun, 11 Jan 2026 14:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Repression in Uganda, fighting in Syria’s Aleppo continues, Gaza and West Bank updates",
      "description": "The UN has raised serious concerns ahead of Uganda’s elections scheduled for 15 January, warning they will take place in an environment marked by widespread repression, intimidation and shrinking civic space.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166735",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: Increase in abductions and sexual violence ‘unacceptable’",
      "description": "Despite reductions in the overall number of conflict-related incidents in South Sudan, a rise in abductions and sexual violence is concerning, the UN peacekeeping mission in the country, UNMISS, said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166734",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Human Rights Council elects Indonesian candidate President for 2026",
      "description": "The UN Human Rights Council – the world’s principal defender of vulnerable people worldwide – has elected an Indonesian diplomat to be President for 2026 in a first for the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166720",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Attempt to overturn the Gambia’s ban on FGM heard by supreme court",
      "description": "Case brought by Muslim leaders and MP follows failed 2024 bid and seen as part of global anti-women’s rights backlash A group of religious leaders and an MP in the Gambia have launched efforts to overturn a ban on female genital mutilation at the country’s supreme court. The court case, due to resume this month, comes after two babies bled to death after undergoing FGM in the Gambia last year. Almameh Gibba, an MP and one of the plaintiffs, tabled a bill to decriminalise FGM that was rejected by the country’s parliament in 2024. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/09/the-gambia-female-genital-mutilation-fgm-supreme-court-case-overturn-ban",
      "published": "Fri, 09 Jan 2026 06:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protests enter third week under internet blackout",
      "description": "As Iran's protests enter a third week, the country's president blames foreign powers for the unrest, and warns it will retaliate if the US intervenes militarily.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5673939/iran-protests-enter-third-week-under-internet-blackout",
      "published": "Sun, 11 Jan 2026 17:00:26 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Pakistan: Newlyweds among 8 killed in Islamabad explosion",
      "description": "Police said a gas explosion at a home following a wedding reception in Islamabad killed at least eight people, including the bride and groom.",
      "url": "https://www.dw.com/en/pakistan-newlyweds-among-8-killed-in-islamabad-explosion/a-75464404?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 10:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Top UN court to hear landmark Rohingya genocide case against Myanmar",
      "description": "Judges at the International Court of Justice (ICJ) began three weeks of hearings on Monday into allegations that Myanmar committed genocide against Rohingya Muslims. The Gambia filed the case over a 2017 crackdown. Lawyers say the ruling could shape how the court handles South Africa’s case against Israel over the war in Gaza.",
      "url": "https://www.france24.com/en/asia-pacific/20260112-top-un-court-rohingya-genocide-myanmar",
      "published": "Mon, 12 Jan 2026 05:09:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar vote a ‘facade’ to entrench military rule, independent rights expert says",
      "description": "An independent human rights expert has urged the international community to reject the electoral process organised by Myanmar’s military government, after the first round of voting revealed widespread coercion, exclusion and violence.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166729",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Fighting intensifies in Syria’s Aleppo and South Sudan’s Jonglei state, acute hunger in Niger",
      "description": "UN Secretary-General António Guterres continues to be gravely alarmed by escalating hostilities in Aleppo, Syria, and mounting reports of civilian casualties, his Spokesperson said on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166727",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "NASA makes 'unprecedented' call to bring astronauts home after illness, expert says: 'Evacuated from orbit'",
      "description": "NASA makes unprecedented decision to bring International Space Station crew home early after medical emergency – first time in 25-year station history.",
      "url": "https://www.foxnews.com/us/nasa-makes-unprecedented-call-bring-astronauts-home-after-illness-expert-says-evacuated-from-orbit",
      "published": "Sun, 11 Jan 2026 09:00:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "How volatile is the situation in Iran?",
      "description": "The country has been rocked by two weeks of widespread protests since the currency collapsed.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/11/how-volatile-is-the-situation-in-iran?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 19:37:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Death toll from protests in Iran increases as Trump says Iran wants to talk",
      "description": "President Trump said Sunday that Iran proposed negotiations after his threat to strike the Islamic Republic over its crackdown targeting demonstrators. Activists say at least 544 have died.",
      "url": "https://www.npr.org/2026/01/12/g-s1-105652/trump-says-iran-wants-to-talk",
      "published": "Mon, 12 Jan 2026 01:24:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "PM says Denmark faces ‘decisive moment’ as Trump renews threat of force over Greenland",
      "description": "Denmark’s Prime Minister Mette Frederiksen said on Sunday her country faced a “decisive moment” in its diplomatic dispute with the United States over Greenland, after Donald Trump again suggested using force to seize the Arctic territory. Speaking ahead of meetings in Washington on raw materials, Frederiksen said “there is a conflict over Greenland”.",
      "url": "https://www.france24.com/en/europe/20260111-denmark-trump-greenland",
      "published": "Sun, 11 Jan 2026 23:32:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "New video shows minutes leading up to deadly Minneapolis ICE shooting",
      "description": "New video shows moments before ICE agent fatally shot Minneapolis woman Renee Nicole Good. DHS claims footage shows she was \"stalking\" federal operation.",
      "url": "https://www.foxnews.com/us/new-video-shows-minutes-leading-up-deadly-minneapolis-ice-shooting",
      "published": "Sun, 11 Jan 2026 13:19:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "'There wasn't even time for CPR': Iran medics describe hospitals overwhelmed with dead and injured protesters",
      "description": "Hundreds of people are believed to have been killed or injured by the security forces, with more than 70 bodies brought to one hospital.",
      "url": "https://www.bbc.com/news/articles/cj9rengvnp9o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 21:12:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Myanmar holds 2nd round of elections amid armed conflict",
      "description": "Myanmar has resumed voting in the second round of its first general election in five years, expanding polling to additional townships, including some areas affected by the current civil war between the military government and its armed opponents",
      "url": "https://abcnews.go.com/International/wireStory/myanmar-holds-2nd-round-elections-amid-armed-conflict-129093830",
      "published": "Sat, 10 Jan 2026 19:37:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis ICE shooting officer followed training as potentially 'deadly threat' drove at him: former agent",
      "description": "Former Secret Service agent defends ICE shooting in Minneapolis that killed woman allegedly using vehicle as weapon. Expert cites split-second decisions.",
      "url": "https://www.foxnews.com/us/minneapolis-ice-shooting-officer-followed-training-potentially-deadly-threat-drove-him-former-agent",
      "published": "Sun, 11 Jan 2026 08:00:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran’s ‘distinctive’ drone deployment sees death toll soar amid violent protests",
      "description": "Iran allegedly deploys drones amid nationwide protests as Human Rights Activists News Agency reports at least 544 confirmed deaths and over 10,000 arrests.",
      "url": "https://www.foxnews.com/world/irans-distinctive-drone-deployment-sees-death-toll-soar-amid-violent-protests",
      "published": "Sun, 11 Jan 2026 21:08:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Netanyahu and Rubio discuss US military intervention in Iran amid ongoing nationwide protests: report",
      "description": "Israeli Prime Minister Benjamin Netanyahu and U.S. Secretary of State Marco Rubio spoke as Israel goes on high alert and Iran faces mounting anti-regime protests.",
      "url": "https://www.foxnews.com/world/netanyahu-rubio-discuss-us-military-intervention-iran-amid-ongoing-nationwide-protests-report",
      "published": "Sun, 11 Jan 2026 04:32:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran protests grow deadlier as regime internet blackout fails to stop uprising",
      "description": "Iran's anti-government protests enter day 13 with reported death toll of 51, including 9 children, as demonstrations spread nationwide against the regime.",
      "url": "https://www.foxnews.com/world/iran-protests-grow-deadlier-regime-internet-blackout-fails-stop-uprising",
      "published": "Fri, 09 Jan 2026 15:37:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Bride and groom killed by gas explosion day after Pakistan wedding",
      "description": "Eight people were killed after a gas cylinder exploded at a house the morning after the wedding celebration.",
      "url": "https://www.bbc.com/news/articles/c4gr7nlx421o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 13:17:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "India’s Kohli becomes second-highest run-scorer in international cricket",
      "description": "Indian great surpasses Sri Lanka's Sangakkara with 28,068 runs across all formats but trails compatriot Tendulkar.",
      "url": "https://www.aljazeera.com/sports/2026/1/12/indias-kohli-becomes-second-highest-run-scorer-in-international-cricket?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 06:57:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Jacinda Ardern pulls out of Adelaide writers’ week as fallout over Randa Abdel-Fattah’s axing continues",
      "description": "Ructions within festival board over Palestinian-Australian academic’s inclusion began in October, email reveals Get our breaking news email , free app or daily news podcast Former New Zealand prime minister Jacinda Ardern has become the latest international headline act to pull out of the 2026 Adelaide writers’ week in protest over the Adelaide festival board’s decision to rescind its invitation to Palestinian-Australian academic Randa Abdel-Fattah. Ardern had been scheduled to discuss her memoir A Different Kind of Power with the ABC’s host of 7.30, Sarah Ferguson, on 3 March. Continue reading...",
      "url": "https://www.theguardian.com/culture/2026/jan/12/jacinda-ardern-pulls-out-of-adelaide-writers-week-as-fallout-over-randa-abdel-fattahs-axing-continues-ntwnfb",
      "published": "Mon, 12 Jan 2026 06:58:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Los Angeles wildfire recovery enters second year as frustration and uncertainty linger",
      "description": "One year after massive wildfires devastated Los Angeles County, many families remain displaced, frustrated by slow rebuilding, permit delays and ongoing housing challenges.",
      "url": "https://www.foxnews.com/us/los-angeles-wildfire-recovery-enters-second-year-frustration-uncertainty-linger",
      "published": "Sun, 11 Jan 2026 23:26:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Russia fires new ballistic missile at Ukraine, killing at least four",
      "description": "Ukrainian authorities reported multiple deaths and infrastructure damage after Russia said it deployed a new missile system in an overnight strike.",
      "url": "https://www.foxnews.com/world/russia-fires-new-ballistic-missile-ukraine-killing-least-four",
      "published": "Fri, 09 Jan 2026 03:34:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran protests: Death toll rises to over 540 — activists",
      "description": "Protests challenging the regime have continued in defiance of a clampdown by Iran's clerical rulers. Meanwhile, the Iranian government has declared a \"national resistance march\" for Monday. DW has the latest.",
      "url": "https://www.dw.com/en/iran-protests-death-toll-rises-to-over-540-activists/live-75463923?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 04:34:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Fact-finding mission urges Iran to end protest violence and restore internet",
      "description": "The UN-mandated independent human rights fact-finding mission on Iran has urged authorities to immediately restore internet access and halt the violent crackdown of the ongoing, nationwide protest.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166737",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UN’s ‘responsibility to deliver’ will not waver, after US announces withdrawal from dozens of international organizations",
      "description": "Secretary-General António Guterres has expressed regret over the decision by the United States to withdraw from a number of UN entities, while underscoring that the system will continue to deliver on all its mandates.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166722",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Street takeovers and traffic control by agitators in Minnesota cross legal lines, retired detective says",
      "description": "Retired NYPD detective warns Minnesota traffic obstruction by agitators threatens public safety as crowds impede federal law enforcement operations.",
      "url": "https://www.foxnews.com/us/street-takeovers-traffic-control-agitators-minnesota-cross-legal-lines-retired-nypd-says",
      "published": "Sun, 11 Jan 2026 16:00:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Family seeks answers after ICE deported man to Costa Rica in vegetative state",
      "description": "Exclusive: Before Randall Gamboa Esquivel died, his health had deteriorated badly while he was in ICE custody Costa Rican family demands answers after ICE deportation and death: ‘Have you ever smelled a cadaver?’ The family of a Costa Rican man who was deported from the United States in a vegetative state and died shortly after arriving back in his home country is still urgently seeking answers from the authorities about what happened to him while he was in detention. Randall Gamboa Esquivel had left Costa Rica in good health and crossed the United States-Mexico border in December 2024, according to his family. However, Gamboa was detained by the US authorities for re-entering American soil unlawfully, as he had previously lived there undocumented between 2002 and 2013. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/11/ice-death-costa-rica-randall-gamboa-esquivel",
      "published": "Sun, 11 Jan 2026 12:36:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Live: Trump says Iran wants to 'negotiate' as US threatens military action after hundreds killed",
      "description": "US President Donald Trump said Sunday that Iran's leadership had called him seeking \"to negotiate\" after he repeatedly threatened to intervene militarily if Tehran killed protesters. While a Norway-based NGO has confirmed that at least 192 people have been killed so far, a US-based organisation has estimated it to be at least 544 people, including 48 security forces. Follow our liveblog for the latest updates.",
      "url": "https://www.france24.com/en/middle-east/20260112-live-trump-says-iran-wants-to-negotiate-after-us-threatens-military-intervention",
      "published": "Mon, 12 Jan 2026 06:09:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "At the heart of change: Spotlight Initiative highlights breakthroughs in tackling gender-based violence",
      "description": "When it comes to protecting women and girls from gender-based violence, change happens when they are “at the heart of every decision,” according to Erin Kenny, Global Coordinator of the Spotlight Initiative a United Nations–European Union partnership aimed at tackling all forms of abuse against women and girls.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166721",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "US warns Americans to leave Venezuela immediately as armed militias set up roadblocks",
      "description": "The U.S. government issued an urgent security alert for Americans in Venezuela to leave immediately due to safety concerns and an inability to provide continued assistance.",
      "url": "https://www.foxnews.com/world/us-warns-americans-leave-venezuela-immediately-armed-militias-set-up-roadblocks",
      "published": "Sat, 10 Jan 2026 17:00:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iranian hospitals overwhelmed with injuries as protests rage across Islamic Republic",
      "description": "Iranian hospitals are reportedly overwhelmed as anti-government protests rage, with doctors treating gunshot wounds to heads and eyes amid nationwide unrest.",
      "url": "https://www.foxnews.com/world/iranian-hospitals-overwhelmed-injuries-protests-rage-across-islamic-republic",
      "published": "Sat, 10 Jan 2026 15:00:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "One person dead and 300 buildings destroyed in Australia bushfires",
      "description": "A state of emergency has been declared in Victoria as thousands of firefighters battle the blaze.",
      "url": "https://www.bbc.com/news/articles/c75xdg2p36lo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 14:18:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US urges its citizens to flee Venezuela amid reports of paramilitaries",
      "description": "State department says armed ‘colectivos’ appear to be setting up roadblocks and searching vehicles for Americans The United States has urged its citizens to leave Venezuela immediately amid reports that armed paramilitaries are trying to track down US citizens, one week after the capture of the South American country’s president, Nicolás Maduro. In a security alert sent out on Saturday, the state department said there were reports of armed members of pro-regime militias, known as colectivos , setting up roadblocks and searching vehicles for evidence that the occupants were US citizens or supporters of the country. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/10/us-citizens-venezuela-paramilitaries",
      "published": "Sun, 11 Jan 2026 02:58:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Underground church says leaders detained as China steps up crackdown",
      "description": "Early Rain pastor said to be among those held in sweep that followed arrests of members of other unregistered churches Leaders of a prominent underground church have been detained in south-west China, according to a church statement, the latest blow in what appears to be a sweeping crackdown on unregistered Christian groups in the country. On Tuesday, Li Yingqiang, the leader of the Early Rain Covenant Church, was taken by police from his home in Deyang, a small city in Sichuan province, according to the statement. Li’s wife, Zhang Xinyue, has also been detained, along with two other church members: Dai Zhichao, a pastor; and Ye Fenghua, a lay member. At least a further four members were taken and later released, while some others remain out of contact. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/11/underground-church-early-rain-leaders-detained-china-crackdown",
      "published": "Sun, 11 Jan 2026 13:00:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Inside a Gaza medical clinic at risk of shutting down after an Israeli ban",
      "description": "A recent Israeli decision to bar Doctors Without Borders and other aid groups means international staff and aid can no longer enter Gaza or the West Bank. Local staff must rely on dwindling supplies and no international expertise.",
      "url": "https://www.npr.org/2026/01/11/g-s1-105070/gaza-msf-clinic-israel-aid-groups-ban",
      "published": "Sun, 11 Jan 2026 05:02:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Israel launches new strikes in southern Lebanon after issuing evacuation order",
      "description": "The Israeli army struck an area in southern Lebanon on Sunday that it had earlier called on residents to evacuate, killing one person, according to Lebanese authorities.",
      "url": "https://www.france24.com/en/middle-east/20260111-israel-launches-new-strikes-in-southern-lebanon-after-issuing-evacuation-order",
      "published": "Sun, 11 Jan 2026 17:05:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia strike leaves 1,000 Kyiv apartment blocks without heating",
      "description": "More than 1,000 apartment blocks in the Ukrainian capital Kyiv remain without power after a Russian bombardment of the country's energy system overnight.",
      "url": "https://news.sky.com/story/russia-strike-leaves-1000-kyiv-apartment-blocks-without-heating-13493061",
      "published": "Sun, 11 Jan 2026 13:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Massive overnight attack leaves millions in the dark",
      "description": "UN agencies are supporting efforts on Friday to keep energy services up and running in Ukraine, and families warm amid freezing winter temperatures, following a large-scale overnight attack.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166732",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Expert warns of 'extreme violence' in Venezuelan mining as Trump admin eyes mineral reserves",
      "description": "Venezuela's illicit mining economy dominated by criminal groups involves forced labor, torture and human rights abuses, expert tells Fox News Digital.",
      "url": "https://www.foxnews.com/us/expert-warns-extreme-violence-venezuelan-mining-trump-admin-eyes-mineral-reserves",
      "published": "Sun, 11 Jan 2026 17:59:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ex-con charged in Christmas Day CVS robbery that left clerk fatally stabbed",
      "description": "CVS clerk Eddy Cine Jr. volunteered to work Christmas Day shift, only to be allegedly stabbed to death by armed robber minutes before closing time.",
      "url": "https://www.foxnews.com/us/ex-con-charged-christmas-day-cvs-robbery-left-clerk-fatally-stabbed",
      "published": "Sun, 11 Jan 2026 10:00:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Mississippi prosecutors to seek death penalty against man accused of deadly rampage that included girl, pastor",
      "description": "Prosecutors to seek death penalty for Mississippi man accused in deadly rampage that killed six people, including a child and church pastor Friday night.",
      "url": "https://www.foxnews.com/us/mississippi-prosecutors-seek-death-penalty-against-man-accused-deadly-rampage-included-girl-pastor",
      "published": "Sun, 11 Jan 2026 07:37:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "2026 World Cup: Germany to be based at North Carolina hotel",
      "description": "Germany will be making a hotel in Winston-Salem their base camp during next summer's World Cup. The choice of headquarters has been seen as key to the national team's success — or failure — at previous World Cups.",
      "url": "https://www.dw.com/en/2026-world-cup-germany-to-be-based-at-north-carolina-hotel/a-75455913?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 15:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Death toll rises in Iran, authorities call for counter-protests",
      "description": "Deaths from Iran protests reached more than 500, US-based rights group HRANA reported on Sunday as the Iranian government called for counter-rallies on Monday in support of the Islamic Republic. Read our blog to see how the day's events unfolded.",
      "url": "https://www.france24.com/en/middle-east/20260111-live-iran-death-toll-rises-as-protesters-defy-crackdown",
      "published": "Sun, 11 Jan 2026 11:11:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "What the US withdrawal from UN bodies could mean for climate, trade and development",
      "description": "The United States’ intention to withdraw from a host of UN bodies announced this week targets programmes and initiatives focusing on a wide range of crucial areas, including the climate crisis, trade, gender and development.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166736",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Sudan's government returns to capital after nearly 3 years of war",
      "description": "The military-backed government is back in Khartoum after being driven out by its paramilitary rival.",
      "url": "https://www.bbc.com/news/articles/ckgn5g90lggo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 17:50:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "What does the US raid in Venezuela mean for China’s designs on Taiwan?",
      "description": "Perception that Chinese-made weapons could not stop a ‘decapitation strike’ may give Beijing pause for thought The sight of a hostile regional superpower launching an overnight raid to depose the leader of a smaller neighbouring country could easily have sent pulses in Taiwan racing. The US on Saturday revealed the details of a surprise raid to capture Venezuela’s leader, Nicolás Maduro , who was whisked away to the US, where he was frogmarched into a court in New York on Monday . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/06/what-us-action-in-venezuela-means-for-taiwan",
      "published": "Tue, 06 Jan 2026 01:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Flying foxes die in their thousands in worst mass-mortality event since Australia’s black summer",
      "description": "Volunteers found thousands of dead bats at Melbourne’s Brimbank park, wildlife expert says Get our breaking news email , free app or daily news podcast Thousands of flying foxes have perished in the heatwave that scorched south-east Australia last week, the largest mass mortality event for flying foxes since black summer. Extreme temperatures resulted in deaths in camps across South Australia, Victoria and New South Wales. Grey-headed flying foxes, listed as vulnerable under federal environment laws, were the most affected. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/12/flying-foxes-die-in-their-thousands-in-worst-mass-mortality-event-since-australias-black-summer",
      "published": "Mon, 12 Jan 2026 06:29:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Cuba defiant in face of 'criminal' US threats",
      "description": "After abducting the leader of Venezuela, the US is now threatening Cuba. Havana says Washington's behavior is a threat to global peace as President Trump jokes about appointing Marco Rubio president of the island nation.",
      "url": "https://www.dw.com/en/cuba-defiant-in-face-of-criminal-us-threats/a-75466799?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 18:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Sudan PM announces govt's return to Khartoum from wartime capital Port Sudan",
      "description": "The Sudanese government which had been driven out by war has returned to Khartoum and promises “better services” for the capital's residents, Prime Minister Kamil Idris announced on Sunday. The army-aligned government had been operating out of its wartime capital of Port Sudan for nearly three years after it had been driven out of Khartoum by the paramilitary Rapid Support Forces.",
      "url": "https://www.france24.com/en/africa/20260111-sudan-pm-announces-govt-s-return-to-khartoum-from-wartime-capital-port-sudan",
      "published": "Sun, 11 Jan 2026 16:36:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Five human heads found hanging at picturesque beach",
      "description": "Five human heads were found hanging from ropes at a beach in Ecuador as the country suffers a wave of violence related to drug trafficking.",
      "url": "https://news.sky.com/story/five-human-heads-found-hanging-at-picturesque-beach-13493261",
      "published": "Mon, 12 Jan 2026 04:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Five severed heads found hanging on Ecuador beach amid escalating gang clashes",
      "description": "Ecuador gang violence escalates as five severed heads discovered on tourist beach in Puerto Lopez, highlighting country's record homicide rate amid military crackdown.",
      "url": "https://www.foxnews.com/world/five-severed-heads-found-hanging-tourist-beach-ecuador-amid-escalating-gang-massacre-violence",
      "published": "Sun, 11 Jan 2026 22:45:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Thousands march and dozens arrested in Minneapolis protests against ICE",
      "description": "Days after the death of Renee Good, protests continue in Minneapolis and cities across the US.",
      "url": "https://www.bbc.com/news/articles/cvgpnwnqygro?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 17:21:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Who is Reza Pahlavi, the exiled crown prince encouraging demonstrations across Iran?",
      "description": "In exile for nearly 50 years, Iran's Crown Prince Reza Pahlavi has issued calls urging Iranians to join protests sweeping the country. But support for him may not be clear cut.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5673238/reza-pahlavi-iran-protests",
      "published": "Sat, 10 Jan 2026 17:10:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US: Hundreds of rallies held over ICE shootings",
      "description": "Protests over the killing of Renee Good are taking place across the US. The Trump administration says the gay mom was a dangerous far-left radical; protesters say ICE agents are trigger-happy goons. DW has the latest.",
      "url": "https://www.dw.com/en/us-hundreds-of-rallies-held-over-ice-shootings/live-75462489?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 23:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukrainian drones set fire to Russian oil depot after Moscow launches new missile",
      "description": "A Ukrainian drone strike has sparked a fire at an oil depot in Russia's Volgograd region, according to regional authorities",
      "url": "https://abcnews.go.com/International/wireStory/ukrainian-drones-set-fire-russian-oil-depot-after-129080295",
      "published": "Sat, 10 Jan 2026 07:21:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "U-Haul truck drives through Iran protest crowd in Los Angeles, one person struck and driver detained",
      "description": "U-Haul truck reportedly drives through Iran protest crowd in Los Angeles, striking one person near Federal Building in Westwood. Driver detained by LAPD.",
      "url": "https://www.foxnews.com/us/u-haul-truck-drives-through-iran-protest-crowd-los-angeles-one-person-struck-driver-detained",
      "published": "Sun, 11 Jan 2026 19:37:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russia fires new hypersonic missile in massive Ukraine attack, Kremlin says",
      "description": "Russia fired a hypersonic Oreshnik missile at Ukraine in retaliation for an alleged attack on one of Putin's residences that the U.S. and Ukraine have denied.",
      "url": "https://www.foxnews.com/world/russia-fires-new-hypersonic-missile-massive-ukraine-attack-kremlin-says",
      "published": "Fri, 09 Jan 2026 11:23:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Integration of armed factions remains one of Syria’s biggest challenges",
      "description": "It is also at the centre of the post-war state building project.",
      "url": "https://www.aljazeera.com/opinions/2026/1/12/integration-of-armed-factions-remains-one-of-syrias-biggest-challenges?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 06:58:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Anger in Papua New Guinea after Starlink ordered to shut down internet services",
      "description": "In mid-December PNG said the company did not have a licence to operate in the country and ordered it to halt operations Frustration is growing in Papua New Guinea weeks after the government ordered Starlink to shut down operations in the country as businesses, health providers and communities struggle without access to internet services. Starlink, owned by Elon Musk’s SpaceX, is a satellite internet company that provides internet to remote places. In mid-December, the National Information and Communications Technology Authority (Nicta) ordered the company to halt operations because it was not licensed in PNG. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/06/papua-new-guinea-internet-starlink-shut-down",
      "published": "Tue, 06 Jan 2026 02:50:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "'Hundreds more' US agents head to Minneapolis, says Homeland Security Secretary",
      "description": "Hundreds of additional federal agents are bound for Minneapolis after the killing of Renee Nicole Good in the Midwestern city by an Immigration and Customs Enforcement (ICE) officer prompted mass protests, US Homeland Security Secretary Kristi Noem told Fox News on Sunday.",
      "url": "https://www.france24.com/en/americas/20260111-hundreds-more-us-agents-head-to-minneapolis-minnesota-says-homeland-security-secretary",
      "published": "Sun, 11 Jan 2026 20:30:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens to block ExxonMobil from Venezuela after CEO calls country ‘uninvestable’",
      "description": "US president says company is ‘playing too cute’ after CEO responds sceptically to his push for oil investment after deposing Nicolás Maduro Donald Trump has said he might block ExxonMobil from investing in Venezuela after the oil company’s chief executive called the country “uninvestable” during a White House meeting last week. Darren Woods told the US president that Venezuela would need to change its laws before it could be an attractive investment opportunity, during the high-profile meeting on Friday with at least 17 other oil executives. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/12/donald-trump-threatens-block-exxonmobil-venezuela",
      "published": "Mon, 12 Jan 2026 03:11:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Exiled crown prince Pahlavi cheers Iran protests from US",
      "description": "The son of Iran's last shah is positioning himself as a voice of transition as protests continue across the country. But Reza Pahlavi's role in a democratic Iran remains to be seen.",
      "url": "https://www.dw.com/en/exiled-crown-prince-pahlavi-cheers-iran-protests-from-us/a-75466258?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 19:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "German health minister rejects Robert Kennedy's COVID claims",
      "description": "US Health Secretary Robert F Kennedy Jr has claimed that doctors in Germany who issued COVID-19 vaccine exemptions are facing legal action. Health Minister Nina Warken has hit back vehemently at the accusations.",
      "url": "https://www.dw.com/en/german-health-minister-rejects-robert-kennedy-s-covid-claims/a-75463757?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 07:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump’s Justice Department subpoenas Fed Chair Powell, threatens criminal charges",
      "description": "Federal Reserve Chair Jerome Powell said on Sunday the Department of Justice had subpoenaed the central bank and threatened criminal charges over his testimony on Fed building renovations, marking an unprecedented escalation in President Donald Trump’s dispute with the independent Federal Reserve.",
      "url": "https://www.france24.com/en/economy/20260112-trump-s-justice-department-subpoenas-fed-chair-powell-over-building-renovation",
      "published": "Mon, 12 Jan 2026 01:34:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Human remains found as Australia continues to battle bushfires",
      "description": "Human remains have been found in Australia as bushfires continue to rage on in the country.",
      "url": "https://news.sky.com/story/human-remains-found-as-australia-continues-to-battle-bushfires-13492983",
      "published": "Sun, 11 Jan 2026 10:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran's foreign minister claims 'the situation has come under total control' in the nationwide protests",
      "description": "Iran's foreign minister claims 'the situation has come under total control' in the nationwide protests",
      "url": "https://abcnews.go.com/International/wireStory/irans-foreign-minister-claims-situation-total-control-nationwide-129123044",
      "published": "Mon, 12 Jan 2026 02:09:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran alleges protests turned violent to give Trump 'excuse' to intervene",
      "description": "Iran’s foreign minister alleged Monday that nationwide protests in his nation “turned violent and bloody to give an excuse” for U.S. President Donald Trump to intervene",
      "url": "https://abcnews.go.com/International/wireStory/iran-alleges-protests-turned-violent-give-trump-excuse-129123028",
      "published": "Mon, 12 Jan 2026 02:09:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Rare first Superman comic once stolen from Nicolas Cage sells for $15m",
      "description": "Fewer than 100 copies of Action Comics No 1, which introduced the world to Superman, are thought to exist.",
      "url": "https://www.bbc.com/news/articles/cly95lpwl1ro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 16:06:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran protests live: Unrest ‘stoked and fueled’ by foreign elements – Tehran",
      "description": "Iran's Foreign Minister Araghchi says protests 'turned violent and bloody to give an excuse' for President Trump.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/12/iran-protests-live-us-rhetoric-rises-as-tehran-announces-3-days-mourning?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 06:08:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "After Maduro: Is the US driving global instability?",
      "description": "Risk analyst Ian Bremmer argues that the US is undoing the global system that it built over decades.",
      "url": "https://www.aljazeera.com/video/the-bottom-line/2026/1/11/after-maduro-is-the-us-driving-global-instability?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 19:18:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cremation pyre in Africa thought to be world’s oldest containing adult remains",
      "description": "9,500-year-old pyre uncovered in Malawi offers rare insight into rituals of ancient African hunter-gatherer groups A cremation pyre built about 9,500 years ago has been discovered in Africa, offering a fresh glimpse into the complexity of ancient hunter-gatherer communities. Researchers say the pyre, discovered in a rock shelter at the foot of Mount Hora in northern Malawi, is thought to be the oldest in the world to contain adult remains, the oldest confirmed intentional cremation in Africa, and the first pyre to be associated with African hunter-gatherers. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/01/cremation-pyre-in-africa-thought-to-be-worlds-oldest-containing-adult-remains",
      "published": "Thu, 01 Jan 2026 19:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump tells Cuba to ‘make a deal’ or face the consequences",
      "description": "No more Venezuelan oil or money will flow to the communist-run island after Maduro’s fall, says US president Donald Trump has told Cuba to “make a deal” or face unspecified consequences, adding that no more Venezuelan oil or money would flow to the communist-run Caribbean island that has been a US foe for decades. As Cuba, a close ally of Venezuela and big beneficiary of its oil, braced for potential widespread unrest after Nicolás Maduro was deposed as the South American nation’s leader, the US president ramped up his threatening language on Sunday. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/11/trump-tells-cuba-to-make-a-deal-or-face-the-consequences",
      "published": "Sun, 11 Jan 2026 17:59:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Alleged scam kingpin Chen Zhi arrives in China after extradition from Cambodia",
      "description": "Chen founded multinational conglomerate Prince Group that US says is front for multibillion-dollar fraud operation Chinese television has shown footage of the US-indicted tycoon Chen Zhi being escorted by armed police after his extradition to China from Cambodia, where authorities on Thursday ordered the liquidation of a bank he founded linked to a massive “scam centre” network. Chen, who chairs a conglomerate the US says is a front for a multibillion-dollar online fraud operation, was shown in handcuffs and hooded as he was led off a plane at a Beijing airport by black-clad Swat officers, with the state broadcaster CCTV describing him as the “leader of a major transnational gambling and fraud crime syndicate”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/alleged-scam-kingpin-chen-zhi-extradited-china-cambodia-arrest",
      "published": "Thu, 08 Jan 2026 14:28:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Powell says US Fed subpoenaed by Trump's justice department",
      "description": "US Fed's Jerome Powell has alleged that President Donald Trump is using the threat of criminal indictment to influence monetary policy. Trump has denied any knowledge of the investigation.",
      "url": "https://www.dw.com/en/powell-says-us-fed-subpoenaed-by-trump-s-justice-department/a-75468819?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 03:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'This is journalism at its most raw': Go behind the scenes on the frontline with new-look Sky News show",
      "description": "A new-look Sky News series takes viewers straight into some of the world's most hostile environments.",
      "url": "https://news.sky.com/story/this-is-journalism-at-its-most-raw-go-behind-the-scenes-on-the-frontline-with-new-look-sky-news-show-13476126",
      "published": "Thu, 27 Nov 2025 13:29:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Protests in Iran near 2-week mark as authorities intensify crackdown on demonstrators",
      "description": "Protests in Iran have continued for nearly two weeks, with the government acknowledging the unrest despite a harsh crackdown",
      "url": "https://abcnews.go.com/International/wireStory/protests-iran-2-week-mark-authorities-intensify-crackdown-129079693",
      "published": "Sat, 10 Jan 2026 10:26:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US military strikes Islamic State group targets in Syria, officials say",
      "description": "US President Donald Trump ordered the \"large-scale strikes\" on Saturday, US Central Command announced.",
      "url": "https://www.bbc.com/news/articles/cly9597r4qpo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 01:50:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie's family accuse hospital of negligence over son's death",
      "description": "A hospital in Lagos denies medical negligence over the death of Chimamanda Ngozi Adichie's 21-month-old.",
      "url": "https://www.bbc.com/news/articles/c0lx09e618yo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 22:25:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "One Battle After Another, Adolescence dominate Golden Globes",
      "description": "Timothee Chalamet picks up best actor award for his role in sport comedy-drama Marty Supreme.",
      "url": "https://www.aljazeera.com/news/2026/1/12/timothee-chalamet-paul-thomas-anderson-take-honours-at-gloden-globes?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 04:32:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,418",
      "description": "These are the key developments from day 1,418 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/12/russia-ukraine-war-list-of-key-events-day-1418?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 03:17:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli forces kill one person in series of attacks on southern Lebanon",
      "description": "Israel claims its latest attacks on Lebanon were targeting alleged Hezbollah infrastructure.",
      "url": "https://www.aljazeera.com/news/2026/1/11/israeli-forces-kill-one-person-in-series-of-attacks-on-southern-lebanon?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 20:52:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria: Kurdish forces leave Aleppo after days of fighting",
      "description": "Syrian army forces have taken control of the Kurdish-dominated districts in Aleppo after a ceasefire was announced.",
      "url": "https://www.dw.com/en/syria-kurdish-forces-leave-aleppo-after-days-of-fighting/a-75463086?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 02:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'No more oil or money': Trump urges Cuba to cut deal with US 'before it's too late'",
      "description": "A week after the capture of Venezuela's President Nicolas Maduro by US forces, President Donald Trump on Sunday urged Cuba to “make a deal before it's too late” and the country finds itself without Venezuelan oil or money. The loss of Venezuelan oil would be highly detrimental to Cuba's economy, according to US intelligence reports.",
      "url": "https://www.france24.com/en/americas/20260111-no-more-oil-or-money-trump-urges-cuba-to-cut-deal-with-us-before-it-s-too-late",
      "published": "Sun, 11 Jan 2026 14:53:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Woman shot dead in head as body bags show emerging picture of Iranian crackdown",
      "description": "The extent of the state's crackdown on Iranian protesters is beginning to emerge, despite the internet shutdown.",
      "url": "https://news.sky.com/story/woman-shot-dead-in-head-as-body-bags-show-emerging-picture-of-iranian-crackdown-13493187",
      "published": "Sun, 11 Jan 2026 18:55:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "British skier killed in avalanche in French Alps",
      "description": "A British skier has died in an avalanche in the French Alps.",
      "url": "https://news.sky.com/story/british-skier-killed-in-avalanche-in-french-alps-13493204",
      "published": "Sun, 11 Jan 2026 19:47:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria signals renewed cooperation on chemical weapons destruction",
      "description": "Progress continues to be made towards eliminating remnants of the chemical weapons programme in Syria that was developed under the Assad regime, the UN Security Council heard on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166724",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria: Aleppo fighting leaves civilians dead, displaces thousands",
      "description": "At least five civilians have been killed and some 30,000 people displaced following renewed fighting in Aleppo, Syria, prompting calls from the UN for immediate de-escalation and a return to political talks.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166719",
      "published": "Wed, 07 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Critical clue led police to suspect Chicago doctor in deaths of Ohio dentist, wife",
      "description": "Chicago doctor arrested in Ohio double murder case after surveillance footage allegedly shows his car at victims' home during the time of killings.",
      "url": "https://www.foxnews.com/us/critical-clue-led-police-suspect-chicago-doctor-deaths-ohio-dentist-wife",
      "published": "Sun, 11 Jan 2026 14:55:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Mississippi synagogue burned in arson attack, suspect in custody",
      "description": "Suspect arrested after apparent arson destroys sacred Torahs at Mississippi's largest synagogue. FBI investigating the blaze at Beth Israel Congregation.",
      "url": "https://www.foxnews.com/us/mississippi-synagogue-burned-arson-attack-suspect-custody",
      "published": "Sun, 11 Jan 2026 13:53:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "DC pipe bomb suspect pleads not guilty to planting devices at DNC and RNC headquarters",
      "description": "The man accused of planting pipe bombs at party headquarters before the Jan. 6 attack pleaded not guilty this week. The FBI arrested Brian Cole after his alleged confession.",
      "url": "https://www.foxnews.com/us/dc-pipe-bomb-suspect-pleads-not-guilty-planting-devices-dnc-rnc-headquarters",
      "published": "Sat, 10 Jan 2026 22:21:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Who is Michael David McKee, the man accused of killing ex-wife and dentist husband in Ohio",
      "description": "Ohio surgeon Michael David McKee is accused of murdering his ex-wife and her dentist husband in a Columbus shooting. The Chicago doctor was arrested on murder charges.",
      "url": "https://www.foxnews.com/us/who-michael-david-mckee-man-accused-killing-ex-wife-dentist-husband-ohio",
      "published": "Sat, 10 Jan 2026 20:07:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nobel Institute shuts down talk of Venezuelan leader sharing Peace Prize with Trump",
      "description": "Nobel Institute rejects suggestion from Venezuelan leader María Corina Machado to transfer her Peace Prize to Trump, stating awards \"cannot be transferred.\"",
      "url": "https://www.foxnews.com/world/nobel-institute-shuts-down-talk-venezuelan-leader-sharing-peace-prize-trump",
      "published": "Sat, 10 Jan 2026 23:54:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump discusses whether he'd order a mission to capture Putin",
      "description": "President Donald Trump dismisses the idea of capturing Vladimir Putin, saying he's \"disappointed\" the Russia-Ukraine war remains without a resolution.",
      "url": "https://www.foxnews.com/world/trump-answers-whether-hed-order-mission-capture-putin",
      "published": "Sat, 10 Jan 2026 14:49:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Socialist dictator Maduro gone, but Venezuelans remain wary after years of oppression",
      "description": "Venezuelan citizens express cautious relief after Nicolas Maduro was ousted and taken to New York to face trial, ending years of controversial socialist rule.",
      "url": "https://www.foxnews.com/world/socialist-dictator-maduro-gone-venezuelans-remain-wary-after-years-oppression",
      "published": "Sat, 10 Jan 2026 06:00:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Protester scales Iranian Embassy in London, tears down regime flag, hoists pre-revolution symbol",
      "description": "Drama played out in London when a protester reportedly scaled Iran's embassy building, tears down a regime flag and replaces it with a pre-1979 flag.",
      "url": "https://www.foxnews.com/world/protester-scales-iranian-embassy-in-london-tears-down-regime-flag-hoists-pre-revolution-symbol",
      "published": "Sat, 10 Jan 2026 17:03:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Indonesia blocks Musk’s Grok chatbot due to risk of pornographic content",
      "description": "Move comes after governments and regulators from Europe to Asia have condemned the AI tool and some have opened inquiries into sexualised content Indonesia temporarily blocked Elon Musk’s Grok chatbot on Saturday due to the risk of AI-generated pornographic content, becoming the first country to deny access to the AI tool. The move comes after governments, researchers and regulators from Europe to Asia have condemned and some have opened inquiries into sexualised content on the app. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/10/indonesia-blocks-musks-grok-chatbot-due-to-risk-of-pornographic-content",
      "published": "Sat, 10 Jan 2026 07:52:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Historic upset in English soccer's FA Cup as Macclesfield beat holders Crystal Palace",
      "description": "The result marks the first time in 117 years that a side from outside the major national leagues has eliminated the reigning FA Cup holders.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5673942/historic-upset-soccer-fa-cup-macclesfield-beat-crystal-palace",
      "published": "Sun, 11 Jan 2026 12:26:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela's exiles in Chile caught between hope and uncertainty",
      "description": "Initial joy among Venezuela's diaspora in Chile has given way to caution, as questions grow over what Maduro's capture means for the country — and for those who fled it.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5666843/venezuelas-exiles-in-chile-caught-between-hope-and-uncertainty",
      "published": "Sun, 11 Jan 2026 06:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Myanmar junta kicks off second phase of military-run election",
      "description": "Voting has resumed in Myanmar's multi-phase election, which the country's military junta is promoting as a return to democracy. Critics have derided the election as a sham by the junta to legitimize its rule.",
      "url": "https://www.dw.com/en/myanmar-junta-kicks-off-second-phase-of-military-run-election/a-75463631?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 06:34:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Salah, Osimhen and Mané aim to deny Morocco AFCON title",
      "description": "The tournament favorites, Morocco and Senegal, have reached the semi-finals of the 2025 Africa Cup of Nations, but face two major obstacles on their way to the final: the Nigerian team for the host country and the solid Egyptian team for the Lions of Teranga.",
      "url": "https://www.france24.com/en/africa/20260111-salah-osimhen-and-man%C3%A9-aim-to-deny-morocco-afcon-title",
      "published": "Sun, 11 Jan 2026 15:51:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Nepalese royalists demand monarchy restoration ahead of March elections",
      "description": "Supporters of Nepal’s deposed royal family have rallied in the capital to demand the monarchy's restoration ahead of March elections",
      "url": "https://abcnews.go.com/International/wireStory/nepalese-royalists-demand-monarchy-restoration-ahead-march-elections-129099722",
      "published": "Sun, 11 Jan 2026 06:43:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Built on care and connection: How one Somali-British woman is strengthening diaspora communities",
      "description": "When her family moved from Somalia to London in the 1980s, Safia Jama watched women in her community help her mother navigate a new life in the UK — booking doctor’s appointments, enrolling children in school, and learning how to access everyday services in a new country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166725",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Wild video shows federal agents detaining 2 men at Minnesota gas station as agitators gather",
      "description": "Dramatic video shows two men being taken into custody by federal agents at a Minnesota gas station. One man was drug out of his car and thrown to the ground.",
      "url": "https://www.foxnews.com/us/wild-video-shows-federal-agents-detaining-2-men-minnesota-gas-station-agitators-gather",
      "published": "Sun, 11 Jan 2026 21:52:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "DEA zeroes in on Cartel of the Suns bosses as Maduro is hauled into US narco case",
      "description": "Nicolas Maduro arrested on federal narcotics trafficking charges as Venezuelan President allegedly led \"Cartel of the Suns\" cocaine network, prosecutors say.",
      "url": "https://www.foxnews.com/us/dea-zeroes-cartel-suns-bosses-maduro-hauled-us-narco-case",
      "published": "Sun, 11 Jan 2026 18:00:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Last Kurdish forces leave Aleppo after ceasefire deal reached",
      "description": "The deal was announced in the early hours of Sunday morning after a week of violent clashes.",
      "url": "https://www.bbc.com/news/articles/cx2p84xleg2o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 04:52:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Man detained after driving truck through anti-Iran protest in Los Angeles",
      "description": "Police respond after a truck drives down a street filled with demonstrators marching in support of the Iranian people.",
      "url": "https://www.aljazeera.com/news/2026/1/12/man-detained-after-driving-truck-through-anti-iran-protest-in-los-angeles?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 06:25:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says US considering ‘very strong options’ for Iran",
      "description": "US president says Washington is closely monitoring protests in Iran and considering possible military intervention.",
      "url": "https://www.aljazeera.com/news/2026/1/12/trump-says-us-military-considering-very-strong-options-for-iran?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 02:09:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Denmark’s PM says Greenland showdown at ‘decisive moment’",
      "description": "Denmark is ready to defend its values, Mette Frederiksen says, as Trump renews threats to seize the Danish territory.",
      "url": "https://www.aljazeera.com/news/2026/1/12/denmarks-pm-says-greenland-showdown-at-decisive-moment?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 01:19:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US Fed Chair Powell says he’s under investigation, will not bow to Trump",
      "description": "Head of US central bank condemns 'intimidation' amid fears for independence of monetary policy.",
      "url": "https://www.aljazeera.com/economy/2026/1/12/trump-administration-opens-criminal-probe-into-fed-chair-jerome-powell?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 01:15:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Will Elon Musk’s X changing the Iranian flag have any impact on the ground?",
      "description": "Analysts say Musk's move may give a small boost to some protesters, but matters little during internet blackouts.",
      "url": "https://www.aljazeera.com/features/2026/1/11/will-elon-musks-x-changing-the-iranian-flag-have-any-impact-on-the-ground?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 18:13:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany’s double standard on peaceful protests",
      "description": "Germany’s double standard on peaceful protests",
      "url": "https://www.aljazeera.com/video/compare-contrast/2026/1/11/germanys-double-standard-on-peaceful-protests?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 16:47:48 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US ‘adapt, shrink or die’ terms for $2bn aid pot will mean UN bowing down to Washington, say experts",
      "description": "Afghanistan and Yemen excluded from list of 17 priority countries chosen by Trump administration to receive aid laden with demands The $2bn (£1.5bn) of aid the US pledged this week may have been hailed as “bold and ambitious” by the UN but could be the “nail in the coffin” in changing to a shrunken, less flexible aid system dominated by Washington’s political priorities, aid experts fear. After a year of deep cuts in aid budgets by the US and European countries, the announcement of new money for the humanitarian system is a source of some relief, but experts are deeply concerned about demands that the US has imposed on how the money should be managed and where it can go. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/01/us-aid-cuts-conditions-un-humanitarian-pledge-ocha",
      "published": "Thu, 01 Jan 2026 13:00:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "For Germany and India, forging closer ties won't be easy",
      "description": "German Chancellor Friedrich Merz is heading to India. In the face of US tariffs, Russian threats and an uncertain China, Germany is courting the Asian giant as a trading and geopolitical partner. But it's not so easy.",
      "url": "https://www.dw.com/en/for-germany-and-india-forging-closer-ties-won-t-be-easy/a-74279379?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 08:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "First responders enter devastated Aleppo neighborhood after days of deadly fighting",
      "description": "Residents have started returning to a contested neighborhood in Syria's Aleppo after deadly clashes between government and Kurdish-led forces",
      "url": "https://abcnews.go.com/International/wireStory/responders-enter-devastated-aleppo-neighborhood-after-days-deadly-129106929",
      "published": "Sun, 11 Jan 2026 13:59:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: New strikes disrupt basic services for millions",
      "description": "Several parts of Ukraine were hit by a new wave of Russian strikes between Wednesday and Thursday morning.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166726",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Smithsonian replaces Trump portrait display, strips Jan. 6 and impeachment references from accompanying text",
      "description": "Smithsonian replaces Trump portrait, removes impeachment text after president calls museums 'woke' and threatens funding cuts in sweeping review.",
      "url": "https://www.foxnews.com/us/smithsonian-replaces-trump-portrait-display-strips-jan-6-impeachment-references-from-accompanying-text",
      "published": "Sun, 11 Jan 2026 23:17:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Washington anti-ICE agitators clash with crowd calling for Iran regime change",
      "description": "A convoluted protest clash unfolded in D.C. on Sunday. Anti-ICE agitators shouted at Iranian regime change protesters as others shouted \"Free Palestine\" and \"No kings.\"",
      "url": "https://www.foxnews.com/us/washington-anti-ice-agitators-clash-crowd-calling-iran-regime-change",
      "published": "Sun, 11 Jan 2026 17:36:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Exiled Iranian crown prince urges Trump to help as protests against Islamic regime intensify: 'Man of peace'",
      "description": "Exiled Iranian Crown Prince Pahlavi appeals to President Donald Trump for immediate intervention as Iran implements internet blackout amid deadly protests.",
      "url": "https://www.foxnews.com/world/exiled-iranian-crown-prince-urges-trump-help-protests-against-islamic-regime-intensify-man-of-peace",
      "published": "Fri, 09 Jan 2026 13:54:30 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Five hundred people in Canada were diagnosed with mystery brain disease. What if it isn't real?",
      "description": "A small Canadian province feared it had a mystery neurological illness on its hands. The search for answers set off a battle for the truth.",
      "url": "https://www.bbc.com/news/articles/c623r47d67lo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 00:23:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "'I had no electricity for six months': US families struggle with soaring energy prices",
      "description": "Rising electricity costs have emerged as a key cost-of-living concern, pushing families further into debt.",
      "url": "https://www.bbc.com/news/articles/c1dz0dz0zkvo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 01:58:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Nicaraguan authorities arrest dozens for reportedly supporting Maduro capture",
      "description": "Human rights groups say ‘at least 60 arbitrary arrests’ have occurred for celebrating the US military operation Authorities in Nicaragua have arrested at least 60 people for reportedly celebrating or expressing support for the capture of Venezuelan president Nicolás Maduro, a human rights watchdog group and local media outlets said Friday. Nicaraguan president Daniel Ortega and his wife, vice president Rosario Murillo, are staunch allies of Maduro, who was captured by US military personnel in Caracas last Saturday and taken to New York to face trial on drug and weapons charges. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/10/nicaraguan-authorities-arrests-dozens-for-reportedly-supporting-maduro-capture",
      "published": "Sat, 10 Jan 2026 07:25:24 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "German Chancellor Merz begins his first state visit to India",
      "description": "Merz is due to meet India's Prime Minister Modi, on his first visit to India as a chancellor. The visit comes just weeks ahead of plans to sign a long-awaited free trade agreement between India and the EU. DW has more.",
      "url": "https://www.dw.com/en/german-chancellor-merz-begins-his-first-state-visit-to-india/live-75434261?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 00:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "How AI can detect health risks — just from the way you sleep",
      "description": "A new artificial intelligence model in the United States, SleepFM, has found that patterns in human slumber can be used to predict a person's risk for about 130 diseases, including dementia and certain cancers.",
      "url": "https://www.dw.com/en/how-ai-can-detect-health-risks-just-from-the-way-you-sleep/a-75461969?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 09:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Supporters of UAE-backed separatist group rally in southern Yemen as regional tensions rise",
      "description": "Thousands of Yemenis have gathered in Aden to support a separatist group backed by the UAE",
      "url": "https://abcnews.go.com/International/wireStory/supporters-uae-backed-separatist-group-rally-southern-yemen-129082460",
      "published": "Sat, 10 Jan 2026 10:09:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2026-01-12T07:48:58.781561Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "There's a daily game of cat and mouse to catch illegal migrants in Germany - and it may soon become UK's problem",
      "description": "In Germany's fight against people smugglers, Chief Inspector Igor Weber's Pasewalk force is on the frontline.",
      "url": "https://news.sky.com/story/theres-a-daily-game-of-cat-and-mouse-to-catch-illegal-migrants-in-germany-and-it-may-soon-become-uks-problem-13492375",
      "published": "Sun, 11 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Who would rule Iran if the Islamic Republic falls?",
      "description": "From Crown Prince Reza Pahlavi to imprisoned activists, Iran's potential successors remain unclear. Opposition figures debate who could unify after regime change.",
      "url": "https://www.foxnews.com/world/who-would-rule-iran-islamic-republic-falls",
      "published": "Sat, 10 Jan 2026 09:00:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "UAE cuts funding for citizens studying at UK universities over campus radicalization fears: report",
      "description": "The UAE is pulling scholarships from U.K. universities, citing fears Emirati students could be radicalized amid tensions over Britain and the Muslim Brotherhood.",
      "url": "https://www.foxnews.com/world/uae-cuts-funding-citizens-studying-uk-universities-over-campus-radicalization-fears-report",
      "published": "Fri, 09 Jan 2026 19:47:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "'Hermès of durian': The luxury fruit cashing in on China's billion-dollar appetite",
      "description": "A former gold mining town in Malaysia has seen its riches turn a new shade of yellow, thanks to this pungent fruit.",
      "url": "https://www.bbc.com/news/articles/cz7ndzw28v4o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 23:06:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Frightening ordeal as Sky News team forced into cars and camera seized - with dissent in China rising dramatically",
      "description": "In an industrial corner of the city of Shenzhen, there was a sense the system was bracing.",
      "url": "https://news.sky.com/story/china-would-prefer-its-dissent-not-to-be-seen-but-it-is-increasingly-there-13493041",
      "published": "Mon, 12 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump tells Cuba to 'make a deal, before it is too late'",
      "description": "Trump has been turning his attention to Cuba since US forces seized Venezuelan leader Nicolás Maduro.",
      "url": "https://www.bbc.com/news/articles/cx2kv2gn62vo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 16:33:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thousands of tourists stranded in Lapland as cold grounds flights",
      "description": "All flights out of Kittila airport in northern Finland were cancelled on Sunday with temperatures falling as low as -38C.",
      "url": "https://www.bbc.com/news/articles/c74vnxlvl40o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 21:35:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bob Weir, Grateful Dead co-founder, dies aged 78",
      "description": "Weir was a fixture in the psychedelic rock group and its various spin-offs over 60 years.",
      "url": "https://www.bbc.com/news/articles/cly95x9qe4ko?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 03:00:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Musk says X outcry is 'excuse for censorship'",
      "description": "The government is urging Ofcom to use all its powers – up to and including an effective ban – against X.",
      "url": "https://www.bbc.com/news/articles/ce3kqzepp5zo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 11:41:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US film stars Meagan Good and Jonathan Majors become Guinea citizens after DNA tests",
      "description": "The pair join other US celebrities reconnecting with their African heritage and taking up citizenship.",
      "url": "https://www.bbc.com/news/articles/c8d04zp8m26o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 13:28:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Hounded and harassed': The former pop star taking on Uganda's long-time president",
      "description": "Bobi Wine - a former musician - has been arrested numerous times as he challenges President Yoweri Museveni.",
      "url": "https://www.bbc.com/news/articles/cz0pr807yz7o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 00:42:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN top court set to open Myanmar Rohingya genocide case",
      "description": "Rohingya refugees in Bangladesh hope for justice as the ICJ begins its first full genocide case in more than a decade.",
      "url": "https://www.aljazeera.com/news/2026/1/12/un-top-court-set-to-open-myanmar-rohingya-genocide-case?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 05:16:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Barcelona beat Real Madrid in El Clasico to retain Spanish Super Cup",
      "description": "Raphinha scores twice as Barcelona beat Real Madrid for second year running in the Spanish Super Cup with a 3-2 win.",
      "url": "https://www.aljazeera.com/sports/2026/1/11/barcelona-beat-real-madrid-in-clasico-to-retain-spanish-super-cup?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 22:01:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How Israel is shifting Gaza’s yellow line",
      "description": "Satellite images show Israeli forces repositioning yellow cement blocks hundreds of metres inside Gaza’s yellow line.",
      "url": "https://www.aljazeera.com/video/birds-eye-view/2026/1/11/how-israel-is-shifting-gazas-yellow-line?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 19:29:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says no more Venezuelan oil or money to go to Cuba, demands ‘deal’",
      "description": "Venezuela is Cuba's biggest oil supplier, but no shipments have departed Venezuelan ports since Maduro's abduction.",
      "url": "https://www.aljazeera.com/news/2026/1/11/trump-says-no-more-venezuelan-oil-or-money-to-go-to-cuba-and-demands-deal?traffic_source=rss",
      "published": "Sun, 11 Jan 2026 17:22:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 16 km ESE of Baculin, Philippines",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - V Time 2026-01-07 03:02:56 UTC 2026-01-07 03:02:56 UTC at epicenter Location 7.390°N 126.722°E Depth 35.00 km (21.75 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rn2z",
      "published": "2026-01-10T16:27:43.386Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysia, Indonesia become first to block Musk's Grok over AI deepfakes",
      "description": "Malaysia and Indonesia have become the first countries to block Grok, the artificial intelligence chatbot developed by Elon Musk's xAI, after authorities said it was being misused to generate sexually explicit and non-consensual images.",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5674660/malaysia-indonesia-block-grok-ai-deepfakes",
      "published": "Mon, 12 Jan 2026 02:15:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Latin American left responds to Trump's pledge to take over of Venezuelan oil",
      "description": "Latin America's left is in disarray after the seizure of Nicolas Maduro and the U.S.'s pledge to take over Venezuela's oil industry. Many on the left are changing their rhetoric about President Trump.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5672420/latin-american-left-responds-to-the-trumps-pledge-to-take-over-of-venezuelan-oil",
      "published": "Sun, 11 Jan 2026 08:06:01 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Meta shuts over 544,000 Australian accounts after ban",
      "description": "The tech giant removed Facebook, Instagram and Threads accounts to comply with Australia's social media ban for under-16-year-olds.",
      "url": "https://www.dw.com/en/meta-shuts-over-544-000-australian-accounts-after-ban/a-75469113?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 06:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Menopause: When hormones harm the economy",
      "description": "There are nine million working women in Germany of menopausal age. When they experience symptoms, it has economic consequences. There are, however, things companies can do to retain their personnel.",
      "url": "https://www.dw.com/en/menopause-when-hormones-harm-the-economy/a-75441306?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 05:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jack London felt 'Call of the Wild,' lived life of adventure",
      "description": "The Klondike gold rush, wolves in the Alaskan snow, adventures on the high seas: Jack London, author of \"The Call of the Wild\" and \"The Sea Wolf,\" was born 150 years ago. DW looks at his life.",
      "url": "https://www.dw.com/en/jack-london-felt-call-of-the-wild-lived-life-of-adventure/a-75434544?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 11:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "As China sales slow, Germany's carmakers look to India",
      "description": "For decades, German cars symbolized engineering perfection and economic power. Now, sales are down as China, a key market, goes electric. India could fill some of that gap for German carmakers. But will it be enough?",
      "url": "https://www.dw.com/en/as-china-sales-slow-germany-s-carmakers-look-to-india/a-75206421?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 08:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Dobrindt vows to fight left-wing extremism",
      "description": "The interior minister says he will \"hit back\" at left-wing extremists suspected of having caused the Berlin blackout.",
      "url": "https://www.dw.com/en/germany-news-dobrindt-vows-to-fight-left-wing-extremism/live-75458964?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 11 Jan 2026 08:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French Cup: Endrick gives Lyon victory over Lille in round of 32",
      "description": "Olympique Lyonnais won 2-1 at Lille in the French Cup round of 32. On loan from Real Madrid, Endrick scored the winning goal on his debut.",
      "url": "https://www.france24.com/en/tv-shows/sports/20260112-french-cup-endrick-gives-lyon-victory-over-lille-in-round-of-32",
      "published": "Mon, 12 Jan 2026 06:58:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Chalamet clinches first Golden Globe, 'One Battle After Another' among top winners",
      "description": "Actor Timothée Chalamet won the Golden Globe for best actor in a comedy film on Sunday, a potential boost to his Oscar prospects, as \"One Battle After Another\" took multiple honours. Chalamet, previously winless after four Globe nominations, was applauded by fellow nominees including Leonardo DiCaprio and George Clooney.",
      "url": "https://www.france24.com/en/culture/20260112-chalamet-one-battle-golden-globes",
      "published": "Mon, 12 Jan 2026 03:41:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Barca edge Real Madrid in Spanish Super Cup final",
      "description": "Despite Kylian Mbappé's return, FC Barcelona retained their Spanish Super Cup title on Sunday in Saudi Arabia after a thrilling final against Real Madrid (3-2).",
      "url": "https://www.france24.com/en/sport/20260111-barca-edge-real-madrid-in-spanish-super-cup-final",
      "published": "Sun, 11 Jan 2026 21:51:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "\"It's a scam\": French AI envoy on X making Grok chatbot pay-to-perve",
      "description": "France's AI and digital ambassador Clara Chappaz says making public image generation a paid feature of Grok is a \"scam\", adding to the outcry over how tech mogul Elon Musk has dealt with a torrent of deepfake sexual abuse on his social media platform X.",
      "url": "https://www.france24.com/en/tv-shows/tech-24/20260111-it-s-a-scam-french-ai-envoy-on-x-making-grok-chatbot-pay-to-perve",
      "published": "Sun, 11 Jan 2026 16:23:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Conditions not met for oil firms to invest in Venezuela, expert says",
      "description": "President Donald Trump has urged top oil executives to invest in Venezuela's oil industry following the capture of Nicolas Maduro by US forces. However, his push has been met with caution, as the conditions for oil firms to invest in Venezuela are not yet met, said Francis Perrin, Senior Research Fellow at IRIS, citing three key requirements: “security, long-term stability and profitability.”",
      "url": "https://www.france24.com/en/conditions-not-met-for-oil-firms-to-invest-in-venezuela-expert-says",
      "published": "Sun, 11 Jan 2026 14:45:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela releases political prisoners in deal with Washington",
      "description": "Venezuela's government on Thursday pledged to free a significant number of prisoners in what it described as a gesture to “seek peace.” Officials have not identified or given a number of prisoners being considered for release, leaving rights groups scouring for hints of information and families to watch the hours tick by with no word. US President Donald Trump said the release of people detained for political reasons came at Washington’s request.",
      "url": "https://www.france24.com/en/venezuela-releases-political-prisoners-in-deal-with-washington",
      "published": "Sun, 11 Jan 2026 14:42:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AI-powered innovation dominates Consumer Electronics show",
      "description": "Pendants and brooches packed with artificial intelligence abounded at the Consumer Electronics show, using cameras and microphones to watch and listen through the day like a vigilant personal assistant. The return of the wearable tech comes about a year after the discontinuation of a Humane AI Pin panned by reviewers after it was launched amid high expectations in early 2024.",
      "url": "https://www.france24.com/en/ai-powered-innovation-dominates-consumer-electronics-show",
      "published": "Sun, 11 Jan 2026 12:19:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON semi-finals: Morocco to play Nigeria, Egypt to face Senegal",
      "description": "Mohamed Salah’s Egypt defeated reigning champions Ivory Coast 3-2 in the quarter-finals and will face Senegal in the semi-finals on Wednesday in Tangiers. Meanwhile, Victor Osimhen starred as Nigeria beat Algeria 2-0, setting up a semi-final clash with hosts Morocco.",
      "url": "https://www.france24.com/en/afcon-semi-finals-morocco-to-play-nigeria-egypt-to-face-senegal",
      "published": "Sun, 11 Jan 2026 11:23:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "-37C temperatures traps thousands of tourists in Finland",
      "description": "Thousands of tourists have been left stranded in northern Finland after flights at Kittila Airport were cancelled due to severe cold.",
      "url": "https://news.sky.com/story/37c-temperatures-traps-thousands-of-tourists-in-finland-13493256",
      "published": "Mon, 12 Jan 2026 01:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN court to begin hearings on whether Myanmar committed genocide against the Rohingya",
      "description": "Myanmar will face accusations that it is responsible for genocide against the Rohingya ethnic minority at the top court of the United Nations, as long-awaited hearings are set to begin",
      "url": "https://abcnews.go.com/International/wireStory/court-begin-hearings-myanmar-committed-genocide-rohingya-129122831",
      "published": "Mon, 12 Jan 2026 01:45:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Off the ballot, Ugandan president's son waits in the wings this election",
      "description": "Muhoozi Kainerugaba, the Ugandan president’s military son, is not on the ballot in Thursday's presidential election",
      "url": "https://abcnews.go.com/International/wireStory/off-ballot-ugandan-presidents-son-waits-wings-election-129119451",
      "published": "Sun, 11 Jan 2026 22:33:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Britain is in talks with NATO to counter Russia and China in the Arctic",
      "description": "Britain is discussing with NATO allies how to enhance Arctic security against Russia and China",
      "url": "https://abcnews.go.com/International/wireStory/britain-talks-nato-counter-russia-china-arctic-129106620",
      "published": "Sun, 11 Jan 2026 13:21:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Deep freeze strands thousands in northern Finland",
      "description": "Flights at Kittilä airport were canceled due to severe cold.",
      "url": "https://abcnews.go.com/International/wireStory/thousands-tourists-stranded-northern-finland-deep-freeze-halts-129104910",
      "published": "Sun, 11 Jan 2026 11:50:02 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany sharply rejects RFK Jr.'s claims that it prosecutes doctors for vaccine exemptions",
      "description": "The German government has sharply rejected claims by U.S. Health Secretary Robert F. Kennedy Jr. that it sidelined patient autonomy during COVID-19",
      "url": "https://abcnews.go.com/International/wireStory/germany-sharply-rejects-rfk-jrs-claims-prosecutes-doctors-129100167",
      "published": "Sun, 11 Jan 2026 07:04:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope Leo baptizes 20 infants in tradition marking end of Christmas season",
      "description": "Pope Leo XIV has baptized 20 babies in the Sistine Chapel, continuing an annual tradition marking the end of the Christmas holiday at the Vatican",
      "url": "https://abcnews.go.com/International/wireStory/pope-leo-baptizes-20-infants-tradition-marking-end-129099856",
      "published": "Sun, 11 Jan 2026 05:52:04 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Millions of Venezuelans scattered across Latin America cautiously watch what comes next",
      "description": "Many of the 8 million Venezuelans scattered across the Americas received the news of their president's capture with caution",
      "url": "https://abcnews.go.com/International/wireStory/millions-venezuelans-scattered-latin-america-cautiously-watch-129098217",
      "published": "Sun, 11 Jan 2026 00:25:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kenyan women lost their husbands and then their land. But some are fighting back",
      "description": "Thousands of widows in western Kenya face losing their land after their husbands die",
      "url": "https://abcnews.go.com/International/wireStory/kenyan-women-lost-husbands-land-fighting-back-129096709",
      "published": "Sat, 10 Jan 2026 22:49:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Slow-moving prisoner releases in Venezuela enter 3rd day after government announces goodwill effort",
      "description": "Venezuela’s government has pledged to free a significant number of prisoners.",
      "url": "https://abcnews.go.com/International/wireStory/slow-moving-prisoner-releases-venezuela-enter-3rd-day-129092386",
      "published": "Sat, 10 Jan 2026 20:33:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nicaragua’s government says it’s freeing detainees after pressure from the US",
      "description": "Nicaragua’s Interior Ministry has announced the release of dozens of prisoners",
      "url": "https://abcnews.go.com/International/wireStory/nicaraguas-government-freeing-detainees-after-pressure-us-129091177",
      "published": "Sat, 10 Jan 2026 17:21:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Aid continues despite winter hardship in Gaza and West Bank, UN says",
      "description": "Despite harsh winter conditions and continuing access constraints, the UN and partners are maintaining large-scale humanitarian operations in Gaza and the occupied West Bank, with a focus on shelter, water, health and education.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166728",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Journalist’s dangerous obsession with a forgotten serial killer unraveled her reality",
      "description": "Unknown recordings reveal how journalist Laura Greenberg befriended serial killer Doug Gretzler, visiting him 350 times. Her story is told on Oxygen's \"Charmed by the Devil.\"",
      "url": "https://www.foxnews.com/us/journalists-dangerous-obsession-forgotten-serial-killer-unraveled-reality",
      "published": "Sun, 11 Jan 2026 14:00:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland leaders push back on Trump's calls for US control of the island: 'We don’t want to be Americans'",
      "description": "Greenland leaders firmly reject President Donald Trump's proposed U.S. takeover as the American administration vows action regardless of their wishes.",
      "url": "https://www.foxnews.com/world/greenland-leaders-push-back-trumps-calls-us-control-island-we-dont-want-americans",
      "published": "Sat, 10 Jan 2026 12:51:21 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces seize oil tanker in the Caribbean Sea in pre-dawn mission",
      "description": "U.S. forces boarded a tanker known as Olina in ongoing campaign against vessels evading Venezuela sanctions blockade, the U.S. Southern Command said.",
      "url": "https://www.foxnews.com/world/us-forces-seize-oil-tanker-caribbean-sea-pre-dawn-mission",
      "published": "Fri, 09 Jan 2026 09:14:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}