{
  "last_updated": "2025-12-24T14:21:06.504508Z",
  "event_count": 225,
  "events": [
    {
      "title": "Jeju Air crash: South Korea sets up independent inquiry into disaster that killed 179 amid delays and acrimony",
      "description": "MPs vote to investigate crash amid accusations from victims’ relatives of cover-ups and delays South Korea’s parliament has launched an independent inquiry into the deadliest air disaster on its soil amid accusations of investigation delays and cover-ups of last year’s Jeju Air crash. On 29 December 2024 all but two of the 181 people onboard a Jeju Air Boeing 737-800 died when it crashed at Muan international airport, 288km south of Seoul, after reporting a bird strike during landing. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/jeju-air-crash-independent-inquiry-south-korea",
      "published": "Mon, 22 Dec 2025 06:33:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "NSW premier says police commissioner to decide when to use state’s new protest ban powers",
      "description": "Introduced in response to the Bondi beach terror attack, the laws give police powers to ban on protests for up to three months after a terrorist event Ten minutes of terror: how the Bondi mass shooting unfolded in real time – video Follow the latest live updates The New South Wales premier, Chris Minns, has said it is up to the state’s police commissioner, Mal Lanyon, when to activate controversial new powers to ban protests – although he made it clear he would like them triggered quickly. The new laws, were assented to on Wednesday after being passed in a late-night sitting of the NSW upper house and affirmed on Wednesday morning by the lower house. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/24/nsw-premier-police-commissioner-protest-ban-powers-bondi-shooting-terror-attack-ntwnfb",
      "published": "Wed, 24 Dec 2025 04:06:50 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 42,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: More UN staff detentions in Yemen, peacekeepers killed in Sudan sent home, attacks in Ukraine",
      "description": "The UN Secretary-General on Friday condemned the arbitrary detention of 10 more UN personnel by Houthi de facto authorities in Yemen, warning that the growing crackdown is crippling humanitarian operations and putting millions of lives at risk.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166644",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "4 indicted in foiled New Year's Eve terror bombing plot targeting Southern California businesses",
      "description": "Four people face federal terror charges for allegedly plotting New Year's Eve 2025 bombings targeting businesses. The holiday attack was foiled by FBI agents.",
      "url": "https://www.foxnews.com/us/four-indicted-foiled-new-years-eve-terror-bombing-plot-targeting-southern-california-businesses",
      "published": "Tue, 23 Dec 2025 19:52:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Australia terror attack exposes ISIS resurgence as experts warn of global jihadist networks",
      "description": "Terror attack in Australia exposes growing jihadist networks as security experts warn ISIS remains far from defeated despite recent government claims.",
      "url": "https://www.foxnews.com/world/australia-terror-attack-exposes-isis-resurgence-experts-warn-global-jihadist-networks",
      "published": "Mon, 22 Dec 2025 06:00:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Bondi policeman injured in mass shooting wakes from coma",
      "description": "A police officer injured in the Bondi terror attack has woken from a coma.",
      "url": "https://news.sky.com/story/bondi-policeman-injured-in-mass-shooting-wakes-from-coma-13487062",
      "published": "Tue, 23 Dec 2025 14:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Retribution fears as Australian Muslims see surge in Islamophobic hate since Bondi terror attack",
      "description": "Security stepped up at mosques amid spate of targeted abuse as leaders mourn Bondi victims and say community will not ‘claim victimhood’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Threats and hate speech against Muslim Australians have surged in the wake of the Bondi beach attack, with one mosque receiving dozens of offensive phone calls and reports of people being targeted in the street. As Australia’s Jewish community deals with trauma from the attack that killed 15 people at a Hanukah event, religious leaders say societal and political divisions has led to other groups being targeted by hatred. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/24/retribution-fears-australian-muslims-surge-islamophobic-hate-since-bondi-terror-attack-ntwnfb",
      "published": "Wed, 24 Dec 2025 03:22:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Libya’s army chief dies in plane crash in Turkey",
      "description": "Libyan PM says Mohammed Ali Ahmed al-Haddad died after aircraft lost radio contact above Ankara The Libyan army’s chief of staff, Mohammed Ali Ahmed al-Haddad, has been killed in a plane crash after leaving Turkey’s capital, Ankara. The prime minister of Libya’s internationally recognised government confirmed on Tuesday evening that Mohammed Ali Ahmed al-Haddad had died and that four others were on the jet with him. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/libyas-army-chief-dies-in-plane-crash-in-turkey",
      "published": "Tue, 23 Dec 2025 23:46:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Guilty verdicts in ISIS plot police say could have been 'the deadliest terrorist attack in UK history'",
      "description": "Three men convicted of planning alleged gun attacks on Jewish targets in Manchester as British Jews report feeling increasingly unsafe across the U.K.",
      "url": "https://www.foxnews.com/world/guilty-verdicts-isis-plot-police-say-could-have-been-the-deadliest-terrorist-attack-uk-history",
      "published": "Tue, 23 Dec 2025 13:17:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns Sudan war entering deadlier phase as fighting spreads in Kordofan",
      "description": "The war in Sudan is entering a deadlier phase, the United Nations has warned, as intensified fighting in the Kordofan region, mounting civilian casualties from drone strikes and growing risks of regional spillover push the conflict toward the 1,000-day mark.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166655",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Delaware state trooper killed in DMV shooting incident, gunman also dead with no active threat: officials",
      "description": "A Delaware state trooper was killed Tuesday in a shooting at a Wilmington DMV. Officials say the suspect is dead and the scene is secure.",
      "url": "https://www.foxnews.com/us/delaware-state-trooper-killed-dmv-shooting-incident-gunman-dead-no-active-threat-officials",
      "published": "Tue, 23 Dec 2025 17:06:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "France slams US visa ban as row over European 'censorship' deepens",
      "description": "France condemned on Wednesday a US visa ban on Thierry Breton, a former European Union commissioner who helped drive landmark online regulation that Washington believes censors free speech and unfairly targets US tech giants. The Trump administration imposed visa bans on Tuesday on Breton, one of the ​architects of the EU's Digital Services Act, and other anti-disinformation campaigners who it says were involved in censoring U.S. social media platforms. The visa bans ‍underline growing divergences between Washington and some European capitals over issues including free speech, defence, immigration, far-right politics, trade and the Russia-Ukraine war. Analysis by FRANCE 24 international affairs commentator, Douglas Herbert.",
      "url": "https://www.france24.com/en/video/20251224-france-slams-us-visa-ban-as-row-over-european-censorship-deepens",
      "published": "Wed, 24 Dec 2025 11:37:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "ISIS, Iran escalating global campaign against Jews, Israel spy chief says",
      "description": "Mossad Director David Barnea said Israel will pursue the Bondi attackers and those who sent them, warning Iran and ISIS are accelerating global plots against Jews.",
      "url": "https://www.foxnews.com/world/isis-iran-escalating-global-campaign-against-jews-israel-spy-chief-says",
      "published": "Sun, 21 Dec 2025 13:04:30 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Perth man charged with racial harassment for alleged post backing Bondi attack",
      "description": "Martin Thomas Glynn, 39, was arrested in Yangebup where police allege they found firearms, ammunition and Hamas and Hezbollah flags A man accused of posting an antisemitic social media message in support of the Bondi massacre will spend Christmas behind bars. Martin Thomas Glynn, 39, was arrested in the Perth suburb of Yangebup and charged after a concerned member of the public reported him to police. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/24/perth-man-charged-with-racial-harassment-for-alleged-post-backing-bondi-attack-ntwnfb",
      "published": "Wed, 24 Dec 2025 10:35:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Brown University police chief placed on leave after deadly shooting as Trump admin opens investigation",
      "description": "Brown University places police chief Rodney Chatman on administrative leave following deadly campus shooting that killed two people and injured nine others.",
      "url": "https://www.foxnews.com/us/brown-university-police-chief-placed-leave-after-deadly-shooting-trump-admin-opens-investigation",
      "published": "Tue, 23 Dec 2025 11:35:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "NSW laws take effect – as it happened",
      "description": "This blog is now closed Retribution fears as Australian Muslims see surge in Islamophobic hate since Bondi terror attack NSW premier says police commissioner to decide when to use state’s new protest ban powers Get our breaking news email , free app or daily news podcast Sabra Lane signs off as host of AM after eight years The ABC journalist Sabra Lane has signed off as the host of flagship radio current affairs program AM after more than eight years in the role. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2025/dec/24/nsw-gun-and-protest-laws-bondi-terror-attack-hate-crime-database-anthony-albanese-sussan-ley-chris-minns-labor-coalition-ntwnfb",
      "published": "Wed, 24 Dec 2025 04:51:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Russian general killed by car bomb, third senior military leader killed this year",
      "description": "Russian Lt. General Fanil Sarvarov killed in Moscow car bombing as investigators suspect Ukrainian intelligence involvement in the deadly attack on Monday.",
      "url": "https://www.foxnews.com/world/russian-general-killed-car-bomb-third-senior-military-leader-killed-year",
      "published": "Mon, 22 Dec 2025 07:53:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "US: Pennsylvania nursing home rocked by twin explosions",
      "description": "Deaths were reported following two explosions and fire at a nursing home outside Philadelphia, with several people still unaccounted for, officials have said.",
      "url": "https://www.dw.com/en/us-pennsylvania-nursing-home-rocked-by-twin-explosions/a-75291851?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 07:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Explosion in Russian capital kills 3",
      "description": "Three people, including two police officers, have been killed in an explosion in Moscow, Russian investigators said, just days after a car bomb killed a high-ranking general not far away",
      "url": "https://abcnews.go.com/International/wireStory/explosion-russian-capital-kills-3-128672682",
      "published": "Wed, 24 Dec 2025 04:26:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN urges calm in Bangladesh after killing of protest leader sparks unrest",
      "description": "The United Nations has urged calm in Bangladesh after the killing of a prominent youth protest leader sparked fresh unrest, raising concerns about political violence and the safety of civic space as the country prepares for elections early next year.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166642",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Explosion at Pennsylvania senior home leaves at least people 2 dead, several hospitalized",
      "description": "At least two people dead, multiple others reportedly trapped and hurt after explosion rocks Silver Lake Nursing Home in Bucks County, Pennsylvania.",
      "url": "https://www.foxnews.com/us/explosion-pennsylvania-senior-home-prompts-mass-casualty-response",
      "published": "Tue, 23 Dec 2025 16:35:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "American journalist injured in Israeli attack wants answers from Washington",
      "description": "AFP's Dylan Collins was among journalists injured in an Israeli attack on Lebanon in 2023. The attack killed Reuters' Issam Abdallah. Collins was in Washington this month to press for accountability.",
      "url": "https://www.npr.org/2025/12/23/g-s1-103310/dylan-collins-lebanon-israel-attack-washington-congress",
      "published": "Tue, 23 Dec 2025 05:02:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "LIVE: Security Council meets on escalating violence in Sudan",
      "description": "Senior UN political and humanitarian officials are set brief the Security Council this afternoon as members meet to discuss the rapidly deteriorating situation in Sudan, where intensified fighting – including in the Kordofan region – has driven widespread civilian harm and displacement. The region has seen a sharp escalation, including a deadly drone attack on a UN peacekeeping base that killed six Bangladeshi peacekeepers. The meeting was requested by Sudan and Transitional Prime Minister, Kamil Eltayeb Idris, is expected to attend. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166650",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Australian PM Albanese gets booed during Bondi Beach vigil honoring Hanukkah attack victims",
      "description": "Prime Minister Anthony Albanese faced boos at a vigil for Bondi Beach shooting victims Sunday, as some 10,000 mourners gathered to honor those killed.",
      "url": "https://www.foxnews.com/world/australian-pm-albanese-gets-booed-during-bondi-beach-vigil-honoring-hanukkah-attack-victims",
      "published": "Sun, 21 Dec 2025 11:07:04 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Sweden and Germany slash aid budgets to focus on Ukraine and defence spending",
      "description": "Echoing the dismantling of USAID, other countries are changing funding priorities and health and hunger programmes in Africa will lose out The notion of humanitarian aid being used to combat poverty and hunger is being replaced in Europe with geopolitical “games” as states redirect aid to Ukraine and to defence spending, analysts warn after recent announcements by Sweden and Germany. Earlier this year, humanitarian groups called for European donors to fill the gap as President Donald Trump dismantled the USAID programme, but instead other nations are further pulling back from their commitments around the world. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/21/sweden-and-germany-slash-aid-budgets-to-focus-on-ukraine-and-defence-spending",
      "published": "Sun, 21 Dec 2025 14:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Zelensky reveals revised 20-point US plan to end Russian war",
      "description": "Ukrainian President Volodymyr Zelensky has revealed details of the latest US-led plan to end the war in Ukraine, saying it had been agreed between negotiators from Kyiv and Washington and sent to Moscow for feedback. Analysis by Stefan Wolff, professor of international security at the University of Birmingham. Story by Carys Garland.",
      "url": "https://www.france24.com/en/video/20251224-ukraine-zelensky-reveals-revised-20-point-us-plan-to-end-russian-war",
      "published": "Wed, 24 Dec 2025 12:29:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Libya army chief of staff killed in jet crash near Ankara after fault reported",
      "description": "A private jet that crashed overnight, killing Libya's army chief of staff and seven others on board, had reported an electrical fault and requested an emergency landing ​shortly before contact was lost, a Turkish official said on Wednesday. Story by Charlotte Lam.",
      "url": "https://www.france24.com/en/video/20251224-libya-army-chief-of-staff-killed-in-jet-crash-near-ankara-after-fault-reported",
      "published": "Wed, 24 Dec 2025 10:29:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Venezuela accuses US of 'extortion' and seeks to criminalise oil tanker seizures",
      "description": "Venezuela’s parliament on Tuesday approved a measure that criminalises a broad range of activities that can hinder navigation and commerce in the South American country, such as the seizure of oil tankers. The bill -- introduced, debated and approved within two days in the National Assembly -- follows this month's seizures by US forces of two tankers carrying Venezuelan oil in international waters. Story by Charlotte Lam.",
      "url": "https://www.france24.com/en/video/20251224-venezuela-accuses-us-of-extortion-and-seeks-to-criminalise-oil-tanker-seizures",
      "published": "Wed, 24 Dec 2025 09:55:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Russia: Police officers killed in new Moscow explosion",
      "description": "The two officers were approaching a suspicious person in Moscow when the blast took place, investigators say. The latest explosion was reported near the scene of a car blast which killed a Russian general this week.",
      "url": "https://www.dw.com/en/russia-police-officers-killed-in-new-moscow-explosion/a-75291926?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 07:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Workers organized by a key union rally in Bolivia against scrapping fuel subsidies",
      "description": "Bolivian miners have marched in downtown La Paz, the country’s capital, and union-organized protesters took to the streets elsewhere on the first day of a strike over the government’s scrapping of fuel subsidies that have been blamed for contributing t...",
      "url": "https://abcnews.go.com/International/wireStory/workers-organized-key-union-rally-bolivia-scrapping-fuel-128635978",
      "published": "Mon, 22 Dec 2025 19:37:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Croatian man sentenced to 50 years for killing 7-year-old student in school attack",
      "description": "A Croatian man has been sentenced to 50 years in prison for fatally stabbing a 7-year-old student in an attack at a school that shocked the European Union country",
      "url": "https://abcnews.go.com/International/wireStory/croatian-man-sentenced-50-years-killing-7-year-128644215",
      "published": "Tue, 23 Dec 2025 06:40:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Freed Nigerian schoolchildren to be reunited with families",
      "description": "Month-long ordeal ends but no details released on how they regained their freedom or who was behind abduction A final group of 130 kidnapped Nigerian schoolchildren freed by the government on Sunday are expected to be reunited with their families in the central Niger state on Monday, ending a month-long ordeal that drew global concern. Last month, unknown gunmen took hundreds of schoolchildren and 12 teachers from St Mary’s Catholic school, Papiri community in Niger state, which runs west from the capital, Abuja, to neighbouring Benin. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/freed-nigerian-schoolchildren-set-to-be-reunited-with-families",
      "published": "Mon, 22 Dec 2025 12:00:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘Gunboat diplomacy on steroids’: US signs security deals across Latin America",
      "description": "Venezuela’s Nicolás Maduro warns Trump administration may ‘destabilise the entire region’ amid rising tensions While all eyes are on the four-month-long US military campaign against Venezuela, the White House has been quietly striking security agreements with other countries to deploy US troops across Latin America and the Caribbean. As Donald Trump announced a blockade on oil tankers under sanctions and ordered the seizure of vessels amid airstrikes that have killed more than 100 people in the Caribbean and the Pacific, the US secured military deals with Paraguay, Ecuador, Peru and Trinidad and Tobago in the past week alone. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/23/us-trump-administration-signs-security-deals-across-latin-america",
      "published": "Tue, 23 Dec 2025 12:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Christmas in Ukraine: 'Despite the war, our children want to feel happy'",
      "description": "Ukraine’s Volodymyr Zelensky says he's hoping for an answer from Moscow on Wednesday to the draft peace plan hashed out between Washington and Kyiv. Meanwhile, the president's compatriots are preparing to celebrate yet another Christmas under Russian invasion. After nearly four years of war, the population continues to be subjected to near-nightly missile and drone attacks – but it's not stopping them from getting into the holiday spirit. Story by Bryan Quinn.",
      "url": "https://www.france24.com/en/video/20251224-christmas-in-ukraine-despite-the-war-our-children-want-to-feel-happy",
      "published": "Wed, 24 Dec 2025 11:00:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Overnight strikes leave death, destruction and power outages in Ukraine",
      "description": "A new wave of overnight strikes and front-line hostilities in Ukraine have caused further civilian casualties and damage to critical energy infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166664",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Myanmar elections marked by fear as UN warns civilians are coerced from all sides",
      "description": "As Myanmar approaches elections scheduled for 28 December, the UN’s top human rights official has said that civilians are being coerced from all sides – forced by the military to vote and threatened by armed opposition groups to boycott – in a climate of fear, violence and mass repression.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166662",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘Israel is only the appetizer’: Huckabee warns Iran threat looms as Netanyahu eyes Trump talks",
      "description": "Israeli Prime Minister Benjamin Netanyahu seeks meeting with President Donald Trump as officials warn Iranian missile drills could cover surprise attack plans.",
      "url": "https://www.foxnews.com/world/israel-only-appetizer-huckabee-warns-iran-threat-looms-netanyahu-eyes-trump-talks",
      "published": "Mon, 22 Dec 2025 11:35:34 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Security Council remains divided over Iran nuclear programme, sanctions stay in place",
      "description": "At a meeting to discuss nuclear non-proliferation on Tuesday, the Security Council’s stance on Iran’s nuclear activities remained divided on the issue, split between those who support the reinstatement of sanctions, and the members who believe the sanctions should be permanently lifted, whilst questioning the legality of the meeting itself.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166660",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Security Council meets on Venezuela, Iran, Somalia",
      "description": "The Security Council convened earlier today for a packed agenda, adopting a resolution extending the authorisation of the African Union support mission in Somalia (AUSSOM) and hearing a briefing on Iran and the implementation of resolution 2231, which endorsed the 2015 nuclear deal known as the Joint Comprehensive Plan of Action (JCPOA). Members are set to reconvene at 3 pm for an emergency meeting requested by Venezuela, amid heightened tensions between Caracas and Washington. Assistant Secretary-General for Political Affairs Khaled Khiari is expected to brief ambassadors. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166656",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Israeli diaspora minister says Australia should have seen 'writing on the wall' before terror attack",
      "description": "Israel’s Amichai Chikli said Australian officials overlooked rising antisemitism and extremist rhetoric ahead of the Bondi Beach Hanukkah attack, criticizing the focus on gun laws.",
      "url": "https://www.foxnews.com/world/israeli-diaspora-minister-australia-writing-wall-terror-attack",
      "published": "Sun, 21 Dec 2025 15:20:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "A Canadian lawyer linked to a former Olympic snowboarder accused of drug trafficking gets bail",
      "description": "A Canadian lawyer accused of playing a key role in an international drug smuggling network involving a former Olympic snowboarder has been granted bail ahead of his extradition hearing to the United States",
      "url": "https://abcnews.go.com/International/wireStory/canadian-lawyer-linked-former-olympic-snowboarder-accused-drug-128656746",
      "published": "Tue, 23 Dec 2025 13:38:02 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Weekend attacks in Ukraine bring more casualties, damage infrastructure",
      "description": "Hostilities in Ukraine this weekend resulted in more civilian casualties and widespread damage to critical infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166652",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Calming the mind and promoting global peace on World Meditation Day",
      "description": "Meditation, which has its roots in religious, yogic and secular traditions from various civilisations, calls for living in the present moment.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166641",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Colorado mom accused of killing 2 children and fleeing to UK returns stateside to face murder charges",
      "description": "Colorado mother accused of killing two of her children, injuring another during custody battle extradited from U.K. to face murder charges after lengthy international legal fight.",
      "url": "https://www.foxnews.com/us/colorado-mom-accused-killing-2-children-fleeing-uk-returns-stateside-face-murder-charges",
      "published": "Wed, 24 Dec 2025 05:38:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Two dead after Pennsylvania nursing home explosions",
      "description": "Authorities are investigating whether a gas leak was to blame for the twin blasts and fire, which caused a partial collapse.",
      "url": "https://www.bbc.com/news/articles/ce3wry1529wo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:37:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Despite Vatican-Israel tensions, Catholics and Jews work to build trust in Haifa",
      "description": "Religious leaders started getting together after Oct. 7, 2023, in the hope of preventing a repeat of Arab-Jewish violence that erupted after a previous conflict in Gaza two years earlier.",
      "url": "https://www.npr.org/2025/12/24/g-s1-103018/israel-interfaith-understanding-jews-catholics-christmas",
      "published": "Wed, 24 Dec 2025 05:03:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Japan, bears have gone from dangerous to delicious",
      "description": "Since Japan recorded a spike in deadly bear attacks, some restaurants have struggled to keep up with booming demand for grilled cuts of the animal. Cooked on a stone slate – or in a hot pot with vegetables – the meat comes from bears culled to curb maulings that have killed a record 13 people this year. Story by Gabrielle Nadler.",
      "url": "https://www.france24.com/en/video/20251224-in-japan-bears-have-gone-from-dangerous-to-delicious",
      "published": "Wed, 24 Dec 2025 12:11:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia launches major deadly missile and drone attack on Ukraine",
      "description": "Russia launched a major overnight missile and drone attack on Ukraine that killed at least three people - including a four-year-old child.",
      "url": "https://news.sky.com/story/russia-launches-major-deadly-missile-and-drone-attack-on-ukraine-13486997",
      "published": "Tue, 23 Dec 2025 11:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sudan war: Kordofan’s El-Obeid ‘one or two steps’ away from being attacked",
      "description": "As fighting escalates in Sudan, “people are scared, people are fleeing their homes”, the UN migration agency, IOM, said on Friday, noting that more than 50,000 people have been uprooted since late October in the Kordofans region alone.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166633",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Woman in Florida Barnes & Noble stabbed to death, police seek motive",
      "description": "A woman died from stab wounds after allegedly being attacked inside a Barnes & Noble bookstore in Palm Beach Gardens, leaving police searching for a motive.",
      "url": "https://www.foxnews.com/us/woman-florida-barnes-noble-stabbed-death-police-seek-motive",
      "published": "Wed, 24 Dec 2025 07:29:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Family warned nonprofit not to free repeat offender who allegedly killed man days later",
      "description": "Family warned bail nonprofit not to release repeat offender who allegedly killed man days later, saying he needed help and treatment, not freedom.",
      "url": "https://www.foxnews.com/us/family-warned-nonprofit-not-free-repeat-offender-who-allegedly-killed-man-days-later",
      "published": "Wed, 24 Dec 2025 06:00:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "PA man charged with attempting to make weapons of mass destruction after neighbor tip",
      "description": "Counterterrorism investigation leads to arrest of Pennsylvania man accused of weapons of mass destruction charges. Neighbor's tip sparked FBI probe.",
      "url": "https://www.foxnews.com/us/pa-man-charged-attempting-make-weapons-mass-destruction-after-neighbor-tip",
      "published": "Tue, 23 Dec 2025 20:49:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Walz under fire as Minnesota mayors sound alarm on 'financial disaster' ahead and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/walz-under-fire-mayors-sound-alarm-more-top-headlines",
      "published": "Tue, 23 Dec 2025 06:51:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Bolsonaro supporters ‘cancel’ Havaianas flip-flop brand over television ad",
      "description": "Son of jailed former Brazilian president says spokesperson for ‘national symbol’ sandals is ‘openly left wing’ Leaderless since its figurehead was jailed for attempting a coup , Brazil’s far right has found a new nemesis: the flip-flop brand Havaianas, which has been “cancelled” by Jair Bolsonaro ’s supporters over a television advert. The controversy stems from the actor Fernanda Torres – the star of I’m Still Here , the Brazilian film that won an Oscar for best international feature – saying in the ad that she hoped audiences would not start 2026 “on the right foot”, but “with both feet”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/brazil-jair-bolsonaro-eduardo-havaianas-television-ad-fernanda-torres",
      "published": "Tue, 23 Dec 2025 14:02:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "After football World Cup exit and coaching shake-up, Cameroon braces for AFCON challenge",
      "description": "After failing to qualify for the 2026 FIFA World Cup and sacking their coach just weeks before AFCON, Cameroon's national football team is facing an uphill battle ahead of their opening game against Gabon on Wednesday. But newly appointed coach David Pagou says he's up for the challenge. Story by Laurent Berstecher.",
      "url": "https://www.france24.com/en/video/20251224-after-football-world-cup-exit-and-coaching-shake-up-cameroon-braces-for-afcon-challenge",
      "published": "Wed, 24 Dec 2025 12:28:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "U.S. and Ukraine reach consensus on key issues aimed at ending the war",
      "description": "The United States and Ukraine have reached a consensus on several critical issues, but sensitive issues around territorial control in Ukraine's eastern industrial heartland remain unresolved.",
      "url": "https://www.npr.org/2025/12/24/g-s1-103618/u-s-and-ukraine-reach-consensus-on-key-issues",
      "published": "Wed, 24 Dec 2025 05:38:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump's plans for warship fleet. And, deported Venezuelans must receive due process",
      "description": "President Trump has announced the Navy will begin building a new fleet of warships. And, a federal judge has ruled the deportations of more than 100 Venezuelan men to El Salvador were illegal.",
      "url": "https://www.npr.org/2025/12/23/g-s1-103442/up-first-newsletter-caribbean-oil-tankers-venezuelan-due-process-heritage-due-process",
      "published": "Tue, 23 Dec 2025 07:32:09 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Venezuela passes bill criminalizing oil tanker seizures",
      "description": "The move comes after the US seized two tankers transporting Venezuelan oil this month. At an emergency UN meeting requested by Caracas, China and Russia accused the US of \"bullying\" the South American country.",
      "url": "https://www.dw.com/en/venezuela-passes-bill-criminalizing-oil-tanker-seizures/a-75291713?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 06:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "What interest do China and Russia have in Venezuela?",
      "description": "US president Donald Trump continues to ratchet up pressure on Venezuela. There is also a geopolitical element to the conflict. What interests do China and Russia have in the country?",
      "url": "https://www.dw.com/en/what-interest-do-china-and-russia-have-in-venezuela/a-75290223?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 19:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Thailand - Cambodia peace talks in doubt over venue row",
      "description": "Thailand on Tuesday rejected a request by Cambodia to hold bilateral talks in a neutral country, leaving a planned meeting to negotiate an end to deadly border clashes in doubt. The nations' long-standing border conflict reignited this month, shattering an earlier truce, killing more than 40 people and displacing over 900,000 on both sides, officials said. Analysis by Astrid Norén-Nilsson, senior lecturer at Lund University's centre for East and Sout-East Asian studies.",
      "url": "https://www.france24.com/en/video/20251224-thailand-cambodia-peace-talks-in-doubt-over-venue-row",
      "published": "Wed, 24 Dec 2025 10:25:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "US and Ukraine reach consensus on key issues, but territorial disputes unresolved",
      "description": "The United States and Ukraine have reached a consensus on several critical issues to end the nearly four-year conflict with Russia",
      "url": "https://abcnews.go.com/International/wireStory/us-ukraine-reach-consensus-key-issues-territorial-disputes-128672962",
      "published": "Wed, 24 Dec 2025 04:25:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza aid restrictions, Syria humanitarian needs, lawyer reprisals in Burundi",
      "description": "The UN and partners continue to provide assistance to people in Gaza, where recent winter storms have worsened conditions for thousands across the enclave.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166663",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "China quietly loads 100+ ICBMs into new missile silos near Mongolia: report",
      "description": "China has reportedly loaded over 100 new intercontinental ballistic missiles into border silos, accelerating nuclear expansion faster than any other power.",
      "url": "https://www.foxnews.com/world/china-quietly-loads-100-icbms-new-missile-silos-near-mongolia-report",
      "published": "Mon, 22 Dec 2025 16:15:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Manhunt underway in South Africa after gunmen open fire at tavern, killing 9 and wounding 10",
      "description": "Manhunt underway after masked gunmen kill nine people at South African tavern in Bekkersdal township. At least 10 others hospitalized in the attack.",
      "url": "https://www.foxnews.com/world/manhunt-underway-south-africa-after-gunmen-open-fire-tavern-killing-wounding",
      "published": "Sun, 21 Dec 2025 09:54:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Libya's army chief killed in air crash in Turkey",
      "description": "Signal was earlier lost with a jet that took off from Ankara with Gen Mohammed Ali Ahmed al-Haddad and four others on board.",
      "url": "https://www.bbc.com/news/articles/cyvgzyepdqno?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 09:27:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Crisis in India-Bangladesh relations spirals amid violent protests",
      "description": "Recent deadly protests in Bangladesh are further straining Delhi's already frayed tied with Dhaka.",
      "url": "https://www.bbc.com/news/articles/c4gekjjqn1ro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 23:34:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Libyan army chief killed in plane crash: What we know so far",
      "description": "Libya mourns military chief Mohammed Ali Ahmed al-Haddad, who was seen as a unifying figure amid political divisions.",
      "url": "https://www.aljazeera.com/news/2025/12/24/libyan-army-chief-killed-in-plane-crash-what-we-know-so-far?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 12:44:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Video captures Libyan military chief’s fatal plane crash near Ankara",
      "description": "Video has emerged of the moment a plane, carrying Libya's military chief, crashed outside Ankara.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/24/video-captures-libyan-military-chiefs-fatal-plane-crash-near-ankara?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 11:01:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Australia’s NSW passes tough anti-protest, gun laws after Bondi attack",
      "description": "Palestinian, Jewish and Indigenous groups say they will launch constitutional challenge to laws described as 'rushed'.",
      "url": "https://www.aljazeera.com/news/2025/12/24/australias-nsw-passes-tough-anti-protest-gun-laws-after-bondi-attack?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 08:20:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Bangladesh: Political unrest casts shadow over elections",
      "description": "As Bangladesh heads toward a general election in early 2026, internal turmoil and external tensions present a major challenge.",
      "url": "https://www.dw.com/en/bangladesh-political-unrest-casts-shadow-over-elections/a-75294963?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Search teams probe wreckage after Libyan army chief, 7 others killed in plane crash",
      "description": "Search and recovery teams are intensifying operations at a plane crash site where Libya’s military chief and other officers were killed",
      "url": "https://abcnews.go.com/International/wireStory/search-teams-probe-wreckage-after-libyan-army-chief-128672581",
      "published": "Wed, 24 Dec 2025 02:55:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "South Korean lawmakers pass bill targeting false information despite warnings on censorship",
      "description": "South Korea’s liberal-led legislature has passed a bill allowing heavy punitive damages against traditional news and internet media for publishing false or fabricated information",
      "url": "https://abcnews.go.com/International/wireStory/south-korean-lawmakers-pass-bill-targeting-false-information-128672862",
      "published": "Wed, 24 Dec 2025 04:25:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Texts after Anna Kepner’s mysterious cruise ship death show family scrambling to clamp down on info",
      "description": "Court records expose family's 'damage control' texts following teen's death aboard Carnival cruise ship. 16-year-old stepbrother under investigation.",
      "url": "https://www.foxnews.com/us/texts-after-anna-kepners-mysterious-cruise-ship-death-show-family-scrambling-clamp-down-info",
      "published": "Tue, 23 Dec 2025 19:14:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "60 Minutes episode on brutal El Salvador prison, pulled from air by CBS, appears online",
      "description": "Segment that Bari Weiss had removed provides in-depth look at the Centro de Confinamiento del Terrorismo prison A 60 Minutes episode investigating a brutal prison in El Salvador , which CBS News’s editor-in-chief, Bari Weiss, pulled from the air on Sunday, appeared online on Monday after appearing on a Canadian TV app. The segment, which runs for nearly 14 minutes and was viewed by the Guardian, provides an in-depth look at the Centro de Confinamiento del Terrorismo (Cecot) prison in El Salvador. It opens with footage of the mega-prison and shows detainees being shackled upon arrival in El Salvador. Continue reading...",
      "url": "https://www.theguardian.com/media/2025/dec/23/60-minutes-cecot-appears-online",
      "published": "Tue, 23 Dec 2025 20:53:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "‘Is this real?’: wife of detained pastor describes anguish as China cracks down on unofficial churches",
      "description": "Church leaders and members detained as government tightens controls on underground Christian gatherings The knocks came at 2am. Hiding out at a friend’s house in a Beijing suburb, Gao Yingjia and his wife, Geng Pengpeng, rushed downstairs to meet the group of plain-clothed men who said they were police officers. Their son, nearly six, was sleeping upstairs, and Gao and Geng wanted to minimise the ruckus. They knew their time was up. Two months later, Gao is in a detention centre in Guangxi province, southern China, charged with “illegal use of information networks”. His arrest was part of the biggest crackdown on Christians in China since 2018. It has prompted alarm from the US government and human rights groups, with some analysts describing it as the death knell for unofficial churches in China. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/christians-pastors-arrested-detained-china-crackdown-house-churches",
      "published": "Tue, 23 Dec 2025 01:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "M 6.0 - 2025 Taitung, Taiwan Earthquake",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-24 09:47:06 UTC 2025-12-24 09:47:06 UTC at epicenter Location 22.851°N 121.207°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rkjm",
      "published": "2025-12-24T14:01:41.721Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Germany's far-right AfD may seize regional power in 2026",
      "description": "The Alternative for Germany (AfD) will seek power in next year's state elections. Civil society groups are alarmed, as are security services, which have found that some of its factions represent extremist threats.",
      "url": "https://www.dw.com/en/germany-s-far-right-afd-may-seize-regional-power-in-2026/a-75133782?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 09:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "EU warns of possible action after US bars five Europeans accused of censorship",
      "description": "The European Union's executive branch has warned it would respond to any \"unjustified measures\" after the US State Department barred five Europeans it accuses of pressuring American tech companies to censor or limit US viewpoints.",
      "url": "https://news.sky.com/story/eu-warns-of-possible-action-after-us-bars-five-europeans-accused-of-censorship-13487257",
      "published": "Wed, 24 Dec 2025 14:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Winter aid delivery continues in Gaza",
      "description": "Despite the ceasefire in the Gaza Strip, humanitarians continue to receive reports of airstrikes, shelling and gunfire in all five governorates, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166653",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Bondi Beach suspects filmed antisemitic video manifesto, Australian investigators say",
      "description": "Father-son duo accused in Bondi Beach shooting allegedly created antisemitic manifesto with Islamic State ideology, Australian investigators reveal.",
      "url": "https://www.foxnews.com/world/bondi-beach-suspects-filmed-antisemitic-video-manifesto-australian-investigators-say",
      "published": "Mon, 22 Dec 2025 10:40:05 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "New clashes as Cambodia, Thailand hold first talks to end latest violence",
      "description": "Injuries reported in ongoing violence on both sides of the border ahead of negotiations over the renewed fighting.",
      "url": "https://www.aljazeera.com/news/2025/12/24/new-clashes-as-cambodia-thailand-hold-first-talks-to-end-latest-violence?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 10:40:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Rare footage from trial of Chinese general who defied Tiananmen crackdown order leaked online",
      "description": "Video shows Gen Xu Qinxian explaining why he refused to deploy troops to crush 1989 student-led demonstrations Rare footage of a People’s Liberation Army (PLA) general who defied orders to lead his troops into Tiananmen Square and crush the 1989 student protesters has been leaked online, offering a highly unusual glimpse into the upper echelons of the military at one of the most fraught moments in modern Chinese history. General Xu Qinxian’s refusal to take his troops from the PLA’s prestigious 38th Group Army, a unit based on the outskirts of Beijing, into the capital has been the stuff of Tiananmen lore for decades. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/24/rare-footage-from-trial-of-chinese-general-who-defied-tiananmen-crackdown-order-leaked-online",
      "published": "Wed, 24 Dec 2025 01:00:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Mom arrested on murder charge after body of missing ‘at-risk’ girl Melodee Buzzard found",
      "description": "Melodee Buzzard's body found in Utah as mother charged with murder. 9-year-old was reported missing in October after California road trip with family.",
      "url": "https://www.foxnews.com/us/missing-melodee-buzzard-body-found-girls-mother-taken-into-custody-report",
      "published": "Tue, 23 Dec 2025 14:23:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Jet crash carrying Libya’s top general triggers airspace shutdown over NATO capital",
      "description": "Turkey shuts down Ankara airspace after business jet carrying Libya's top military commander crashes. Ali Ahmed Al-Haddad is feared dead.",
      "url": "https://www.foxnews.com/world/jet-crash-carrying-libyas-top-general-triggers-airspace-shutdown-over-nato-capital",
      "published": "Tue, 23 Dec 2025 16:31:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Australia vows to strengthen hate speech laws, gun control in wake of Bondi Beach attack",
      "description": "Australia proposes new hate speech laws and gun buyback program after Bondi Beach attack, sparking a heated debate over the government's response.",
      "url": "https://www.foxnews.com/world/australia-vows-strengthen-hate-speech-laws-gun-control-wake-bondi-beach-attack",
      "published": "Sun, 21 Dec 2025 08:01:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Manchester Museum seeks help to uncover hidden histories of African collection",
      "description": "New Africa Hub confronts colonial-era silences by asking visitors to share insights on 40,000 objects It’s a rare thing for a museum to talk about what it doesn’t know. But unanswered questions and archival silences are at the heart of the new Africa Hub at Manchester Museum, north-west England, which is inviting people around the world to help fill the gaps. The museum holds more than 40,000 items from across Africa, many of which were traded, collected, looted or preserved during the era of the British empire. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2025/dec/21/manchester-museum-uncover-hidden-histories-africa-hub",
      "published": "Sun, 21 Dec 2025 15:00:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Germany's Steinmeier: 'A light is shining in the darkness'",
      "description": "In his Christmas address, German President Frank-Walter Steinmeier has highlighted the importance of community and togetherness — which he says are glimmers of light when the world seems dark.",
      "url": "https://www.dw.com/en/germany-s-steinmeier-a-light-is-shining-in-the-darkness/a-75290389?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 23:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Christmas festivities slowly return to West Bank holy city of Bethlehem",
      "description": "The city of Bethlehem prepares to hold Christmas as celebrations are slowly returning to the holy land after celebrations were called off in the past two years due to the Israel-Hamas war. Details by FRANCE 24 correspondent in Jerusalem, Noga Tarnopolsky.",
      "url": "https://www.france24.com/en/video/20251224-christmas-festivities-slowly-return-to-west-bank-holy-city-of-bethlehem",
      "published": "Wed, 24 Dec 2025 13:30:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Christmas celebrations slowly return to Bethlehem, Jesus' birthplace",
      "description": "Christmas celebrations in Bethlehem, Jesus’ traditional birthplace, are slowly returning, as the city in the Israeli-occupied West Bank emerges from the shadow of war to celebrate its first festive Christmas in more than two years. Story by Bryan Quinn.",
      "url": "https://www.france24.com/en/video/20251224-christmas-celebrations-slowly-return-to-bethlehem-jesus-birthplace",
      "published": "Wed, 24 Dec 2025 10:13:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "50 Cent, Zelenskyy and Trump: a Christmas Q&A special",
      "description": "👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈",
      "url": "https://news.sky.com/story/50-cent-zelenskyy-and-trump-a-christmas-qa-special-13487063",
      "published": "Tue, 23 Dec 2025 14:46:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Greta Thunberg arrested supporting Palestinian prisoners on hunger strike during London protest",
      "description": "Greta Thunberg was arrested and later released on bail after supporting pro-Palestinian activists protesting detentions and a hunger strike in London.",
      "url": "https://www.foxnews.com/world/greta-thunberg-arrested-supporting-palestinian-prisoners-hunger-strike-london-protest",
      "published": "Tue, 23 Dec 2025 15:35:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky moves towards demilitarised zones in latest peace plan for Ukraine",
      "description": "On the key question of Ukraine's eastern Donbas, Zelensky says a \"free economic zone\" is a potential option.",
      "url": "https://www.bbc.com/news/articles/c9d9wg2pwl1o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 12:48:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela accuses US of 'extortion' over seizure of oil tankers",
      "description": "An emergency meeting of the UN Security Council was called to discuss the US seizure of two tankers.",
      "url": "https://www.bbc.com/news/articles/cd749gqgg11o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 09:46:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN experts urge Iran to stop execution of woman activist",
      "description": "Zahra Tabari, 67, was sentenced to death after a trial that lasted less than 10 minutes, her family says.",
      "url": "https://www.bbc.com/news/articles/cwyxz5jken3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 22:11:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'A miracle': Officer shot in head during Bondi attack home from hospital",
      "description": "The Christmas homecoming of Jack Hibbert, who was shot in the head and shoulder, is a \"miracle\", his family say.",
      "url": "https://www.bbc.com/news/articles/cd0kxrr2jyko?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 06:06:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "China probe finds Taiwanese men controlled ship that cut undersea cables",
      "description": "Chinese officials claim Taiwanese smugglers are to blame for February incident Taipei says was an act of hybrid warfare.",
      "url": "https://www.aljazeera.com/news/2025/12/24/china-probe-finds-taiwanese-men-controlled-ship-that-cut-undersea-cables?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 08:17:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli forces injure dozens in occupied West Bank raid",
      "description": "Israeli forces have injured dozens of people and carried out mass arrests as they carry out raids in Jerusalem.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/24/israeli-forces-injure-dozens-in-occupied-west-bank-raid?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 08:00:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia and China pledge support for Venezuela as Trump ratchets up pressure on Maduro",
      "description": "Trump again called for Venezuela’s president to leave power and said the US would keep or sell the oil it had seized China and Russia have expressed support for Venezuela as it confronts a US blockade of sanctioned oil tankers, while Donald Trump continues to ramp up his pressure campaign on the South American country’s president, Nicolás Maduro. Amid reports of slowing activity at Venezuelan ports, the US president again called for Maduro to leave power, and reiterated that the US would keep or sell the oil it had seized off the coast of Venezuela in recent weeks. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/russia-china-support-venezuela-trump-pressure-maduro",
      "published": "Tue, 23 Dec 2025 02:52:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "In Israel, some Jews and Christians seek to build trust between their communities",
      "description": "Despite tensions between the Vatican and Israel's government over the Gaza war, some Jews and Christians living in Israel are trying to build trust between their communities.",
      "url": "https://www.npr.org/2025/12/23/nx-s1-5613384/some-jews-and-christians-in-israel-seek-to-build-trust-between-their-communities",
      "published": "Tue, 23 Dec 2025 17:00:02 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "The Christmas Truce of 1914: When the guns fell silent",
      "description": "On Christmas Eve 1914, battling German and British soldiers laid down their arms and sang Christmas carols together — a brief moment of peace in the midst of war.",
      "url": "https://www.dw.com/en/the-christmas-truce-of-1914-when-the-guns-fell-silent/a-75219518?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Kosovo: Will elections break the political gridlock?",
      "description": "Kosovo hasn't had a functioning parliament since the February 2025 election. All attempts to form a governing coalition have failed. It's hoped fresh elections will provide a way forward, but many voters are skeptical.",
      "url": "https://www.dw.com/en/kosovo-will-elections-break-the-political-gridlock/a-75290784?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 07:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "To boycott or not to boycott? Ivory Coast holds tense parliamentary election",
      "description": "Supporters of former Ivorian president Laurent Gbagbo are divided over whether to boycott the country’s upcoming parliamentary elections. The disagreement follows the recent presidential election, in which incumbent President Alassane Ouattara won a controversial fourth term after Gbagbo was barred from running. Despite the party’s official call for a boycott, some of Gbagbo’s supporters have chosen to take part in the legislative elections. Report by Julia Guggenheim and Damien Koffi.",
      "url": "https://www.france24.com/en/video/20251224-to-boycott-or-not-to-boycott-ivory-coast-holds-tense-parliamentary-election",
      "published": "Wed, 24 Dec 2025 12:16:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky unveils new US-backed, 20-point plan to end the war in Ukraine",
      "description": "Ukrainian President Volodymyr Zelensky on Wednesday revealed details of the latest US-backed 20-point plan to end the war in Ukraine, saying it has been sent to Moscow for feedback. Zelensky gave a point-by-point briefing to journalists in Kyiv, including details on the creation of demilitarised zones.",
      "url": "https://www.france24.com/en/europe/20251224-zelensky-reveals-new-us-backed-plan-to-end-the-russian-invasion-of-ukraine",
      "published": "Wed, 24 Dec 2025 11:20:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "British 13-year-old boy stabbed to death in Portugal named",
      "description": "A teenage British boy who was stabbed to death in Portugal has been named.",
      "url": "https://news.sky.com/story/british-13-year-old-boy-stabbed-to-death-in-portugal-named-13487203",
      "published": "Wed, 24 Dec 2025 08:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yemen’s sides agree to release 2,900 detainees in war's largest exchange",
      "description": "Yemen’s government and the Iran-backed Houthi rebels have agreed to release 2,900 detainees from the 11-year civil war",
      "url": "https://abcnews.go.com/International/wireStory/yemens-sides-agree-release-2900-detainees-wars-largest-128644604",
      "published": "Tue, 23 Dec 2025 09:37:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian church marks Christmas and reaffirms faith months after deadly attack",
      "description": "Hundreds of worshippers have gathered at Mar Elias Church in Syria to remember those lost in a suicide attack",
      "url": "https://abcnews.go.com/International/wireStory/syrian-church-marks-christmas-reaffirms-faith-months-after-128672671",
      "published": "Wed, 24 Dec 2025 04:25:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Horror video captures repeat offender allegedly attacking 75-year-old woman, gouging her eye with spiked stick",
      "description": "Newly released video shows a notorious Seattle repeat offender launching a sudden spike-club attack outside the King County Courthouse, leaving a 75-year-old woman blind in one eye.",
      "url": "https://www.foxnews.com/us/horror-video-captures-repeat-offender-allegedly-attacking-75-year-old-woman-gouging-her-eye-spiked-stick",
      "published": "Tue, 23 Dec 2025 17:28:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brown University students shaken as relief, anger collide after suspected shooter's death",
      "description": "Brown University community mourns the loss of Mukhammad Aziz Umurzokov and Ella Cook. Students recall the harrowing moments and share memories of those who died.",
      "url": "https://www.foxnews.com/us/brown-university-students-react-shooter-being-found",
      "published": "Tue, 23 Dec 2025 15:25:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Oklahoma teaching assistant fired after uproar over flunking Christian student who referenced Bible in essay",
      "description": "University of Oklahoma fires teaching assistant who gave student zero for citing Bible in paper, sparking viral debate over religious freedom.",
      "url": "https://www.foxnews.com/us/oklahoma-teaching-assistant-fired-after-uproar-over-flunking-christian-student-who-referenced-bible-essay",
      "published": "Tue, 23 Dec 2025 09:49:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Russia says Ukraine peace talks 'proceeding constructively,' as Kremlin launches deadly strike on Odesa",
      "description": "Peace talks between Russia and Ukraine reportedly proceed \"constructively\" in Florida even as deadly missile strike hits Odesa, killing eight people.",
      "url": "https://www.foxnews.com/world/russia-says-ukraine-peace-talks-proceeding-constructively-kremlin-launches-deadly-strike-odesa",
      "published": "Sun, 21 Dec 2025 07:08:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "UK social media campaigners among five denied US visas",
      "description": "The Trump administration bans five people who have called for tech regulation from entering the country.",
      "url": "https://www.bbc.com/news/articles/cp39kngz008o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 11:53:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Video: India launches ‘heaviest satellite’ into orbit",
      "description": "India has launched what it says is the heaviest satellite ever lifted from the country, using an Indian-made launcher.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/24/video-india-launches-heaviest-satellite-into-orbit?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 12:09:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says ‘anyone who disagrees’ with him will never head Federal Reserve",
      "description": "US president is reviewing candidates to replace outgoing Fed chief Jerome Powell, who disagreed on interest rates.",
      "url": "https://www.aljazeera.com/news/2025/12/24/trump-says-anyone-who-disagrees-with-him-will-never-head-federal-reserve?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 06:44:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "British man’s Australian visa cancelled after being charged with displaying Nazi symbols",
      "description": "Home affairs minister, Tony Burke, said the government had ‘no time for hatred when it came to cancelling visas’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The federal government has cancelled the visa of a British man charged with displaying prohibited Nazi symbols, after police seized swords bearing “swastika symbology” from his Queensland home last month. Federal police announced earlier this month that a 43-year-old United Kingdom citizen living in Queensland had been charged with three counts of allegedly displaying prohibited Nazi symbols, and one count of using a carriage service to menace, harass or cause offence. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/24/british-man-australian-visa-cancelled-display-nazi-symbols-charge",
      "published": "Wed, 24 Dec 2025 03:13:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Why some U.S. oil companies aren't interested in returning to Venezuela",
      "description": "The Trump administration says it wants U.S. oil companies to return to Venezuela, but some don't desire to re-invest. Why would oil companies be against returning to a country with large oil reserves?",
      "url": "https://www.npr.org/2025/12/23/nx-s1-5649545/why-some-u-s-oil-companies-arent-interested-in-returning-to-venezuela",
      "published": "Tue, 23 Dec 2025 16:55:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Coast Guard pursues oil tanker Trump administration says evaded Venezuela blockade",
      "description": "The Trump administration continued its pressure campaign against Venezuela's president over the weekend, enforcing a blockade of sanctioned oil tankers traveling to and from the country.",
      "url": "https://www.npr.org/2025/12/22/nx-s1-5651313/coast-guard-pursues-oil-tanker-trump-administration-says-evaded-venezuela-blockade",
      "published": "Mon, 22 Dec 2025 06:50:16 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US Supreme Court blocks National Guard deployment in Chicago",
      "description": "In a major setback for US President Donald Trump, the top court refused to overturn a decision against his plan to send National Guard troops to Chicago to support an immigration crackdown.",
      "url": "https://www.dw.com/en/us-supreme-court-blocks-national-guard-deployment-in-chicago/a-75291226?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 03:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland PM 'sad' over Trump push for US control of island",
      "description": "Jens-Frederik Nielsen's remarks come after Donald Trump repeated his desire to have US control over Greenland. Trump argues that the territory, which is part of the Danish Kingdom, is essential to US national security.",
      "url": "https://www.dw.com/en/greenland-pm-sad-over-trump-push-for-us-control-of-island/a-75289082?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 18:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump: US has to have Greenland",
      "description": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security.",
      "url": "https://news.sky.com/story/trump-us-has-to-have-greenland-13486627",
      "published": "Mon, 22 Dec 2025 10:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council hears of fading election prospects in Libya",
      "description": "The path to long-awaited elections in Libya is paved with complications but they can be overcome, the UN Special Representative for the country said on Friday in a briefing to the Security Council.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166646",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council renews DR Congo peacekeeping mission amid renewed M23 offensives in the east",
      "description": "The UN Security Council on Friday unanimously extended the mandate of the UN peacekeeping mission in the Democratic Republic of the Congo (DRC) for another year, as fighting in the country’s east intensified amid renewed offensives by the M23 rebel group.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166643",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Major university cuts ties with US-sanctioned UN expert on Palestinian issues, watchdog says",
      "description": "Georgetown University reportedly cut ties with U.N. expert Francesca Albanese, who was sanctioned by the Trump administration in July 2025.",
      "url": "https://www.foxnews.com/us/major-university-cuts-ties-us-sanctioned-un-expert-palestinian-issues-watchdog-says",
      "published": "Tue, 23 Dec 2025 14:30:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Border villagers abducted and taken to Russia, says Ukraine",
      "description": "Ukraine has tried to evacuate areas of Sumy region near the Russian border, but many civilians have refused to leave.",
      "url": "https://www.bbc.com/news/articles/czxpz05yj5po?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 09:07:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ties with Turkiye improve “once Libya can patch its internal differences”",
      "description": "“This [Libyan general’s plane crash in Turkiye] will not change the broader framework of Turkiye’s role within Libya.”",
      "url": "https://www.aljazeera.com/video/quotable/2025/12/24/ties-with-turkiye-improve-once-libya-can-patch-its-internal?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 13:23:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China hits EU dairy industry with tariffs of up to 42.7%",
      "description": "Move made after first phase of anti-subsidy investigation widely seen as retaliation for bloc’s EV tariffs China will impose provisional duties of up to 42.7% on certain dairy products imported from the EU from Tuesday after concluding the first phase of an anti-subsidy investigation widely seen as retaliation for the bloc’s electric vehicle tariffs . The tariffs will range from 21.9% to 42.7% – although most companies will pay about 30% – and target products such as milk and cheese, including protected origin brands such as French roquefort and Italian gorgonzola. Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/22/china-hits-eu-dairy-industry-with-tariffs",
      "published": "Mon, 22 Dec 2025 13:49:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Libya's military chief dies in plane crash in Turkey",
      "description": "Libya's military chief was returning home after attending meetings in Turkey with seven other people on board. Turkish officials say black boxes have been recovered from the crash site.",
      "url": "https://www.dw.com/en/libya-s-military-chief-dies-in-plane-crash-in-turkey/a-75290406?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 04:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Sudan PM presents peace plan at UN, calling for a ceasefire",
      "description": "Sudan's Prime Minister has brought a wide ranging peace plan before the United Nations. But the paramilitary group, the Rapid Support Forces, has yet to sign onto it, and experts say it is unlikely they will, as it demands their withdrawal and disarmament. Story by Ellen Gainsford.",
      "url": "https://www.france24.com/en/video/20251224-sudan-pm-presents-peace-plan-at-un-calling-for-a-ceasefire",
      "published": "Wed, 24 Dec 2025 12:12:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "AFCON 2025: Senegal and Tunisia cruise to 3 points, VAR crash causes chaos",
      "description": "Today was a busy day at AFCON, with four games in total. Senegal comfortably beat Botswana 3-0, the Zebras' goalkeeper put in an impressive performance, making 14 saves.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251224-afcon-2025-senegal-and-tunisia-cruise-to-3-points-var-crash-causes-chaos",
      "published": "Wed, 24 Dec 2025 09:49:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Eight dead in plane crash over Turkey",
      "description": "The military chief of Libya is among eight people who have died in a plane crash in Turkey.",
      "url": "https://news.sky.com/story/libyas-military-chief-and-four-others-killed-in-plane-crash-over-turkey-13487149",
      "published": "Tue, 23 Dec 2025 20:52:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Greta Thunberg arrested in London while supporting hunger-striking pro-Palestinian activists",
      "description": "Greta Thunberg has been arrested in central London while supporting pro-Palestinian activists on a hunger strike",
      "url": "https://abcnews.go.com/International/wireStory/greta-thunberg-arrested-london-supporting-hunger-striking-pro-128645184",
      "published": "Tue, 23 Dec 2025 09:29:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Suspected militants ambush police vehicle in northwest Pakistan, killing 5 officers",
      "description": "Suspected militants have opened fire on a police vehicle in northwest Pakistan, killing five officers before fleeing",
      "url": "https://abcnews.go.com/International/wireStory/suspected-militants-ambush-police-vehicle-northwest-pakistan-killing-128641708",
      "published": "Tue, 23 Dec 2025 03:45:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "South Sudan: UN condemns killing of staff member in Wau, calls for swift investigation",
      "description": "The United Nations on Friday condemned the killing of a civilian staff member serving with its peacekeeping mission in South Sudan (UNMISS), calling on the authorities to swiftly bring those responsible to justice.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166640",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza famine pushed back, but millions still face hunger and malnutrition, UN says",
      "description": "Food security in Gaza has improved since the ceasefire declared in October, pushing back famine conditions, but the situation remains critical with more than three-quarters of the population still facing acute hunger and malnutrition, a new UN-backed analysis has found.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166638",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli hostages freed, Iran hit, ceasefire held — 2025 shattered idea that US was exiting the Middle East",
      "description": "Analysis reveals how American force, not retreat, reshaped the Middle East in 2025, from Gaza ceasefire to Iran's weakened position across the region.",
      "url": "https://www.foxnews.com/world/israeli-hostages-freed-iran-hit-ceasefire-held-2025-shattered-idea-us-exiting-middle-east",
      "published": "Tue, 23 Dec 2025 12:00:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israelis show “very widespread support for a racist state”",
      "description": "\"The idea of the liberal Zionist that you can have both failed.”",
      "url": "https://www.aljazeera.com/video/quotable/2025/12/24/israelis-show-very-widespread-support-for-a-racist?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 13:05:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Another 130 kidnapped schoolchildren released in Nigeria",
      "description": "Presidential spokesperson says all those abducted from a Catholic school in Niger state last month are now free Nigerian authorities say they have secured the release of a further 130 schoolchildren kidnapped from a Catholic school in November, after 100 were freed earlier this month . “Another 130 abducted Niger state pupils released, none left in captivity,” presidential spokesperson Sunday Dare said on X, in a post accompanied by a photo of smiling children. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria",
      "published": "Sun, 21 Dec 2025 20:05:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Thailand and Cambodia begin talks to end deadly clashes after venue row",
      "description": "Negotiations expected to last four days as each side calls on the other to show sincerity in words and actions Cambodian and Thai officials began four days of talks at a border checkpoint on Wednesday intended to negotiate an end to the deadly clashes between the two countries, Phnom Penh said. The meeting in Thailand’s Chanthaburi province had been at risk after Phnom Penh demanded a switch to a neutral venue. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/24/thailand-and-cambodia-begin-talks-to-end-deadly-clashes-after-venue-row",
      "published": "Wed, 24 Dec 2025 12:53:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "U.S. bars Europeans it says pressured tech firms to censor American viewpoints online",
      "description": "The State Department announced Tuesday it was barring five Europeans it accused of leading efforts to pressure U.S. tech firms to censor or suppress American viewpoints.",
      "url": "https://www.npr.org/2025/12/24/g-s1-103606/u-s-bars-five-europeans-american-viewpoints-online",
      "published": "Wed, 24 Dec 2025 01:48:22 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Bureaucratic mishap delayed gun license for accused Bondi Beach shooter in Australia",
      "description": "An Australian state leader says a man accused of killing 15 people at Sydney’s Bondi Beach faced a lengthy gun license delay due to bureaucracy, not suspicion",
      "url": "https://abcnews.go.com/International/wireStory/bureaucratic-mishap-delayed-gun-license-accused-bondi-beach-128641695",
      "published": "Tue, 23 Dec 2025 03:45:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Pope disappointed over approval of assisted suicide legislation in his home state of Illinois",
      "description": "Pope Leo XIV says he's “very disappointed” that his home state of Illinois has approved medically assisted suicide",
      "url": "https://abcnews.go.com/International/wireStory/pope-disappointed-approval-assisted-suicide-legislation-home-state-128662510",
      "published": "Tue, 23 Dec 2025 18:01:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "DR Congo: Displaced people in South Kivu close to ‘utter desperation’, WFP says",
      "description": "An estimated 500,000 people have been forced from their homes since fighting erupted in South Kivu province, Democratic Republic of Congo (DRC), at the beginning of December.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166657",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Stokes concerned for England’s mental wellbeing on Ashes tour of Australia",
      "description": "The England cricket team have come in for heavy criticism of their performance and conduct on losing Ashes tour.",
      "url": "https://www.aljazeera.com/sports/2025/12/24/stokes-concerned-for-england-mental-well-being-on-ashes-tour-of-australia?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 11:57:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy unveils details of new peace plan, seeks Trump talks on territory",
      "description": "President says negotiators secured gains on issues like army numbers, but control of Donbas 'most difficult point'.",
      "url": "https://www.aljazeera.com/news/2025/12/24/zelenskyy-unveils-details-of-new-peace-plan-seeks-trump-talks-on-territory?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 11:42:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine: Zelenskyy unveils revised US-backed peace plan",
      "description": "US and Ukrainian negotiators agree on the new 20-point plan, President Volodymyr Zelenskyy has said, but key issues remain over ceding territory to Russia and Moscow's reaction to the new terms. DW has more.",
      "url": "https://www.dw.com/en/ukraine-zelenskyy-unveils-revised-us-backed-peace-plan/live-75294126?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 12:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Youth's vote crucial in upcoming Central African Republic general election",
      "description": "General elections are due to be held in the Central African Republic on December 28. It is the first time in decades that the election includes presidential, parliamentary and municipal elections. With almost 82% of young people unemployed, the youth hope a change in government might boost job opportunities and economic growth. Report by Jospin Bissi, Cyrille Jefferson Yapende and Eunice Masson.",
      "url": "https://www.france24.com/en/video/20251224-youth-s-vote-crucial-in-upcoming-central-african-republic-general-election",
      "published": "Wed, 24 Dec 2025 12:14:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Christmas celebrations in Kenya: Families spend on average one month's salary",
      "description": "In Kenya, Christmas is primarily a religious celebration that brings families together. As summer approaches and temperatures rise, Santa Claus and Christmas trees are relatively rare. But that does not mean people don’t celebrate — the day is usually marked by generous meals on December 25th. Report by Elodie Cousin and Bastien Renouil.",
      "url": "https://www.france24.com/en/video/20251224-christmas-celebrations-in-kenya-families-spend-on-average-one-month-s-salary",
      "published": "Wed, 24 Dec 2025 10:54:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Epstein files appear to show Andrew asking for 'inappropriate friends'",
      "description": "A trove of newly released Epstein files include emails that appear to involve Andrew Mountbatten-Windsor, while another suggests Donald Trump travelled on the billionaire's private jet \"many more times than previously has been reported\".",
      "url": "https://news.sky.com/story/what-we-learned-from-the-latest-release-of-epstein-files-13487073",
      "published": "Tue, 23 Dec 2025 15:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Japan's former emperor turns 92 as heart condition stabilizes after health concerns",
      "description": "Japan’s beloved former Emperor Akihito is marking his 92nd birthday as his heart condition stabilizes, palace officials say, following health concerns earlier this year",
      "url": "https://abcnews.go.com/International/wireStory/japans-former-emperor-turns-92-heart-condition-stabilizes-128641423",
      "published": "Tue, 23 Dec 2025 04:14:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "What to know about the Central African Republic ahead of its election",
      "description": "Central African Republic on Dec. 28 will hold presidential and legislative elections as concerns over armed groups have led to a growing reliance on Russia for security",
      "url": "https://abcnews.go.com/International/wireStory/central-african-republic-ahead-election-128671799",
      "published": "Wed, 24 Dec 2025 00:49:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "FBI violent crime arrests double in Trump's first year compared to Biden record: 'Massive strides'",
      "description": "FBI reports violent crime arrests roughly doubled under Trump administration, jumping from 6,000-7,000 annually to nearly 14,000 in first year.",
      "url": "https://www.foxnews.com/us/fbi-violent-crime-arrests-double-trumps-first-year-compared-biden-record-massive-strides",
      "published": "Tue, 23 Dec 2025 21:50:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Cities across Europe revise Christmas traditions, triggering public backlash",
      "description": "Brussels faces backlash over modern nativity scene as European cities rethink Christmas traditions amid cultural debates. U.K. museum suggests Santa is \"too white.\"",
      "url": "https://www.foxnews.com/world/cities-across-europe-revise-christmas-traditions-triggering-public-backlash",
      "published": "Tue, 23 Dec 2025 10:35:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Israel calls out UN-backed Gaza famine report as biased, ignores aid flow and on-the-ground data",
      "description": "Israeli officials slam 'biased' U.N. food security report on Gaza, citing increased aid deliveries. Analysis reveals disputed famine claims lack evidence.",
      "url": "https://www.foxnews.com/world/israel-calls-out-un-backed-gaza-famine-report-biased-ignores-aid-flow-on-the-ground-data",
      "published": "Mon, 22 Dec 2025 14:35:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Email by 'A' from 'Balmoral' asked Ghislaine Maxwell for 'inappropriate friends', Epstein files show",
      "description": "A newly released email sent to Ghislane Maxwell from \"A\" is among the latest set of Epstein files released by the US' House Committee on Oversight and Reform.",
      "url": "https://www.bbc.com/news/articles/cm28g5exx09o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 22:48:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump trips, a fake video and 10 possible co-conspirators: Takeaways from new Epstein files",
      "description": "The largest release of Epstein-related documents yet from the justice department included some notable messages and several mentions of Trump.",
      "url": "https://www.bbc.com/news/articles/c5yj4yvx80do?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:08:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australia to deport British man charged with displaying Nazi symbols",
      "description": "The immigration minister said the man is an unwelcome \"guest\" in Australia.",
      "url": "https://www.bbc.com/news/articles/cgke51rzpvro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 00:25:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's Supreme Court allows Bolsonaro to leave prison for surgery",
      "description": "Former president is granted permission to leave jail for a hernia operation on Christmas Day.",
      "url": "https://www.bbc.com/news/articles/c8dy3mvye62o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:10:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US economy grows at fastest pace in two years",
      "description": "Strong consumer spending helps the US economy grow at a faster rate than expected.",
      "url": "https://www.bbc.com/news/articles/c62n9ynzrdpo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 15:56:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says US will keep or sell oil seized from Venezuela",
      "description": "The US president also says the US intends to keep the tankers it has intercepted off the coast of Venezuela.",
      "url": "https://www.bbc.com/news/articles/c87lnn09yj8o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 09:51:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gunmen abduct 28 Muslim travellers in central Nigeria",
      "description": "The victims, including women and children, were ambushed on their way to a religious festival.",
      "url": "https://www.bbc.com/news/articles/czj0ll7ppewo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 14:10:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rivalries and rumours: How the new order of the Murdoch dynasty is playing out",
      "description": "Family feuds and strategic change are redefining who holds power inside the Murdoch empire.",
      "url": "https://www.bbc.com/news/articles/clyd12d38jgo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:25:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Have the American Pope and the American administration fallen out?",
      "description": "Why the Catholic Church and Donald Trump’s government are at odds over immigration policy.",
      "url": "https://www.bbc.com/news/articles/cvg1361d32ro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 00:03:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "An alleged drug cartel and a murdered witness: South Africa's police corruption probe",
      "description": "Allegations of graft and political interference in the police have been aired at public hearings.",
      "url": "https://www.bbc.com/news/articles/cj69d8we98jo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 00:02:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What Friday's underwhelming Epstein files release means for Trump and Maga",
      "description": "Conservative influencers were conspicuously silent following the latest release - but political danger remains for the president.",
      "url": "https://www.bbc.com/news/articles/cy95w0x9889o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 00:24:25 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump declared a ‘new Middle East’ – but what has changed?",
      "description": "Chatham House director Bronwen Maddox lays out the obstacles blocking progress on Trump’s plan for a ‘new Middle East’.",
      "url": "https://www.aljazeera.com/video/the-bottom-line/2025/12/24/trump-declared-a-new-middle-east-but-what-has?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 12:48:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Palestinian Christians worry about erasure as Israeli settlements grow",
      "description": "Christmas celebrations have returned to Bethlehem, but Palestinian Christians fear they are being erased by Israel.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/24/palestinian-christians-worry-about-erasure-as-israeli-settlements-grow?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 12:29:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Aid cuts push Sudan deeper into “acute hunger”",
      "description": "\"The impact of the funding cut is very clear on the humanitarian aid.\"",
      "url": "https://www.aljazeera.com/video/quotable/2025/12/24/aid-cuts-push-sudan-deeper-into-acute?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 09:57:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Arab League welcomes Sudanese gov’t peace plan presented at UN",
      "description": "Paramilitary RSF group rejects plan, saying that proposals for its withdrawal are 'closer to fantasy than to politics'.",
      "url": "https://www.aljazeera.com/news/2025/12/24/arab-league-welcomes-sudanese-govt-peace-plan-presented-at-un?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 09:53:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Christmas is not a Western story – it is a Palestinian one",
      "description": "Christmas is a story of empire, injustice and the vulnerability of ordinary people caught in its path.",
      "url": "https://www.aljazeera.com/opinions/2025/12/24/christmas-is-not-a-western-story-it-is-a-palestinian-one?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 08:37:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brooks Koepka quits LIV Golf to focus on family life",
      "description": "Koepka, a key signing to the breakaway LIV Golf three years ago, has exited the tour a year before his contract ends.",
      "url": "https://www.aljazeera.com/sports/2025/12/24/brooks-koepka-quits-liv-golf-to-focus-on-family-life?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 08:28:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Burkina Faso leader vows AES alliance crackdown on armed groups in Sahel",
      "description": "Burkina Faso, Niger, Mali have launched joint battalion aiming to bolster sovereignty after group booted out France, US.",
      "url": "https://www.aljazeera.com/news/2025/12/24/burkina-faso-leader-vows-sahel-alliance-crackdown-on-armed-groups?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 07:54:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China’s rising economic influence in the Middle East",
      "description": "China’s rising economic influence in the Middle East",
      "url": "https://www.aljazeera.com/video/money-works/2025/12/24/chinas-rising-economic-influence-in-the-middle-east?traffic_source=rss",
      "published": "Wed, 24 Dec 2025 07:25:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada bill targeting refugees feared to signal new era of US-style border policy",
      "description": "Bill C-12 includes many changes around border security along with new ineligibility rules for refugee claimants Canada’s Liberal government is pushing through sweeping new legislation targeting refugees that observers fear will usher in a new era of US-style border policies, fueling xenophobia and the scapegoating of immigrants. Bill C-12, or Strengthening Canada’s Immigration System and Borders Act, includes many changes around border security along with new ineligibility rules for refugee claimants. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/canada-bill-refugees",
      "published": "Tue, 23 Dec 2025 13:24:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 42 km NNE of Goroka, Papua New Guinea",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-22 10:31:28 UTC 2025-12-22 10:31:28 UTC at epicenter Location 5.720°S 145.496°E Depth 110.18 km (68.46 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000rwgh",
      "published": "2025-12-23T10:56:00.234Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.9 - 5 km SE of San Ramon, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - V Time 2025-12-21 02:31:54 UTC 2025-12-21 02:31:54 UTC at epicenter Location 37.747°N 121.946°W Depth 10.03 km (6.23 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283691",
      "published": "2025-12-23T14:21:36.532Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.0 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:56:09 UTC 2025-12-20 03:56:09 UTC at epicenter Location 37.744°N 121.953°W Depth 9.63 km (5.98 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283031",
      "published": "2025-12-23T04:30:22.632Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:49:28 UTC 2025-12-20 03:49:28 UTC at epicenter Location 37.743°N 121.954°W Depth 9.56 km (5.94 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283016",
      "published": "2025-12-22T17:36:16.470Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Palestinians says Israel is demolishing homes near Jerusalem, displacing hundreds",
      "description": "Palestinians say Israel has demolished hundreds of homes near Jerusalem, displacing hundreds of Palestinians as new Jewish settlements are greenlit in the West Bank.",
      "url": "https://www.npr.org/2025/12/23/nx-s1-5651920/palestinians-says-israel-is-demolishing-homes-near-jerusalem-displacing-hundreds",
      "published": "Tue, 23 Dec 2025 04:44:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "DOJ releases more Epstein files. And, immigration court 'no-shows' surged, NPR finds",
      "description": "The DOJ has released more files related to convicted sex offender Jeffrey Epstein. And, NPR finds a rise in the number of immigrants without legal status who aren't showing up to immigration court.",
      "url": "https://www.npr.org/2025/12/22/g-s1-103305/up-first-newsletter-us-venezuela-oil-tankers-epstein-files-immigration-court",
      "published": "Mon, 22 Dec 2025 07:50:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's growing engagement with Taiwan angers China",
      "description": "Relations between Tokyo and Beijing are worsening over Taiwan, yet China may be exercising restraint and waiting for the right moment to hit back.",
      "url": "https://www.dw.com/en/japan-s-growing-engagement-with-taiwan-angers-china/a-75293997?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Christmas: Christians celebrate, NORAD tracks Santa's route",
      "description": "Rudolph's red nose is essential to track Santa's progress across the globe, according to a NORAD spokesperson. Pope Leo XIV is set to celebrate his first Christmas Eve Mass as pontiff. Join us for more festive updates.",
      "url": "https://www.dw.com/en/christmas-christians-celebrate-norad-tracks-santa-s-route/live-75292667?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 11:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From coup to ballot box: Guinea votes",
      "description": "Following the 2021 coup and a divisive constitutional reform, elections are being held in Guinea. The frontrunner in the vote is junta leader Doumbouya, but experts criticize that opposition parties have been suspended.",
      "url": "https://www.dw.com/en/from-coup-to-ballot-box-guinea-votes/a-75265607?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 09:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India's space agency launches its heaviest satellite yet",
      "description": "The BlueBird Block-2 satellite, weighing over six tons, successfully reached orbit following a milestone launch by India's space agency ISRO. New Delhi hopes to use the same US-built rocket to fly humans into space.",
      "url": "https://www.dw.com/en/india-s-space-agency-launches-its-heaviest-satellite-yet/a-75292128?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 09:34:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "7 mysterious languages that have yet to be deciphered",
      "description": "Indus, Rongorongo, Linear A: Some ancient writing systems cannot be deciphered. Can artificial intelligence help crack the codes of the past?",
      "url": "https://www.dw.com/en/7-mysterious-languages-that-have-yet-to-be-deciphered/a-75249574?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 09:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US bans ex-EU commissioner, others over social media rules",
      "description": "The US accuses former EU tech regulator Thierry Breton and four anti-disinformation campaigners of censorship. Breton called the visa ban a \"witch hunt.\"",
      "url": "https://www.dw.com/en/us-bans-ex-eu-commissioner-others-over-social-media-rules/a-75291190?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 24 Dec 2025 01:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK: Russell Brand charged with two more sex offenses",
      "description": "British comedian Russell Brand has been charged with two more sex offenses, UK police said on Tuesday, in addition to existing charges.",
      "url": "https://www.dw.com/en/uk-russell-brand-charged-with-two-more-sex-offenses/a-75290095?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 17:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French Christmas traditions, from foie gras to oysters and the bûche de Noël",
      "description": "Christmas dinner in France makes good on a promise to dine very well, offering everything from extravagant seafood platters to sweet treats such as the traditional Yule log cake (or bûche de Noël). Here are some of the delicacies you might find at a traditional French holiday feast.",
      "url": "https://www.france24.com/en/europe/20251224-french-christmas-traditions-foie-gras-to-oysters-b%C3%BBche-de-no%C3%ABl-vin-chaud",
      "published": "Wed, 24 Dec 2025 12:23:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fresh Epstein files release contains multiple Trump references",
      "description": "A new batch of Jeffrey Epstein files released Tuesday contains numerous references to President Donald Trump, including documents detailing flights he took on his then friend's private jet, and other claims that his Justice Department described as \"untrue and sensationalist.\" Story by Camille Knight.",
      "url": "https://www.france24.com/en/video/20251224-fresh-epstein-files-release-contains-multiple-trump-references",
      "published": "Wed, 24 Dec 2025 10:58:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How a real photo of Donald Trump linked to Jeffrey Epstein was doctored using AI",
      "description": "One of the photos released from the files of convicted sex offender Jeffrey Epstein shows US President Donald Trump with six women whose faces have been censored to protect their anonymity. Recently, however, online users shared an image that shows the women’s faces, claiming that it was the uncensored photo. It turns out that this image is a fake generated by AI based on the original photograph.",
      "url": "https://www.france24.com/en/americas/20251224-real-photo-donald-trump-jeffrey-epstein-doctored-artificial-intelligence",
      "published": "Wed, 24 Dec 2025 09:59:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US bars former EU commissioner, activists over alleged censorship",
      "description": "The Trump administration on Tuesday imposed visa bans on a former European Union commissioner and anti-disinformation campaigners it says were involved in censoring US social media platforms. Trump officials have ordered US diplomats ‍to build opposition to the European Union's landmark Digital Services Act (DSA), which is intended to combat hateful speech, misinformation and disinformation, but which Washington says stifles free speech and ​imposes costs on U.S. tech companies. Story by Gabrielle Nadler.",
      "url": "https://www.france24.com/en/video/20251224-us-bars-former-eu-commissioner-activists-over-alleged-censorship",
      "published": "Wed, 24 Dec 2025 09:59:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'No one is here to help us': Palestinians watch as Israeli diggers tear down homes in East Jerusalem",
      "description": "A balcony of onlookers stare as three diggers gnaw at the four-storey building that was a fixture of their daily view.",
      "url": "https://news.sky.com/story/no-one-is-here-to-help-us-palestinians-watch-on-as-israeli-diggers-tear-down-their-homes-in-east-jerusalem-13486867",
      "published": "Mon, 22 Dec 2025 21:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian general assassinated - here's why the timing appears significant",
      "description": "A Russian general being blown up on his own doorstep isn't a good look for Moscow, and it seems it's becoming increasingly common.",
      "url": "https://news.sky.com/story/timing-of-russian-generals-assassination-appears-significant-13486701",
      "published": "Mon, 22 Dec 2025 13:32:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mali, Burkina Faso and Niger call for joint 'large-scale operations' against extremists",
      "description": "The head of an alliance of Mali, Burkina Faso and Niger says the launch of a joint battalion “must be followed by large-scale operations in the coming days.\"",
      "url": "https://abcnews.go.com/International/wireStory/mali-burkina-faso-niger-call-joint-large-scale-128659610",
      "published": "Tue, 23 Dec 2025 15:13:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea's junta leader is expected to win first election since 2021 coup",
      "description": "Guineans are set to vote Sunday in their first presidential election since a military coup four years ago",
      "url": "https://abcnews.go.com/International/wireStory/guineas-junta-leader-expected-win-election-2021-coup-128674397",
      "published": "Wed, 24 Dec 2025 07:12:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Contact lost with private jet heading for Libya after takeoff from Turkey: Official",
      "description": "Turkey's interior minister says air traffic controllers lost contact with a private jet carrying Libya’s military chief home after a visit to Turkey",
      "url": "https://abcnews.go.com/International/wireStory/contact-lost-private-jet-heading-libya-after-takeoff-128658502",
      "published": "Tue, 23 Dec 2025 14:37:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea lawmakers pass bill to establish rebellion courts after complaints about Yoon case",
      "description": "South Korea’s liberal-led legislature has passed a bill mandating specialized court panels for cases involving rebellion, treason and foreign subversion",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-lawmakers-pass-bill-establish-rebellion-courts-128641514",
      "published": "Tue, 23 Dec 2025 02:01:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Louvre tightens security after $102M jewel heist, installs bars on infamous window",
      "description": "Workers are installing security bars on a window at the Louvre Museum",
      "url": "https://abcnews.go.com/International/wireStory/louvre-tightens-security-after-102m-jewel-heist-installs-128649493",
      "published": "Tue, 23 Dec 2025 09:53:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somalia: Funding cuts impact assistance to millions affected by drought",
      "description": "Brutal slashes to aid budgets are hampering efforts to assist millions of people in Somalia affected by drought, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166654",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Synthetic drug market disrupted in Syria after regime change",
      "description": "Past geopolitical tensions related to the synthetic drug “captagon” are now being mitigated with the Syrian authorities’ commitment to dismantle illicit manufacturing, says the United Nations Office on Drugs and Crime (UNODC).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166647",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Convicted killer Scott Peterson keeps swinging in court — but expert says he’s not going anywhere but his cell",
      "description": "Scott Peterson remains in prison as 2025 ends, serving life without parole for murdering pregnant wife Laci Peterson over 20 years ago in shocking case.",
      "url": "https://www.foxnews.com/us/convicted-killer-scott-peterson-keeps-swinging-court-but-expert-says-hes-not-going-anywhere-but-his-cell",
      "published": "Wed, 24 Dec 2025 08:00:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Judge gives 'green light' to controversial New York law and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/judge-gives-green-light-controversial-new-york-law-more-top-headlines",
      "published": "Wed, 24 Dec 2025 06:53:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "3 Georgia jail escapees allegedly force Lyft driver to Florida before capture by authorities",
      "description": "Three inmates escaped from DeKalb County jail Monday and were captured in Miami after allegedly forcing a Lyft driver to drive them to Florida at gunpoint.",
      "url": "https://www.foxnews.com/us/georgia-jail-escapees-allegedly-force-lyft-driver-florida-before-capture-authorities",
      "published": "Tue, 23 Dec 2025 16:02:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Repeat offender allegedly kills Ohio man just days after nonprofit pays his bail",
      "description": "The Bail Project paid $500 to release Ohio man from jail who then allegedly committed murder within days at Cleveland light rail station.",
      "url": "https://www.foxnews.com/us/repeat-offender-allegedly-kills-ohio-man-just-days-after-nonprofit-pays-his-bail",
      "published": "Tue, 23 Dec 2025 08:00:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope Leo XIV says he’s ‘very disappointed’ after Illinois approves assisted suicide law",
      "description": "Pope Leo XIV and Chicago Cardinal Cupich unsuccessfully urged Illinois Gov. Pritzker not to sign controversial medical aid in dying legislation into law.",
      "url": "https://www.foxnews.com/world/pope-leo-xiv-says-hes-very-disappointed-after-illinois-approves-assisted-suicide-law",
      "published": "Tue, 23 Dec 2025 20:41:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bukele challenges Hillary Clinton to take El Salvador's entire prison population after criticism",
      "description": "Bukele challenged Hillary Clinton’s allegations of torture at El Salvador’s CECOT prison, offering to release inmates if other countries accept them.",
      "url": "https://www.foxnews.com/world/bukele-challenges-hillary-clinton-take-el-salvadors-entire-prison-population-criticism",
      "published": "Tue, 23 Dec 2025 19:07:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran executes man convicted of spying for Israeli intelligence",
      "description": "Iran executed a man convicted of spying for Israel's Mossad intelligence agency, accused of conducting over 200 spy missions across multiple cities, including Tehran.",
      "url": "https://www.foxnews.com/world/iran-executes-man-convicted-spying-israeli-intelligence",
      "published": "Sun, 21 Dec 2025 21:18:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}