{
  "last_updated": "2026-01-28T07:49:35.814539Z",
  "event_count": 224,
  "events": [
    {
      "title": "New Zealand could see more deadly landslides as climate crisis triggers intense storms, experts warn",
      "description": "As it grapples with two fatal tragedies, questions emerge over how to protect the country from more landslides – its deadliest natural hazard New Zealand could experience an increase in landslides – its most deadly natural hazard – as global warming triggers more intense and frequent storms, experts have warned in the wake of two landslide tragedies in the North Island. New Zealand’s landscapes are scarred with the evidence of landslides – they are responsible for more than 1,800 deaths since written records began – more than earthquakes and volcanoes combined. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/28/new-zealand-landslides-climate-crisis-storms",
      "published": "Wed, 28 Jan 2026 03:26:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 66,
      "severity_level": "Critical"
    },
    {
      "title": "Crocodile warnings as floods devastate southern Africa",
      "description": "More than 100 people killed and hundreds of thousands displaced in South Africa, Mozambique and Zimbabwe Devastating floods have killed more than 100 people in southern Africa since the beginning of the year and displaced hundreds of thousands, as authorities and aid workers warn of hunger, cholera and attacks by crocodiles that have spread with the waters. More than 70 people have died in Zimbabwe and 30 in South Africa, where hundreds of people were evacuated from Kruger national park earlier this month after a deluge of rain . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/crocodile-warnings-floods-devastate-southern-africa",
      "published": "Mon, 26 Jan 2026 13:44:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Palestine Action Group plans ‘national day of protest’ as Herzog visit confirmed – as it happened",
      "description": "This blog is now closed Sussan Ley says David Littleproud rejected offer of talks this week after Coalition break-up Analysis: Sussan Ley has two factors working in her favour as rumours of a Liberal leadership mutiny swirl Get our breaking news email , free app or daily news podcast The minister for defence industry, Pat Conroy , has refuted claims made by shadow frontbencher Andrew Bragg about the Muslim community. Earlier Bragg accused Australia’s Muslim community of needing to “take some responsibility” for the Bondi terror attack and for the federal government to make sure funding doesn’t go to “hate preachers”. We’ve been very clear these acts were committed by people who believed an extreme perversion of Islam and to try and hold the entire Islamic community responsible for these acts, I think, is anti to social cohesion. It’s incredibly unfair, and it’s not a recipe for taking this country forward. Some of the earliest people condemning the vile attacks in Bondi were leaders of our Muslim Australian community, and we’ll continue to support their right to practise in peace. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/28/australia-news-live-anthony-albanese-timor-leste-heatwave-nsw-bushfires-victoria-weather-liberals-leadership-sussan-ley-andrew-hastie-angus-taylor-ntwnfb",
      "published": "Wed, 28 Jan 2026 07:35:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "London-based Persian TV aims to air 'truth' about Iran protests",
      "description": "It deems itself to be the voice of truth for all Iranians: 'Iran International' is a private Persian-language news channel based in London that has been declared a terrorist organisation by Tehran. Since its creation in 2017, it is one of the only reliable sources of information that Iranians can access via satellite and private VPNs and is a prime target of Iranian authorities. FRANCE 24's Selina Sykes reports.",
      "url": "https://www.france24.com/en/london-based-persian-tv-aims-to-air-truth-about-iran-protests",
      "published": "Tue, 27 Jan 2026 20:00:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "'Doomsday Clock' ticks closer to midnight over global threats, group says",
      "description": "Doomsday Clock moves to 85 seconds to midnight as scientists warn of nuclear war, climate change and AI threats bringing humanity closer to catastrophe.",
      "url": "https://www.foxnews.com/us/doomsday-clock-ticks-closer-midnight-over-global-threats-group-says",
      "published": "Tue, 27 Jan 2026 14:45:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Scott Morrison accused of ‘deeply ill-informed’ attack on religious freedom after Islam speech",
      "description": "Former PM called for national register and accreditation for imams, sparking backlash from Muslim leaders Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Leading Islamic groups have condemned Scott Morrison as “deeply ill-informed” and “dangerous” after the former prime minister demanded a national register and accreditation for imams, and expanding foreign interference frameworks to capture foreign links in religious institutions. The former Liberal leader, speaking at an antisemitism conference in Jerusalem on Tuesday, claimed the measures were needed after the Islamic State-inspired Bondi terror shooting at a Hanukah event, which left 15 people dead. Morrison demanded a focus on “radicalised extremist Islam”, noting the two alleged Bondi shooters “were Australian-made” and demanding local Muslim bodies do more to stamp out hate. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/28/scott-morrison-muslim-speech-religious-freedoms-ntwnfb",
      "published": "Wed, 28 Jan 2026 07:39:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns ‘law of the jungle’ is replacing rule of law",
      "description": "Warning that the “rule of law is being replaced by the law of the jungle,” the UN Secretary-General on Monday urged world powers to recommit to international law as the foundation of peace, justice and multilateral cooperation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166832",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "UNESCO warns of alarming rise in antisemitism and Holocaust denial in classrooms across the EU",
      "description": "Nadia Massih is pleased to welcome Heather Mann, Project Officer at UNESCO’s Section for Global Citizenship and Peace Education. On International Holocaust Remembrance Day, Ms. Mann shares her findings of an extensive UNESCO report, a year in the making, on antisemitism in European schools. Based on surveys with roughly 2,000 teachers across the EU, UNESCO is calling is for structured teacher training and targeted educational resources to confront both historical understanding and contemporary manifestations of antisemitism.",
      "url": "https://www.france24.com/en/video/20260127-unesco-warns-of-alarming-rise-in-antisemitism-and-holocaust-denial-in-classrooms-across-the-eu",
      "published": "Tue, 27 Jan 2026 22:25:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Japanese have 'greater awareness of security issues and a greater concern over actions by China'",
      "description": "Hundreds ‍of Japanese ​panda lovers bid an emotional farewell to the country's last two giant pandas, Xiao ⁠Xiao and Lei Lei, as they left Tokyo's Ueno Zoo for China on Tuesday. Their departure leaves Japan with no pandas for the first time in half a century, and the chances of getting a replacement are poor, with Tokyo's relations with Beijing at their lowest point in years. We speak with Kristi Govella, senior adviser and Japan Chair at the Centre for Strategic and International Studies.",
      "url": "https://www.france24.com/en/tv-shows/a-propos/20260127-japanese-have-greater-awareness-of-security-issues-and-a-greater-concern-over-actions-by-china",
      "published": "Tue, 27 Jan 2026 22:10:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "'Geopolitical momentum': Is EU-India deal a challenge to great powers wielding 'imperialist policy'?",
      "description": "Nadia Massih is pleased to welcome Dr. Tobias Scholz, Asia Associate in the Research Cluster of Cybersecurity and Digital Policy at the German Institute for International and Security Affairs.After nearly two decades of on-again, off-again negotiations, the EU-India trade agreement has been signed and is awaiting ratification in a shifting geopolitical landscape. As Dr. Tobias Schultt explains, Russia’s war on Ukraine, the rise of economic protectionism, and a recalibration of global partnerships have pushed both the EU and India to re-evaluate each other’s strategic and economic relevance. Unlike the contested Mercosur deal, the EU-India pact is gaining support, largely due to its exclusion of sensitive agricultural sectors and India's growing economic and political stature.",
      "url": "https://www.france24.com/en/geopolitical-momentum-is-eu-india-deal-a-challenge-to-great-powers-wielding-imperialist-policy",
      "published": "Wed, 28 Jan 2026 00:06:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Remembering the Holocaust: ‘You are here because you choose hope over hate’",
      "description": "The Holocaust is a warning, that hatred “can consume everything” – a message that feels more urgent than ever, the UN chief said on Tuesday, as antisemitism rages worldwide.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166840",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Iran in the Human Rights Council, Myanmar election ‘fraud’, migration chief in Cyprus, Mozambique flood update",
      "description": "Disturbing details continued to emerge on Friday about Iran’s State-led crackdown against mass protests, while UN rights chief Volker Türk expressed deep concern that demonstrators could be executed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166819",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime reportedly issued nationwide shoot-to-kill orders as protest death toll surges",
      "description": "Iran protest death toll estimates range from several thousand to over 35,000 as brutal crackdown intensifies. Medical data reveals shocking scale of violence.",
      "url": "https://www.foxnews.com/world/iran-regime-reportedly-issued-nationwide-shoot-to-kill-orders-protest-death-toll-surges",
      "published": "Mon, 26 Jan 2026 13:10:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "The Trader Joe's tote bag goes global",
      "description": "Trader Joe's tote bags have become all the rage overseas. Why have the supermarket chain's bags become an international fashion statement?",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5686766/the-trader-joes-tote-bag-goes-global",
      "published": "Tue, 27 Jan 2026 16:51:48 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: Victim numbers rise as US announces military drills",
      "description": "A US-based group said the number of people killed in the protests against the regime in Iran has exceeded 6,100. US war ships have reached the region, with an IRCG official warning neighbors against aiding any strikes.",
      "url": "https://www.dw.com/en/iran-victim-numbers-rise-as-us-announces-military-drills/a-75684803?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 19:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "West Virginia man allegedly threatened to kill Trump supporters, ICE agents in online videos: report",
      "description": "West Virginia man allegedly posted videos threatening Trump supporters and ICE agents, police say. Cody Smith, 20, arrested on terroristic charges.",
      "url": "https://www.foxnews.com/us/west-virginia-man-allegedly-threatened-kill-trump-supporters-ice-agents-online-videos-report",
      "published": "Tue, 27 Jan 2026 18:37:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "How Israel’s West Bank security realities are reshaping the two-state debate",
      "description": "The West Bank remains central to Israel's security strategy as experts debate two-state solution viability following declining Palestinian terrorist incidents.",
      "url": "https://www.foxnews.com/world/how-israels-west-bank-security-realities-reshaping-two-state-debate",
      "published": "Tue, 27 Jan 2026 07:51:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Symbolic Doomsday Clock moves closer to midnight amid ‘catastrophic risks’",
      "description": "Atomic scientists say the public must demand quick action from leaders on nuclear and climate threats to avoid disaster.",
      "url": "https://www.aljazeera.com/news/2026/1/28/symbolic-doomsday-clock-moves-closer-to-midnight-amid-catastrophic-risks?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 05:03:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "US withdrawal from WHO ‘risks global safety’, agency says in detailed rebuttal",
      "description": "The World Health Organization (WHO) has issued a detailed statement regretting the United States decision to leave the UN agency, and declaring that it will leave both the US and the world less safe as a result.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166828",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "US president talks up economy amid outrage over Minnesota killings",
      "description": "Trump attempts to shift focus to bread-and-butter issues amid outcry over two fatal shootings by federal agents.",
      "url": "https://www.aljazeera.com/economy/2026/1/28/trump-talks-up-strength-of-us-economy-in-advance-of-midterm-elections?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 03:16:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Russian drones kill 1 and injure children in Ukraine as Zelenskyy urges speedier diplomacy",
      "description": "A heavy Russian drone attack on Odesa has killed at least one person and injured 23, including children and a pregnant woman",
      "url": "https://abcnews.go.com/International/wireStory/russian-drones-kill-1-injure-children-ukraine-zelenskyy-129590788",
      "published": "Tue, 27 Jan 2026 06:57:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "World pauses to commemorate International Holocaust Remembrance Day",
      "description": "People across Europe and beyond are commemorating International Holocaust Remembrance Day",
      "url": "https://abcnews.go.com/International/wireStory/world-pauses-commemorate-international-holocaust-remembrance-day-129590602",
      "published": "Tue, 27 Jan 2026 13:37:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘We must stand up for our shared humanity - each and every day’: UN human rights chief",
      "description": "On the eve of International Holocaust Remembrance Day, UN High Commissioner for Human Rights Volker Türk called on the global community to “not only to look at our past, but to reflect on our present, and to safeguard our future.”",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166836",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: UN and rights experts warn against risk of mass violence in Jonglei",
      "description": "The UN Mission in South Sudan (UNMISS) is sounding the alarm over the threat of escalating violence in Jonglei state which is putting lives at risk and further weakening prospects for peace.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166831",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Republicans criticise immigration force but steer clear of Trump attacks",
      "description": "Lawmakers are questioning the crackdown while anger grows over two citizens killed by federal agents.",
      "url": "https://www.bbc.com/news/articles/cj3vp84j1l3o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 02:29:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian drone swarms pose 'credible threat' to USS Abraham Lincoln carrier group, defense expert says",
      "description": "USS Abraham Lincoln strike group approaches Middle East amid warnings that Iranian drone capabilities worth \"tens of millions of dollars\" threaten U.S. naval vessels.",
      "url": "https://www.foxnews.com/world/iranian-drone-swarms-pose-credible-threat-uss-abraham-lincoln-carrier-group-defense-expert-says",
      "published": "Sun, 25 Jan 2026 21:00:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian security forces gun down amateur boxer near Tehran: source",
      "description": "Iranian security forces allegedly killed amateur boxer Sepehr Ebrahimi during ongoing protests near Tehran. The death adds to Iran's rising protest toll of at least 6,126 people killed.",
      "url": "https://www.foxnews.com/world/iranian-security-forces-gun-down-amateur-boxer-father-searches-morgues-missing-son-source",
      "published": "Mon, 26 Jan 2026 21:34:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the sovereignty of the country’: Guinea-Bissau says US vaccine study suspended",
      "description": "Despite US pushback, officials in west Africa say controversial hepatitis B study on pause amid ethics concerns US health officials insisted it was still on. African health leaders said it was cancelled . At the heart of the controversy is the west African nation of Guinea-Bissau – one of the poorest countries in the world and the proposed site of a hotly debated US-funded study on vaccines. The study on hepatitis B vaccination, to be led by Danish researchers, became a flashpoint after major changes to the US vaccination schedule and prompted questions about how research is conducted ethically in other countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/guinea-bissau-hepatitis-b-vaccine-study",
      "published": "Fri, 23 Jan 2026 17:09:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Zelenskyy condemns 'terrorism' after Russia hits train in Ukraine",
      "description": "A drone struck a train carriage carrying nearly 200 passengers in Ukraine, in an attack authorities blamed on Russia.",
      "url": "https://www.dw.com/en/zelenskyy-condemns-terrorism-after-russia-hits-train-in-ukraine/a-75686904?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 28 Jan 2026 02:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Ted Cruz urges US to arm Iranian protesters as militias threaten ‘total war’ against America",
      "description": "Ted Cruz responds to reports describing rapidly deteriorating situation as Iran-backed militias threaten 'total war' against America. He called for the U.S. to arm Iranian protesters.",
      "url": "https://www.foxnews.com/world/ted-cruz-urges-us-arm-iranian-protesters-militias-threaten-total-war-against-america",
      "published": "Tue, 27 Jan 2026 21:36:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Anger as branch of ICE to help with security at Winter Olympics in Italy",
      "description": "A branch of the US Immigration and Customs Enforcement (ICE) will help with security for the Winter Olympics in Italy, it confirmed Tuesday, sparking anger and warnings they were not welcome. Reports had been circulating for days that the agency embroiled in an often brutal immigration crackdown in the United States could be involved in US security measures for the February 6-22 Games in northern Italy.",
      "url": "https://www.france24.com/en/anger-as-branch-of-ice-to-help-with-security-at-winter-olympics-in-italy",
      "published": "Tue, 27 Jan 2026 19:58:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "From lunch tray to lifelong health: WHO sets global standards for school meals",
      "description": "For the first time ever, the World Health Organization (WHO) is providing recommendations for healthy and nutritious food in schools around the world.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166843",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Arizona man accused of human smuggling shot by federal authorities after firing at helicopter, agents: FBI",
      "description": "A shooting involving the U.S. Border Patrol prompted a law enforcement response in Arizona’s Arivaca area on Tuesday, local authorities said.",
      "url": "https://www.foxnews.com/us/border-patrol-involved-arizona-shooting-one-person-injured-local-authorities-say",
      "published": "Tue, 27 Jan 2026 14:17:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Repeat offender on parole for murder tied to brutal jail assault, escape hours after robbery",
      "description": "Murder parolee Edmound Guillory allegedly cut ankle monitor before CVS robbery and jail escape. The 19-year-old Texas teen was reportedly convicted in 2022 fatal shooting but released early.",
      "url": "https://www.foxnews.com/us/repeat-offender-parole-murder-tied-brutal-jail-assault-escape-hours-after-robbery",
      "published": "Tue, 27 Jan 2026 12:13:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Minnesota congresswoman Ilhan Omar attacked with unknown liquid during town hall",
      "description": "Omar was uninjured and continued to speak at the event following the incident.",
      "url": "https://www.bbc.com/news/articles/cn9zpee3llxo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 07:15:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "USS Abraham Lincoln Aircraft Carrier Strike Group makes move amid threat from Iran",
      "description": "USS Abraham Lincoln entered CENTCOM waters Monday amid escalating threats from Iran and the potential for a \"credible\" drone attack on the U.S.",
      "url": "https://www.foxnews.com/world/uss-abraham-lincoln-aircraft-carrier-strike-group-makes-move-threat-iran",
      "published": "Mon, 26 Jan 2026 06:58:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump promises to ‘de-escalate’ Minnesota crisis after Alex Pretti shooting",
      "description": "US president says he still has confidence in Homeland Security Secretary Kristi Noem amid calls for her resignation.",
      "url": "https://www.aljazeera.com/news/2026/1/28/trump-promises-to-de-escalate-minnesota-crisis-after-alex-pretti-shooting?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 06:11:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Plane crash kills prominent Indian politician Ajit Pawar",
      "description": "The plane carrying the deputy chief minister of Maharashtra state came down in his constituency of Baramati.",
      "url": "https://www.aljazeera.com/news/2026/1/28/plane-crash-kills-prominent-indian-politician-ajit-pawar?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 05:51:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Netanyahu vows to disarm Hamas, demilitarise Gaza after last hostage returned",
      "description": "Israeli Prime Minister Benjamin Netanyahu said on Tuesday that Israel would now focus on disarming Hamas and demilitarising Gaza following the return of the last hostage from the territory, warning that no reconstruction would be allowed until those goals were achieved and reiterating his opposition to Palestinian statehood in Gaza.",
      "url": "https://www.france24.com/en/middle-east/20260127-netanyahu-vows-to-disarm-hamas-demilitarise-gaza",
      "published": "Tue, 27 Jan 2026 22:58:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "'What do you want from me?' Captain in fatal ship collision asks prosecutor&#160;",
      "description": "A captain has been confronted in a trial over the \"serious and obvious\" risk of death posed when his container ship collided with an anchored US oil tanker.",
      "url": "https://news.sky.com/story/what-do-you-want-from-me-captain-in-fatal-ship-collision-asks-prosecutor160-13499703",
      "published": "Tue, 27 Jan 2026 16:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Germany's Green Party under pressure over Mercosur vote",
      "description": "The Greens are big supporters of international agreements. But, now, eight German lawmakers in the European Parliament have all but scuppered the Mercosur free trade agreement — defying their party's leadership.",
      "url": "https://www.dw.com/en/germany-s-green-party-under-pressure-over-mercosur-vote/a-75677747?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 15:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump backs down on immigration enforcement push after Minneapolis shootings",
      "description": "President Donald Trump sent border czar Tom Homan to Minneapolis on Tuesday to ease tensions after two US citizens were shot dead by federal agents, signalling a shift in the administration’s aggressive immigration enforcement tactics. Homan met with the city’s mayor and the governor of Minnesota amid growing political pressure and public outrage.",
      "url": "https://www.france24.com/en/americas/20260128-trump-backs-down-on-immigration-enforcement-push-after-minneapolis-shootings",
      "published": "Wed, 28 Jan 2026 01:46:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "FBI’s Kash Patel falsely claims Americans ‘cannot bring firearms’ to protests",
      "description": "FBI Director Kash Patel was accused of not knowing the law, after falsely claiming protesters cannot carry firearms to demonstrations, following the killing of ICU nurse Alex Pretti by ICE agents in Minneapolis. His statement outraged gun rights groups across the US - including the NRA - who argue it’s a Second Amendment right to bear arms, and Pretti had a legal license to carry a handgun. Vedika Bahl explains in Truth or Fake.",
      "url": "https://www.france24.com/en/fbi-s-kash-patel-falsely-claims-americans-cannot-bring-firearms-to-protests",
      "published": "Tue, 27 Jan 2026 21:48:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Holocaust survivor, 93, bears witness for young 'messengers of peace'",
      "description": "Lili Keller-Rosenberg has been sharing her story with young people for more than 40 years. Born into a French Jewish family with Hungarian origins, she was captured in Roubaix when she was 11 years old. Deported to Ravensbrück concentration camp and then Bergen-Belsen, she miraculously survived with her mother and two little brothers. FRANCE 24 met her to mark International Holocaust Remembrance Day.",
      "url": "https://www.france24.com/en/europe/20260127-holocaust-survivor-lili-keller-rosenberg-bears-witness-messengers-of-peace",
      "published": "Tue, 27 Jan 2026 17:02:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘Cycle of attacks must end’: Lead UN official in Ukraine",
      "description": "The senior UN official in Ukraine, Matthias Schmale, has issued a condemnation of the massive overnight Russian drone and missile strike on several major Ukrainian cities, killing and injuring civilians, and knocking out energy infrastructure amid sub-zero temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166825",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Retired NYPD officer collapses, dies shoveling snow for churchgoers during devastating Northeast winter storm",
      "description": "Retired NYPD sergeant Roger McGovern, 60, reportedly died of heart attack while shoveling snow at his Long Island church preparing for Sunday mass.",
      "url": "https://www.foxnews.com/us/retired-nypd-officer-collapses-dies-shoveling-snow-churchgoers-during-devastating-northeast-winter-storm",
      "published": "Tue, 27 Jan 2026 15:51:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "China slams Trump administration over US sanctions on Cuba",
      "description": "China strongly condemns U.S. pressure on Cuba, calling sanctions violations of international law as diplomatic tensions escalate over decades-long embargo.",
      "url": "https://www.foxnews.com/world/china-slams-trump-administration-over-us-sanctions-on-cuba",
      "published": "Tue, 27 Jan 2026 14:15:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Chinese hackers reportedly breached phones at 'heart of Downing Street' in global spy campaign",
      "description": "Chinese state-linked hackers reportedly breached phones \"at the heart of Downing Street,\" and allegedly accessed the phone data of millions.",
      "url": "https://www.foxnews.com/world/chinese-hackers-reportedly-breached-phones-heart-downing-street-global-spy-campaign",
      "published": "Mon, 26 Jan 2026 18:53:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Can Venezuela’s Delcy Rodríguez become a Latin American Deng Xiaoping?",
      "description": "Maduro’s Sorbonne-educated successor is talking up an era of ‘reform and opening up’ modelled on China’s post-Mao boom After years of political and social upheaval, hunger and despair, the Great Helmsman departs and is replaced by a francophile economic reformer who catapults a traumatised country into a new era of prosperity and growth . That is what happened in China half a century ago when the croissant-loving communist Deng Xiaoping became paramount leader after Chairman Mao Zedong’s 1976 death and set in motion one of history’s biggest economic booms. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/28/can-venezuelas-delcy-rodriguez-become-a-latin-american-deng-xiaoping",
      "published": "Wed, 28 Jan 2026 04:00:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "‘Very low bar’: analysts say Starmer faces slim pickings in China",
      "description": "Experts say business with China is always a double-edged sword let alone when its overheated economy can offer only marginal gains Starmer vows to remain ‘clear-eyed’ over national security as he flies to China Keir Starmer’s trip to China is billed as an attempt to revitalise diplomatic relations but eight years after Theresa May paved the way for a never-materialised “ambitious” post-Brexit deal, the prospect of the prime minister landing any meaningful trade deal is slim, experts have warned. The visit to Beijing, involving a delegation of British companies led by Starmer, the chancellor, Rachel Reeves, and the business secretary, Peter Kyle, is the first since May’s 2018 visit, and will revolve around joint trade and investment efforts. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/27/very-low-bar-analysts-say-starmer-faces-slim-pickings-in-china",
      "published": "Tue, 27 Jan 2026 22:30:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "French PM Lecornu survives no-confidence votes as budget moves forward",
      "description": "French Prime Minister Sébastien Lecornu on Tuesday survived two new no-confidence votes after forcing his budget through the National Assembly, France's lower house of parliament, clearing a key hurdle towards its final adoption.",
      "url": "https://www.france24.com/en/france/20260127-french-pm-lecornu-survives-no-confidence-votes-as-budget-moves-forward",
      "published": "Tue, 27 Jan 2026 20:02:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "'We all know someone who was killed' -  Iran protesters tell BBC of brutal crackdown",
      "description": "Young Iranians able tell the BBC how they saw friends and other people die as security forces crushed protests earlier this month.",
      "url": "https://www.bbc.com/news/articles/cy8y2jxx9ppo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 00:46:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Zelensky condemns deadly Russian drone strike on passenger train",
      "description": "At least four people were killed when drones targeted a packed train in north-eastern Ukraine, officials say.",
      "url": "https://www.bbc.com/news/articles/crkrpl4ngdzo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 21:48:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Neil Young offers Greenlanders free access to his archives",
      "description": "Young says he hopes the offer will \"ease some of the unwarranted stress and threats\" Greenlanders feel over Trump's threats to the territory.",
      "url": "https://www.bbc.com/news/articles/crmlpl0w2z2o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 03:34:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Families sue US over deadly boat strike off Venezuela coast",
      "description": "Relatives of Chad Joseph and Rishi Samaroo - among six killed on 14 October - say the Trinidadian men were returning home when their vessel was hit.",
      "url": "https://www.bbc.com/news/articles/c98jr75w4zko?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 20:24:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Firefighters battle 'emergency level' blazes in Australia heatwave",
      "description": "Firefighters in Victoria are battling at least six major fires amid a record-breaking heatwave.",
      "url": "https://www.bbc.com/news/articles/cpqyp9w84eeo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 14:49:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ex-FIFA president Sepp Blatter joins those calling for boycott of World Cup in U.S.",
      "description": "Former FIFA president Sepp Blatter is backing a proposed fan boycott of World Cup matches in the United States because of the conduct of President Trump and his administration at home and abroad.",
      "url": "https://www.npr.org/2026/01/27/g-s1-107571/fifa-sepp-blatter-boycott-world-cup",
      "published": "Tue, 27 Jan 2026 16:38:13 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Workers from Bangladesh sought jobs in Russia but got sent to combat in Ukraine",
      "description": "An Associated Press investigation found that Bangladeshi workers were lured to Russia by the false promise of civilian jobs and thrust onto the battlefield in the Ukraine war",
      "url": "https://abcnews.go.com/International/wireStory/workers-bangladesh-sought-jobs-russia-combat-ukraine-129588588",
      "published": "Tue, 27 Jan 2026 03:53:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "From deepfakes to grooming: UN warns of escalating AI threats to children",
      "description": "The staggering amount of harmful AI-generated online content has prompted an urgent call from across the UN system for a raft of measures to protect children from abuse, exploitation and mental trauma.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166827",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Well-known Texas attorney’s wife among victims of deadly private jet crash in Maine",
      "description": "Family and friends identified the victims of a deadly Maine plane crash that killed six people aboard a private jet at Bangor airport Sunday night during takeoff.",
      "url": "https://www.foxnews.com/us/well-known-texas-attorneys-wife-among-victims-deadly-private-jet-crash-maine",
      "published": "Tue, 27 Jan 2026 15:55:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "SEE IT: Missing teen drives stolen SUV over 115 mph, crosses into oncoming traffic before rollover crash",
      "description": "Teen driver allegedly reaches 115+ mph in stolen SUV before rollover crash. Dashcam video shows dangerous high-speed chase along Georgia roads.",
      "url": "https://www.foxnews.com/us/see-it-missing-teen-drives-stolen-suv-over-115-mph-crosses-oncoming-traffic-before-rollover-crash",
      "published": "Tue, 27 Jan 2026 15:30:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Virginia school safety director charged with DUI after winter storm",
      "description": "Arlington Public Schools employee Aaron Queen was charged with a DUI after a winter storm incident. The district says it's cooperating with a police investigation.",
      "url": "https://www.foxnews.com/us/virginia-school-safety-director-charged-dui-winter-storm",
      "published": "Tue, 27 Jan 2026 14:47:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Netanyahu sounds alarm on antisemitism at Holocaust Remembrance Day gathering",
      "description": "Antisemitism surge prompts leaders to gather in Jerusalem for Holocaust Remembrance Day conference. Netanyahu warns ideology threatens Western civilization.",
      "url": "https://www.foxnews.com/world/world-leaders-gather-jerusalem-address-global-antisemitism-surge-holocaust-remembrance-day",
      "published": "Tue, 27 Jan 2026 10:22:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Human remains found in search for Belgian backpacker missing in Tasmanian wilderness since 2023",
      "description": "Police say Celine Cremer’s family was told of the discovery on Wednesday and that forensic testing was yet to take place Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Human remains have been discovered near a remote location where a Belgian hiker disappeared more than two years ago. Police say a bushwalker found the remains during a search for Celine Cremer, who was last seen in the Philosopher Falls area near Cradle Mountain in Tasmania’s north-west on 17 June 2023. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/28/human-remains-found-in-search-for-belgium-backpacker-missing-in-tasmanian-wilderness-since-2023",
      "published": "Wed, 28 Jan 2026 06:49:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Minnesota: Trump wants 'honorable' probe into Pretti killing",
      "description": "Facing nationwide backlash, Donald Trump described the killing of Alex Pretti by federal agents in Minneapolis as \"very sad.\" Meanwhile, a planned visit by ICE members has stirred controversy in Italy. DW has more.",
      "url": "https://www.dw.com/en/minnesota-trump-wants-honorable-probe-into-pretti-killing/live-75684720?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 20:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Flooding hammers Mozambique, southern African neighbors",
      "description": "Weeks of heavy rainfall have caused severe floods across southern Africa, with Mozambique and South Africa among the hardest hit. Rising water has destroyed infrastructure, affecting 1.3 million people.",
      "url": "https://www.dw.com/en/flooding-hammers-mozambique-southern-african-neighbors/a-75673858?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 11:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Families of Kenyans lured into Russia-Ukraine war seek state intervention for repatriation",
      "description": "In tonight's edition, the families of Kenyans fighting for Russia in its invasion of Ukraine are demanding that their loved ones be brought back home. Also, white farmers in Zimbabwe hire a US lobbying firm as they court President Donald Trump's help in chasing their government for billions of dollars in compensation for land seized in the 2000s. And more South African schools are introducing phone-free days.",
      "url": "https://www.france24.com/en/families-of-kenyans-lured-into-russia-ukraine-war-seek-state-intervention-for-repatriation",
      "published": "Tue, 27 Jan 2026 21:51:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Landslide leaves Sicilian town teetering on cliff edge",
      "description": "More than 1,000 people were evacuated in Sicily after a five-kilometre section of cliff crumbled during a storm, leaving houses perched perilously on the edge, authorities said Monday. Land was continuing to give way due to rain that has soaked the area in recent days, said the mayor of the southern hill town of Niscemi. FRANCE 24's Seema Gupta reports from Rome.",
      "url": "https://www.france24.com/en/landslide-leaves-sicilian-town-teetering-on-cliff-edge",
      "published": "Tue, 27 Jan 2026 21:27:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Deadly shipwrecks in the Mediterranean, Duterte trial update, final hostage remains recovered in Gaza, FAO boosts farming in Haiti",
      "description": "The UN migration agency, IOM, expressed deep concern on Monday over multiple deadly shipwrecks that are believed to have taken place over the past ten days across the Central Mediterranean.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166834",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "India curbs ‘grocery under 10 minutes’. But riders must still fatally race",
      "description": "India tells platforms to curb 10-minute deliveries amid concerns for workers’ safety but there's no incentive to comply.",
      "url": "https://www.aljazeera.com/features/2026/1/28/india-curbs-grocery-under-10-minutes-but-riders-must-still-fatally-race?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 05:58:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran’s currency, the rial, falls to 1.5 million to $1, a record low after nationwide protests sparked by economic woes",
      "description": "Iran’s currency, the rial, falls to 1.5 million to $1, a record low after nationwide protests sparked by economic woes",
      "url": "https://abcnews.go.com/International/wireStory/irans-currency-rial-falls-15-million-1-record-129590791",
      "published": "Tue, 27 Jan 2026 06:17:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Skier suffers brutal mauling after stepping within 10 feet of snow leopard for photo, video shows",
      "description": "Female skier survives snow leopard mauling in China's Fuyun County after authorities warned tourists about predator sightings near hotel, according to reports.",
      "url": "https://www.foxnews.com/world/skier-suffers-brutal-mauling-stepping-10-feet-snow-leopard-photo-video-shows",
      "published": "Mon, 26 Jan 2026 19:18:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "China experts raise alarms over Xi’s sweeping military purge",
      "description": "Military turmoil in China raises Taiwan invasion concerns as Xi Jinping removes senior officers. Analysts warn of growing instability despite control.",
      "url": "https://www.foxnews.com/world/china-experts-raise-alarms-over-xis-sweeping-military-purge",
      "published": "Mon, 26 Jan 2026 15:51:33 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump says government will 'de-escalate' in Minnesota following Pretti shooting",
      "description": "The killing of Alex Pretti over the weekend led Minnesota officials and locals to renew calls for Trump to end his immigration operation there.",
      "url": "https://www.bbc.com/news/articles/c0q425vg4qzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 05:38:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Pegula sets up Australian Open semi against Rybakina as Swiatek crashes out",
      "description": "Second seed Swiatek is stunned by Rybakina in straight sets while Pegula makes short work of her compatriot Anisimova.",
      "url": "https://www.aljazeera.com/sports/2026/1/28/pegula-sets-up-australian-open-semi-against-rybakina-as-swiatek-crashes-out?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 05:41:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota Representative Ilhan Omar attacked during town hall meeting",
      "description": "Omar was sprayed with an unknown substance during the attack by a man, who was then tackled to the ground.",
      "url": "https://www.aljazeera.com/news/2026/1/28/minnesota-representative-ilhan-omar-attacked-during-town-hall-meeting?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 01:29:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Guyanese businessman facing US extradition elected opposition leader",
      "description": "Azruddin Mohamed’s election comes six months after he formed political party that became country’s second largest A Guyanese businessman facing extradition to the US on gold-smuggling and money-laundering charges has been elected as the country’s opposition leader, six months after he formed a political party that quickly became the second largest in the South American country . Azruddin Mohamed, 38, was confirmed as Guyana’s opposition leader after 16 lawmakers from the We Invest in Nationhood party (Win) and another from a single-seat outfit voted in his favor. The tally made Win the second-largest party in parliament, securing Mohamed’s election even as a magistrate’s court hears state arguments for his extradition to the US. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/guyana-opposition-leader-us-extradition",
      "published": "Mon, 26 Jan 2026 18:26:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. strikes on alleged drug boats have done little to stop the flow of illegal drugs",
      "description": "Despite dozens of lethal U.S. military strikes on suspected narco-boats, drug flows continue, allies are alarmed, and Caribbean fishermen say their livelihoods are under threat.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5688765/boat-strikes-us-cocaine-venezuela-fishermen",
      "published": "Tue, 27 Jan 2026 04:44:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "ICE on US streets challenges American norms, founding values",
      "description": "The Trump administration has moved ICE's center of activity from the border with Mexico to the heart of US cities. Federal agents' encounters with the public are challenging the foundational ideas of the United States.",
      "url": "https://www.dw.com/en/ice-on-us-streets-challenges-american-norms-founding-values/a-75679947?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 20:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "FIFA ex-President Blatter backs call to boycott World Cup",
      "description": "With the US due to co-host the football World Cup this summer, former FIFA President Sepp Blatter said a former colleague was \"right\" to advise supporters to \"stay home\" and watch on TV amid an immigration crackdown.",
      "url": "https://www.dw.com/en/fifa-ex-president-blatter-backs-call-to-boycott-world-cup/a-75678298?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 16:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Regime crackdown: Life inside Iran",
      "description": "👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈",
      "url": "https://news.sky.com/story/regime-crackdown-life-inside-iran-13499877",
      "published": "Tue, 27 Jan 2026 23:50:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Doomsday Clock moved closer to midnight than ever: What is it and how does it work?",
      "description": "The Doomsday Clock has been moved closer than ever to midnight by scientists, a change that is said to signify that we are edging closer to the end of the world.",
      "url": "https://news.sky.com/story/doomsday-clock-moves-closer-to-midnight-what-does-it-mean-12794884",
      "published": "Tue, 28 Jan 2025 14:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Young people must be ‘truly involved’ in transforming education",
      "description": "With young people under 30 making up more than half of the global population and over 272 million children and youth still out of school, their participation in shaping education is becoming increasingly vital.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166820",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "VCU anti-ICE nurse fired after referencing paralytic drug in video instructing 'sabotage' of ICE agents",
      "description": "VCU nurse allegedly posted TikTok videos instructing viewers to use paralytics and poison ivy against ICE agents, prompting a police investigation and administrative leave.",
      "url": "https://www.foxnews.com/us/vcu-anti-ice-nurse-fired-after-referencing-paralytic-drug-in-video-instructing-sabotage-of-ice-agents",
      "published": "Tue, 27 Jan 2026 13:29:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea’s former first lady sentenced to jail term in bribery case",
      "description": "Kim Keon Hee's husband, Yoon Suk Yeol, could be facing the death penalty over his declaration of martial law in 2024.",
      "url": "https://www.aljazeera.com/news/2026/1/28/south-koreas-former-first-lady-sentenced-to-jail-term-in-bribery-case?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 07:02:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "LIVE: Gaza ‘desperate’ as Israel aid blocks hit children hardest, UN says",
      "description": "Palestinians 'desperate' for Rafah crossing to open as prolonged closures compound widespread suffering, warns the UN.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/28/live-rafah-crossing-reopens-as-israel-keeps-launching-deadly-attacks-on-gaza?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 06:38:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,434",
      "description": "These are the key developments from day 1,434 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/28/russia-ukraine-war-list-of-key-events-day-1434?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 01:16:43 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds feared dead in attempt to cross Mediterranean during cyclone",
      "description": "Fifty killed in one incident as Italian authorities estimate 380 people may have drowned last week Up to 380 people may have drowned attempting to cross the Mediterranean last week as Cyclone Harry battered southern Italy and Malta, the Italian coastguard has said, as a shipwreck with the loss of 50 lives was confirmed by Maltese authorities. Just one person, who was hospitalised in Malta, survived the shipwreck, which happened on Friday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/hundreds-feared-dead-after-attempting-to-cross-mediterranean-amid-cyclone-harry",
      "published": "Mon, 26 Jan 2026 14:54:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Five-year-old deported to Honduras despite being US citizen is latest child victim of Trump crackdown",
      "description": "Mother whose visa application was pending says she will send girl back to US soon accompanied by another relative Five-year-old Génesis Ester Gutiérrez Castellanos misses her cousins, classmates and kindergarten teachers in Austin, Texas. Despite being a US citizen, she was deported on 11 January alongside her mother, Karen Guadalupe Gutiérrez Castellanos, to Honduras, a country Génesis had never known. Immigration and Customs Enforcement (ICE) agents were acting on an administrative deportation order against Gutiérrez, 26, issued in 2019, before Génesis was born. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/27/five-year-old-girl-us-citizen-and-mother-deported-honduras",
      "published": "Tue, 27 Jan 2026 14:34:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Italian officials voice outrage at the presence of U.S. ICE agents at the 2026 Olympics",
      "description": "U.S. Homeland Security agents provided security support at past Olympics. But after violence by ICE agents in Minneapolis, some Italian officials say an ICE unit is unwelcome in Milan Cortina.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5690100/winter-olympics-ice-agents-milan-italy",
      "published": "Tue, 27 Jan 2026 17:09:17 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "ICE victim wasn't a 'would-be assassin', Trump says",
      "description": "Donald Trump has appeared to distance himself from controversial remarks by senior members of his administration about ICE shooting victim Alex Pretti.",
      "url": "https://news.sky.com/story/trump-wants-to-de-escalate-in-minneapolis-but-says-ice-victim-shouldnt-have-carried-gun-13499878",
      "published": "Wed, 28 Jan 2026 00:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Philippines grounds company's fleet of passenger ships after at least 18 die in ferry sinking",
      "description": "Philippine officials have grounded the entire fleet of passenger ships belonging to a company that owned a ferry that sank in the south and left at least 18 people dead, with more than 300 others rescued",
      "url": "https://abcnews.go.com/International/wireStory/philippines-grounds-companys-fleet-passenger-ships-after-18-129589677",
      "published": "Tue, 27 Jan 2026 03:54:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea launches suspected ballistic missiles toward the sea, neighbors say",
      "description": "North Korea has launched short-range ballistic missiles into the sea",
      "url": "https://abcnews.go.com/International/wireStory/north-korea-launches-suspected-ballistic-missiles-sea-neighbors-129589070",
      "published": "Tue, 27 Jan 2026 08:33:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea says North Korea has launched an unidentified projectile toward the sea",
      "description": "South Korea says North Korea has launched an unidentified projectile toward the sea",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-north-korea-launched-unidentified-projectile-sea-129589072",
      "published": "Tue, 27 Jan 2026 03:45:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN says Gaza crisis remains dire, children hardest hit",
      "description": "Despite a modest increase in humanitarian assistance, the situation in Gaza remains “dire”, with children among the hardest hit by shortages of shelter, basic services and education, the United Nations said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166842",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Between fear and survival: Women and girls flee violence in northern Syria",
      "description": "When fighting recently intensified near her neighbourhood in Aleppo, in northern Syria, Fatima and her family had to run.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166833",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Keeping people warm amid hostilities and harsh winter weather in Ukraine",
      "description": "As people in war-torn Ukraine face the coldest winter in more than a decade, authorities and humanitarians are working to help them stay warm, particularly the most vulnerable residents.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166822",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Utah children’s author Kouri Richins says state threatened witnesses ahead of trial in husband’s poisoning",
      "description": "Utah mother accused of poisoning husband faces witness intimidation claims before murder trial. Defense alleges prosecution threatened witnesses.",
      "url": "https://www.foxnews.com/us/utah-childrens-author-kouri-richins-says-state-threatened-witnesses-ahead-trial-husbands-poisoning",
      "published": "Tue, 27 Jan 2026 14:26:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "From 700 murdered relatives to 3 survivors: Holocaust descendant leads Israeli forces after Oct 7 attacks",
      "description": "Israeli colonel whose parents survived Holocaust continues military service at the age of 56, serving over 3,600 days in reserves including Gaza operations.",
      "url": "https://www.foxnews.com/world/from-700-murdered-relatives-3-survivors-holocaust-descendant-leads-israeli-forces-after-oct-7-attacks",
      "published": "Tue, 27 Jan 2026 14:08:41 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A new blow for UNRWA as headquarters in East Jerusalem 'set on fire'",
      "description": "The head of embattled UN relief agency for Palestinians, UNRWA, has condemned reports that its headquarters in East Jerusalem have been set alight deliberately.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166829",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Young brothers die after trying desperately to help each other in icy pond during winter storm: report",
      "description": "Three elementary school brothers, ages 6, 8 and 9, tragically died after getting into difficulty in an icy pond during a Texas winter storm, authorities said.",
      "url": "https://www.foxnews.com/us/young-brothers-die-trying-desperately-help-each-other-icy-pond-texas-storm",
      "published": "Tue, 27 Jan 2026 19:43:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Los Angeles homeowner opens fire on burglary suspects fleeing in Studio City neighborhood",
      "description": "A Los Angeles homeowner fired multiple shots at two suspects during attempted burglary in Studio City early Tuesday morning, forcing the pair to flee in SUV.",
      "url": "https://www.foxnews.com/us/los-angeles-homeowner-opens-fire-burglary-suspects-fleeing-studio-city-neighborhood",
      "published": "Tue, 27 Jan 2026 13:23:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Spain plans to give half a million undocumented migrants legal status",
      "description": "The process will be available to foreign nationals without a criminal record who can prove they lived in Spain for five months prior to 31 December 2025.",
      "url": "https://www.bbc.com/news/articles/c62n6gw1dp9o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 16:59:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US to send ICE agents to Winter Olympics, prompting Italian anger",
      "description": "The US federal agency says it will not play an immigration role at February's event in Milan-Cortina.",
      "url": "https://www.bbc.com/news/articles/c5y29xzjdzvo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 19:13:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mexico’s president says cancellation of oil shipment to Cuba is ‘sovereign’ decision",
      "description": "Claudia Sheinbaum denied move was response to pressure from the US, after Trump said ‘zero’ oil would go to Cuba Mexico has cancelled a shipment of oil to Cuba , the country’s president, Claudia Sheinbaum, appeared to confirm on Tuesday, but she insisted the decision was “sovereign” and not a response to pressure from the US. Fuel shortages are causing increasingly severe blackouts in Cuba, and Mexico has been the island’s biggest oil supplier since the US blocked shipments from Venezuela last month. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/27/mexico-cuba-trump-oil",
      "published": "Tue, 27 Jan 2026 18:57:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Sussan Ley says David Littleproud rejected offer of talks this week after Coalition break-up",
      "description": "Liberal leader proposed meeting ‘without any preconditions’ to discuss two parties’ relationship after last week’s split David Littleproud rebuffed Sussan Ley’s offer for last-minute peace talks ahead of parliament’s return next week as the Nationals leader prepares for a leadership contest. In a message to Liberal MPs on Wednesday, Ley said she had written to Littleproud on Tuesday night proposing a meeting “without any preconditions” to discuss the two parties’ relationship following last week’s spectacular break-up. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/28/sussan-ley-says-david-littleproud-rejected-offer-of-talks-this-week-after-coalition-break-up",
      "published": "Wed, 28 Jan 2026 07:36:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Spain will grant legal status to immigrants lacking authorization",
      "description": "Spain's government announced Tuesday it will grant legal status to potentially hundreds of thousands of immigrants living and working in the country without authorization.",
      "url": "https://www.npr.org/2026/01/28/g-s1-107636/spain-legal-status-immigrants",
      "published": "Wed, 28 Jan 2026 01:51:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "In China, AI is no longer optional for some kids. It's part of the curriculum",
      "description": "While debate rages in the U.S. about the merits and risks of AI in schools, it's become a state-mandated part of the curriculum in China, as the authorities try to create a pool of AI-savvy professionals.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5683821/china-ai-schools-curriculum",
      "published": "Tue, 27 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Israel's Netanyahu says a Palestinian state in Gaza 'will not happen'",
      "description": "Israeli Prime Minister Benjamin Netanyahu vowed Tuesday that he would not allow the establishment of a Palestinian state in the Gaza Strip, asserting that Israel would maintain security control \"from Jordan to the sea\". FRANCE 24's Noga Tarnopolsky reports from Jerusalem.",
      "url": "https://www.france24.com/en/israel-s-netanyahu-says-a-palestinian-state-in-gaza-will-not-happen",
      "published": "Tue, 27 Jan 2026 20:22:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Spain to grant legal status to thousands of immigrants lacking permission",
      "description": "Spain's government has announced it will grant legal status to potentially hundreds of thousands of immigrants living and working in the country without authorization",
      "url": "https://abcnews.go.com/International/wireStory/surprise-move-spain-grant-legal-status-thousands-immigrants-129593469",
      "published": "Tue, 27 Jan 2026 08:45:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Days after a disputed election, Uganda's army is on the hunt for opposition leader Bobi Wine",
      "description": "A military hunt is underway in Uganda opposition leader Bobi Wine, whom the country's army chief is calling a wanted fugitive",
      "url": "https://abcnews.go.com/International/wireStory/days-after-disputed-election-ugandas-army-hunt-opposition-129592334",
      "published": "Tue, 27 Jan 2026 07:37:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Independent experts alarmed by child rights violations in US immigration procedures",
      "description": "UN-appointed independent human rights experts have raised alarm over violations of children’s rights during US immigration procedures, nearly a year after federal funding for legal representation for unaccompanied minors was terminated.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166837",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Dozens arrested after protesters take over NYC hotel lobby during anti-ICE demonstration",
      "description": "Dozens arrested after anti-ICE protesters took over New York City hotel lobby, chanting against immigration enforcement and refusing to leave the Tribeca location.",
      "url": "https://www.foxnews.com/us/dozens-arrested-protesters-take-over-nyc-hotel-lobby-anti-ice-demonstration",
      "published": "Wed, 28 Jan 2026 01:23:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Federal judge blocks deportation of 5-year-old boy and father taken in Minnesota immigration operation",
      "description": "A federal judge blocked the deportation of 5-year-old Ecuadorian boy and father detained by immigration authorities in Minnesota last week amid legal challenge.",
      "url": "https://www.foxnews.com/us/federal-judge-blocks-deportation-5-year-old-boy-father-taken-minnesota-immigration-operation",
      "published": "Tue, 27 Jan 2026 17:38:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Protests in Iran: Ali Karimi leads sports' call for support",
      "description": "Former Iran and Bayern Munich footballer Ali Karimi has signed an open letter, asking FIFA to act. He is not the only athlete to be vocal.",
      "url": "https://www.dw.com/en/protests-in-iran-ali-karimi-leads-sports-call-for-support/a-75673788?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 13:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Live: Macron to meet leaders of Denmark and Greenland in Paris",
      "description": "President Emmanuel Macron will host the leaders of Denmark and Greenland in Paris on Wednesday for talks aimed at reaffirming France's support for Greenland’s sovereignty, following recent US threats over the Arctic island that have heightened diplomatic tensions. Follow our liveblog for the latest updates.",
      "url": "https://www.france24.com/en/europe/20260128-live-macron-to-meet-with-leaders-of-denmark-and-greenland-in-paris",
      "published": "Wed, 28 Jan 2026 05:53:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Sensitive agricultural products excluded from EU - India trade deal",
      "description": "The EU and India have hailed their new free trade agreement as \"the mother of all deals\". While the pact eliminates or significantly reduces tariffs on a vast majority of goods traded between the two, it excludes politically sensitive farming products. We'll take a closer look. Also in the segment, some Cypriot fishermen have taken their battle against invasive fish to the dinner table.",
      "url": "https://www.france24.com/en/tv-shows/business/20260127-sensitive-agricultural-products-excluded-from-eu-india-trade-deal",
      "published": "Tue, 27 Jan 2026 21:54:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Top rabbi says Europe must do 'much more' to support revolution in Iran",
      "description": "Europe's most prominent rabbi has told Sky News he holds Iran responsible for the rise of antisemitism in recent years and believes European countries must do much more to support Iranian protesters in overthrowing the Tehran regime.",
      "url": "https://news.sky.com/story/rabbi-pinchas-goldschmidt-says-europe-must-do-much-more-to-support-revolution-in-iran-13499645",
      "published": "Tue, 27 Jan 2026 14:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "A private plane crashes in western India and kills a deputy chief minister and 4 others",
      "description": "A private plane carrying a deputy chief minister has crashed in western India, killing the official and four other people",
      "url": "https://abcnews.go.com/International/wireStory/private-plane-crashes-western-india-kills-deputy-chief-129625463",
      "published": "Wed, 28 Jan 2026 01:53:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza ceasefire improves aid access, but children still face deadly conditions",
      "description": "The fragile ceasefire in the Gaza Strip is making a difference to the lives of over a million children, and improving overall access to food - but more aid still needs to enter.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166835",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Minn 'Antifa' member claims he's 'on the run' after calling for 'armed' men to confront immigration officials",
      "description": "Self-described \"Antifa\" member Kyle Wagner says he's \"on the run\" after deleting social accounts following backlash over calls for armed protesters.",
      "url": "https://www.foxnews.com/us/minn-antifa-member-claims-hes-on-run-after-calling-armed-men-confront-immigration-officials",
      "published": "Tue, 27 Jan 2026 12:05:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says Iran called 'numerous' times to make deal as carrier enters Middle East waters",
      "description": "President Donald Trump indicated Iran is seeking negotiations as the USS Abraham Lincoln carrier enters the region and protests continue inside Iran.",
      "url": "https://www.foxnews.com/world/trump-says-iran-called-numerous-times-make-deal-carrier-enters-middle-east-waters",
      "published": "Mon, 26 Jan 2026 19:55:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says US will end support for Iraq if al-Maliki reinstated as PM",
      "description": "Al-Maliki has been nominated by the largest Shia bloc in parliament as its candidate for PM.",
      "url": "https://www.aljazeera.com/news/2026/1/27/trump-says-us-will-end-support-for-iraq-if-al-maliki-reinstated-as-pm?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 22:50:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Rwanda sues UK over scrapped asylum seeker deal",
      "description": "Rwanda began the inter-state arbitration proceedings under the asylum partnership agreement in November.",
      "url": "https://www.aljazeera.com/news/2026/1/27/rwanda-sues-uk-over-scrapped-asylum-seeker-deal?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 22:20:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "'Voter rolls could be used to intimidate', professor says as Bondi requests Minnesota records",
      "description": "Speaking with FRANCE 24's Monte Francis, Nadine Strossen, Professor of Constitutional Law at New York Law School and Former President of the ACLU, says that voter rolls 'could definitely be used to intimidate people who are lawfully entitled to vote'. US Attorney General Pam Bondi demanded Minnesota hand over voter registration records in a letter to Governor Tim Waltz amid tensions over ICE deployment in the state.",
      "url": "https://www.france24.com/en/voter-rolls-could-be-used-to-intimidate-professor-says-as-bondi-requests-minnesota-records",
      "published": "Tue, 27 Jan 2026 20:30:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Coco Gauff condemns tennis's lack of privacy after she's caught on camera smashing racket",
      "description": "Coco Gauff has called for more privacy for tennis players after being caught on camera smashing her racket in an off-court players' area following her Australian Open quarter-final loss to Elina Svitolina on Tuesday.",
      "url": "https://news.sky.com/story/coco-gauff-condemns-tenniss-lack-of-privacy-after-shes-caught-on-camera-smashing-a-racket-13499748",
      "published": "Tue, 27 Jan 2026 18:21:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Tech tycoon husband arrested after wife found dead below mountain highway in wealthy enclave",
      "description": "A tech executive is accused of killing his wife during a $4.5 million divorce battle. Aryan Papoli's body was discovered 75 feet below a highway in the Crestline area.",
      "url": "https://www.foxnews.com/us/tech-tycoon-husband-arrested-after-wife-found-dead-below-mountain-highway-wealthy-enclave",
      "published": "Tue, 27 Jan 2026 19:20:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Mexico vows ‘solidarity’ with Cuba after oil shipment cancellation reports",
      "description": "The president says Mexico's decision 'to sell or give oil to Cuba for humanitarian reasons' was a 'sovereign' one.",
      "url": "https://www.aljazeera.com/news/2026/1/27/mexico-vows-solidarity-with-cuba-after-oil-shipment-cancellation-report?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 22:38:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2026-01-28T07:49:13.606298Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Activists fear U.S. visa restrictions for Palestinians will hurt diplomacy",
      "description": "Palestinians can no longer apply for a U.S. visa with documents issued by the Palestinian Authority — another sign, they say, that the Trump administration is sidelining Palestinians.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5668158-e1/activists-fear-u-s-visa-restrictions-for-palestinians-will-hurt-diplomacy",
      "published": "Tue, 27 Jan 2026 16:45:47 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Activists fear U.S. visa restrictions for Palestinians will hurt diplomacy",
      "description": "Palestinians can no longer apply for a U.S. visa with documents issued by the Palestinian Authority -- another sign, they say, that the Trump administration is sidelining Palestinians.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5668158/activists-fear-u-s-visa-restrictions-for-palestinians-will-hurt-diplomacy",
      "published": "Tue, 27 Jan 2026 04:43:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Limited access restored to Syria’s Al Hol camp amid security concerns",
      "description": "United Nations agencies have regained limited access to Syria’s Al Hol camp and resumed the delivery of essential supplies after days of disruption caused by a volatile security situation, the UN Deputy Spokesperson said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166824",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Accused surgeon Michael McKee allegedly lurked at ex-wife's home weeks before double murder: report",
      "description": "A surgeon allegedly stalked his ex-wife weeks before a Columbus double murder, new court documents reveal. Michael McKee is accused of lurking at the victims' home.",
      "url": "https://www.foxnews.com/us/accused-surgeon-michael-mckee-allegedly-lurked-ex-wifes-home-weeks-before-double-murder-report",
      "published": "Tue, 27 Jan 2026 18:18:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Russia reportedly slams Trump’s Golden Dome as 'provocative' as trillion-dollar shield takes shape",
      "description": "Russia reportedly called the U.S. Golden Dome missile defense project \"provocative\" as an expert says Russia's reaction shows the system's power as a bargaining chip.",
      "url": "https://www.foxnews.com/world/russia-reportedly-slams-trumps-golden-dome-provocative-trillion-dollar-shield-takes-shape",
      "published": "Mon, 26 Jan 2026 16:26:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US congresswoman Ilhan Omar sprayed with liquid at town hall meeting",
      "description": "US Rep Ilhan Omar of Minnesota was sprayed with an unknown substance by an assailant during a public meeting.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/28/us-congresswoman-ilhan-omar-sprayed-with-liquid-at-town-hall-meeting?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 06:56:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "‘We are just not stopping’: How Minnesotans turned the tables on ICE",
      "description": "US President Donald Trump’s mass deportation programme has given rise to a social media spectacle of shaved and shackled detainees being rounded up by force. But on the streets of Minneapolis and Saint Paul, thousands of locals have launched their own campaign to document ICE’s often-violent operations, filming masked immigration agents wherever they go.",
      "url": "https://www.france24.com/en/americas/20260127-we-are-just-not-stopping-how-minnesotans-turned-the-tables-on-ice",
      "published": "Tue, 27 Jan 2026 21:33:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "ICE agents to have role at Winter Olympics - but told they are 'not welcome'",
      "description": "ICE agents will have a security role at the Winter Olympics in Italy, it has been revealed, after the man who led the Trump administration's crackdown in Minneapolis was moved out of the city.",
      "url": "https://news.sky.com/story/public-face-of-trumps-minneapolis-crackdown-set-to-leave-city-as-presidents-tone-shifts-13499461",
      "published": "Mon, 26 Jan 2026 23:37:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Goma in eastern Congo is hanging by a thread a year after the city fell to Rwanda-backed rebels",
      "description": "The M23 rebel group still controls Goma, a year after taking the main city in eastern Congo",
      "url": "https://abcnews.go.com/International/wireStory/goma-eastern-congo-hanging-thread-year-after-city-129589827",
      "published": "Tue, 27 Jan 2026 04:10:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Yemen: Security Council votes on final extension of Hudaydah Mission",
      "description": "The Security Council adopted a resolution on Tuesday that renews the mandate of the UN Mission in the Yemeni port city of Hudaydah for a final two-month period through 31 March of this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166844",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Soros-backed Philadelphia DA vows to 'hunt' down ICE agents: 'We will find you'",
      "description": "Philadelphia DA Larry Krasner vows to \"hunt\" down ICE agents, calling them \"wannabe Nazis\" as city introduces legislation to limit immigration enforcement.",
      "url": "https://www.foxnews.com/us/soros-backed-philadelphia-da-vows-hunt-down-ice-agents-we-find-you",
      "published": "Tue, 27 Jan 2026 18:57:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "South Korea's ex-first lady jailed 20 months for bribery",
      "description": "Kim Keon Hee was also ordered to return a Graff diamond necklace and pay back 12.85m won in cash.",
      "url": "https://www.bbc.com/news/articles/cevnppplkjjo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 07:16:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former French senator found guilty of drugging MP",
      "description": "Joel Guerriau received a four-year prison sentence, 18 months of which are to be served behind bars.",
      "url": "https://www.bbc.com/news/articles/cy8p1mn3j29o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 22:04:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mexico president asks South Korea for more BTS concerts",
      "description": "About a million fans were vying for 150,000 concert tickets, which sold out in less than 40 minutes.",
      "url": "https://www.bbc.com/news/articles/cz7y2gy4p24o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 03:07:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says US will 'no longer help Iraq' if it picks Maliki as PM",
      "description": "The US president said Iraq would have \"zero\" chance of success without American support.",
      "url": "https://www.bbc.com/news/articles/cn0kpk3drgjo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 01:54:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Crying horse' toys go viral in China ahead of Lunar New Year",
      "description": "Shop owners say the frowning toys - originally made in error - are resonating with young workers.",
      "url": "https://www.bbc.com/news/articles/c70l7zndy3jo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 14:05:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India and EU announce 'mother of all trade deals'",
      "description": "The long-awaited deal comes as both Delhi and Brussels contend with economic and geopolitical pressure from the US.",
      "url": "https://www.bbc.com/news/articles/crrnee01r9jo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 12:23:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian PM Carney denies walking back Davos speech in phone call with Trump",
      "description": "The Canadian prime minister said \"there's almost nothing normal in the US\" when asked about trade talks with Washington.",
      "url": "https://www.bbc.com/news/articles/c9qp3x5x2jpo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 28 Jan 2026 01:31:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sweden aims to lower age of criminal responsibility to 13 as gangs recruit children",
      "description": "Critics say the proposal could see even younger children becoming offenders as well as breaching children's rights.",
      "url": "https://www.bbc.com/news/articles/c4gw49gk13xo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 12:26:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "TikTok US pushes back on claims it is censoring content",
      "description": "Thousands of people claim political content is being suppressed after the US operation was spun off.",
      "url": "https://www.bbc.com/news/articles/ckgjedpn8p8o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 20:25:11 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rwanda takes legal action against UK over axed migrant deal",
      "description": "The African nation argues it is owed payments but Downing Street says it will fight the case.",
      "url": "https://www.bbc.com/news/articles/czx32yxnvzro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 15:17:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "As Western powers crack down on migrants, Spain embraces 500,000",
      "description": "Madrid points to 'positive impact' of migration as it moves to grant 500,000 undocumented people legal status.",
      "url": "https://www.aljazeera.com/news/2026/1/28/as-western-powers-crack-down-on-migrants-spain-embraces-500000?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 06:32:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "One family’s daily struggle reflects alarming food shortages in Yemen",
      "description": "Nasr has no steady employment in Sanaa. He, his wife and five daughters often go to bed hungry.",
      "url": "https://www.aljazeera.com/features/2026/1/28/one-familys-struggle-aid-agencies-warn-of-alarming-food-shortages-in-yemen?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 06:26:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Is Trump’s ‘Board of Peace’ an effort to curtail Europe’s middle powers?",
      "description": "Most European countries have declined or demurred on their invitations to the US president's initiative to rebuild Gaza.",
      "url": "https://www.aljazeera.com/news/2026/1/28/trumps-board-of-peace-an-effort-to-curtail-middle-powers-says-expert?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 05:11:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UPS says it will shed 30,000 jobs in major cost-cutting drive",
      "description": "Package-delivery giant targets savings of $3bn in 2026 amid push to slash deliveries for Amazon.",
      "url": "https://www.aljazeera.com/economy/2026/1/28/ups-says-it-will-shed-30000-jobs-in-major-cost-cutting-drive?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 04:24:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US president praises Syrian leader al-Sharaa after offensive against SDF",
      "description": "Al-Sharaa is due in Moscow on Wednesday to meet with Russian President Vladimir Putin.",
      "url": "https://www.aljazeera.com/news/2026/1/28/trump-praises-syrian-president-al-sharaa-after-offensive-against-sdf?traffic_source=rss",
      "published": "Wed, 28 Jan 2026 02:54:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Benfica’s Jose to kill Real with love, says Madrid boss ‘like his child’",
      "description": "Fiery-tempered and fierce-tongued Jose Mourinho softens his tone as former club Real Madrid face crunch game in Benfica.",
      "url": "https://www.aljazeera.com/sports/2026/1/27/benficas-jose-to-kill-real-with-love-says-madrid-boss-like-his-child?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 21:57:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian ex-Olympian pleads not guilty to 17 felonies including drug trafficking",
      "description": "Authorities allege Ryan Wedding, 44, ‘turned to a life of crime’ after his snowboarding career ended Ryan Wedding, the Canadian former Olympic snowboarder accused of cocaine distribution and orchestrating several murders, appeared on Monday in a southern California courtroom for arraignment. The 44-year-old has been charged with drug trafficking, conspiracy to murder, witness tampering and money laundering, among other charges. Authorities allege that after his snowboarding career, Wedding “turned to a life of crime” as a narcotics trafficker and led an organization that moved cocaine from South America to the US and Canada. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/26/canadian-ryan-wedding-ex-olympian-drug-trafficking",
      "published": "Mon, 26 Jan 2026 23:08:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Starmer says Reform pursuing politics of ‘toxic division’ after Matt Goodwin unveiled as byelection candidate",
      "description": "Prime minister says Reform seeking to ‘tear people apart’ after Gorton and Denton candidate questions whether all UK-born people are British Keir Starmer has accused the Reform UK candidate in the Greater Manchester byelection of pursuing the politics of “toxic division” after he refused to disown his claim that UK-born people from minority ethnic backgrounds are not necessarily British. The prime minister suggested that Matthew Goodwin, a hard-right activist, would try to “tear people apart” in Gorton and Denton, and that voters wanting to stop Nigel Farage’s party should coalesce around the Labour candidate. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/28/reform-matt-goodwin-byelection-keir-starmer-reaction-toxic-division-ntwnfb",
      "published": "Wed, 28 Jan 2026 07:00:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘I lost part of my heart’: last of Japan’s pandas leave for China as ties fray",
      "description": "Hundreds at zoo in Tokyo say farewell to Lei Lei and Xiao Xiao, as China ends ‘panda diplomacy’ with Japan Hundreds of people have gathered to say farewell to two popular pandas departing Tokyo for China, leaving Japan without any of the beloved bears for the first time in 50 years, as ties between the Asian neighbours fray. Panda twins Lei Lei and Xiao Xiao were transported by truck out of Ueno zoological gardens, their birthplace, disappointing many Japanese fans who have grown attached to the furry four-year-olds. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/27/last-of-japan-pandas-leave-china",
      "published": "Tue, 27 Jan 2026 14:33:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Expectations grow for interest rate hike next week after Australia’s inflation jumps to 3.8%",
      "description": "Rapidly rising consumer prices led to annual inflation growing from 3.4% to 3.8% in the year to December Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Inflation jumped to 3.8% in the year to December, from 3.4% in the month before, as strong underlying price growth added to the chance of a Reserve Bank rate hike next Tuesday. The latest figures from the Australian Bureau of Statistics suggested that Australian households once again face a fight to bring rapidly rising consumer prices back under control. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/28/inflation-rate-australia-cpi-rates-abs-data",
      "published": "Wed, 28 Jan 2026 05:22:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NSW school counsellor banned after having jelly shots and engaging in ‘sexual contact’ with students",
      "description": "Health Care Complaints Commission finds Victoria Worsley poses ‘a significant and unacceptable risk’ Get our breaking news email , free app or daily news podcast A New South Wales school counsellor who invited students to her home for alcoholic jelly shots before engaging in “sexual contact” with them has been permanently banned from practising. The Health Care Complaints Commission found that Victoria Worsley, known as “Toy” Worsley, poses “a significant and unacceptable risk to the health and safety of the public”, permanently prohibiting her from providing any health services in paid or voluntary roles, including counselling and social work. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/28/nsw-counsellor-victoria-worsley-banned-sexual-contact-students-ntwnfb",
      "published": "Wed, 28 Jan 2026 05:11:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 5.5 - 9 km ESE of Dianga, China",
      "description": "PAGER - YELLOW ShakeMap - VII DYFI? - IV Time 2026-01-26 06:56:02 UTC 2026-01-26 06:56:02 UTC at epicenter Location 34.028°N 103.305°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rs2q",
      "published": "2026-01-27T07:23:20.332Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-28T01:13:20.077Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-25T08:09:13.060Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU signs 'mother of all deals' to boost trade with India",
      "description": "The European Union has signed what India's prime minister has called \"the mother of all deals\" to boost trade with India. For Europe, the move seeks to hedge against its unpredictable ties to the U.S.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5689884/eu-signs-mother-of-all-deals-to-boost-trade-with-india",
      "published": "Tue, 27 Jan 2026 17:00:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India and the EU clinch the 'mother of all deals' in a historic trade agreement",
      "description": "India and the European Union have reached a free trade agreement, at a time when Washington targets them both with steep import tariffs, pushing major economies to seek alternate partnerships.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5689875/india-eu-trade-agreement",
      "published": "Tue, 27 Jan 2026 08:11:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea: Former first lady sentenced to jail for bribery",
      "description": "A South Korean court has sentenced former first lady Kim Keon Hee to 20 months in prison for corruption.",
      "url": "https://www.dw.com/en/south-korea-former-first-lady-sentenced-to-jail-for-bribery/a-75687451?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 28 Jan 2026 06:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rwanda sues UK over contentious migrant deal",
      "description": "Rwanda accuses the UK of \"intransigence\" and says London owes it millions of pounds over a controversial migration agreement.",
      "url": "https://www.dw.com/en/rwanda-sues-uk-over-contentious-migrant-deal/a-75687005?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 28 Jan 2026 03:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "TikTok settles amid looming social media addiction trial",
      "description": "The social video platform is among the companies facing accusations that their platforms deliberately addict and harm children.",
      "url": "https://www.dw.com/en/tiktok-settles-amid-looming-social-media-addiction-trial/a-75686739?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 28 Jan 2026 00:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netherlands set for minority coalition as parties reach deal",
      "description": "Three Dutch political parties clinched a coalition deal but will have to rely on support from other parties to govern.",
      "url": "https://www.dw.com/en/netherlands-set-for-minority-coalition-as-parties-reach-deal/a-75686726?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 23:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How does Germany deport people?",
      "description": "Germany does not have masked ICE officers or an equivalent agency, but both Chancellor Friedrich Merz and his predecessor have done all they can to accelerate deportations. Here's how the process works.",
      "url": "https://www.dw.com/en/how-does-germany-deport-people/a-75683771?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 20:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nipah virus: India says only 2 cases confirmed as fears rise",
      "description": "India's government said there were two confirmed cases of Nipah virus since December last year, with all those in contact with the affected people having been quarantined and tested.",
      "url": "https://www.dw.com/en/nipah-virus-india-says-only-2-cases-confirmed-as-fears-rise/a-75683059?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 18:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ICE agents spark controversy in Italy over Olympics plans",
      "description": "A group of American ICE agents is set to travel to Italy and provide additional security to the US delegation during the Winter Olympics. \"It's not like the SS are coming,\" Italy's Foreign Minister Antonio Tajani said.",
      "url": "https://www.dw.com/en/ice-agents-spark-controversy-in-italy-over-olympics-plans/a-75683434?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 17:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Dutch court sentences Eritrean migrant smuggler to 20 years",
      "description": "A Dutch court on Tuesday sentenced Eritrean Amanuel W. to 20 years in prison in the Netherlands' largest migrant smuggling case so far. More suspects are set to appear in court later this year.",
      "url": "https://www.dw.com/en/dutch-court-sentences-eritrean-migrant-smuggler-to-20-years/a-75673234?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 17:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Spain to grant legal status to 500,000 undocumented migrants",
      "description": "Spain is moving against the European tide with a plan to offer a chance at residency status to hundreds of thousands of undocumented migrants. The move has exposed a deep political divide for the minority government.",
      "url": "https://www.dw.com/en/spain-to-grant-legal-status-to-500-000-undocumented-migrants/a-75682942?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 16:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China: Is Xi Jinping losing trust in his top generals?",
      "description": "A corruption scandal in the People's Liberation Army has rocked China's military. Probes into two of President Xi Jinping's deputies highlight a struggle over loyalty, power and control within the armed forces.",
      "url": "https://www.dw.com/en/china-is-xi-jinping-losing-trust-in-his-top-generals/a-75680908?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 15:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea's 'fake news' law tests press autonomy",
      "description": "Critics accuse lawmakers of pushing measures that could stifle a free press, while Seoul says the changes are needed to manage the rapidly evolving media landscape.",
      "url": "https://www.dw.com/en/south-korea-s-fake-news-law-tests-press-autonomy/a-75677742?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Plastic emissions could double health damage by 2040",
      "description": "Plastic pollution could double its harm to human health in the coming decades if current production trends continue, according to a new study that links rising risks directly to the manufacture of new plastics.",
      "url": "https://www.dw.com/en/plastic-emissions-could-double-health-damage-by-2040/a-75677138?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 12:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "TikTok settles landmark social media addiction lawsuit ahead of trial",
      "description": "TikTok has agreed to settle a major lawsuit claiming its platform deliberately addicted and harmed children, just days before the trial was set to begin. The case, which also involves Meta’s Instagram, Google’s YouTube and Snap, could influence hundreds of similar lawsuits targeting social media companies over youth mental health and safety.",
      "url": "https://www.france24.com/en/technology/20260127-tiktok-settles-landmark-social-media-addiction-lawsuit-ahead-of-trial",
      "published": "Tue, 27 Jan 2026 23:52:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French ex-senator found guilty of spiking MP's drink to sexually assault her",
      "description": "A French court on Tuesday found former senator Joel Guerriau guilty of spiking lawmaker Sandrine Josso's champagne in November 2023 in order to sexually abuse her. The court sentenced him to four years in prison, of which 18 months must be behind bars.",
      "url": "https://www.france24.com/en/france/20260127-french-ex-senator-found-guilty-of-spiking-mp-s-drink-to-sexually-assault-her",
      "published": "Tue, 27 Jan 2026 21:53:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The mother of all deals? EU and India sign trade deal two decades in the making",
      "description": "It has been described as the Mother Of All Deals. But will the accords struck between the EU and India lead to a wider sense of a Happy Family? The signing took place with predictable, and some might say, justifiable fanfare. The headline says it's a free trade festival, 20 years in the planning. Clear and present opportunities for business to go back and forth.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260127-the-mother-of-all-deals-eu-and-india-sign-trade-deal-two-decades-in-the-making",
      "published": "Tue, 27 Jan 2026 19:18:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Starmer in China: What will be on the table?",
      "description": "It doesn't feel all that long ago that David Cameron took the Chinese leader Xi Jinping for a pint in a Buckinghamshire pub.",
      "url": "https://news.sky.com/story/prime-minister-sir-keir-starmer-in-china-what-will-be-on-the-table-13499611",
      "published": "Tue, 27 Jan 2026 13:15:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Talk to me, Goose': Starmer teases Macron with Top Gun mock up",
      "description": "British Prime Minister Keir Starmer has poked fun at his French counterpart - by putting on a pair of sunglasses at an event before saying, \"bonjour\".",
      "url": "https://news.sky.com/story/talk-to-me-goose-starmer-teases-macron-with-top-gun-mock-up-13499830",
      "published": "Tue, 27 Jan 2026 22:09:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rwanda suing UK over scrapped deportation scheme",
      "description": "Rwanda is suing the UK for failing to formally terminate the controversial agreement.",
      "url": "https://news.sky.com/story/rwanda-suing-uk-over-scrapped-deportation-scheme-13499633",
      "published": "Tue, 27 Jan 2026 14:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea's former first lady sentenced to 20 months in prison for corruption",
      "description": "A South Korean court has sentenced former first lady Kim Keon Hee to 20 months in prison for corruption",
      "url": "https://abcnews.go.com/International/wireStory/south-koreas-former-lady-sentenced-20-months-prison-129625094",
      "published": "Wed, 28 Jan 2026 02:33:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A court sentences South Korea's former first lady Kim Keon Hee to 20 months in prison",
      "description": "A court sentences South Korea's former first lady Kim Keon Hee to 20 months in prison for corruption",
      "url": "https://abcnews.go.com/International/wireStory/court-sentences-south-koreas-former-lady-kim-keon-129624910",
      "published": "Wed, 28 Jan 2026 01:37:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's last pair of pandas have arrived back in China",
      "description": "Japan no longer has pandas for the first time in half a century",
      "url": "https://abcnews.go.com/International/wireStory/japans-pair-pandas-arrived-back-china-129624545",
      "published": "Wed, 28 Jan 2026 01:38:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What to know about South Sudan's major offensive against opposition forces",
      "description": "South Sudan’s army has launched a major military operation against opposition forces after recent territorial losses",
      "url": "https://abcnews.go.com/International/wireStory/south-sudans-major-offensive-opposition-forces-129622421",
      "published": "Wed, 28 Jan 2026 02:40:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French lawmaker recounts trauma in trial of ex-senator accused of drugging her with MDMA",
      "description": "A French lawmaker seeks \"the truth” in the trial in Paris of a former senator accused of drugging her to commit sexual assault",
      "url": "https://abcnews.go.com/International/wireStory/french-lawmaker-recounts-trauma-trial-senator-accused-drugging-129600504",
      "published": "Tue, 27 Jan 2026 10:49:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India and EU clinch the 'mother of all deals' in a historic free trade agreement",
      "description": "India and the European Union have reached a free trade agreement to deepen economic and strategic ties",
      "url": "https://abcnews.go.com/International/wireStory/india-eu-clinch-mother-deals-historic-free-trade-129588687",
      "published": "Tue, 27 Jan 2026 11:05:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India's prime minister says it has reached a free trade agreement with the European Union",
      "description": "India's prime minister says it has reached a free trade agreement with the European Union",
      "url": "https://abcnews.go.com/International/wireStory/indias-prime-minister-reached-free-trade-agreement-european-129588691",
      "published": "Tue, 27 Jan 2026 02:01:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A Holocaust survivor born in a concentration camp shares her story",
      "description": "Ilana Kantorowicz Shalem was born in the Bergen-Belsen concentration camp in March 1945, and is one of the youngest Holocaust survivors",
      "url": "https://abcnews.go.com/International/wireStory/holocaust-survivor-born-concentration-camp-shares-story-129588686",
      "published": "Tue, 27 Jan 2026 03:53:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russia offers cash bonuses, frees prisoners and lures foreigners to replenish its troops in Ukraine",
      "description": "Russian authorities use various strategies to recruit new troops to replenish its supply of soldiers for its nearly 4-year-old full-scale invasion of Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/russia-offers-cash-bonuses-frees-prisoners-lures-foreigners-129588455",
      "published": "Tue, 27 Jan 2026 03:29:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From family farm to climate tech: How one Kenyan woman is helping farmers outsmart drought",
      "description": "“Giving up is not an option - so many people depend on you,” the words of Maryanne Gichanga, a participant in a UN supported initiative, which aims to help farmers in Kenya find solutions to alleviate the pressures of climate change on agriculture production.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166823",
      "published": "Sun, 25 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida man allegedly tells victim 'sorry... I need to see my grandmother' during armed carjacking",
      "description": "A masked man, 18, allegedly carjacked a woman at gunpoint in Orange County, Florida, telling her he needed the car to visit his grandmother, authorities said.",
      "url": "https://www.foxnews.com/us/florida-man-allegedly-tells-victim-sorry-i-need-see-my-grandmother-during-armed-carjacking",
      "published": "Tue, 27 Jan 2026 13:10:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "University of Michigan student vanishes from fraternity party in T-shirt during sub-zero night",
      "description": "University of Michigan student Lucas Mattson, 19, found dead after leaving fraternity party in T-shirt during sub-zero conditions. His body was found after 20-hour search effort.",
      "url": "https://www.foxnews.com/us/university-michigan-student-vanishes-from-fraternity-party-t-shirt-during-sub-zero-night",
      "published": "Tue, 27 Jan 2026 12:44:24 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French lawmakers declare 'battle for free minds' after approving social media ban for children under 15",
      "description": "French lawmakers paved the way for a bill banning social media for children under 15, following Australia's lead in protecting children from digital harm.",
      "url": "https://www.foxnews.com/world/france-lawmakers-declare-battle-free-minds-after-approving-social-media-ban-children-under-15",
      "published": "Tue, 27 Jan 2026 14:18:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Witkoff celebrates 'new day in the Middle East' after final Israeli hostage is returned from Gaza",
      "description": "All hostages from Gaza have returned home as Trump administration completes historic Middle East diplomatic achievement, marking end of painful chapter.",
      "url": "https://www.foxnews.com/world/witkoff-celebrates-new-day-middle-east-after-final-israeli-hostage-returned-from-gaza",
      "published": "Tue, 27 Jan 2026 13:01:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "North Korea launches short-range ballistic missiles into sea, show of force ahead of political meetings",
      "description": "North Korean leader Kim Jong Un's regime tests ballistic missiles as tensions rise in the region ahead of a massive political party gathering.",
      "url": "https://www.foxnews.com/world/north-korea-launches-short-range-ballistic-missiles-sea-show-force-ahead-political-meetings",
      "published": "Tue, 27 Jan 2026 08:07:30 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan opposition leader says democratic transition would be 'fall of the Berlin Wall' for Americas",
      "description": "Opposition leader María Corina Machado said she intends to return to Venezuela soon to help drive a democratic transition.",
      "url": "https://www.foxnews.com/world/venezuelan-opposition-leader-says-democratic-transition-would-be-fall-berlin-wall-americas",
      "published": "Mon, 26 Jan 2026 13:36:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel confirms recovery of last hostage's remains from Gaza",
      "description": "The remains of Ran Gvili, the final Israeli hostage held by Hamas, have been recovered from Gaza. The police officer died defending Israel on Oct. 7.",
      "url": "https://www.foxnews.com/world/israel-confirms-recovery-last-hostages-remains-from-gaza",
      "published": "Mon, 26 Jan 2026 09:11:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy says US security guarantees document is '100% ready' for signing",
      "description": "Ukraine's Zelenskyy says U.S. security guarantees document is \"100% ready\" for signing as trilateral peace talks with Russia expected to continue in Abu Dhabi.",
      "url": "https://www.foxnews.com/world/zelenskyy-says-us-security-guarantees-document-100-ready-signing",
      "published": "Mon, 26 Jan 2026 08:11:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}