{
  "last_updated": "2026-01-05T11:21:16.916994Z",
  "event_count": 222,
  "events": [
    {
      "title": "Venezuela live updates: interim president offers to ‘collaborate’ with US after Trump warns of further strikes",
      "description": "Delcy Rodríguez adopts conciliatory tone as she stands in for Nicolás Maduro after Venezuelan leader captured by American forces and brought to US Tense calm spreads at border with Colombia after Maduro capture Analysis: European leaders appear torn in face of new world order A UK minister would not be drawn into saying whether his government believes the US capture of Venezuela’s president was influenced by the country’s rich oil reserves . Asked on Sky News why he thought Donald Trump had captured Nicolás Maduro and said America would “run” Venezuela, Home Office minister Mike Tapp said: This is for Donald Trump to answer , and I think he has said in his press conference, which I watched with interest around narco-terrorism and that threat. Continue reading...",
      "url": "https://www.theguardian.com/world/live/2026/jan/05/venezuela-live-updates-trump-us-interim-president-collaborate",
      "published": "Mon, 05 Jan 2026 11:00:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Coast Guard suspends search for survivors days after narco-terrorist strikes in Eastern Pacific",
      "description": "The U.S. Coast Guard ended a search for survivors after strikes on suspected drug vessels in the Eastern Pacific. Three alleged narco-terrorists were killed, and others remain missing.",
      "url": "https://www.foxnews.com/us/coast-guard-searches-survivors-us-strikes-suspected-narco-terrorist-vessels-eastern-pacific",
      "published": "Fri, 02 Jan 2026 17:08:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Parliament to be recalled early as Labor seeks to crack down on ‘hate preachers’ and fund gun buybacks",
      "description": "Coalition gearing up to intensify campaign for royal commission into antisemitism but may be split on tighter gun controls The federal parliament will be recalled early as the Albanese government seeks to rush through laws to crack down on “hate preachers” and fund a national gun buyback scheme in the wake of the Bondi beach alleged terrorist attack. But the government is resisting calls for a royal commission into antisemitism, as the Coalition prepares to use parliament’s return to intensify the campaign for an inquiry. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/05/parliament-recalled-early-labor-crack-down-hate-preachers-gun-buybacks-ntwnfb",
      "published": "Mon, 05 Jan 2026 06:28:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "North Korea's Kim oversees hypersonic missile test amid 'geopolitical crisis'",
      "description": "North Korean leader Kim Jong Un oversaw the launch of “cutting-edge” hypersonic missiles to ready the country’s nuclear forces for war, state media said on Monday, citing an urgent “geopolitical crisis” after a US strike on Venezuela. Seoul and Tokyo detected two ballistic launches near Pyongyang.",
      "url": "https://www.france24.com/en/asia-pacific/20260105-north-korea-hypersonic-missiles-nuclear-forces",
      "published": "Mon, 05 Jan 2026 02:38:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "The rise and fall of Venezuela's Nicolás Maduro in photos",
      "description": "Nicolás Maduro rose from a unionized bus driver in Caracas to the presidency of Venezuela, inheriting power after the death of Hugo Chávez and consolidating it over a turbulent decade in office. Under his leadership, the nation spiraled into crisis, pushing millions into poverty and driving one of the world’s largest migration waves. International isolation and U.S.-led sanctions intensified as Maduro clung to power. ___ This is a photo gallery curated by AP photo editors.",
      "url": "https://abcnews.go.com/International/wireStory/rise-fall-venezuelas-nicols-maduro-photos-128880425",
      "published": "Sat, 03 Jan 2026 21:21:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s driver charged with dangerous driving after fatal crash in Nigeria",
      "description": "British boxer was injured in collision that killed his personal trainer Latif Ayodele and strength coach Sina Ghami Nigerian police have charged Anthony Joshua’s driver with causing death by dangerous driving after a fatal crash that killed two people. Adeniyi Mobolaji Kayode, 46, was also charged with driving without a valid driving licence and “driving without due care and attention, causing bodily harm and damage to property”. He is due to appear in court on 20 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/anthony-joshuas-driver-charged-with-dangerous-driving-after-fatal-crash-in-nigeria",
      "published": "Fri, 02 Jan 2026 17:54:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Gunmen kill at least 30 villagers and abduct others during raid in northern Nigeria",
      "description": "At least 30 villagers have been killed and several others are missing after gunmen raided a village in northern Nigeria’s Niger state, police said Sunday, the latest in a cycle of deadly violence in the conflict-hit region. Story by Simon Moritz.",
      "url": "https://www.france24.com/en/video/20260105-gunmen-kill-at-least-30-villagers-and-abduct-others-during-raid-in-northern-nigeria",
      "published": "Mon, 05 Jan 2026 10:16:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Massacre at Nigerian market leaves more than 30 dead as gunmen torch stalls, kidnap others",
      "description": "Armed attackers killed more than 30 people and kidnapped others during a violent market raid in Nigeria's Niger state, police said.",
      "url": "https://www.foxnews.com/world/massacre-nigerian-market-leaves-dead-gunmen-torch-stalls-kidnap-others",
      "published": "Sun, 04 Jan 2026 12:59:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Trump threatens Iran as more protest deaths reported",
      "description": "Amid deadly protests in Iran sparked by economic woes, US President Trump warned that the regime in Tehran would be \"hit very hard\" by the US if more protesters were killed.",
      "url": "https://www.dw.com/en/trump-threatens-iran-as-more-protest-deaths-reported/a-75388284?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 06:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Drop draft proposals on death penalty for Palestinians, UN rights chief urges Israel",
      "description": "The UN’s top human rights official on Friday called on Israeli authorities to abandon plans for new legislation that would impose mandatory death sentences exclusively on Palestinians, warning the proposals violate international law and fundamental human rights standards.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166693",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "North Korea launches ballistic missiles towards sea before South Korean leader’s visit to China",
      "description": "South Korea’s military reports projectile launch hours before Lee Jae Myung was due to head to Beijing North Korea launched ballistic missiles towards the sea on Sunday, its neighbours said, just hours before South Korea’s president was due to leave for talks in China expected to cover North Korea’s nuclear programme. South Korea’s joint chiefs of staff said in a statement that they detected several ballistic missile launches from North Korea’s capital region at about 7.50am local time. They said the missiles flew about 560 miles (900km) and that South Korea and US authorities were analysing details of the launches. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/03/north-korea-has-fired-ballistic-missile-towards-the-sea-of-japan",
      "published": "Sun, 04 Jan 2026 03:50:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Trump warning over Iran protests 'reckless' says foreign minister",
      "description": "The US president earlier said if peaceful protesters are killed, Washington \"will come to their rescue\".",
      "url": "https://www.bbc.com/news/articles/c2057md3gvro?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 00:11:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Venezuela attack could embolden China and Russia, says Emily Thornberry",
      "description": "Failure to condemn US intervention risks encouraging others to take similar action, warns senior Labour MP The lack of western condemnation of the US military intervention in Venezuela could embolden China and Russia to take similar action against other countries, a senior Labour MP has warned. Emily Thornberry, who chairs the Commons foreign affairs committee, said that without a coherent and strong response to Donald Trump’s move at the weekend to remove the Venezuelan president , Nicolás Maduro, and bring him to the US, the norms of international law could break down. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/05/venezuela-attack-embolden-china-russia-uk-labour-emily-thornberry",
      "published": "Mon, 05 Jan 2026 09:30:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "WHO research shows COVID vaccines still crucial in preventing severe illness",
      "description": "Up-to-date vaccination remains the most effective way to prevent severe COVID-19 illness, new research from the World Health Organization (WHO) shows, even as the pandemic has officially ended.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166689",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "WATCH: Ohio police smash sunroof, drag injured driver from burning car after rollover crash",
      "description": "Ohio police officers smashed through a sunroof to rescue a trapped driver from a burning car after a crash. Dramatic body camera video shows the rescue.",
      "url": "https://www.foxnews.com/us/watch-ohio-police-smash-sunroof-drag-injured-driver-from-burning-car-after-rollover-crash",
      "published": "Sat, 03 Jan 2026 16:00:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "At least 30 killed and several others abducted as gunmen storm village in Nigeria",
      "description": "At least 30 people have been killed and several others abducted after gunmen attacked a village in Nigeria, police said.",
      "url": "https://news.sky.com/story/at-least-30-killed-and-several-others-abducted-as-gunmen-storm-village-in-nigeria-13490339",
      "published": "Sun, 04 Jan 2026 15:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "At least 30 killed in attack on Nigeria village",
      "description": "It is the latest in a spate of violent attacks in Niger state, and comes a day after officials said schools could reopen following a mass abduction last year.",
      "url": "https://www.bbc.com/news/articles/c0r4nwy7k48o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 19:49:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Why Europe bows to US influence: \"The Owned Continent\"",
      "description": "Reactions to the US attack on Caracas have been somewhat muted, notably from Europe. Most heads of state, including from EU institutions, said that they were watching the situation carefully and called for restraint and for international laws to be respected. Our EU correspondent has penned a book about the US' relationship with the EU: \"The Owned Continent\". He gives an assessment of Europe’s dependence on the US and describes how Donald Trump has exploited it, but he also proposes a way out.",
      "url": "https://www.france24.com/en/video/20260105-why-europe-bows-to-us-influence-the-owned-continent",
      "published": "Mon, 05 Jan 2026 11:16:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Health advances marked 2025 as wars and funding cuts strained systems",
      "description": "From eliminating deadly infections to expanding access to lifesaving vaccines, 2025 delivered meaningful progress for global health, according to the UN World Health Organization (WHO), offering cautious optimism at the close of a year marked by both breakthroughs and strain.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166690",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Rubio vows to eliminate Hezbollah, Iran operations from Venezuela after Maduro capture",
      "description": "Hezbollah condemns U.S. capture of Nicolas Maduro as Secretary of State Marco Rubio vows to end the terrorist group's decades-long presence in Venezuela.",
      "url": "https://www.foxnews.com/world/rubio-vows-eliminate-hezbollah-iran-operations-from-venezuela-after-maduro-capture",
      "published": "Sun, 04 Jan 2026 12:39:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Rise in holiday measles infections sparks health alerts in NSW, SA and Victoria",
      "description": "Cases of the highly contagious virus jumped nearly threefold in 2025 as immunisation rates declined Get our breaking news email , free app or daily news podcast Health authorities across Australia are on high alert as measles cases rise across the country, fuelled by summer international travel and a decline in childhood vaccination rates. Data from the National Centre for Immunisation Research and Surveillance (NCIRS) has found that for the first time in 10 years, Australia’s early childhood vaccination coverage has slipped below the critical 95% threshold required for herd immunity. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/05/measles-alert-infections-australia",
      "published": "Mon, 05 Jan 2026 06:21:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Trump ramps up pressure on Iran after fresh clashes erupt",
      "description": "Deadly clashes between Iranian protesters and security forces flared again on Sunday, rights groups and local media said, as demonstrations triggered by anger over rising living costs entered a second week. At least 12 people have been killed. US President Donald Trump warned that Iran would get \"hit very hard\" by the United States if more protesters die.",
      "url": "https://www.france24.com/en/middle-east/20260105-donald-trump-iran-clashes",
      "published": "Mon, 05 Jan 2026 03:47:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "North Korea says latest missile tests involve hypersonic weapons system",
      "description": "North Korea says leader Kim Jong Un has observed test-flights of hypersonic missiles and underscored the need to bolster the country’s nuclear war deterrent",
      "url": "https://abcnews.go.com/International/wireStory/north-korea-latest-missile-tests-involve-hypersonic-weapons-128897837",
      "published": "Mon, 05 Jan 2026 00:01:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Afghanistan to remain major crisis in 2026, UN, partners warn",
      "description": "Afghanistan is expected to remain one of the world’s largest humanitarian crises in 2026, UN agencies and humanitarian partners warned on Tuesday, launching a $1.7 billion appeal to assist nearly 18 million people in urgent need.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166684",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Israel extends Gaza occupation beyond ‘yellow line’ in north, bombs south",
      "description": "Israeli attacks have killed at least 414 Palestinians and injured 1,145 in daily truce violations since October 10.",
      "url": "https://www.aljazeera.com/news/2026/1/5/israel-extends-gaza-occupation-beyond-yellow-line-in-north-bombs-south?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 10:48:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Oil price dips as markets assess impact of Trump’s moves in Venezuela",
      "description": "Crude oil falls amid fears US president’s pledge to run country and unlock vast reserves could deepen global supply glut Business live – latest updates Venezuela crisis - latest updates The price of oil has fallen as investors digested the impact of the US capture of the Venezuelan president, Nicolás Maduro, while a former Chevron executive has said he is already seeking to raise $2bn (£1.5bn) to invest in oil projects in the country. Brent crude dropped by 0.7% to $60.33 a barrel and West Texas Intermediate crude fell 0.54% to $56.01 a barrel in early trading on Monday, after Donald Trump pledged to unlock Venezuela’s vast oil reserves. It later recovered some ground, down 0.1%. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/05/oil-price-dips-venezuela",
      "published": "Mon, 05 Jan 2026 10:38:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "'Deeply shocked': World leaders react to US attack on Venezuela",
      "description": "There has been a mixed reaction to a large-scale strike on Venezuela and Maduro's capture by the US.",
      "url": "https://www.bbc.com/news/articles/czx1rpxzyx9o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 06:02:11 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine updates: Deadly Russian attack hits Kyiv",
      "description": "An overnight Russian air attack killed at least two people in Ukraine's capital. Meanwhile, Donald Trump has said he doesn't believe Russia's claim that Ukraine attacked Putin's residence. DW has more.",
      "url": "https://www.dw.com/en/ukraine-updates-deadly-russian-attack-hits-kyiv/live-75387687?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 04:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Concerns raised over legality of Maduro's seizure",
      "description": "The United States' sudden capture and removal of Venezuelan president Nicolas Maduro likely broke international law, according to experts.",
      "url": "https://www.dw.com/en/concerns-raised-over-legality-of-maduro-s-seizure/a-75386205?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 19:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Drone strike kills 1 in Russian border region ahead of Ukraine peace talks",
      "description": "A Ukrainian drone strike killed one person and wounded two others, including a 4-year-old child, in Russia’s Belgorod region on Sunday, officials said, ahead of peace talks in Paris this week",
      "url": "https://abcnews.go.com/International/wireStory/drone-strike-kills-1-russian-border-region-ahead-128884577",
      "published": "Sun, 04 Jan 2026 06:41:04 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "American jailed for billionaire’s Monaco death, plot to kill wife exposed in long con, expert says",
      "description": "Crime expert analyzes Ted Maher's pattern from the deadly 1999 Monaco fire that killed banker Edmond Safra to his recent murder-for-hire conviction.",
      "url": "https://www.foxnews.com/us/american-jailed-billionaires-monaco-death-plot-kill-wife-exposed-long-con-expert-says",
      "published": "Sun, 04 Jan 2026 14:00:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Venezuela updates: Maduro due in US court as UNSC meets",
      "description": "The captured Venezuelan president is appearing in a New York court on narco-terrorism charges, while the UN Security Council convenes after the US attack. Follow DW for the latest.",
      "url": "https://www.dw.com/en/venezuela-updates-maduro-due-in-us-court-as-unsc-meets/live-75389837?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 09:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Germany: Power back for some Berliners, but others freeze on",
      "description": "Thousands of households in Berlin might have to wait several days for power, amid freezing temperatures after an outage caused by possible arson. Mayor Kai Wegner called the attack \"terrorism.\"",
      "url": "https://www.dw.com/en/germany-power-back-for-some-berliners-but-others-freeze-on/a-75382671?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 09:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran’s Khamenei lashes out at protesters as nationwide anti-regime unrest grows",
      "description": "Iran protests prompted Ayatollah Ali Khamenei to call demonstrators \"enemy mercenaries\" and \"rioters\" in his first public speech since nationwide unrest began seven days ago.",
      "url": "https://www.foxnews.com/world/irans-khamenei-lashes-out-protesters-nationwide-anti-regime-unrest-grows",
      "published": "Sat, 03 Jan 2026 17:04:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Police identify all 40 victims of Swiss bar fire",
      "description": "Among those killed by the blaze at Le Constellation is 16-year-old Swiss national Arthur Brodard, his mother confirms.",
      "url": "https://www.bbc.com/news/articles/c3vel0xvlvgo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 05 Jan 2026 00:53:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump’s abduction of Maduro escalates concerns over potential war with Iran",
      "description": "Experts say US military action in Caracas 'gives momentum' for conflict with Tehran and deals another blow to diplomacy.",
      "url": "https://www.aljazeera.com/news/2026/1/5/trumps-abduction-of-maduro-escalates-concerns-over-potential-war-with-iran?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 02:15:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Ghanaian artist Ibrahim Mahama at top of the art world",
      "description": "Best known for large-scale burlap sack installations, Ibrahim Mahama is helping shift power in the art world to the Global South while redefining art as a collective practice.",
      "url": "https://www.dw.com/en/ghanaian-artist-ibrahim-mahama-at-top-of-the-art-world/a-75134392?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 08:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Attacks disrupt heating as temperatures plunge",
      "description": "Recent attacks across Ukraine have killed civilians, damaged critical infrastructure and cut heating and power supplies for millions, UN humanitarians report, as temperatures drop below freezing.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166687",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "SEE PICS: Venezuelans worldwide celebrate as exiles react to Maduro’s capture",
      "description": "Venezuelans erupt in celebration after President Donald Trump announces Nicolás Maduro's capture, with celebrations in Miami, Chile and Spain.",
      "url": "https://www.foxnews.com/world/see-pics-venezuelans-worldwide-celebrate-as-exiles-react-to-maduros-capture",
      "published": "Sat, 03 Jan 2026 15:07:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Maduro gave state TV address as US strikes in Venezuela began: report",
      "description": "Venezuelan President Nicolás Maduro called U.S. strikes an \"attack against Venezuela's sovereignty\" before President Donald Trump announced his capture.",
      "url": "https://www.foxnews.com/world/maduro-gave-state-tv-address-us-strikes-venezuela-began-report",
      "published": "Sat, 03 Jan 2026 10:30:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Teenage boy who survived Hillcrest jumping castle tragedy killed in ebike accident in Tasmania",
      "description": "Lucas Reid, 15, remembered for ‘resilience and optimism’ after bike crash near Devonport on New Year’s Eve Get our breaking news email , free app or daily news podcast A teenage boy who survived the 2021 Hillcrest jumping castle incident was killed in an ebike accident on New Year’s Eve. Lucas Reid, 15, lost control of the bike and hit a pole outside Devonport, Tasmania, at about 7.30pm on Wednesday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/05/teenage-boy-who-survived-hillcrest-jumping-castle-tragedy-killed-in-ebike-accident-in-tasmania",
      "published": "Mon, 05 Jan 2026 06:41:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "United Nations official shares scenes from Darfur region amid humanitarian crisis",
      "description": "The United Nations humanitarian coordinator for Sudan recounts devastating scenes and stories of horrific violence after her team gained access to a city in the embattled Darfur region.",
      "url": "https://www.npr.org/2026/01/05/nx-s1-5664783/united-nations-official-shares-scenes-from-darfur-region-amid-humanitarian-crisis",
      "published": "Mon, 05 Jan 2026 04:47:44 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Security Council: New faces, old tensions as five nations take their seats",
      "description": "From deploying peacekeepers to conducting quiet – but at times heated – diplomacy, the UN Security Council sits at the heart of global decision-making on war and peace. As of January, five new countries will have a seat around the iconic horseshoe table.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166697",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Thirty-two Cubans killed during US attack on Venezuela",
      "description": "Cuba's president said military and intelligence operatives were providing protection to captured leader Nicolás Maduro.",
      "url": "https://www.bbc.com/news/articles/cj9r0eyw0jno?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 05 Jan 2026 07:23:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Tensions between Saudis and Emiratis over future of Yemen reach boiling point",
      "description": "Dispute has potential to create civil war in south of Yemen and spill over into neighbouring countries Tensions between the United Arab Emirates and Saudi Arabia over the future of Yemen and the imminent possibility of the declaration of an independent southern state have reached boiling point with Saudi Arabia in effect accusing the UAE of threatening its future security. The dispute has the potential to create a civil war within the south of Yemen and also spill over into other disputes including in Sudan and the Horn of Africa where the two countries often find themselves backing opposite sides. Yemen could yet become only one theatre in which the two vastly wealthy Gulf states vie for political influence, control of shipping lanes and commercial access. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/saudi-arabia-uae-tension-future-yemen-boiling-point",
      "published": "Tue, 30 Dec 2025 17:19:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Nicolás Maduro to appear in New York court on drugs and weapons charges",
      "description": "Deposed Venezuelan president was controversially captured over weekend amid US military intervention Deposed Venezuelan president Nicolás Maduro is expected to appear in Manhattan federal court on Monday afternoon on drugs and weapons charges after his controversial capture by US Special Forces this weekend. Maduro and his wife, Cilia Flores, were seized in a shocking pre-dawn raid at a compound on Saturday during an assault on Caracas . At least 40 people, including civilians and Venezuelan military members, died in the attack, the New York Times reported. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/05/nicolas-maduro-venezuela-new-york-court",
      "published": "Mon, 05 Jan 2026 09:00:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Germany: State antisemitism commissioner's house attacked",
      "description": "Brandenburg's antisemitism commissioner, Andreas Büttner, said a fire was set next to his property. This was the second attack on the official in the past 16 months.",
      "url": "https://www.dw.com/en/germany-state-antisemitism-commissioner-s-house-attacked/a-75386391?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 17:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Cuba says 32 Cuban officers were killed in US operation in Venezuela",
      "description": "Cuba has acknowledged the deaths of 32 Cubans in the American military operation that ousted Venezuela's leader over the weekend",
      "url": "https://abcnews.go.com/International/wireStory/cuba-32-cuban-officers-killed-us-operation-venezuela-128899713",
      "published": "Sun, 04 Jan 2026 22:49:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "British and French warplanes strike suspected IS weapons facility in Syria",
      "description": "British and French warplanes have carried out an airstrike in central Syria, targeting an underground facility suspected of storing weapons for the Islamic State group",
      "url": "https://abcnews.go.com/International/wireStory/british-french-warplanes-strike-suspected-weapons-facility-syria-128884467",
      "published": "Sun, 04 Jan 2026 03:40:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Indonesian rescuers find a second body as search for Spanish soccer coach and 2 children extended",
      "description": "Indonesian rescuers have recovered a second body in the ongoing search for a Spanish soccer coach and two of his children who went missing after a tour boat sank during their Christmas holiday",
      "url": "https://abcnews.go.com/International/wireStory/indonesian-rescuers-find-body-search-spanish-soccer-coach-128884413",
      "published": "Mon, 05 Jan 2026 01:29:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sexual violence against children ‘entrenched, systemic and widespread’ across DR Congo, UNICEF warns",
      "description": "Sexual violence against children has become entrenched, systemic and increasingly widespread across the Democratic Republic of the Congo (DRC), with new data showing a sharp rise in cases since 2022, according to the UN Children’s Fund (UNICEF).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166683",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Runner fought off mountain lion with stick just weeks before fatal attack on same Colorado trail",
      "description": "A Colorado hiker fought off a mountain lion with a stick after being rushed on a trail where a woman was found dead weeks later in a suspected wildlife attack.",
      "url": "https://www.foxnews.com/us/runner-fought-mountain-lion-stick-just-weeks-fatal-attack-same-colorado-trail",
      "published": "Fri, 02 Jan 2026 21:33:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Off-duty ICE agent takes down armed man firing rifle at LA apartment complex",
      "description": "Off-duty ICE agent confronted armed neighbor firing rifle shots into the air at Los Angeles apartment complex on New Year's Eve, fatally shooting the gunman.",
      "url": "https://www.foxnews.com/us/off-duty-ice-agent-takes-armed-man-firing-rifle-la-apartment-complex",
      "published": "Fri, 02 Jan 2026 17:08:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US capture of Maduro championed, condemned across world stage after surgical Venezuela strikes",
      "description": "World leaders react with condemnation, concern and praise after President Donald Trump announces strikes on Venezuela and capture of Nicolás Maduro.",
      "url": "https://www.foxnews.com/world/us-capture-maduro-championed-condemned-across-world-stage-after-surgical-venezuela-strikes",
      "published": "Sat, 03 Jan 2026 08:22:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump warns of potential second strike on Venezuela",
      "description": "Trump told reporters that the US is ready to carry out a second strike on Venezuela if its government doesn't cooperate.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/5/trump-warns-of-potential-second-strike-on-venezuela?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 06:45:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Fire in Switzerland: Crowd gathers for deadly fire victims",
      "description": "Swiss investigators have identified the bodies of sixteen more of those who were killed in a bar fire on New Year's Eve in the Swiss ski resort of Crans Montana. Their announcement came the same day that a procession and church mass were held in the centre of the ski resort in order to honor the victims. Story by Charlotte Hughes.",
      "url": "https://www.france24.com/en/video/20260105-fire-in-switzerland-crowd-gathers-for-deadly-fire-victims",
      "published": "Mon, 05 Jan 2026 10:18:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuelan President Nicolas Maduro’s narco case echoes US history of targeting alleged foreign drug kingpins",
      "description": "From Maduro to El Chapo: How the U.S. has pursued foreign leaders allegedly involved in international drug trafficking operations over the decades.",
      "url": "https://www.foxnews.com/us/venezuelan-president-nicolas-maduro-narco-case-echoes-us-history-targeting-alleged-foreign-drug-kingpins",
      "published": "Sun, 04 Jan 2026 15:37:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "France's Prime Minister meets with farmer's trade unions as protests resume",
      "description": "New ‘measures’ and a return to ‘common sense’: France’s Prime Minister Sébastien Lecornu is meeting with farmers' unions on Monday and Tuesday in an attempt to avert the threat of a third winter of rural unrest, as protests resume after a relative lull during the holidays. Story by Gabrielle Nadler and France 2.",
      "url": "https://www.france24.com/en/video/20260105-france-s-prime-minister-meets-with-farmer-s-trade-unions-as-protests-resume",
      "published": "Mon, 05 Jan 2026 11:02:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Iran announces monthly allowance of 7% of minimum wage as protests continue",
      "description": "Iranian authorities announced on Sunday they would give a monthly allowance to every citizen in the country to alleviate economic pressure, after a week of protests. Government spokeswoman Fatemeh Mohajerani told state TV that one million Tomans (approximately $7) will be given to every Iranian for four months in the form of credit that can be used to purchase certain goods and is intended to \"reduce the economic pressure on the people\". Story by Oliver Farry.",
      "url": "https://www.france24.com/en/video/20260105-iran-announces-monthly-allowance-of-7-of-minimum-wage-as-protests-continue",
      "published": "Mon, 05 Jan 2026 10:15:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Berlin power outage affecting 45,000 homes blamed on ‘politically motivated’ attack",
      "description": "A fire that left over 45,000 households and 2,200 businesses in southwest Berlin without electricity was a politically motivated attack by left-wing extremists, city officials have said",
      "url": "https://abcnews.go.com/International/wireStory/berlin-power-outage-affecting-45000-homes-blamed-politically-128889344",
      "published": "Sun, 04 Jan 2026 11:14:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Yemen aid response buckling under funding cuts as needs keep rising",
      "description": "Yemen’s already fragile humanitarian response is being pushed to breaking point by deep funding shortfalls, the UN warned in an update Sunday highlighting mounting risks for millions across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166699",
      "published": "Sun, 04 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "‘Do not give up on children’: Displaced by violence, a Haitian girl finds hope at school",
      "description": "A teenage Haitian girl who was forced to flee her home in Haiti’s capital, Port-au-Prince, due to gang violence has urged adults not to “give up on children.”",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166695",
      "published": "Sat, 03 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens Colombia’s Petro, says Cuba looks ‘ready to fall’",
      "description": "US president says a military operation in Colombia 'sounds good' to him and warns Mexico 'to get their act together'.",
      "url": "https://www.aljazeera.com/news/2026/1/5/trump-threatens-colombias-petro-says-cuba-looks-like-its-ready-to-fall?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 02:04:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Gunmen raid village in Nigeria, killing at least 30 people and abducting others",
      "description": "Gunmen have killed at least 30 villagers and abducted several others in northern Nigeria’s Niger state, according to police",
      "url": "https://abcnews.go.com/International/wireStory/gunmen-raid-village-northern-nigeria-killing-30-people-128884984",
      "published": "Sun, 04 Jan 2026 07:45:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Off-duty deputy shot and killed while working security job in Texas, suspect apprehended",
      "description": "Off-duty Caldwell County deputy shot and killed while working security at a nightclub in Austin, Texs. Police investigation ongoing.",
      "url": "https://www.foxnews.com/us/off-duty-deputy-shot-killed-while-working-security-job-texas-suspect-apprehended",
      "published": "Sun, 04 Jan 2026 17:47:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Tech-savvy thieves exploit obits, online posts to strike homes while families grieve, expert warns",
      "description": "Retired LAPD lieutenant reveals how burglars use obituaries to predict when homes are vacant, targeting families during their most vulnerable moments.",
      "url": "https://www.foxnews.com/us/tech-savvy-thieves-exploit-obits-online-posts-strike-homes-while-families-grieve-expert-warns",
      "published": "Sun, 04 Jan 2026 10:00:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "What is the US charging Nicolas Maduro with?",
      "description": "Maduro and five others are charged in the US with a number of crimes, including 'narco-terrorism'.",
      "url": "https://www.aljazeera.com/news/2026/1/5/what-is-the-us-charging-nicolas-maduro-with?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 09:19:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "At least 30 people dead in Nigeria 'bandit' attack",
      "description": "Several other people, including children, were kidnapped by \"bandits\" in Nigeria's Niger state.",
      "url": "https://www.dw.com/en/at-least-30-people-dead-in-nigeria-bandit-attack/a-75384579?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 12:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "25 are dead and 14 more missing after boat capsizes in Nigeria's Yobe state",
      "description": "A passenger boat has capsized in northern Nigeria’s Yobe state, leaving at least 25 people dead",
      "url": "https://abcnews.go.com/International/wireStory/25-dead-14-missing-after-boat-capsizes-nigerias-128885318",
      "published": "Sun, 04 Jan 2026 08:25:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "A woman dies from cervical cancer every two minutes, UN says",
      "description": "A flood of questions drowned Jeanette in thought after she was diagnosed with cervical cancer. Would she be unable to conceive a child? Would she have to enter menopause at the early age of 31?",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166696",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Another child dies in extreme conditions in Gaza: UNICEF",
      "description": "A sixth child has died in Gaza this month as the enclave’s people continue to endure dire living conditions linked to freezing rains and the Israel-Hamas war, the UN Children’s Fund (UNICEF) has announced. The development comes as aid agencies urged Israeli authorities to reconsider revoking the licences of dozens of humanitarian partners that provide assistance across the devastated enclave from 1 January.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166686",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Activist group says it was behind Berlin fire that cut power to thousands",
      "description": "The far-left Vulkan Gruppe says in a statement that targeting the fossil fuel economy, not cutting power, was the goal.",
      "url": "https://www.bbc.com/news/articles/c78v984ywgeo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 18:44:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Watch: 'I'm so happy' - Venezuelans in the US react to Maduro's capture",
      "description": "The BBC's Bernd Debusmann reports from Doral Florida, where the Venezuelan-American community has gathered to celebrate the US attack.",
      "url": "https://www.bbc.com/news/videos/c5y2xqgjd7eo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 22:20:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Denmark urges Trump to cease threats to take over Greenland",
      "description": "The Danish prime minister has said the US doesn't have the right to annex the territory, after Donald Trump again said the US needs Greenland for national security reasons.",
      "url": "https://www.dw.com/en/denmark-urges-trump-to-cease-threats-to-take-over-greenland/a-75387453?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 01:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Hundreds march in silence to honor victims of Swiss bar fire that left 40 dead",
      "description": "Hundreds marched in silence Sunday to honor victims of the New Year’s Eve fire at a bar in Crans-Montana, Switzerland",
      "url": "https://abcnews.go.com/International/wireStory/mother-goodbye-son-swiss-community-grieves-after-deadly-128884877",
      "published": "Sun, 04 Jan 2026 06:40:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Sudan: UN warns of unprecedented child hunger in Darfur as fighting fuels refugee exodus",
      "description": "Sudan’s deepening war is driving unprecedented levels of hunger, child malnutrition and displacement, UN agencies report, as new data from Darfur and a renewed refugee influx into Chad underscore the rapidly deteriorating situation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166682",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Gaza battered by heavy rains as humanitarian response continues",
      "description": "Severe weather conditions have led to further casualties and heightened health risks in Gaza over the past 24 hours, the UN aid coordination office (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166680",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "South Korea's 'movie of the year' is an indie story about a teen's trauma",
      "description": "The World of Love has been praised for its touching, empathetic portrayal of life after sexual assault.",
      "url": "https://www.bbc.com/news/articles/cjrz3dey7lxo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 23:15:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cremation pyre in Africa thought to be world’s oldest containing adult remains",
      "description": "9,500-year-old pyre uncovered in Malawi offers rare insight into rituals of ancient African hunter-gatherer groups A cremation pyre built about 9,500 years ago has been discovered in Africa, offering a fresh glimpse into the complexity of ancient hunter-gatherer communities. Researchers say the pyre, discovered in a rock shelter at the foot of Mount Hora in northern Malawi, is thought to be the oldest in the world to contain adult remains, the oldest confirmed intentional cremation in Africa, and the first pyre to be associated with African hunter-gatherers. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/01/cremation-pyre-in-africa-thought-to-be-worlds-oldest-containing-adult-remains",
      "published": "Thu, 01 Jan 2026 19:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Do countries really need fossil fuels to develop?",
      "description": "Rich nations built their wealth on coal, oil and gas. Now the world is asking poorer countries to chart a different course. Is a fossil-free path to development realistic?",
      "url": "https://www.dw.com/en/do-countries-really-need-fossil-fuels-to-develop/a-75243684?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 10:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US's big plans for Venezuela's oil face political, economic challenges",
      "description": "US President Donald Trump has made no secret of his desire for American firms to take control of Venezuela's massive oil reserves. But the dilapidated state of the country's petroleum infrastructure will make exploiting those reserves difficult and expensive. Meanwhile, China is facing the loss of one of its key suppliers of sour, heavy crude. We take a closer look in this edition.",
      "url": "https://www.france24.com/en/tv-shows/business/20260105-us-s-big-plans-for-venezuela-s-oil-face-political-economic-challenges",
      "published": "Mon, 05 Jan 2026 10:13:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Acting president, army, USA... Who holds power in Venezuela?",
      "description": "Venezuela's acting president offered on Sunday to collaborate with the United States ⁠on an agenda focused on \"shared development\", striking a conciliatory tone for the first time since U.S. forces captured the oil-rich nation's president, Nicolas Maduro. The US captured him his wife in a military operation Saturday. Trump said the US would “run” Venezuela temporarily, but Secretary of State Marco Rubio said Sunday that it would not govern the country day-to-day other than enforcing an existing \" oil quarantine.\" Details and analysis by FRANCE 24's Andrew Hilliar.",
      "url": "https://www.france24.com/en/video/20260105-acting-president-army-usa-who-holds-power-in-venezuela",
      "published": "Mon, 05 Jan 2026 09:49:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump has started with Venezuela - but he may not stop there",
      "description": "The seizure of Nicolas Maduro takes the world into new territory.",
      "url": "https://news.sky.com/story/venezuela-crisis-after-maduros-capture-geopolitics-is-about-to-become-weirder-and-potentially-a-lot-more-dangerous-13490177",
      "published": "Sun, 04 Jan 2026 02:29:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump warns new Venezuelan leader as Maduro set to appear in court",
      "description": "Trump said Venezuela's interim president Delcy Rodríguez could \"pay a very big price, probably bigger than Maduro\" if she \"doesn't do what's right\".",
      "url": "https://www.bbc.com/news/articles/ckgnxvp477eo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 05 Jan 2026 05:23:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "The Yemeni crisis: More complexity and many repercussions",
      "description": "External interventions created political and administrative chaos that intensified internal divisions.",
      "url": "https://www.aljazeera.com/opinions/2026/1/5/the-yemeni-crisis-more-complexity-and-many-repercussions?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 08:15:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump spurns Kremlin’s Putin residence attack claim, Russia kills 2 in Kyiv",
      "description": "Russia’s Defence Ministry had published a video of a downed drone it said Ukraine had launched at Putin’s residence.",
      "url": "https://www.aljazeera.com/news/2026/1/5/trump-spurns-kremlins-putin-residence-attack-claim-russia-kills-2-in-kyiv?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 07:02:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,411",
      "description": "These are the key developments from day 1,411 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/5/russia-ukraine-war-list-of-key-events-day-1411?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 04:36:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Cuba says 32 Cuban fighters killed in US raids on Venezuela",
      "description": "Havana declares two days of mourning for the Cubans killed in US operation to abduct Nicolas Maduro.",
      "url": "https://www.aljazeera.com/news/2026/1/5/cuba-says-32-cubans-killed-during-us-raids-on-venezuela?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 01:50:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "What lies ahead for Venezuela after U.S. attack?",
      "description": "The future of Venezuela is uncertain after the U.S. capture of President Nicolas Maduro. The vice president is now in charge, but she hasn't indicated she'll fall in step with President Trump.",
      "url": "https://www.npr.org/2026/01/05/nx-s1-5666189/what-lies-ahead-for-venezuela-after-u-s-attack",
      "published": "Mon, 05 Jan 2026 04:47:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Covering US-Russian relations and a rapidly changing wartime Russia",
      "description": "NPR's Charles Maynes in Moscow on how the White House's Russia rhetoric shifted this year and how it is landing in Moscow.",
      "url": "https://www.npr.org/2026/01/04/nx-s1-5649890/covering-us-russian-relations-and-a-rapidly-changing-wartime-russia",
      "published": "Sun, 04 Jan 2026 18:00:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump warns Venezuela's interim leader to 'do what's right'",
      "description": "Donald Trump says the US is \"in charge\" in Venezuela after Nicolas Maduro's capture, and warned Venezuela's acting president to comply with US demands or face more military action. DW has more.",
      "url": "https://www.dw.com/en/trump-warns-venezuela-s-interim-leader-to-do-what-s-right/live-75382023?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 10:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ten people found guilty of cyberbullying France's first lady Brigitte Macron",
      "description": "A Paris ​court on Monday found ten people guilty ⁠of the cyber-harassment of France's first lady, Brigitte Macron, for spreading false claims she is a transgender ​woman who was born a man. The court convicted all defendants to sentences ranging from a cyberbullying awareness training to 8-month suspended prison sentences. Details from the courthouse by FRANCE 24 journalist Antonia Kerrigan.",
      "url": "https://www.france24.com/en/video/20260105-ten-people-found-guilty-of-cyberbullying-france-s-first-lady-brigitte-macron",
      "published": "Mon, 05 Jan 2026 11:10:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "After capturing Nicolas Maduro, Donald Trump renews push to annex Greenland",
      "description": "President Donald Trump doubled down Sunday on his claim that Greenland should become part of the United States, despite calls by Denmark's prime minister to stop \"threatening\" the territory. Washington's military intervention against Nicolas Maduro in Venezuela has reignited fears for Greenland, which Trump has repeatedly said he wants to annex, given its strategic location in the Arctic. Story by Gabrielle Nadler and Simon Moritz.",
      "url": "https://www.france24.com/en/video/20260105-after-capturing-nicolas-maduro-donald-trump-renews-push-to-annex-greenland",
      "published": "Mon, 05 Jan 2026 09:50:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela's Maduro set to appear before US court on narcotrafficking charges",
      "description": "Venezuela's president Nicolas Maduro, 63, is set to appear before a New York court on Monday on drug trafficking charges after being seized along with his wife and taken out of Caracas in a shock US assault Saturday. The UN Security Council will hold an emergency session on Monday at Venezuela's request.",
      "url": "https://www.france24.com/en/live-news/20260105-trump-declares-us-in-charge-of-venezuela-and-maduro-goes-to-court",
      "published": "Mon, 05 Jan 2026 06:41:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "35,000 homes without power in Berlin for days after 'left-wing activists' attack power lines",
      "description": "About 35,000 homes are without power in Berlin after officials said left-wing extremists attacked high-voltage power lines.",
      "url": "https://news.sky.com/story/35000-homes-without-power-in-berlin-for-days-after-left-wing-activists-attack-power-lines-13490546",
      "published": "Mon, 05 Jan 2026 04:09:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "New year dawns amid rubble and resolve in Gaza",
      "description": "As 2026 begins, residents of the Gaza Strip are confronting life in displacement camps and among the ruins of destroyed neighbourhoods – facing deep uncertainty after months of war and devastation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166692",
      "published": "Thu, 01 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pilot dies alongside 3 nieces on wedding day in tragic Arizona helicopter crash",
      "description": "Tragic helicopter crash kills pilot and his three nieces on his wedding day. Family devastated as celebratory flight turns deadly in remote canyon.",
      "url": "https://www.foxnews.com/us/pilot-dies-alongside-3-nieces-wedding-day-tragic-arizona-helicopter-crash",
      "published": "Sun, 04 Jan 2026 18:30:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Sister warned Bryan Kohberger about 'psycho killer' on the loose before his arrest: 'Be careful'",
      "description": "Bryan Kohberger's sister revealed she warned him about a \"psycho killer\" after the Idaho murders, not knowing she was speaking to the actual killer.",
      "url": "https://www.foxnews.com/us/sister-warned-bryan-kohberger-about-psycho-killer-loose-before-idaho-arrest-careful",
      "published": "Sat, 03 Jan 2026 19:22:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "The Bail Project spent $91M freeing criminal suspects, including some who later committed murder",
      "description": "The Bail Project spent $90+ million bailing out suspects, including those who allegedly killed people after release. Multiple murders linked to the program.",
      "url": "https://www.foxnews.com/us/bail-project-spent-91m-freeing-criminal-suspects-including-some-who-later-committed-murder",
      "published": "Sat, 03 Jan 2026 08:00:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Maduro capture echoes Noriega takedown that used rock music as psychological warfare against dictator",
      "description": "Nicolás Maduro's capture in Venezuela draws striking parallels to the dramatic 1989 U.S. operation that brought down Panamanian dictator Manuel Noriega.",
      "url": "https://www.foxnews.com/world/maduro-capture-echoes-noriega-takedown-used-rock-music-psychological-warfare-dictator",
      "published": "Sat, 03 Jan 2026 19:09:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "From bus driver to dictator: Nicolás Maduro’s rise and fall in Venezuela",
      "description": "The U.S. had announced a $50 million reward for information leading to Maduro’s arrest before news emerged Saturday of his capture in Venezuela.",
      "url": "https://www.foxnews.com/world/from-bus-driver-dictator-nicolas-maduros-rise-fall-venezuela",
      "published": "Sat, 03 Jan 2026 07:54:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nicolás Maduro will appear in U.S. federal court on Monday",
      "description": "The Venezuelan president, who was captured by U.S. forces early Saturday, is awaiting trial in New York City on federal criminal charges.",
      "url": "https://www.npr.org/2026/01/04/nx-s1-5666351/nicolas-maduro-new-york-court-charges",
      "published": "Sun, 04 Jan 2026 18:06:21 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump’s bid to commandeer Venezuela’s oil sector faces hurdles, experts say",
      "description": "Exploiting Latin American country's reserves faces obstacles from decrepit infrastructure to leadership uncertainty.",
      "url": "https://www.aljazeera.com/economy/2026/1/5/trumps-bid-to-commandeer-venezuelas-oil-sector-faces-hurdles-experts-say?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 09:48:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela’s acting president meets cabinet ministers",
      "description": "Venezuela’s interim president Delcy Rodriguez met with the country’s cabinet of ministers after Maduro's abduction.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/5/venezuelas-acting-president-meets-cabinet-ministers?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 08:42:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea’s junta chief elected president after opposition boycott",
      "description": "Mamady Doumbouya reneged on promise not to stand and hand west African country back to civilian rule The head of Guinea’s junta, Mamady Doumbouya, who had pledged not to run for office after seizing power four years ago, has been elected president after the country’s electoral commission said he had secured a sweeping majority of the vote. Doumbouya, 41, faced eight rivals for the presidency but the main opposition leaders were barred from running and had urged a boycott of the vote held over the weekend. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/guinea-junta-chief-mamady-doumbouya-elected-president-after-opposition-boycott",
      "published": "Wed, 31 Dec 2025 07:54:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Holocaust survivor Eva Schloss dies at 96",
      "description": "King Charles III paid tribute to the Auschwitz survivor, saying he was \"privileged and proud\" to have known her. Austrian-born Schloss fled her home country to the Netherlands, where she would later meet Anne Frank.",
      "url": "https://www.dw.com/en/holocaust-survivor-eva-schloss-dies-at-96/a-75386928?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 20:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "About a dozen loaded oil tankers left Venezuela in dark mode",
      "description": "​About a dozen tankers loaded with Venezuelan crude and fuel departed ⁠in recent days from the country's waters in dark mode, seemingly breaking a strict blockade imposed by the US amid intense pressure that ​mounted until the capture of deposed President Nicolas Maduro, monitoring ‍service TankerTrackers.com said. Story by Nicholas Rushworth.",
      "url": "https://www.france24.com/en/video/20260105-about-a-dozen-loaded-oil-tankers-left-venezuela-in-dark-mode",
      "published": "Mon, 05 Jan 2026 10:54:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Doué, Dembélé shine for PSG in first Paris derby since 1990",
      "description": "Defending champion Paris Saint-Germain stayed one point behind surprise Ligue 1 leader Lens after beating Paris FC 2-1 on Sunday in the capital’s first men’s derby since 1990. Désiré Doué and Ousmane Dembélé scored for PSG. Marseille slipped eight points off the pace after a 2-0 home loss to Nantes.",
      "url": "https://www.france24.com/en/sport/20260105-psg-pfc-paris-ligue-1",
      "published": "Mon, 05 Jan 2026 00:17:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Myanmar's government releases over 6,100 prisoners on independence anniversary",
      "description": "Myanmar’s military government has granted amnesty to more than 6,100 prisoners and has reduced other inmates’ sentences to mark the 78th anniversary of the country's independence from Britain",
      "url": "https://abcnews.go.com/International/wireStory/myanmars-military-government-releases-6100-prisoners-independence-anniversary-128882805",
      "published": "Sat, 03 Jan 2026 23:45:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Captured Venezuelan dictator Maduro faces New York federal judge after dramatic palace raid",
      "description": "Dethroned Venezuelan dictator Nicolas Maduro faces arraignment in New York federal court Monday on drug trafficking charges after dramatic U.S. capture.",
      "url": "https://www.foxnews.com/us/captured-venezuelan-dictator-maduro-faces-new-york-federal-judge-after-dramatic-palace-raid",
      "published": "Mon, 05 Jan 2026 06:00:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Maduro and 'Lady Macbeth’ Cilia Flores marriage spells 'worst case' custody scenario",
      "description": "Venezuelan leader Nicolás Maduro and Cilia Flores face \"worst-case scenario\" in U.S. custody according to expert, with federal indictments on drug and weapons charges.",
      "url": "https://www.foxnews.com/us/maduro-wife-face-manhattan-arraignment-expert-calls-us-custody-worst-case-scenario",
      "published": "Sun, 04 Jan 2026 20:02:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Maduro met Chinese envoy hours before US capture from Caracas as Beijing slams operation",
      "description": "Venezuela's dictator Nicolás Maduro was captured by U.S. forces and flown out of the country hours after meeting Chinese envoy to Latin America, Qiu Xiaoqi.",
      "url": "https://www.foxnews.com/world/maduro-met-chinese-envoy-hours-before-us-capture-from-caracas-beijing-slams-operation",
      "published": "Sat, 03 Jan 2026 11:00:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "'We need Greenland': Trump repeats threat to annex Danish territory",
      "description": "The US president has repeatedly said he wants the island to become a part of the US.",
      "url": "https://www.bbc.com/news/articles/c4g0zg974v1o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 05 Jan 2026 09:58:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Raw emotions as mourners attend Mass for Swiss bar fire victims",
      "description": "There are tears and hugs at a special Mass for the victims of the blaze on New Year’s Eve.",
      "url": "https://www.bbc.com/news/articles/cn82l012dw6o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 21:54:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Video shows Maduro's arrival in US and journey into custody",
      "description": "The Venezuelan president is in custody in New York after he was captured during US strikes on Saturday.",
      "url": "https://www.bbc.com/news/videos/cly308pn4r8o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 10:57:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens Colombia’s president, says Cuba is “ready to fall”",
      "description": "Donald Trump has threatened Colombia’s president following the US’s abduction of Venezuelan leader Nicolas Maduro.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/5/trump-threatens-colombias-president-says-cuba-is-ready-to?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 06:53:43 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US ‘adapt, shrink or die’ terms for $2bn aid pot will mean UN bowing down to Washington, say experts",
      "description": "Afghanistan and Yemen excluded from list of 17 priority countries chosen by Trump administration to receive aid laden with demands The $2bn (£1.5bn) of aid the US pledged this week may have been hailed as “bold and ambitious” by the UN but could be the “nail in the coffin” in changing to a shrunken, less flexible aid system dominated by Washington’s political priorities, aid experts fear. After a year of deep cuts in aid budgets by the US and European countries, the announcement of new money for the humanitarian system is a source of some relief, but experts are deeply concerned about demands that the US has imposed on how the money should be managed and where it can go. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/01/us-aid-cuts-conditions-un-humanitarian-pledge-ocha",
      "published": "Thu, 01 Jan 2026 13:00:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuelans describe the day after U.S. strikes",
      "description": "A day after Saturday's U.S. strikes, Venezuelans describe fear, confusion, and long lines for fuel and food.",
      "url": "https://www.npr.org/2026/01/04/nx-s1-5666307/venezuelans-describe-the-day-after-u-s-strikes",
      "published": "Sun, 04 Jan 2026 19:20:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Switzerland bar fire: All victims of New Year's fire identified",
      "description": "More than half of those who died at a Swiss ski resort celebrating the New Year were under 18 years of age, with two as young as 14. Switzerland will hold a day of mourning on Friday in memory of the victims.",
      "url": "https://www.dw.com/en/switzerland-bar-fire-all-victims-of-new-year-s-fire-identified/a-75387162?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 23:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Danish PM responds to Trump 'threats' to seize Greenland",
      "description": "Denmark's leader has urged Donald Trump to stop threatening to take over Greenland after the US president reiterated his wish to do so in a new interview.",
      "url": "https://news.sky.com/story/denmarks-pm-urges-donald-trump-to-stop-threats-to-take-over-greenland-13490529",
      "published": "Sun, 04 Jan 2026 22:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "British teenager confirmed dead after Swiss bar fire - as all 40 victims are identified",
      "description": "A teenager with British citizenship has been confirmed dead after a fire at a bar in Switzerland - as officials say all 40 victims have been identified.",
      "url": "https://news.sky.com/story/teen-educated-in-uk-confirmed-dead-after-swiss-bar-fire-13490320",
      "published": "Sun, 04 Jan 2026 14:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran has been shaken by a series of protests over the past 50 years. Here's a look at them",
      "description": "Over the past 50 years, Iran has been shaken by a series of protests",
      "url": "https://abcnews.go.com/International/wireStory/iran-shaken-series-protests-past-50-years-128903395",
      "published": "Mon, 05 Jan 2026 04:09:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza aid lifelines under strain as winter worsens",
      "description": "Humanitarian partners in the Gaza Strip are struggling to reach hundreds of thousands of vulnerable people as winter storms batter damaged homes and temporary shelters.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166694",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Mind chess,’ not threats, convinced real-life Sopranos mobster to cooperate: retired FBI agent",
      "description": "How the FBI cracked the real-life crime family behind HBO's \"The Sopranos\" using one shocking arrest to bring down the entire DeCavalcante organization.",
      "url": "https://www.foxnews.com/us/mind-chess-not-threats-convinced-real-life-sopranos-mobster-cooperate-retired-fbi-agent",
      "published": "Sat, 03 Jan 2026 10:00:02 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "UK confirms joint airstrike targeting suspected ISIS weapons facility in Syria",
      "description": "British and French aircraft struck an underground ISIS facility in Syria believed to be used for weapons storage. RAF Typhoon jets targeted the site north of Palmyra.",
      "url": "https://www.foxnews.com/world/uk-confirms-joint-airstrike-targeting-suspected-isis-weapons-facility-syria",
      "published": "Sun, 04 Jan 2026 20:52:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea's Lee Jae Myung meets China's Xi as he seeks to reset ties",
      "description": "Trade, regional security and Beijing's unofficial ban on Korean pop culture are on the agenda.",
      "url": "https://www.bbc.com/news/articles/c70lw9x581no?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 05 Jan 2026 08:51:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Weather tracker: Arctic air grips Europe as severe winds batter Corsica",
      "description": "Subzero temperatures, heavy snowfall and powerful gusts mark a harsh start to 2026 for many It has been a cold start to the year across much of Europe, particularly in central regions, where temperatures dropped to double-digit negatives. Heavy snowfall hit parts of eastern and central Europe on New Year’s Eve, notably in Poland and Ukraine, with similar conditions across the Alps on the first few days of the year. The cold is likely to continue this week as an Arctic air mass sinks south across Europe, pulling temperatures well below the seasonal average outside south-east Europe. Temperatures are expected to fall widely by about 5C (41F) below average, with some areas – such as parts of central and north-eastern Europe – up to 10C lower than the norm. When wind chill is taken into account, it will feel even colder. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/05/weather-tracker-arctic-air-grips-europe-winds-corsica",
      "published": "Mon, 05 Jan 2026 09:15:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Kim Jong-un’s daughter visits state mausoleum, fuelling speculation she will be next North Korean ruler",
      "description": "Kim Ju-ae has been making increasingly prominent appearances in state media over the past three years The daughter of the North Korean ruler, Kim Jong-un, who is likely being prepared as his successor has accompanied her parents on her first public visit to the Kumsusan mausoleum to pay respects to former leaders, ahead of an event that could see her succession formalised. Photos from state news agency KCNA showed Kim Jong-un accompanied by his wife, Ri Sol-ju, and senior officials on the visit on 1 January, with Ju-ae between her parents in the main hall of the Kumsusan Palace of the Sun. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/kim-jong-un-daughter-ju-ae-north-korean-ruler-speculation",
      "published": "Fri, 02 Jan 2026 03:31:45 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "NewJeans member Danielle sued for millions after bitter feud with K-pop record label",
      "description": "Ador terminated the Australian-born singer’s contract on Monday and is now suing her, a family member and the band’s former producer The K-pop record label Ador is suing a former member of megaband NewJeans for millions in damages, it has announced, a day after removing her from the group following a year-long dispute that saw the band allege mistreatment and attempt to leave their contract. The compensation suit against Danielle Marsh, a 20-year-old Australian-born singer, comes months after a Seoul district court ruled that NewJeans’ five members must honour their contracts with Ador, whose parent company Hybe is also behind the K-pop sensation BTS. The band’s contract runs until 2029. Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/01/newjeans-member-danielle-sued-for-millions-after-bitter-feud-with-k-pop-record-label",
      "published": "Thu, 01 Jan 2026 06:19:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Drake and livestreamer Adin Ross accused of using online casino money to artificially inflate streams in class action case",
      "description": "US class action alleges Stake’s anonymised design enabled rapper to fund automated streams on music platforms Drake and American livestreamer Adin Ross have been accused in a US civil case of using online casino money to pay for automated streams in a bid to artificially inflate the singer’s royalties and popularity on music streaming platforms. No one has been charged criminally with regard to the allegations in the lawsuit. Two women in the US state Virginia have filed a class action seeking US$5m from e-casino Stake.com, the celebrities and another Australian internet personality for alleged breaches of Racketeer Influenced and Corrupt Organizations (Rico) and consumer protection laws. Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/05/drake-accused-of-using-online-casino-money-to-artificially-inflate-streams-in-class-action-case-ntwnfb",
      "published": "Mon, 05 Jan 2026 06:50:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Former State Department official discusses the future of Venezuela",
      "description": "NPR's Steve Inskeep speaks with Kevin Whitaker, former U.S. ambassador to Colombia and former U.S. deputy chief of mission in Venezuela, about the U.S. raid on Caracas and engagement in Venezuela.",
      "url": "https://www.npr.org/2026/01/05/nx-s1-5666324/former-state-department-official-discusses-the-future-of-venezuela",
      "published": "Mon, 05 Jan 2026 04:47:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Miami mayor calls for Trump to 'immediately' reinstate TPS for Venezuelans",
      "description": "Higgins said the Trump administration ending TPS for Venezuelans in early 2025 was \"reckless, dangerous, and wrong.\"",
      "url": "https://www.npr.org/2026/01/04/nx-s1-5666340/venezuela-nicolas-maduro-venezuelans-asylum-seekers-refugee",
      "published": "Sun, 04 Jan 2026 18:33:13 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "South Korean president begins China state visit",
      "description": "President Lee's trip to Beijing marks the first by any South Korean leader in the last six years and comes amid heightened tensions over Taiwan.",
      "url": "https://www.dw.com/en/south-korean-president-begins-china-state-visit/a-75382207?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 09:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Live: Macron says France ‘does not approve’ of method US used to overthrow Maduro",
      "description": "French President Emmanuel Macron stated during a cabinet meeting on Monday that while the \"method\" used by the United States to capture Venezuelan President Nicolas Maduro was \"neither supported nor approved\" by France, Maduro was \"a dictator\" whose departure was \"good news for Venezuelans\". Follow our liveblog for updates.",
      "url": "https://www.france24.com/en/americas/20260105-live-maduro-us-court-new-york-federal-indictment",
      "published": "Mon, 05 Jan 2026 04:39:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US actions in Venezuela ‘constitute a dangerous precedent’: Guterres",
      "description": "The UN Secretary-General António Guterres has said he is “deeply alarmed” over the standoff between the United States and Venezuela in recent months, which culminated on Saturday morning in the capture of President Nicolás Maduro by US special forces.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166698",
      "published": "Sat, 03 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Results expected 5 January after landmark elections in Central African Republic",
      "description": "Voting proceeded largely as planned in the Central African Republic’s first-ever combined presidential, legislative, regional and municipal elections, and ballot counting is now complete, the UN peacekeeping mission (MINUSCA) said on Wednesday, with results expected to be announced on 5 January.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166688",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Greek aviation disrupted by radio communication issues",
      "description": "Airports in Greece suspended arrivals and departures amid radio frequency disturbances. Some flights resumed later in the day.",
      "url": "https://www.dw.com/en/greek-aviation-disrupted-by-radio-communication-issues/a-75383839?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 11:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "What the capture of Maduro means for China",
      "description": "Donald Trump said shortly after his action in Venezuela that it was \"not going to be a problem\" in terms of his relations with China because it would get more oil as a result.",
      "url": "https://news.sky.com/story/what-the-capture-of-maduro-means-for-china-13490245",
      "published": "Sun, 04 Jan 2026 09:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Israel shuts door on Turkey in Gaza as Trump praises Erdogan, plays down clash",
      "description": "Israel is blocking any Turkish military role in Gaza as President Donald Trump praises Turkey's president and works to manage rising tensions over Gaza, Syria and other issues in region.",
      "url": "https://www.foxnews.com/world/israel-shuts-door-turkey-gaza-trump-praises-erdogan-plays-down-clash",
      "published": "Mon, 05 Jan 2026 06:00:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Maduro's presumed successor, Venezuelan Vice President Delcy Rodriguez, is possibly in Russia: report",
      "description": "Venezuelan Vice President Delcy Rodriguez, the presumed successor to captured Venezuelan President Nicolás Maduro, is in Russia, according to a report.",
      "url": "https://www.foxnews.com/world/maduros-presumed-successor-venezuelan-vice-president-delcy-rodriguez-possibly-in-russia-report",
      "published": "Sat, 03 Jan 2026 12:43:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Solar power usage on the rise",
      "description": "Solar energy generated some 18% of Germany's electricity last year, new figures show. And alcohol can be purchased more cheaply in Germany than almost anywhere else in the EU. DW has more",
      "url": "https://www.dw.com/en/germany-news-solar-power-usage-on-the-rise/live-75390211?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 10:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Bowen: Trump's action could set precedent for authoritarian powers across globe",
      "description": "Trump seems to believe he makes the rules and others cannot have the same privileges.",
      "url": "https://www.bbc.com/news/articles/c5y45nyz124o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 15:14:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From Caracas 'fort' to New York court: Maduro's capture in pictures and maps",
      "description": "Follow the operation to seize the Venezuelan president through photos, satellite images and maps.",
      "url": "https://www.bbc.com/news/articles/c5yvxnlw1pzo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 18:05:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who is Cilia Flores, Venezuela's first lady captured by the US?",
      "description": "Long seen as a powerful figure, Flores has also faced allegations of corruption and nepotism.",
      "url": "https://www.bbc.com/news/articles/ckgl7k91nl8o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 19:01:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thousands stranded across Europe as Greece airspace disrupted",
      "description": "A fault with radio communications caused air traffic controllers to temporarily suspend arrivals and departures.",
      "url": "https://www.bbc.com/news/articles/cgezjlzwz1do?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 14:36:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Can Maduro's trusted lieutenant now work for Trump?",
      "description": "Delcy Rodríguez, a close ally of captured Venezuelan leader Nicolás Maduro, has been named interim president.",
      "url": "https://www.bbc.com/news/articles/cvgx0ylzy8vo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 23:47:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The French university where spies go for training",
      "description": "Sciences Po Saint-Germain near Paris trains current French secret agents and potential new recruits.",
      "url": "https://www.bbc.com/news/articles/c98nqeqnylro?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 05 Jan 2026 00:02:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Spies, drones and blowtorches: How the US captured Maduro",
      "description": "An extraordinary mission dubbed \"Operation Absolute Resolve\" saw elite troops breach the Venezuelan president's fortified compound.",
      "url": "https://www.bbc.com/news/articles/cdred61epg4o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 04 Jan 2026 21:32:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What will happen to parts of Venezuela’s economy affected by US sanctions?",
      "description": "Economist Francisco Rodriguez: regaining access to blocked assets will be essential for Venezuela’s economic recovery",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/5/what-will-happen-to-parts-of-venezuelas-economy-affected-by-us-sanctions?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 10:37:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Amorim sacked by Manchester United; Fletcher named as interim manager",
      "description": "Amorim's tumultuous reign as manager comes to an end after 14 months as academy coach Fletcher takes over temporarily.",
      "url": "https://www.aljazeera.com/sports/2026/1/5/manchester-united-sack-amorim-fletcher-brought-in-as-interim-manager?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 10:28:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mixed messages from Trump administration on US ‘running’ Venezuela",
      "description": "Donald Trump claimed the US will ‘run’ Venezuela, his top diplomat Marco Rubio insisted the US would not be in charge.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/5/mixed-messages-from-trump-administration-on-us-running-venezuela?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 08:50:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syria’s new currency removes al-Assad family images, seeks to boost economy",
      "description": "Authorities remove two zeros from the pound, hoping to simplify transactions and regain trust in the currency.",
      "url": "https://www.aljazeera.com/economy/2026/1/5/syrias-new-currency-removes-al-assad-family-images-seeks-to-boost-economy?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 08:23:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who is Cilia Flores, Venezuela’s ‘first combatant’?",
      "description": "First Lady Cilia Flores was abducted with her husband, President Nicolas Maduro, on Saturday. Who is she?",
      "url": "https://www.aljazeera.com/news/2026/1/5/who-is-cilia-flores-venezuelas-first-combatant?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 08:14:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan interim leader tones down criticism, ready to ‘work with the US’",
      "description": "Acting President Delcy Rodriguez calls for a 'balanced and respectful' relationship with Washington during transition.",
      "url": "https://www.aljazeera.com/news/2026/1/5/venezuelan-interim-leader-tones-down-criticism-ready-to-work-with-the-us?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 07:54:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Booker sinks Thunder with game-winning shot, Lakers rally past Grizzlies",
      "description": "LA Lakers beat Memphis twice in three days while Phoenix's Devin Booker nets a three-pointer to beat the NBA champions.",
      "url": "https://www.aljazeera.com/sports/2026/1/5/nba-lakers-rally-past-grizzlies-as-phoenix-steal-oklahomas-thunder?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 06:45:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Venezuela’s Maduro to appear in court, Rodriguez offers hand to US",
      "description": "UN Security Council to discuss the US abduction of Maduro, wife, as Trump insists control of Venezuela.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/5/live-venezuelas-maduro-to-appear-in-court-trump-threatens-more-strikes?traffic_source=rss",
      "published": "Mon, 05 Jan 2026 05:59:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Our minerals could be used to annex us’: why Canada doesn’t want US mining",
      "description": "Opposition to a controversial graphite mine in Quebec strengthened once the Pentagon became involved The Outaouais region on the western edge of Quebec is home to thousands of lakes, vast forests and extensive wetlands. It is also the setting of a swathe of wooded land known as La Petite-Nation , which, although not far from the cities of Montreal and Ottawa, remains relatively untouched. That, however, is to change with the arrival of a controversial graphite mine with financing from the Pentagon. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/05/our-minerals-could-be-used-to-annex-us-why-canada-doesnt-want-us-mining",
      "published": "Mon, 05 Jan 2026 10:00:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Xi Jinping vows to reunify China and Taiwan in New Year’s Eve speech",
      "description": "Reunification ‘is unstoppable’, says Chinese president, a day after the conclusion of intense military drills China’s president, Xi Jinping, has vowed to reunify China and Taiwan in his annual New Year’s Eve speech in Beijing. Speaking the day after the conclusion of intense Chinese military drills around Taiwan, Xi said: “The reunification of our motherland, a trend of the times, is unstoppable.” Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/xi-jinping-vows-reunification-china-taiwan-new-years-eve-speech",
      "published": "Wed, 31 Dec 2025 13:47:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NSW residents urged to check if they are owed share of $300m in unclaimed money",
      "description": "Millions of dollars held by Revenue NSW includes uncashed cheques, refunds and other payments owed to individuals who may have died or changed address Get our breaking news email , free app or daily news podcast New South Wales residents are being urged to check if they are owed some of the $300m sitting in Revenue NSW’s unclaimed money pool. The pool includes funds from overpayments, uncashed cheques, dividends, refunds, and other amounts owed to individuals the government has not been able to contact. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/05/revenue-nsw-residents-millions-dollars-unclaimed-money",
      "published": "Mon, 05 Jan 2026 06:12:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 4 km NNW of Rancho Viejo, Mexico",
      "description": "PAGER - YELLOW ShakeMap - VI DYFI? - VII Time 2026-01-02 13:58:18 UTC 2026-01-02 13:58:18 UTC at epicenter Location 16.902°N 99.303°W Depth 35.00 km (21.75 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rm3k",
      "published": "2026-01-05T01:42:07.979Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 15 km NNW of Susanville, CA",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VII Time 2025-12-31 05:49:32 UTC 2025-12-31 05:49:32 UTC at epicenter Location 40.544°N 120.692°W Depth 5.32 km (3.31 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75288851",
      "published": "2026-01-05T05:59:36.466Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why a power plant is strategically important in the talks between Russia and Ukraine",
      "description": "NPR's A Martinez talks to Henry Sokolski of the Nonproliferation Policy Education Center about the Zaporizhzhia power plant and its importance in the peace talks between Russia and Ukraine.",
      "url": "https://www.npr.org/2026/01/05/nx-s1-5664884/why-a-power-plant-is-strategically-important-in-the-talks-between-russia-and-ukraine",
      "published": "Mon, 05 Jan 2026 04:47:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The rise and fall of Nicolás Maduro",
      "description": "The rise of Venezuela's deposed president, Nicolás Maduro, was slow, beginning in youth politics and shaped by the mentorship of Hugo Chávez. His fall, too, unfolded over years.",
      "url": "https://www.npr.org/2026/01/05/g-s1-104501/rise-and-fall-nicolas-maduro",
      "published": "Mon, 05 Jan 2026 04:35:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Even in prison, Marwan Barghouthi looms large in Palestinian politics",
      "description": "Arab Barghouthi, the son of Palestinian leader Marwan Barghouthi, on his father's life in Israeli prison and the stalemate after nearly two decades without elections.",
      "url": "https://www.npr.org/2026/01/04/nx-s1-5662673/even-in-prison-marwan-barghouthi-looms-large-in-palestinian-politics",
      "published": "Sun, 04 Jan 2026 17:54:29 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France: 10 found guilty of cyberbullying Brigitte Macron",
      "description": "Ten people were accused of spreading false information about the French first lady, including about her gender and sexuality.",
      "url": "https://www.dw.com/en/france-10-found-guilty-of-cyberbullying-brigitte-macron/a-75392821?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 11:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Asylum applications in Germany down by half in 2025",
      "description": "The Interior Ministry has attributed the drop in applications to stricter migration policies, but other factors also played a role.",
      "url": "https://www.dw.com/en/asylum-applications-in-germany-down-by-half-in-2025/a-75386053?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 15:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What's next for Venezuela oil after US ousts Maduro?",
      "description": "US President Donald Trump says now that Nicolas Maduro is gone, more US oil companies will enter Venezuela and spend billions revitalizing its oil industry. Several key questions have to be answered.",
      "url": "https://www.dw.com/en/what-s-next-for-venezuela-oil-after-us-ousts-maduro/a-75383322?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 12:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar to free thousands of prisoners in annual amnesty",
      "description": "The amnesty comes while Myanmar marks 78 years of indenpendence from Britain and as the junta stages its first election since the 2021 coup.",
      "url": "https://www.dw.com/en/myanmar-to-free-thousands-of-prisoners-in-annual-amnesty/a-75382196?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 4 Jan 2026 07:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ten people found guilty of cyberbullying France’s First Lady Brigitte Macron",
      "description": "‍A Paris ​court on Monday ⁠found eight men and two ​women guilty for the cyber harassment of ​France's First Lady ‍Brigitte Macron. The court pointed to “particularly degrading, insulting, and malicious” comments referring to false claims regarding alleged trans identity and alleged pedocriminality targeting Brigitte Macron.",
      "url": "https://www.france24.com/en/france/20260105-ten-people-found-guilty-cyberbullying-france-first-lady-brigitte-macron",
      "published": "Mon, 05 Jan 2026 11:02:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Cameroon heads for the quarter-finals after knocking out South-Africa",
      "description": "Goals either side of half-time by Junior Tchamadeu and Christian Kofane took Cameroon through to the Africa Cup of Nations quarter-finals at South Africa's expense on Sunday as the Indomitable Lions edged their last-16 clash 2-1. Story by Gabrielle Nadler and Natalia Odisharia.",
      "url": "https://www.france24.com/en/video/20260105-afcon-2025-cameroon-heads-for-the-quarter-finals-after-knocking-out-south-africa",
      "published": "Mon, 05 Jan 2026 10:19:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "With Nicolas Maduro in a New York prison, who will govern Venezuela now?",
      "description": "With Nicolas Maduro in a New York prison, his vice-president Delcy Rodriguez has been sworn in as president. And while Donald Trump announced his intention to \"run Venezuela\" on Saturday, she used her inaugural address to say \"never again will we be a colony\"... So what does Venezuela's immediate political future hold? Story by Charlotte Hughes and Antonia Kerrigan.",
      "url": "https://www.france24.com/en/video/20260105-with-nicolas-maduro-in-a-new-york-prison-who-will-govern-venezuela-now",
      "published": "Mon, 05 Jan 2026 09:47:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Morocco beat Tanzania and qualify for quarter-finals",
      "description": "Hosts Morocco beat Tanzania 1-0 in the Africa Cup of Nations thanks to Brahim Diaz. The Real Madrid player is the tournament's top scorer.",
      "url": "https://www.france24.com/en/tv-shows/sports/20260105-afcon-2025-morocco-beat-tanzania-and-qualify-for-the-quarterfinals",
      "published": "Mon, 05 Jan 2026 06:34:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Auschwitz survivor Eva Schloss, stepsister of Anne Frank, dies at 96",
      "description": "Eva Schloss, an Auschwitz survivor who spent decades educating people about the Holocaust and the stepsister of renowned diarist Anne Frank, has died aged 96, her foundation said Sunday. Her family mourned a “remarkable woman”, praising her tireless work for remembrance, understanding and peace.",
      "url": "https://www.france24.com/en/europe/20260105-anne-frank-holocaust-eva-schloss",
      "published": "Mon, 05 Jan 2026 01:01:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ten guilty of cyber bullying France's first lady after false transgender claims",
      "description": "Ten people have been found guilty of cyber bullying France's first lady Brigitte Macron.",
      "url": "https://news.sky.com/story/ten-people-found-guilty-of-cyber-bullying-frances-first-lady-brigitte-macron-13490565",
      "published": "Mon, 05 Jan 2026 06:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What are jail conditions like for Nicolas Maduro?",
      "description": "The capture of Nicolas Maduro was quite the show, but it was a one-day spectacle.",
      "url": "https://news.sky.com/story/nicolas-maduro-is-at-a-jail-housing-americas-most-unwanted-and-its-far-from-presidential-13490538",
      "published": "Mon, 05 Jan 2026 00:14:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How spies tracked Maduro's food, clothes and pets in run-up to capture",
      "description": "Months of spying, ground forces and more than 150 aircraft were involved in the daring US operation against Venezuela's President Nicolas Maduro.",
      "url": "https://news.sky.com/story/us-general-reveals-how-america-captured-venezuelas-president-13490105",
      "published": "Sat, 03 Jan 2026 19:35:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Don't play games': White House gives Maduro the meme treatment",
      "description": "The capture of Venezuelan president Nicolas Maduro is being relived by its orchestrators with a stirring soundtrack and couched in the language of internet memes.",
      "url": "https://news.sky.com/story/dont-play-games-white-house-gives-maduro-the-meme-treatment-13490234",
      "published": "Sun, 04 Jan 2026 08:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finland's battle against fake news starts in preschool classrooms",
      "description": "Finland has been fighting fake news by teaching media literacy to children as young as 3",
      "url": "https://abcnews.go.com/International/wireStory/finlands-battle-fake-news-starts-preschool-classrooms-128902330",
      "published": "Mon, 05 Jan 2026 01:31:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Driving instructors teach students to dodge danger on Zimbabwe roads",
      "description": "Zimbabwe’s driving lessons have shifted from test prep to survival",
      "url": "https://abcnews.go.com/International/wireStory/driving-instructors-teach-students-dodge-danger-zimbabwe-roads-128901457",
      "published": "Sun, 04 Jan 2026 23:45:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Paris court finds 10 guilty of cyberbullying France’s first lady Brigitte Macron",
      "description": "A Paris court found 10 people guilty of cyberbullying France’s first lady Brigitte Macron",
      "url": "https://abcnews.go.com/International/wireStory/paris-court-rule-case-involving-alleged-cyberbullying-brigitte-128902658",
      "published": "Mon, 05 Jan 2026 05:20:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Photos show people in Lebanon enjoying winter weather on the slopes",
      "description": "People in Lebanon enjoyed winter weather and snow as they took to the slopes at the Mzaar-Kfardebian ski resort on Saturday. This is a photo gallery curated by AP photo editors.",
      "url": "https://abcnews.go.com/International/wireStory/photos-show-people-lebanon-enjoying-winter-weather-slopes-128899340",
      "published": "Sun, 04 Jan 2026 21:05:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korean movie star Ahn Sung-ki, dubbed 'The Nation's Actor,' dies at 74",
      "description": "South Korean film star Ahn Sung-ki, whose prolific career earned him the nickname “The Nation's Actor,” has died",
      "url": "https://abcnews.go.com/International/wireStory/prominent-south-korean-movie-star-ahn-sung-ki-128898311",
      "published": "Mon, 05 Jan 2026 04:17:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India's top court denies bail to 2 Muslim activists after 5 years in jail without trial",
      "description": "India’s Supreme Court has denied bail to two Muslim student activists, Umar Khalid and Sharjeel Imam, who have been detained for years without trial",
      "url": "https://abcnews.go.com/International/wireStory/indias-top-court-denies-bail-2-muslim-activists-128903040",
      "published": "Mon, 05 Jan 2026 04:01:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portugal’s presidential election draws 11 candidates, making a later runoff vote likely",
      "description": "A record 11 candidates have launched campaigns for Portugal's upcoming presidential election",
      "url": "https://abcnews.go.com/International/wireStory/portugals-presidential-election-draws-11-candidates-making-runoff-128884667",
      "published": "Sun, 04 Jan 2026 04:34:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A Seoul hospital says prominent South Korean movie star Ahn Sungki has died",
      "description": "A Seoul hospital says prominent South Korean movie star Ahn Sungki has died",
      "url": "https://abcnews.go.com/International/wireStory/seoul-hospital-prominent-south-korean-movie-star-ahn-128898034",
      "published": "Sun, 04 Jan 2026 19:53:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN chief condemns Israeli amendments targeting UNRWA operations",
      "description": "The UN Secretary-General has condemned amendments adopted by Israel’s Knesset to a law aimed at ceasing the operations of the UN agency assisting Palestine refugees (UNRWA), saying the measures must be immediately repealed.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166691",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "General Assembly approves $3.45 billion UN regular budget for 2026",
      "description": "The General Assembly has approved a $3.45 billion regular budget for the United Nations for 2026, following weeks of intensive negotiations and one of the Organization’s most important reform initiatives, UN80.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166685",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: General Assembly decides on 2026 UN budget",
      "description": "Follow our live coverage as the General Assembly and its Fifth Committee meet today to finalize negotiations and vote on the United Nations’ regular budget for 2026. The Fifth Committee is responsible for administrative and budgetary matters, including the Organization’s finances and staffing. UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166681",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro, wife face 'worst-case scenario' as Trump vows to govern Venezuela and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/maduro-wife-face-worst-case-scenario-trump-vows-govern-venezuela-more-top-headlines",
      "published": "Mon, 05 Jan 2026 06:13:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan leader Maduro, wife arrive at Brooklyn detention facility after capture by US forces",
      "description": "Venezuelan leader Nicolás Maduro and his wife arrived at the Metropolitan Detention Center in New York Saturday night and face drug conspiracy charges after being captured by U.S. forces Saturday.",
      "url": "https://www.foxnews.com/us/venezuelan-leader-maduro-lands-new-york-after-being-captured-us-forces-drug-conspiracy-charges",
      "published": "Sat, 03 Jan 2026 18:50:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro jailed at New York detention center that held Diddy, Ghislaine Maxwell and Sam Bankman-Fried",
      "description": "Venezuelan President Nicolás Maduro will be detained at MDC Brooklyn, the same prison housing Luigi Mangione and where Diddy and Ghislaine Maxwell were held.",
      "url": "https://www.foxnews.com/us/maduro-jailed-new-york-detention-center-held-diddy-ghislaine-maxwell-sam-bankman-fried",
      "published": "Sat, 03 Jan 2026 17:39:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US military details timeline of operation to capture Maduro, revealing more than 150 aircraft involved",
      "description": "Joint Chiefs Gen. Dan Caine provides details about the high-stakes military operation to capture Venezuelan President Nicolás Maduro that was planned for months.",
      "url": "https://www.foxnews.com/us/us-military-details-timeline-operation-capture-maduro-revealing-more-than-150-aircraft-involved",
      "published": "Sat, 03 Jan 2026 15:27:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Police seek suspect after dentist and wife found shot dead at home while 2 young children are unharmed",
      "description": "Columbus dentist Spencer Tepe and wife Monique found shot dead in their home just weeks before their fifth wedding anniversary. Two children unharmed.",
      "url": "https://www.foxnews.com/us/dentist-wife-found-shot-dead-home-2-young-children-unharmed",
      "published": "Fri, 02 Jan 2026 18:43:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fox News True Crime Newsletter: Bryan Kohberger video, Slender Man stabber's fate, Luigi Mangione trial",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-bryan-kohberger-video-slender-man-stabbers-fate-luigi-mangione-trial",
      "published": "Fri, 02 Jan 2026 16:11:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says Cuba is ‘ready to fall’ after capture of Venezuela’s Maduro",
      "description": "President Trump says Cuba is “ready to fall\" after the U.S. operation that captured Venezuela’s Nicolás Maduro, cutting off a key economic and security lifeline to Havana.",
      "url": "https://www.foxnews.com/world/trump-says-cuba-ready-fall-after-capture-venezuelas-maduro",
      "published": "Sun, 04 Jan 2026 23:51:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy reacts to Maduro arrest: US 'knows what to do next'",
      "description": "Ukrainian President Volodymyr Zelenskyy reacts to Nicolás Maduro's capture, suggesting the U.S. \"knows what to do next\" with dictators after military operation.",
      "url": "https://www.foxnews.com/world/zelenskyy-reacts-maduro-arrest-us-knows-what-do-next",
      "published": "Sun, 04 Jan 2026 08:13:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan dissident outlines risks and opportunities as Venezuela enters post-Maduro era",
      "description": "Hope emerges for Venezuela's future as experts discuss rebuilding institutions and creating stable democracy after years of authoritarian control.",
      "url": "https://www.foxnews.com/world/venezuelan-dissident-outlines-risks-opportunities-venezuela-enters-post-maduro-era",
      "published": "Sun, 04 Jan 2026 08:04:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran and Maduro ties suffer major blow following US operation and capture of Venezuelan dictator",
      "description": "Venezuela President Nicolás Maduro's capture deals devastating blow to Iran's Western Hemisphere interests, experts say, weakening Tehran's anti-American alliance in South America.",
      "url": "https://www.foxnews.com/world/iran-maduro-ties-suffer-major-blow-following-us-operation-capture-venezuelan-dictator",
      "published": "Sat, 03 Jan 2026 14:56:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What is Delta Force and what does it do? Inside the elite US Army unit that captured Maduro",
      "description": "What is Delta Force? President Donald Trump confirms the elite U.S. Army unit led the operation that captured Venezuela’s Nicolás Maduro.",
      "url": "https://www.foxnews.com/world/what-is-delta-force-what-do-they-do-inside-elite-us-army-unit-captured-maduro",
      "published": "Sat, 03 Jan 2026 14:38:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro’s fall sparks suspicion of betrayal inside Venezuela’s ruling elite",
      "description": "Maduro’s sudden removal raises questions of betrayal, military loyalty and what comes next as Venezuela braces for a dangerous fight over power.",
      "url": "https://www.foxnews.com/world/maduros-fall-sparks-suspicion-betrayal-inside-venezuelas-ruling-elite",
      "published": "Sat, 03 Jan 2026 13:09:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro gave car interview about possible Trump olive branch days before he was captured by US",
      "description": "Venezuelan leader Nicolás Maduro was captured by U.S. forces days after he discussed possible drug trafficking deal negotiations with President Donald Trump.",
      "url": "https://www.foxnews.com/world/maduro-gave-car-interview-about-possible-trump-olive-branch-days-before-he-captured-us",
      "published": "Sat, 03 Jan 2026 12:27:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "María Corina Machado, Venezuelan opposition urge military to back power transfer after Maduro capture",
      "description": "Venezuelan opposition leader María Corina Machado calls for military to abandon Maduro after President Donald Trump announced the president's capture by U.S. forces.",
      "url": "https://www.foxnews.com/world/maria-corina-machado-venezuelan-opposition-urge-military-back-power-transfer-after-maduro-capture",
      "published": "Sat, 03 Jan 2026 12:10:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}