{
  "last_updated": "2025-12-29T05:29:49.189194Z",
  "event_count": 224,
  "events": [
    {
      "title": "Trump supporters hail US strikes in Nigeria as ‘amazing Christmas present’",
      "description": "Some even celebrated ‘mass killing’ and the president’s ‘resolve’ in attacking Islamic State targets The US’s Christmas Day strikes against Islamic State targets in Nigeria have been met with praise by Donald Trump supporters who for months had been agitating for the president to respond forcefully to the killings of Christians in the country. “I can’t think of a better way to celebrate Christmas than by avenging the death of Christians through the justified mass killing of Islamic terrorists,” the far-right political activist Laura Loomer posted on X. “You’ve got to love it! Death to all Islamic terrorists! Thank you.” Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/26/trump-supporters-nigeria-airstrikes",
      "published": "Fri, 26 Dec 2025 17:50:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Israel FM accuses Palestinian Authority of aiding terror with ‘Pay-for-Slay’ after deadly attack",
      "description": "Two Israelis were killed in terrorist attacks in Israel on Friday, as officials accused the Palestinian Authority of misleading the world about its active terror payment policy.",
      "url": "https://www.foxnews.com/world/israel-fm-accuses-palestinian-authority-aiding-terror-pay-for-slay-after-deadly-attack",
      "published": "Fri, 26 Dec 2025 12:16:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 43,
      "severity_level": "Critical"
    },
    {
      "title": "Australian prime minister announces national bravery honors after antisemitic terror attack",
      "description": "Australia announced a national bravery award for heroes who confronted ISIS-inspired gunmen during a deadly Hanukkah attack that killed 15 people in Sydney.",
      "url": "https://www.foxnews.com/world/australian-pm-announces-national-bravery-honors-after-antisemitic-terror-attack",
      "published": "Thu, 25 Dec 2025 21:02:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Albanese rejects calls for federal royal commission by families of Bondi beach terror attack victims",
      "description": "Labor defends plan for faster, narrower review despite Jewish leaders and families of 11 victims demanding full national royal commission Get our breaking news email , free app or daily news podcast The Albanese government has rejected calls by families of Bondi beach terror attack victims for a federal royal commission, claiming it would “provide a platform for the worst voices” of antisemitism. The prime minister, Anthony Albanese, said a royal commission would be too slow and was not the right vehicle to investigate the attack on a Hanukah festival that killed 15 , standing by his preference for a shorter review of intelligence and law enforcement agencies – a move scorned as inadequate by leaders of the Jewish community and many federal MPs. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/29/albanese-government-rejects-calls-bondi-royal-commission-ntwnfb",
      "published": "Mon, 29 Dec 2025 04:25:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "The week in pictures: US strikes on Nigerian jihadists, AFCON 2025 and the death of Brigitte Bardot",
      "description": "Morocco hosted the ongoing Africa Cup of Nations, Russia attacked the Ukrainian capital with more than 650 drones just two days before Christmas, the US carried out strikes against militants linked to the Islamic State group (IS) in Nigeria, and the cinema world paused to remember Brigitte Bardot: FRANCE 24 looks back at the week's most striking images.",
      "url": "https://www.france24.com/en/culture/20251228-the-week-in-pictures-us-strikes-nigerian-jihadists-afcon-2025-death-brigitte-bardot",
      "published": "Sun, 28 Dec 2025 14:12:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Unsung heroes of 2025: First responders and everyday Americans who saved lives across US",
      "description": "Heroes emerged from 2025's deadliest disasters as first responders and citizens risked everything to save lives during floods, shootings and rescues.",
      "url": "https://www.foxnews.com/us/unsung-heroes-2025-first-responders-everyday-americans-who-saved-lives-across-us",
      "published": "Sun, 28 Dec 2025 10:00:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Trump launches Christmas night airstrikes on ISIS 'Terrorist Scum' in Nigeria after killings of Christians",
      "description": "Trump said the United States launched Christmas night airstrikes in Nigeria targeting ISIS militants he accused of killing Christians in recent attacks.",
      "url": "https://www.foxnews.com/world/trump-launches-christmas-night-airstrikes-isis-terrorist-scum-nigeria-after-killings-christians",
      "published": "Thu, 25 Dec 2025 18:16:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan civil war: Health system ‘on the verge of collapse’",
      "description": "The war in Sudan has been tearing the country apart for almost 1,000 days, putting the country’s health system under intolerable pressure. The World Health Organization (WHO) is reporting widespread disease outbreaks, severe shortages, malnutrition and rising deaths.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166673",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: Guterres deplores deadly mosque blast in Homs",
      "description": "UN Secretary-General António Guterres “unequivocally condemns” the deadly terrorist attack on a mosque in Homs, Syria during Friday prayers, his spokesperson said in a statement",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166674",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Africa’s Christian Crisis: How 2025’s deadly attacks finally drew global attention after Trump’s intervention",
      "description": "Christian communities in Africa reportedly under siege as Islamist groups target churches and believers across multiple countries during Christmas 2025.",
      "url": "https://www.foxnews.com/world/16m-christians-displaced-islamist-persecution-sweeps-across-africa-during-2025",
      "published": "Sun, 28 Dec 2025 08:00:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Gangs use sexual violence to control communities in Haiti",
      "description": "Jacqueline Charles of the Miami Herald reports on how gangs in Haiti are using sexual violence as a tool of terror amid the country's deepening political and humanitarian crisis.",
      "url": "https://www.npr.org/2025/12/27/nx-s1-5651322/gangs-use-sexual-violence-to-control-communities-in-haiti",
      "published": "Sat, 27 Dec 2025 17:01:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "‘My target was just to take the gun’: wounded hero Ahmed al-Ahmed speaks of saving lives at Bondi beach",
      "description": "‘I know I saved lots, but I feel sorry for the lost,’ Ahmed tells CBS News of those who died on 14 December Get our breaking news email , free app or daily news podcast Ahmed al-Ahmed, who disarmed one of the Bondi gunmen before being shot five times, says he knows his bravery saved many lives but is sad for those who were killed in the attack. In an interview with CBS News, Ahmed said he “didn’t worry about anything” except for the lives he could save as he disarmed Sajid Akram on 14 December. The act was caught on camera and shared around the world. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/29/wounded-hero-ahmed-al-ahmed-speaks-of-saving-lives-at-bondi-beach-ntwnfb",
      "published": "Mon, 29 Dec 2025 05:03:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly clashes break out in Syria after Alawite mosque bombing",
      "description": "At least four people were killed and dozens more injured during demonstrations staged by members of the Alawite minority in Syria on Sunday. The rare protests followed Friday’s deadly bombing at an Alawite mosque in the city of Homs.",
      "url": "https://www.france24.com/en/middle-east/20251228-clashes-erupt-syria-alawite-minority-protests-deadly-homs-mosque-bombing",
      "published": "Sun, 28 Dec 2025 14:29:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Hamas builds new terror regime in Gaza, recruiting teens amid problematic election",
      "description": "Hamas is recruiting teenage fighters during Gaza ceasefire after Israeli forces withdrew in October. This as national security analyst Professor Kobi Michael warns about growing militant control.",
      "url": "https://www.foxnews.com/world/hamas-builds-new-terror-regime-gaza-recruiting-teens-amid-problematic-election",
      "published": "Sun, 28 Dec 2025 21:25:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Thailand and Cambodia agree ‘immediate’ ceasefire after weeks of deadly border clashes",
      "description": "Two countries pledge in joint statement to halt all forms of attacks and further troop deployments in long-running dispute over contested territory Thailand and Cambodia have agreed to an “immediate” ceasefire, pledging to end weeks of deadly border clashes that have killed more than 100 people and displaced more than half a million on both sides. In a joint statement, the two south-east Asian neighbours said the ceasefire would take effect on Saturday at noon local time and involve “all types of weapons, including attacks on civilians, civilian objects and infrastructures, and military objectives of either side, in all cases and all areas”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/27/thailand-and-cambodia-agree-immediate-ceasefire-after-weeks-of-deadly-border-clashes",
      "published": "Sat, 27 Dec 2025 05:08:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Sri Lanka cyclone: More than a million still need aid weeks after Ditwah floods",
      "description": "Nearly a month after Cyclone Ditwah tore across Sri Lanka, more than a million people – including over half a million children – remain in urgent need of humanitarian assistance, as floods, landslides and renewed rainfall continue to compound one of the country’s worst disasters in decades.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166671",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Mexico: At least 13 killed in Oaxaca train derailment",
      "description": "Mexico's President Claudia Sheinbaum said more than 90 others were injured, some of whom remained in critical condition. An investigation is now underway.",
      "url": "https://www.dw.com/en/mexico-at-least-13-killed-in-oaxaca-train-derailment/a-75325471?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 29 Dec 2025 04:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Polls close in first phase of Myanmar elections widely condemned as a sham",
      "description": "Turnout appears low for vote in which most candidates seen as allies of junta and large areas excluded by war Polls have closed in conflict-racked Myanmar, ending the first phase of an election that has been widely condemned as a sham designed to legitimise the military junta’s rule. The military has touted the vote as a return to democracy almost five years after it seized power in a coup, ousting the country’s then de-facto leader, Aung San Suu Kyi, detaining her and sparking a spiralling civil war. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/myanmar-elections-voting-begins-under-junta-stranglehold-with-aung-san-suu-kyi-banned",
      "published": "Sun, 28 Dec 2025 13:58:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Pope Leo XIV delivers first Christmas message calling for end to violence in Middle East, Russia-Ukraine war",
      "description": "Pope Leo XIV delivers Christmas message calling for peace in Middle East and Ukraine, urging world leaders to reject violence and embrace dialogue.",
      "url": "https://www.foxnews.com/world/pope-leo-xiv-delivers-first-christmas-message-calling-end-violence-middle-east-russia-ukraine-war",
      "published": "Thu, 25 Dec 2025 08:44:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Nine people, including five children, stabbed to death in Suriname",
      "description": "Police detained the male suspect after shooting him in the leg, while two others are seriously injured.",
      "url": "https://www.bbc.com/news/articles/cp8966ew7y7o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 19:32:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Israel becomes first country to recognise Somaliland as sovereign state",
      "description": "Diplomatic breakthrough criticised by African Union, which said it could have ‘far-reaching implications for peace and stability across the continent’ Israel has become the first country to recognise Somaliland as a sovereign state, a breakthrough in its quest for international recognition since it declared independence from Somalia 34 years ago. The Israeli foreign minister, Gideon Sa’ar, announced on Friday that Israel and Somaliland had signed an agreement establishing full diplomatic relations, which would include the opening of embassies and the appointment of ambassadors. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/israel-first-country-to-recognise-somaliland-sovereign-state",
      "published": "Sat, 27 Dec 2025 02:14:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘They’re scared of us now’: how co-investment in a tropical forest saw off loggers",
      "description": "Low-cost tech and joined-up funding have reduced illegal logging, mining and poaching in the Darién Gap – it’s a success story that could stop deforestation worldwide There are no roads through the Darién Gap. This vast impenetrable forest spans the width of the land bridge between South and Central America, but there is almost no way through it: hundreds have lost their lives trying to cross it on foot. Its size and hostility have shielded it from development for millennia, protecting hundreds of species – from harpy eagles and giant anteaters to jaguars and red-crested tamarins – in one of the most biodiverse places on Earth. But it has also made it incredibly difficult to protect. Looking after 575,000 hectares (1,420,856 acres) of beach, mangrove and rainforest with just 20 rangers often felt impossible, says Segundo Sugasti, the director of Darién national park. Like tropical forests all over the world, it has been steadily shrinking, with at least 15% lost to logging, mining and cattle ranching in two decades. Continue reading...",
      "url": "https://www.theguardian.com/environment/2025/dec/25/they-are-scared-of-us-now-how-one-tropical-forest-turned-the-tide-on-loggers",
      "published": "Thu, 25 Dec 2025 15:00:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: 3 killed by security forces in Alawite protests — monitor",
      "description": "Syrian authorities said they had tried to separate two groups of protesters. Demonstrations took place in several cities in Syria after an attack on an Alawite mosque on Friday.",
      "url": "https://www.dw.com/en/syria-3-killed-by-security-forces-in-alawite-protests-monitor/a-75322331?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 15:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN peacekeeper injured in gunfire near ‘Blue Line’ in south Lebanon",
      "description": "One United Nations peacekeeper was injured on Friday after heavy machine gunfire from Israel Defense Forces (IDF) positions south of the Blue Line, following a nearby grenade explosion, impacted close to a UN patrol in southern Lebanon.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166676",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Historic vote looms in Central African Republic as UN urges peaceful participation",
      "description": "With Central Africans set to vote in presidential, legislative, regional and long-delayed municipal elections this weekend, the United Nations has appealed for calm and restraint, warning that the credibility of the process will be critical to consolidating peace after years of conflict and instability.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166665",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian president says his country is at 'total war' with the US, Israel and Europe: reports",
      "description": "Iranian President Masoud Pezeshkian says his country is at 'total war' with the U.S., Israel and Europe, claiming the conflict is more complex than Iran's 1980s war with Iraq.",
      "url": "https://www.foxnews.com/world/iranian-president-says-country-total-war-us-israel-europe",
      "published": "Sat, 27 Dec 2025 21:58:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Italian authorities arrest 9 people who allegedly used charities to funnel more than $8m to Hamas",
      "description": "Italy arrested nine people linked to three charities that allegedly funneled approximately $8.2 million to the Hamas terrorist organization.",
      "url": "https://www.foxnews.com/world/italian-authorities-arrest-9-people-who-allegedly-used-charities-funnel-more-than-8m-hamas",
      "published": "Sat, 27 Dec 2025 12:04:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Fire at Indonesia retirement home kills 16 people",
      "description": "Police say the fire at the Werdha Damai retirement home in the city of Manado killed 16 and wounded three others.",
      "url": "https://www.aljazeera.com/news/2025/12/29/fire-at-indonesia-retirement-home-kills-16-people?traffic_source=rss",
      "published": "Mon, 29 Dec 2025 04:47:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Germany news: Medical association demands home firework ban",
      "description": "The appeal came after injuries and outbreaks of violence linked to New Year’s Eve fireworks, both public and private. Meanwhile, a spate of black ice has caused numerous accidents across Germany.",
      "url": "https://www.dw.com/en/germany-news-medical-association-demands-home-firework-ban/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 17:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "North Korea says it tested long-range cruise missiles",
      "description": "North Korea says it fired long-range strategic cruise missiles into the sea to test the country’s nuclear deterrence",
      "url": "https://abcnews.go.com/International/wireStory/north-korea-tested-long-range-cruise-missiles-128740138",
      "published": "Mon, 29 Dec 2025 00:06:16 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How climate change is threatening human rights",
      "description": "With rising effects of climate change across the globe, the world has started recognising that climate change is not just an ecological collapse, but also a human rights crisis.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166649",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Industrialisation without destruction: A UN blueprint for the future",
      "description": "Since the 19th century, industrialisation has had a transformative effect on the world, both positive and negative. It has created jobs and lifted millions out of poverty. But it has also had devastating consequences; destroying ecosystems, polluting the air, and driving the climate crisis that threatens to make large parts of the planet uninhabitable.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166635",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Niger’s military rulers order ‘general mobilisation’ against armed groups",
      "description": "Military rulers expand emergency powers, warning that people, property, and services may be requisitioned.",
      "url": "https://www.aljazeera.com/news/2025/12/28/niger-military-rulers-order-general-mobilisation-against-armed-groups?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 14:23:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "US, China hail second Cambodia-Thailand ceasefire",
      "description": "Donald Trump and the Chinese foreign minister have congratulated both sides on ending months of border clashes. Since the first flare-up in May, the conflict has killed dozens and displaced hundreds of thousands.",
      "url": "https://www.dw.com/en/us-china-hail-second-cambodia-thailand-ceasefire/a-75322783?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 17:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Bundestag inquiry on Germany's COVID-19 response to conclude",
      "description": "A parliamentary inquiry has been looking into the policy decisions made to contain the coronavirus pandemic in Germany. The decisions made by key leaders from the time are being questioned.",
      "url": "https://www.dw.com/en/bundestag-inquiry-on-germany-s-covid-19-response-to-conclude/a-75283320?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 06:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "A massive crash on a highway in Japan kills 1 person and injures 26 as the holiday season starts",
      "description": "A massive crash in snowy weather has killed one person and injured 26 on an expressway in Japan",
      "url": "https://abcnews.go.com/International/wireStory/massive-crash-highway-japan-kills-1-person-injures-128713859",
      "published": "Fri, 26 Dec 2025 21:29:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "UN renews ceasefire push in Sudan",
      "description": "The UN has urged Sudan’s warring parties to pursue compromise and an immediate ceasefire, even as drone attacks, displacement and the killing of peacekeepers underscore the growing risks to civilians and humanitarians.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166675",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Overnight strikes leave death, destruction and power outages in Ukraine",
      "description": "A new wave of overnight strikes and front-line hostilities in Ukraine have caused further civilian casualties and damage to critical energy infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166664",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Myanmar elections marked by fear as UN warns civilians are coerced from all sides",
      "description": "As Myanmar approaches elections scheduled for 28 December, the UN’s top human rights official has said that civilians are being coerced from all sides – forced by the military to vote and threatened by armed opposition groups to boycott – in a climate of fear, violence and mass repression.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166662",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Trump’s peace through strength in 2025: where wars stopped and rivals came to the table",
      "description": "Trump's 2025 peace agenda produced mostly positive results with new ceasefires in Gaza and other regions, but major conflicts like Ukraine remain unresolved.",
      "url": "https://www.foxnews.com/world/trumps-peace-through-strength-2025-where-wars-stopped-rivals-came-table",
      "published": "Sat, 27 Dec 2025 07:00:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the wildest place I have walked’: new national park will join up Chile’s 2,800km wildlife corridor",
      "description": "Government poised to officially protect 200,000 hectares of remote Patagonian coastline and forest Chile’s government is poised to create the country’s 47th national park, protecting nearly 200,000 hectares (500,000 acres) of pristine wilderness and completing a wildlife corridor stretching 1,700 miles (2,800km) to the southernmost tip of the Americas. The Cape Froward national park is a wild expanse of wind-torn coastline and forested valleys that harbours unrivalled biodiversity and has played host to millennia of human history. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/25/cape-froward-new-national-park-patagonia-chile",
      "published": "Thu, 25 Dec 2025 12:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Kim oversees cruise missile launch as North Korea touts nuclear readiness",
      "description": "North Korean leader Kim Jong-un oversaw the launch of long-range strategic cruise missiles on Sunday, state media said, as Pyongyang stepped up military activity it says is aimed at reinforcing its nuclear deterrent amid what it calls growing security threats.",
      "url": "https://www.france24.com/en/asia-pacific/20251229-kim-oversees-cruise-missile-launch-as-north-korea-touts-nuclear-readiness",
      "published": "Mon, 29 Dec 2025 03:48:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "'Massive numbers' of police to be deployed for Sydney New Year's Eve celebrations",
      "description": "People in Sydney have been urged to show \"defiance\" and celebrate New Year's Eve in the wake of the deadly terror attack in Bondi Beach earlier this month.",
      "url": "https://news.sky.com/story/massive-numbers-of-police-to-be-deployed-for-sydney-new-years-eve-celebrations-13488128",
      "published": "Sun, 28 Dec 2025 20:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Security Council remains divided over Iran nuclear programme, sanctions stay in place",
      "description": "At a meeting to discuss nuclear non-proliferation on Tuesday, the Security Council’s stance on Iran’s nuclear activities remained divided on the issue, split between those who support the reinstatement of sanctions, and the members who believe the sanctions should be permanently lifted, whilst questioning the legality of the meeting itself.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166660",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Security Council meets on Venezuela, Iran, Somalia",
      "description": "The Security Council convened earlier today for a packed agenda, adopting a resolution extending the authorisation of the African Union support mission in Somalia (AUSSOM) and hearing a briefing on Iran and the implementation of resolution 2231, which endorsed the 2015 nuclear deal known as the Joint Comprehensive Plan of Action (JCPOA). Members are set to reconvene at 3 pm for an emergency meeting requested by Venezuela, amid heightened tensions between Caracas and Washington. Assistant Secretary-General for Political Affairs Khaled Khiari is expected to brief ambassadors. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166656",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "John Simpson: 'I've reported on 40 wars but I've never seen a year like 2025'",
      "description": "2025 has been a year of multiple major conflicts and it is becoming clear that one of them has geopolitical implications of unparalleled importance.",
      "url": "https://www.bbc.com/news/articles/cj4qp17e1lqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 29 Dec 2025 03:03:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UN Security Council hears warnings over escalating US-Venezuela standoff",
      "description": "Tensions between the United States and Venezuela have sharply escalated amid increased US military operations in the Southern Caribbean, prompting accusations of sovereignty violations, concerns over civilian harm and growing calls at the UN Security Council for restraint and de-escalation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166668",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Zelenskyy says Ukraine, ahead of Trump meeting, is 'willing to do whatever it takes' to end war with Russia",
      "description": "Russian drone and missile attack on Kyiv reportedly kills one, injures 27 as Ukraine's president prepares for crucial Trump meeting with peace proposal.",
      "url": "https://www.foxnews.com/world/zelenskyy-says-fresh-russian-attack-ukraine-shows-putins-true-attitude-ahead-trump-meeting",
      "published": "Sat, 27 Dec 2025 08:32:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "China launches live-fire drills encircling Taiwan",
      "description": "Taipei condemns exercise that Chinese army calls ‘a stern warning against “Taiwan independence” separatist forces and external interference forces’ China has launched live-fire military drills around Taiwan, in what it calls a warning to “separatist” forces in Taiwan and “external interference” by foreign parties. The People’s Liberation Army (PLA) – the military wing of the ruling Communist party in China – said it had sent naval, air force and rocket forces to surround Taiwan on Monday morning. Chinese coast guard vessels were also sent out to conduct “law enforcement inspections” at sea around Taiwan. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/china-live-fire-military-drills-around-taiwan",
      "published": "Mon, 29 Dec 2025 03:49:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "For Ukrainians, a nuclear missile museum is a bitter reminder of what the country gave up",
      "description": "The Museum of Strategic Missile Forces tells the story of how Ukraine dismantled its nuclear weapons arsenal after independence in 1991. Today many Ukrainians believe that decision to give up nukes was a mistake.",
      "url": "https://www.npr.org/2025/12/28/g-s1-103485/ukraine-museum-strategic-missile-forces-budapest-agreement",
      "published": "Sun, 28 Dec 2025 05:02:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "7.0-magnitude earthquake rattles Taiwan",
      "description": "The quake struck off Taiwan's northeastern coast, and shook buildings in the capital, Taipei.",
      "url": "https://www.dw.com/en/7-0-magnitude-earthquake-rattles-taiwan/a-75317087?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 15:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "'She was a cultural earthquake': Brigitte Bardot dies at 91",
      "description": "French film legend Brigitte Bardot has died at 91, the Bardot foundation announced on Sunday (December 28). Bardot starred in more than 50 movies during her career before becoming an animal rights activist and embracing far-right views. FRANCE 24's Manon Kerjean tells us more. \"In her later years, Bardot became increasingly controversial due to her outspoken and radical political statements\".",
      "url": "https://www.france24.com/en/video/20251228-she-was-a-cultural-earthquake-brigitte-bardot-dies-at-91",
      "published": "Sun, 28 Dec 2025 13:52:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "The harsh reality of life in Gaza under US-backed ceasefire",
      "description": "Warning: This article contains images and descriptions some people may find distressing",
      "url": "https://news.sky.com/story/airstrikes-shootings-hypothermia-the-harsh-reality-of-life-in-gaza-under-us-backed-ceasefire-13487924",
      "published": "Sat, 27 Dec 2025 21:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Major cities see violent crime surge as national rates plummet significantly in 2025: survey",
      "description": "New survey reveals violent crime rose in major U.S. cities despite nationwide decline, with some areas reporting increases in homicides and assaults.",
      "url": "https://www.foxnews.com/us/major-cities-see-violent-crime-surge-national-rates-plummet-significantly-2025-survey",
      "published": "Sun, 28 Dec 2025 16:00:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Major winter storm sweeps across Nordic states",
      "description": "A falling branch killed one person near a Swedish ski resort. Thousands of homes in Finland, Sweden and Norway were left without power.",
      "url": "https://www.dw.com/en/major-winter-storm-sweeps-across-nordic-states/a-75317472?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 20:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sudan's resilience at AFCON rewarded with first win",
      "description": "Sudan get first AFCON win since 2012 despite having to prepare during conflict at home",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251228-sudan-s-resilience-at-afcon-rewarded-with-first-win",
      "published": "Sun, 28 Dec 2025 23:18:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "A magnitude 6.6 earthquake strikes off the coast of Taiwan",
      "description": "The U.S. Geological Survey says a magnitude 6.6 earthquake has hit Taiwan just off its northeast coast",
      "url": "https://abcnews.go.com/International/wireStory/magnitude-66-earthquake-strikes-off-coast-taiwan-128723667",
      "published": "Sat, 27 Dec 2025 14:36:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Crime lords turn Motor City into car-theft supermarket for Middle East buyers: ‘Somebody's getting paid’",
      "description": "International organized crime groups are recruiting juveniles to steal vehicles in Detroit before shipping them to the Middle East, alarming law enforcement officials.",
      "url": "https://www.foxnews.com/us/crime-lords-turn-motor-city-car-theft-supermarket-middle-east-buyers-somebodys-getting-paid",
      "published": "Sat, 27 Dec 2025 08:00:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Central African Republic goes to polls as president seeks third term",
      "description": "Opposition hopes to tap into frustrations of people living in country where conflict remains a daily reality Central African Republic goes to the polls on Sunday with the president, Faustin-Archange Touadéra, seeking a third term. As many as 2.3 million registered voters will cast ballots for what observers are calling a quadruple election: votes for the presidency and parliament as well as local and municipal offices. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/central-african-republic-goes-to-polls-as-president-seeks-third-term",
      "published": "Sun, 28 Dec 2025 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela says it released 99 people detained for 2024 election protests",
      "description": "Government said the move was due to its ‘unrestricted respect for human rights’ in the face of US aggression Venezuela has said it has carried out its largest release of political prisoners this year, claiming to have freed 99 people detained for taking part in protests after the 2024 election, widely believed to have been stolen by the dictator Nicolás Maduro , as it comes under increasing military pressure from the US. Civil society organisations have treated the news with caution and stressed that the releases were insufficient, noting that at least 900 political prisoners remain in the country. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/venezuela-political-prisoner-release",
      "published": "Fri, 26 Dec 2025 14:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "North Korea tests long-range cruise missiles: state media",
      "description": "Kim Jong Un personally oversaw the launching drill for new long‑range cruise missiles, according to state media. The test marks the latest flashpoint in tensions over Pyongyang's expanding nuclear ambitions.",
      "url": "https://www.dw.com/en/north-korea-tests-long-range-cruise-missiles-state-media/a-75324531?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 23:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Myanmar holds election - but critics call it a 'sham' vote",
      "description": "Yangon is Myanmar's beating heart. The bustle of busy market stalls and sight of glittering Buddhist monuments are a vision of the country those in power want the world to see.",
      "url": "https://news.sky.com/story/myanmars-ruling-junta-says-election-will-provide-path-to-peace-as-polls-open-but-opponents-criticise-sham-vote-13487942",
      "published": "Sat, 27 Dec 2025 22:55:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "At least 3 dead, including 1-year-old, in building collapse in South Africa",
      "description": "Three people, including a child, have died after a two-story building collapsed in Soweto, South Africa",
      "url": "https://abcnews.go.com/International/wireStory/building-collapse-south-africa-kills-people-including-1-128729932",
      "published": "Sun, 28 Dec 2025 06:48:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Kosovo voters cast ballots in a second attempt this year to elect a government and avoid more crisis",
      "description": "Voters in Kosovo are casting ballots in an early parliamentary election in hopes of ending a political stalemate that has gripped the small Balkan country for much of this year",
      "url": "https://abcnews.go.com/International/wireStory/kosovo-voters-cast-ballots-attempt-year-elect-government-128729370",
      "published": "Sun, 28 Dec 2025 03:21:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "A knife attack outside Suriname’s capital Paramaribo kills at least 9 people, police say",
      "description": "A knife attack outside Suriname’s capital of Paramaribo left at least nine people dead, police said Sunday",
      "url": "https://abcnews.go.com/International/wireStory/knife-attack-surinames-capital-paramaribo-kills-9-people-128735083",
      "published": "Sun, 28 Dec 2025 12:49:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Pakistan summons UK diplomat over a threat to army chief during a rally",
      "description": "Pakistan has summoned Britain’s deputy high commissioner after a viral video showed a woman at a rally in the city of Bradford saying the Pakistani army chief would die in a possible attack",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-summons-uk-diplomat-threat-army-chief-rally-128706850",
      "published": "Fri, 26 Dec 2025 11:45:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza aid restrictions, Syria humanitarian needs, lawyer reprisals in Burundi",
      "description": "The UN and partners continue to provide assistance to people in Gaza, where recent winter storms have worsened conditions for thousands across the enclave.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166663",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "China holds military drills around Taiwan as warning to 'separatist forces'",
      "description": "The drills come days after the US announced the sale of one of its largest weapons packages to Taiwan.",
      "url": "https://www.bbc.com/news/articles/c87l7xjp235o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 29 Dec 2025 04:14:11 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Three killed in Sweden as major storm sweeps across Nordic countries",
      "description": "Thousands of homes in parts of Finland, Sweden and Norway have been left without power.",
      "url": "https://www.bbc.com/news/articles/cdj817m37rgo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 13:22:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Cruise ship hits reef on first trip since leaving passenger on island",
      "description": "The Coral Adventurer is under investigation for the death of Suzanne Rees, who was found dead on a remote island after being left behind by the ship.",
      "url": "https://www.bbc.com/news/articles/cd9z1k4g40jo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 04:35:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "China launches drills around Taiwan in ‘stern warning’ to external forces",
      "description": "Beijing to impose sea, air restrictions for 10 hours, starting at 00:00 GMT on Tuesday, in five zones around Taiwan.",
      "url": "https://www.aljazeera.com/news/2025/12/29/china-to-stage-drills-around-taiwan-in-stern-warning-to-external-forces?traffic_source=rss",
      "published": "Mon, 29 Dec 2025 02:44:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Javad Zarif: Main threat to the Middle East is Israel, not Iran",
      "description": "Iran’s former foreign minister argues Israel, backed by the US, has killed every opportunity for peace.",
      "url": "https://www.aljazeera.com/video/the-bottom-line/2025/12/28/javad-zarif-main-threat-to-the-middle-east-is-israel-not-iran?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 14:43:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Passengers on cruise ship that ran aground off PNG to be flown home after refloat efforts fail",
      "description": "Coral Adventurer, being investigated for allegedly leaving behind passenger who died, ran aground with 124 people on board on Saturday Get our breaking news email , free app or daily news podcast An Australian cruise ship remains stuck on a reef off Papua New Guinea despite efforts to free it, with passengers set to be flown home early. The Coral Adventurer, which ran aground on Saturday morning , was already under investigation as a result of an unrelated incident in October, in which a passenger died after being allegedly left behind on an island. It was on its first voyage since the passenger’s death when it ran aground. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/passengers-on-cruise-ship-that-ran-aground-off-png-to-be-flown-home-after-refloat-efforts-fail",
      "published": "Mon, 29 Dec 2025 03:47:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Chinese military plans drills around Taiwan to warn against 'external interference'",
      "description": "It calls the move a “stern warning” against separatist and “external” forces.",
      "url": "https://abcnews.go.com/International/wireStory/chinese-military-stage-drills-taiwan-warn-external-forces-128741263",
      "published": "Sun, 28 Dec 2025 21:18:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Libya mourns military chief killed in Turkey plane crash",
      "description": "Hundreds of people have mourned western Libya’s military chief and four others killed in a plane crash in Turkey",
      "url": "https://abcnews.go.com/International/wireStory/libya-mourns-military-chief-killed-turkey-plane-crash-128731394",
      "published": "Sun, 28 Dec 2025 10:17:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Christmas target practice turns deadly as stray bullet kills Oklahoma woman sitting on porch",
      "description": "Oklahoma man allegedly fired bullet during Christmas Day target practice that fatally struck woman on porch, authorities say.",
      "url": "https://www.foxnews.com/us/christmas-target-practice-turns-deadly-stray-bullet-kills-oklahoma-woman-sitting-porch",
      "published": "Sun, 28 Dec 2025 05:04:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Murder in small-town America: The crimes that tore quiet communities apart in 2025",
      "description": "Small towns across the United States faced shocking violence in 2025, exposing deep vulnerabilities in quiet communities from Mississippi to Montana.",
      "url": "https://www.foxnews.com/us/murder-small-town-america-crimes-tore-quiet-communities-apart-2025",
      "published": "Sat, 27 Dec 2025 14:00:39 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "North Korea’s Kim oversees test launch of long-range cruise missiles",
      "description": "Kim urges 'unlimited and sustained' development of nuclear combat forces as North Korea gears up for key party congress.",
      "url": "https://www.aljazeera.com/news/2025/12/29/n-koreas-kim-oversees-test-launch-of-long-range-cruise?traffic_source=rss",
      "published": "Mon, 29 Dec 2025 00:31:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Grave fears for woman missing in SA outback for 16 days as search renewed",
      "description": "Police are expanding aerial searches near where the abandoned car of 41-year-old Trisha Graf was found Get our breaking news email , free app or daily news podcast South Australian police hold grave fears for a woman missing in the outback for 16 days and have renewed search efforts near where her car was found abandoned. Trisha Graf was last seen in the early hours of Friday 12 December in the Roxby Downs area, 510km north of Adelaide. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/29/woman-missing-outback-australia-search-renewed",
      "published": "Mon, 29 Dec 2025 02:03:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "M 6.0 - 2025 Taitung, Taiwan Earthquake",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VI Time 2025-12-24 09:47:06 UTC 2025-12-24 09:47:06 UTC at epicenter Location 22.851°N 121.207°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rkjm",
      "published": "2025-12-27T15:33:29.814Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "China conducts large-scale Taiwan drills amid rising tensions",
      "description": "China mobilised army, naval, air force and artillery units around Taiwan on Monday for its \"Justice Mission 2025\" exercises. Taipei responded by deploying troops to rehearse repelling a potential Chinese attack, underscoring the island's commitment to defending democracy amid escalating regional tensions.",
      "url": "https://www.france24.com/en/asia-pacific/20251229-china-conducts-large-scale-taiwan-drills-amid-rising-tensions",
      "published": "Mon, 29 Dec 2025 03:24:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Saudi-led coalition in Yemen warns UAE-backed separatists of immediate action",
      "description": "The Saudi-led coalition in Yemen has warned it will respond immediately to any military movements of separatists backed by the United Arab Emirates that undermine de-escalation efforts in the south, as the United States urged diplomacy",
      "url": "https://abcnews.go.com/International/wireStory/saudi-led-coalition-yemen-warns-uae-backed-separatists-128717707",
      "published": "Sat, 27 Dec 2025 06:49:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Mexico train crash kills 13 and injures almost 100",
      "description": "An investigation is under way after the train derailed as it rounded a bend near the town of Nizanda.",
      "url": "https://www.bbc.com/news/articles/cx2328e70y7o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 29 Dec 2025 02:15:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump, Zelenskyy hail progress towards Russia-Ukraine peace deal",
      "description": "Trump says Moscow and Kyiv 'closer than ever' to peace despite lack of breakthrough on outstanding issue of territory.",
      "url": "https://www.aljazeera.com/news/2025/12/28/trump-welcomes-zelenskyy-claims-russia-ukraine-truce-in-final-stages?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 21:06:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump, Zelensky say Ukraine peace deal edging closer but key issues unresolved",
      "description": "US President Donald Trump said on Sunday that talks with Ukrainian President Volodymyr Zelensky were moving “very close” to an agreement to end the war in Ukraine, though both leaders acknowledged that major sticking points, including territory and security guarantees, remain unresolved.",
      "url": "https://www.france24.com/en/americas/20251228-trump-zelensky-say-ukraine-peace-deal-closer-key-issues-unresolved",
      "published": "Sun, 28 Dec 2025 22:59:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Reactions to the death of French film legend Brigitte Bardot",
      "description": "Tributes to Brigitte Bardot, ‍an icon of French ​cinema, poured in on Sunday (December 28) following the announcement of her death at the age of 91.",
      "url": "https://www.france24.com/en/video/20251228-reactions-to-the-death-of-french-film-legend-brigitte-bardot",
      "published": "Sun, 28 Dec 2025 15:34:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "'One or two thorny issues' remain after Ukraine peace deal talks, Trump says",
      "description": "Donald Trump and Volodymyr Zelenskyy say they have made \"a lot of progress\" towards finalising a peace agreement to end Russia's war in Ukraine - although \"one or two very thorny issues\" remain.",
      "url": "https://news.sky.com/story/ukraine-a-lot-closer-to-peace-deal-after-talks-donald-trump-says-but-one-or-two-thorny-issues-remain-13488138",
      "published": "Sun, 28 Dec 2025 21:37:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Protesting students in Serbia urge support for early election they hope will oust Vucic",
      "description": "Protesting university students in Serbia have collected signatures throughout the country for their request for an early parliamentary election",
      "url": "https://abcnews.go.com/International/wireStory/protesting-students-serbia-urge-support-early-election-hope-128730710",
      "published": "Sun, 28 Dec 2025 08:33:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Annette Dionne, last surviving Dionne quintuplet, dies aged 91",
      "description": "The sisters, who were the first known quintuplets to survive past infancy, became a global phenomenon after their 1934 birth.",
      "url": "https://www.bbc.com/news/articles/cpvd90k2zn4o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 22:24:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "In pictures: The life and career of Brigitte Bardot",
      "description": "The French actress redefined cinematic allure, captivating the world before championing animal rights.",
      "url": "https://www.bbc.com/news/articles/c20p78kp8pgo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 10:18:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Kyrgios beats Sabalenka 6-3, 6-3: ‘Battle of the Sexes’ – as it happened",
      "description": "All the updates as the Australian maverick defeats the women's world number one in an exhibition tennis match in Dubai.",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/12/28/live-sabalenka-vs-kyrgios-battle-of-the-sexes-tennis-match?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 13:20:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Central African Republic holds elections, President Touadera seeks third term",
      "description": "The President of the Central African Republic is vying for a controversial third term as polling begins in the country. Central Africans are also voting for their legislative, regional and municipal representatives.",
      "url": "https://www.dw.com/en/central-african-republic-holds-elections-president-touadera-seeks-third-term/a-75319473?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 07:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "First Person: Felipe Paullier, the youngest ever senior UN official, charged with giving a voice to young people around the world",
      "description": "A paediatrician by training, Felipe Paullier has long been an advocate for youth. Formerly Director of the Uruguayan Government's Youth Institute, a role which involved several joint actions with various UN agencies, he was appointed to run the UN Youth Office in 2023, the youngest senior appointment in United Nations history.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166651",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Paper and wood: Forest products show signs of recovery, UN agency says",
      "description": "From wood-based panels used in construction, to charcoal for cooking food, forest products are valued and traded all around the world.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166666",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian cinema giant, Bahram Beyzai, dies aged 87",
      "description": "A restored copy of his film, Bashu, the Little Stranger, won an award at this year's Venice Film Festival.",
      "url": "https://www.bbc.com/news/articles/cde61jz5653o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 12:25:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "All the countries Israel attacked in 2025: Animated map",
      "description": "Israel has carried out attacks in Palestine, Lebanon, Iran, Syria, Qatar and Yemen, as well as in maritime waters.",
      "url": "https://www.aljazeera.com/news/longform/2025/12/29/all-the-countries-israel-attacked-in-2025-animated-map?traffic_source=rss",
      "published": "Mon, 29 Dec 2025 05:16:43 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,404",
      "description": "These are the key developments from day 1,404 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2025/12/29/russia-ukraine-war-list-of-key-events-day-1404?traffic_source=rss",
      "published": "Mon, 29 Dec 2025 01:54:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Weather tracker: Deep freeze grips Canada as US records warmest Christmas",
      "description": "Temperatures plunge below -50C in the Yukon, while swaths of US experience springlike weather Northern Canada has been gripped by an intense and prolonged cold spell, with temperatures hovering between -20C and -40C for weeks. On Tuesday, Braeburn in the Yukon recorded -55.7C, its coldest December temperature since 1975. Meanwhile, Mayo and Dawson endured 16 consecutive nights below -40C, with Mayo plunging to -50.4C on Monday. Whitehorse also recorded 10 nights when temperatures dropped below -30C. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/weather-tracker-deep-freeze-canada-us-records-warmest-christmas",
      "published": "Fri, 26 Dec 2025 11:52:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. ramps up Ukraine diplomacy as Zelensky meets Trump",
      "description": "President Trump hosts Zelensky amid intensified U.S. diplomacy aimed at ending Russia's war in Ukraine.",
      "url": "https://www.npr.org/2025/12/28/nx-s1-5659766/u-s-ramps-up-ukraine-diplomacy-as-zelensky-meets-trump",
      "published": "Sun, 28 Dec 2025 17:18:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Crime fears drive South America's sharp turn to the right",
      "description": "From tough-on-crime politics to uneasy ties with Washington, Latin America's year-end story is one of a decisive rightward turn, insecurity at home and a more complicated relationship with the US.",
      "url": "https://www.npr.org/2025/12/28/nx-s1-5649865/crime-fears-drive-south-americas-sharp-turn-to-the-right",
      "published": "Sun, 28 Dec 2025 08:07:12 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea junta leader Doumbouya expected to win election",
      "description": "Doumbouya, who seized power in a 2021 coup, faces weak opposition as UN warns of intimidation and restricted freedoms ahead of the vote.",
      "url": "https://www.dw.com/en/guinea-junta-leader-doumbouya-expected-to-win-election/a-75318988?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 07:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Myanmar's military junta holds controversial election",
      "description": "Civil war-torn Myanmar went to the polls on Sunday in a three-phased election. Critics say the political exercise is a ploy to keep the military's grip on power.",
      "url": "https://www.dw.com/en/myanmar-s-military-junta-holds-controversial-election/a-75318714?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 03:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Analyst: Trump ’delusional’ if he thinks Putin is serious about ending war in Ukraine",
      "description": "US President Donald Trump is “delusional” if he thinks that his Russian counterpart Vladimir Putin is serious about wanting to end the war in Ukraine any time soon, Melinda Haring, a senior analyst at the Atlantic Council’s Eurasia Center, told FRANCE 24.",
      "url": "https://www.france24.com/en/video/20251228-analyst-trump-delusional-if-he-thinks-putin-is-serious-about-ending-war-in-ukraine",
      "published": "Sun, 28 Dec 2025 19:44:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "War in Ukraine: 'Sometimes you feel like the end is close, but every day it feels like far away'",
      "description": "Volodymyr Zelensky is set to meet US President Donald Trump in Florida on Sunday (December 28) to discuss a 20-point peace plan aimed at ending Russia’s invasion. Ukrainian civilians are amongst those who have suffered most from Russia's war especially vulnerable populations. For more on that topic, FRANCE 24's Erin Ogunkeye is joined by Oleksii Starovierov, networks engineer at Chernihiv Rehabilitation Center for children with disabilities.",
      "url": "https://www.france24.com/en/video/20251228-war-in-ukraine-sometimes-you-feel-like-the-end-is-close-but-every-day-it-feels-like-far-away",
      "published": "Sun, 28 Dec 2025 13:21:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian president Zelensky to meet with Trump in Florida",
      "description": "Ukrainian President Volodymyr Zelensky will sit down with US President Donald Trump on Sunday (December 28) and seek to secure his stamp of approval for a new proposal to end the nearly four-year conflict with Russia.",
      "url": "https://www.france24.com/en/video/20251228-ukrainian-president-zelensky-to-meet-with-trump-in-florida",
      "published": "Sun, 28 Dec 2025 12:44:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "It's easy to get lost in multi-point plans and spin - but Zelenskyy's reaction to Trump said it all",
      "description": "Not going backwards is a win. Given Donald Trump's fraught relationship with Volodymyr Zelenskyy, that's important.",
      "url": "https://news.sky.com/story/its-easy-to-get-lost-in-multi-point-plans-and-spin-but-zelenskyys-reaction-to-trump-said-it-all-13488169",
      "published": "Mon, 29 Dec 2025 02:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Florida bell ringer allegedly tries to 'impale' store manager with donation tripod while drunk",
      "description": "Drunken bell ringer Steven Pavlik, 63, allegedly attacked a Publix manager with a tripod after confronting shoppers outside a Stuart, Florida, store location.",
      "url": "https://www.foxnews.com/us/florida-bell-ringer-allegedly-tries-impale-store-manager-donation-tripod-drunk",
      "published": "Sat, 27 Dec 2025 17:03:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Texas father rescues kidnapped daughter by tracing her phone's location, sheriff's office says",
      "description": "The Montgomery County Sheriff's Office said a father in Texas found his kidnapped 15-year-old daughter on Christmas Day by tracing her phone's location.",
      "url": "https://www.foxnews.com/us/texas-father-rescues-kidnapped-daughter-tracing-her-phones-location-sheriffs-office-says",
      "published": "Sat, 27 Dec 2025 13:36:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "California family revives beloved Christmas tradition with surprise sleepover visit",
      "description": "A California family surprised grandparents with a heartwarming Christmas sleepover at home, reviving a 25-year tradition in a viral video.",
      "url": "https://www.foxnews.com/us/california-family-revives-beloved-christmas-tradition-surprise-sleepover-visit",
      "published": "Fri, 26 Dec 2025 21:17:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump meets with Zelenskyy; talks could unlock first Zelenskyy-Putin call in five years: source",
      "description": "President Donald Trump assumes mediator role as talks with President Volodymyr Zelenskyy focus on a U.S.-backed 20-point peace plan that could end the war in Ukraine.",
      "url": "https://www.foxnews.com/world/trump-meets-zelenskyy-talks-could-unlock-first-zelenskyy-putin-call-five-years-source",
      "published": "Sun, 28 Dec 2025 16:30:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK flag clash as foreign banners fly, citizens push back against woke policies reshaping Britain",
      "description": "New polling reveals deep splits over Union Jack symbolism as Britain's changing demographics fuel heated debate about national flags and identity.",
      "url": "https://www.foxnews.com/world/uk-flag-clash-foreign-banners-fly-citizens-push-back-against-woke-policies-reshaping-britain",
      "published": "Sun, 28 Dec 2025 11:57:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Stabbing spree, chemical attack at Japan factory injures 15",
      "description": "A 38-year-old male suspect is in custody following an alleged stabbing spree and chemical attack at a Yokohama Rubber Co. tire factory in central Japan.",
      "url": "https://www.foxnews.com/world/stabbing-spree-chemical-attack-japan-factory-injures-15",
      "published": "Sat, 27 Dec 2025 09:50:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump to press Netanyahu on stalled Gaza ceasefire, Iran and Lebanon",
      "description": "US President Donald Trump is expected to push for progress on the faltering Gaza ceasefire when he meets Israeli Prime Minister Benjamin Netanyahu on Monday, with talks also set to cover Israel’s security concerns over Hezbollah in Lebanon and Iran.",
      "url": "https://www.france24.com/en/middle-east/20251228-trump-to-press-netanyahu-on-stalled-gaza-ceasefire",
      "published": "Sun, 28 Dec 2025 23:34:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Kosovo's ruling party wins election after months of political deadlock",
      "description": "The decisive victory for the Albanian nationalist Vetevendosje party means a third term for leader Albin Kurti.",
      "url": "https://www.bbc.com/news/articles/ce3z3w4wy0go?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 29 Dec 2025 00:27:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Spaniards hurl flour, eggs and fireworks in mock battle",
      "description": "The annual food fight festival ''Els Enfarinats'' has left the Spanish town of Ibi covered in flour and egg shells.",
      "url": "https://www.bbc.com/news/videos/c05834pp6jno?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 17:10:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Protests turn deadly during demonstration in Syrian city of Latakia",
      "description": "Fighting has broken out at a demonstration in the city of Latakia in Syria, killing at least three people.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/28/protests-turn-deadly-during-demonstration-in-syrian-city-of-latakia?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 14:26:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Snow storm blankets New York City, disrupting holiday travel",
      "description": "Thousands of flights were cancelled or delayed during the busy travel period between Christmas and New Year's Eve. Forecasters said the worst of the storm had passed and conditions were set to clear.",
      "url": "https://www.dw.com/en/snow-storm-blankets-new-york-city-disrupting-holiday-travel/a-75318333?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 00:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "The man saving Lebanon's cinema history, a poster at a time",
      "description": "In a country without film archives, one man is preserving Lebanon's film industry history. With thousands of movie posters, Abboudi Bou Jaoude is saving cinematic heritage in an archive that's emotional for many.",
      "url": "https://www.dw.com/en/the-man-saving-lebanon-s-cinema-history-a-poster-at-a-time/a-75312263?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 20:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Kosovo's Prime Minister Kurti set for second term after decisive election win",
      "description": "Kosovo’s Prime Minister Albin Kurti looked poised to secure another term on Sunday after his Self-Determination party won a snap parliamentary election by a wide margin, preliminary results showed, ending months of political deadlock in the Balkan country.",
      "url": "https://www.france24.com/en/europe/20251228-kosovo-prime-minister-kurti-election-win",
      "published": "Sun, 28 Dec 2025 23:11:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Algeria confirm qualification, Ivory Coast and Cameroon stay level",
      "description": "Today saw the final matches of the second round of group stage games. In group E, Equatorial Guinea lost to Sudan after an own goal by the National Thunder's Saul Coco. Algeria meanwhile got their ticket to the knockout stages thanks to a converted penalty in the first half. In group F, Gabon and Mozambique exchanged a flurry of shots on goal, in the end it was disappointment for Gabon as the Mambas won 3-2. Finally, Ivory Coast and Cameroon battled it out for the top of their group, but stayed level in a very tight game.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251228-algeria-confirm-qualification-ivory-coast-and-cameroon-stay-level",
      "published": "Sun, 28 Dec 2025 22:47:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Israel criticised after becoming first country to formally recognise Somaliland as independent nation",
      "description": "Israel has been criticised after it became the first country to formally recognise Somalia's breakaway region of Somaliland as an independent nation.",
      "url": "https://news.sky.com/story/israel-criticised-after-becoming-first-country-to-formally-recognise-somaliland-as-independent-nation-13487923",
      "published": "Sat, 27 Dec 2025 20:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Russia sends 3 Iranian satellites into orbit, report says",
      "description": "Iran's state television says that Russia has sent three Iranian communications satellites into orbit",
      "url": "https://abcnews.go.com/International/wireStory/russia-sends-3-iranian-satellites-orbit-report-128733142",
      "published": "Sun, 28 Dec 2025 10:33:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea votes in first election since 2021 coup with junta leader expected to win",
      "description": "Guineans are voting to elect a new president in the country’s first election since a 2021 coup",
      "url": "https://abcnews.go.com/International/wireStory/guinea-votes-election-2021-coup-junta-leader-expected-128729618",
      "published": "Sun, 28 Dec 2025 03:21:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Polls open in Central African Republic elections with incumbent president likely to win third term",
      "description": "Voters in the Central African Republic are electing a new president and federal lawmakers",
      "url": "https://abcnews.go.com/International/wireStory/polls-open-central-african-republic-elections-incumbent-president-128729624",
      "published": "Sun, 28 Dec 2025 03:21:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Charlie Kirk’s killing, Idaho murders plea and Karen Read verdict: Inside 2025’s biggest crime moments",
      "description": "From assassination plots to brutal murders, 2025's most captivating cases revealed shocking twists in crimes that dominated news cycles nationwide.",
      "url": "https://www.foxnews.com/us/charlie-kirk-killing-idaho-murders-plea-karen-read-verdict-inside-2025-biggest-crime-moments",
      "published": "Sun, 28 Dec 2025 14:00:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Israel becomes first country to recognize Somaliland; Trump 'not ready'",
      "description": "Israel became the first country to officially recognize Somaliland as an independent nation in a historic diplomatic move tied to the Abraham Accords framework.",
      "url": "https://www.foxnews.com/world/israel-becomes-first-country-recognize-somaliland-trump-not-ready",
      "published": "Fri, 26 Dec 2025 18:42:07 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "When Palestinian existence is portrayed as hate",
      "description": "Israel and its supporters would have you believe that just being a Palestinian is a lethal threat.",
      "url": "https://www.aljazeera.com/opinions/2025/12/28/when-palestinian-existence-is-portrayed-as-hate?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 18:07:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syria protests updates: Deadly clashes erupt as hundreds demonstrate",
      "description": "Hundreds of people take to the streets in Tartous and Latakia to demand the release of former soldiers.",
      "url": "https://www.aljazeera.com/news/liveblog/2025/12/28/syria-protests-live-deadly-clashes-erupt-as-thousands-demonstrate?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 13:57:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US-Israel ties: What Netanyahu and Trump will discuss in Florida",
      "description": "Trump to host Netanyahu at Mar-a-Lago amid Washington's push for phase two of Gaza ceasefire as strategy gaps grow.",
      "url": "https://www.aljazeera.com/news/2025/12/28/netanyahu-is-set-to-visit-trump-again-what-to-expect?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 13:28:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza storm kills Palestinian woman as Israeli curbs on aid compound misery",
      "description": "Extreme weather leaves thousands homeless as tents collapse amid strong wind and heavy rain.",
      "url": "https://www.aljazeera.com/news/2025/12/28/gaza-storm-kills-palestinian-woman-as-israeli-curbs-on-aid-compound-misery?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 13:20:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Do Trump's claims about Christian persecution in Nigeria match reality?",
      "description": "Aaron Zelin, a senior fellow at the Washington Institute for Near East Policy, analyzes the U.S. strike on ISIS targets in Nigeria and the message it sends.",
      "url": "https://www.npr.org/2025/12/28/nx-s1-5659769/do-trumps-claims-about-christian-persecution-in-nigeria-match-reality",
      "published": "Sun, 28 Dec 2025 17:26:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China stages drills around Taiwan to deter 'external' forces",
      "description": "Taiwan accused China of military intimidation after Beijing announced live-fire drills. It comes after Japan's prime minister said Tokyo could potentially intervene to defend the self-governing island.",
      "url": "https://www.dw.com/en/china-stages-drills-around-taiwan-to-deter-external-forces/a-75325426?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 29 Dec 2025 02:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "UK Treasury to cover Bayeux Tapestry for estimated €917 million",
      "description": "France is preparing to transport the historic Bayeux Tapestry to England this coming summer. But concerns remain about whether the transfer of this valuable artifact will be secure enough, especially in the wake of the infamous Louvre heist. The Bayeux ​Tapestry is set to be covered by a UK Treasury indemnity of about 800 million ‌pounds (€917 million) during its loan to the British Museum in 2026, the Financial Times report.",
      "url": "https://www.france24.com/en/video/20251228-uk-treasury-to-cover-bayeux-tapestry-for-estimated-%E2%82%AC917-000",
      "published": "Sun, 28 Dec 2025 16:43:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'It is quite concerning': Greenlanders react to appointment of US special envoy to Greenland",
      "description": "Greenlanders react to US President Donald Trump's announcement of the appointment of Louisiana Governor Jeff Landry, a Republican, as US special envoy to Greenland.",
      "url": "https://www.france24.com/en/video/20251228-it-is-quite-concerning-greenlanders-react-to-appointment-of-us-special-envoy-to-greenland",
      "published": "Sun, 28 Dec 2025 13:29:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thai and Cambodian top diplomats meet in China to solidify ceasefire",
      "description": "Top diplomats from Thailand and Cambodia have begun talks in China to address their border dispute",
      "url": "https://abcnews.go.com/International/wireStory/thai-cambodian-top-diplomats-meet-china-solidify-ceasefire-128730021",
      "published": "Sun, 28 Dec 2025 06:33:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Deadly helicopter collision in New Jersey kills one, critically injures another",
      "description": "Two helicopters collided mid-air in Hammonton, New Jersey, killing one person and critically injuring another in the crash, authorities said Sunday.",
      "url": "https://www.foxnews.com/us/deadly-helicopter-collision-new-jersey-kills-critically-injures",
      "published": "Sun, 28 Dec 2025 14:12:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Nigeria says it shared intelligence to support US strikes on ISIS",
      "description": "Nigeria confirmed it shared intelligence with the U.S. ahead of Christmas night airstrikes against ISIS targets accused of killing Christians.",
      "url": "https://www.foxnews.com/world/nigeria-says-shared-intelligence-support-us-strikes-isis",
      "published": "Fri, 26 Dec 2025 07:34:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "How the U.S. has changed its approach to foreign aid this year",
      "description": "This year saw the dismantling of USAID, the United States' premier aid agency. What was the impact and what does the future of U.S. foreign aid look like in the health realm?",
      "url": "https://www.npr.org/2025/12/27/nx-s1-5653295/how-the-u-s-has-changed-its-approach-to-foreign-aid-this-year",
      "published": "Sat, 27 Dec 2025 07:43:30 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Development cooperation agreement marks new phase in UN-Iraq partnership",
      "description": "Better access to education, the protection of the environment and good governance are some of the areas in which the United Nations helps countries improve.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166670",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "DR Congo: Displaced people in South Kivu close to ‘utter desperation’, WFP says",
      "description": "An estimated 500,000 people have been forced from their homes since fighting erupted in South Kivu province, Democratic Republic of Congo (DRC), at the beginning of December.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166657",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ICE delivers 'greatest gift of all' with Christmas arrests of convicted criminals across multiple states",
      "description": "DHS Assistant Secretary Tricia McLaughlin praised ICE agents who arrested \"gang members, murderers, drug traffickers\" on Christmas Eve and Christmas Day.",
      "url": "https://www.foxnews.com/us/ice-delivers-greatest-gift-all-christmas-arrests-convicted-criminals-multiple-states",
      "published": "Sun, 28 Dec 2025 17:32:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Russian forces near collapse in Kupyansk as Moscow allies concede city lost: report",
      "description": "Russian forces were reportedly cut off and surrendering in Ukraine's Kupyansk as supply lines fail. Only dozens of isolated troops remain in the strategic city.",
      "url": "https://www.foxnews.com/world/russian-forces-near-collapse-kupyansk-moscow-allies-concede-city-lost-report",
      "published": "Thu, 25 Dec 2025 21:04:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Executions in Iran estimated to have doubled in 2025, report says",
      "description": "The Iran Human Rights (IHR) group says it has verified at least 1,500 executions up until the start of December.",
      "url": "https://www.bbc.com/news/articles/c3v1g227p4xo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 12:02:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Kennedy Center seeks $1m from musician who cancelled after Trump name added to venue",
      "description": "Drummer Chuck Redd reportedly called off his Christmas Eve performance after a vote by the board to rename the site.",
      "url": "https://www.bbc.com/news/articles/cz68q3p8xqxo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 19:00:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Russia sends 3 Iranian satellites into orbit, report says",
      "description": "The report said that a Russian rocket sent the satellites on Sunday from a launchpad in eastern Russia.",
      "url": "https://www.npr.org/2025/12/28/nx-s1-5659773/russia-iranian-satellites",
      "published": "Sun, 28 Dec 2025 12:55:11 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Former Florida law enforcement officer accused of forcing 6-year-old underwater in hotel pool: report",
      "description": "Former law enforcement officer Tiffany Lee Griffith has been charged with aggravated child abuse after allegedly holding a 6-year-old underwater at a Florida hotel.",
      "url": "https://www.foxnews.com/us/former-florida-law-enforcement-officer-accused-forcing-6-year-old-underwater-hotel-pool-report",
      "published": "Fri, 26 Dec 2025 21:29:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Christmas returns to Holy Land cities as Bethlehem’s Christian population dwindles, Nazareth remains strong",
      "description": "Christmas returns to Bethlehem amid ongoing concerns over Christian population decline from 86% in 1950 to just 10% today, while Nazareth enjoys growth.",
      "url": "https://www.foxnews.com/world/christmas-returns-holy-land-cities-bethlehems-christian-population-dwindles-nazareth-remains-strong",
      "published": "Thu, 25 Dec 2025 15:24:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Train derails in southern Mexico, killing 13 and injuring dozens",
      "description": "Mexico's Navy says the train was carrying 250 people when it derailed partially near the town of Nizanda in Oaxaca.",
      "url": "https://www.aljazeera.com/news/2025/12/29/train-derails-in-southern-mexico-killing-13-and-wounding-dozens?traffic_source=rss",
      "published": "Mon, 29 Dec 2025 03:54:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "French cinema actress Brigitte Bardot dies aged 91",
      "description": "The actress was a symbol of sexual liberation in the 1950s but became increasingly controversial after making homophobic and racist slurs.",
      "url": "https://www.bbc.com/news/articles/cly92pr8qryo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 13:34:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Polls close on first day of Myanmar's widely criticised 'sham' election",
      "description": "Observers say the vote, accompanied by a renewed crackdown on dissent, is meant to entrench the junta's power.",
      "url": "https://www.bbc.com/news/articles/cy7vly6gm76o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 07:37:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's Bolsonaro undergoes medical treatment for hiccups",
      "description": "The 70-year-old had suffered with the spasms for nine months, his wife says, and was already in hospital for hernia surgery.",
      "url": "https://www.bbc.com/news/articles/c3r7ge7937qo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 16:41:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nine arrested in Italy for allegedly raising millions for Hamas",
      "description": "Police say the suspects raised around €7m (£6m) for the militant group over more than two years.",
      "url": "https://www.bbc.com/news/articles/cqxq59np394o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 11:56:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Catching the hunters trapping rare songbirds in China",
      "description": "The BBC catches a man trapping songbirds - selling them is a profitable business because many keep them as pets.",
      "url": "https://www.bbc.com/news/articles/cdxw7593x9zo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 23:00:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "An orphan's brutal murder shines a spotlight on child abuse in Somalia",
      "description": "The woman who was supposed to care for Saabirin Saylaan was found to have beaten and tortured her.",
      "url": "https://www.bbc.com/news/articles/c0je281pnwyo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 29 Dec 2025 03:22:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The blonde bombshell who revolutionised French cinema",
      "description": "The cocktail of kittenish charm and continental sensuality who swept away the cinematic cobwebs of the 1950s.",
      "url": "https://www.bbc.com/news/articles/c888rzkd0dzo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 10:18:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Any Israeli presence in Somaliland will be a ‘target’: Houthi leader",
      "description": "Israel on Friday announced it is officially recognising Somaliland, a first for the self-proclaimed republic since 1991.",
      "url": "https://www.aljazeera.com/news/2025/12/28/any-israeli-presence-in-somaliland-will-be-a-target-houthi-leader?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 23:06:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mozambique win first ever AFCON game, while Algeria reach last 16",
      "description": "Elsewhere in the Africa Cup of Nations 2025, Cameroon and Ivory coast draw 1-1, while Sudan see off Equatorial Guinea.",
      "url": "https://www.aljazeera.com/sports/2025/12/28/mozambique-win-first-ever-afcon-game-while-algeria-reach-last-16?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 22:21:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kyrgios beats Sabalenka 6-3, 6-3 in ‘Battle of the Sexes’ tennis showdown",
      "description": "Kyrgios, who is currently 671st in the men's rankings, beat the four-time Grand Slam singles champion in straight sets.",
      "url": "https://www.aljazeera.com/sports/2025/12/28/kyrgios-beats-sabalenka-6-3-6-3-in-battle-of-the-sexes-tennis-showdown?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 18:08:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "One year in Israeli detention, Dr Hussam Abu Safia’s son pleads for release",
      "description": "Israel has held Gaza doctor Hussam Abu Safia for an entire year without charge.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/28/one-year-in-israeli-detention-dr-hussam-abu-safias-son-pleads-for-release?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 14:01:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Video: What do Rohingya refugees think about Myanmar’s election?",
      "description": "Myanmar's election is unlikely to change the reality for more than 1M Rohingya refugees in Bangladesh.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/28/video-what-do-rohingya-refugees-think-about-myanmars-election?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 13:32:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Opposition anger as Guinea’s junta leader is frontrunner to be elected president",
      "description": "Mamady Doumbouya accused of betraying his promise to be the restorer of democracy after leading 2021 coup In September 2021, a tall, young colonel in the Guinean army announced that he and his comrades had forcibly seized power and toppled the longtime leader Alpha Condé. “The will of the strongest has always supplanted the law,” Mamady Doumbouya said in a speech, stressing that the soldiers were acting to restore the will of the people. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/27/guinea-junta-leader-mamady-doumbouya-frontrunner-president-election",
      "published": "Sat, 27 Dec 2025 08:00:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "British-Egyptian activist Alaa Abd el-Fattah arrives in UK after travel ban lifted",
      "description": "Family say campaigner, who has a son in Brighton, will be able to travel freely between UK and Cairo months after his release from Egyptian jail The British-Egyptian dissident Alaa Abd el-Fattah has arrived in London after the Egyptian government lifted a travel ban that it had imposed on him despite releasing him from jail in September . Abd el-Fattah had been held in jail nearly continuously for 10 years, mainly due to expressing his opposition to the treatment of dissidents by the Egyptian government. He had been detained in jail two years beyond his five-year sentence as the Cairo authorities refused to recognise the period he held in pre-trial detention as part of his time served. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/british-egyptian-activist-alaa-abd-el-fattah-arrives-in-uk-after-travel-ban-lifted",
      "published": "Fri, 26 Dec 2025 17:57:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazilian ex-president Bolsonaro’s treatment for persistent hiccups touches a nerve",
      "description": "Doctors say they blocked his right phrenic nerve in procedure that took place after jailed former president was hospitalised last week for hernia operation Brazil’s former president Jair Bolsonaro underwent “a phrenic nerve block procedure” on Saturday to treat his persistent hiccups, his wife, Michelle Bolsonaro, said on social media. The doctors treating Bolsonaro said later that they blocked the right phrenic nerve and scheduled a new procedure in 48 hours to block the left one. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/brazil-ex-president-jair-bolsonaro-hiccups-treatment",
      "published": "Mon, 29 Dec 2025 01:06:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Search for Malaysia Airlines flight MH370 expected to resume on Tuesday",
      "description": "Marine robotics firm to renew its search more than decade after plane disappeared with 239 people onboard The search for Malaysia Airlines flight MH370 is expected to resume on 30 December, more than a decade after the plane disappeared with 239 people onboard in one of aviation’s greatest mysteries . A renewed search by Ocean Infinity, a UK and US-based marine robotics company, had begun earlier this year but was called off in April because of bad weather. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/search-for-malaysia-airlines-flight-mh370-expected-to-resume",
      "published": "Mon, 29 Dec 2025 05:00:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar is going to the polls. But it’s not the people who hold the power – it’s China",
      "description": "As the military pushes ahead with a widely condemned election, Beijing’s priorities are proving decisive Myanmar’s first election since the 2021 coup: everything you need to know Myanmar’s military has managed to regain momentum in its battle against a determined patchwork of opposition groups, retaking some territory, and pushing ahead with a widely condemned election that begins on Sunday. It is a turnaround for the military, which had appeared so beleaguered that some dared to question if it could collapse. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/myanmar-is-going-to-the-polls-but-its-not-the-people-who-hold-the-power-its-china",
      "published": "Sun, 28 Dec 2025 00:01:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "University of Melbourne’s pioneering vice-chancellor Emma Johnston dies aged 52",
      "description": "Emma Johnston AO became first woman to lead the 172-year-old institution in February 2025 Get our breaking news email , free app or daily news podcast A transformative science researcher and the first woman to lead of one of Australia’s top universities has died. University of Melbourne vice-chancellor Emma Johnston died from complications with cancer, the university announced on Monday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/29/emma-johnston-university-melbourne-vice-chancellor-dies-aged-52",
      "published": "Mon, 29 Dec 2025 04:33:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.2 - 36 km W of Puerto Santa, Peru",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-28 02:51:50 UTC 2025-12-28 02:51:50 UTC at epicenter Location 8.960°S 78.974°W Depth 66.41 km (41.27 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl57",
      "published": "2025-12-29T03:19:46.410Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.6 - 31 km ESE of Yilan, Taiwan",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-27 15:05:56 UTC 2025-12-27 15:05:56 UTC at epicenter Location 24.657°N 122.041°E Depth 67.53 km (41.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl2n",
      "published": "2025-12-29T02:47:38.395Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 42 km NNE of Goroka, Papua New Guinea",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-22 10:31:28 UTC 2025-12-22 10:31:28 UTC at epicenter Location 5.720°S 145.496°E Depth 110.18 km (68.46 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000rwgh",
      "published": "2025-12-23T10:56:00.234Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says Ukraine and Russia 'closer than ever' to peace after talks with Zelenskyy",
      "description": "President Donald Trump's comments came shortly after meeting with Ukrainian President Volodymyr Zelenskyy at his Florida resort. But he acknowledged talks could still break down.",
      "url": "https://www.npr.org/2025/12/28/nx-s1-5659700/zelenskyy-meets-trump-efforts-end-russia-ukraine-war-elusive",
      "published": "Sun, 28 Dec 2025 03:25:09 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'It's behind you!' How Britain goes wild for pantomimes during the holidays",
      "description": "Pantomimes are plays based on a well-known story — often a fairy tale — which are given a bawdy twist. The audience is expected to join in throughout, shouting as loudly as they can.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5645845/its-behind-you-how-britain-goes-wild-for-pantomimes-during-the-holidays",
      "published": "Sat, 27 Dec 2025 17:01:09 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar is holding its first elections in five years",
      "description": "Myanmar's is holding its first elections since the military seized power five years ago. It could give the military junta more legitimacy.",
      "url": "https://www.npr.org/2025/12/27/nx-s1-5622076/myanmar-is-holding-its-first-elections-in-five-years",
      "published": "Sat, 27 Dec 2025 07:43:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kosovo: Kurti wins snap election, signalling end of impasse",
      "description": "Prime Minister Kurti's governing Self-Determination party won nearly 50% of the vote, results showed with most of the votes counted. It is not yet clear whether he will be able to form a cabinet without a coalition.",
      "url": "https://www.dw.com/en/kosovo-kurti-wins-snap-election-signalling-end-of-impasse/a-75319167?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 29 Dec 2025 01:10:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump expects outcome for Russia-Ukraine talks in weeks",
      "description": "Trump said \"a lot of progress\" had been made in talks with Zelenskyy at Mar-a-Lago on Sunday. The Ukrainian president described the meeting as \"great.\" DW has the latest.",
      "url": "https://www.dw.com/en/trump-expects-outcome-for-russia-ukraine-talks-in-weeks/live-75319477?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 22:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brigitte Bardot: Actor, icon, controversial activist",
      "description": "French actress, singer and model Brigitte Bardot became an icon of the 1960s by portraying sexually emancipated characters. The animal rights activist also harbored polarizing political views.",
      "url": "https://www.dw.com/en/brigitte-bardot-actor-icon-controversial-activist/a-75321729?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 12:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French actress and activist Brigitte Bardot dies aged 91",
      "description": "The French screen legend appeared in 56 films before ending her career in 1973 and dedicating herself to animal rights activism.",
      "url": "https://www.dw.com/en/french-actress-and-activist-brigitte-bardot-dies-aged-91/a-75320487?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 10:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German company to sell more refurbished appliances",
      "description": "The secondhand smartphone market has grown significantly in recent years, but other, bulkier items like washing machines are less frequently refurbished and resold. That could soon be changing.",
      "url": "https://www.dw.com/en/german-company-to-sell-more-refurbished-appliances/a-75318074?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 07:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU backs Somalia after Israel recognizes Somaliland",
      "description": "Israel’s support for Somaliland has triggered sharp pushback across Africa, the Middle East and beyond, with the EU urging calm and Somalia vowing to defend its sovereignty.",
      "url": "https://www.dw.com/en/eu-backs-somalia-after-israel-recognizes-somaliland/a-75318108?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 23:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Algeria secure knock-out spot with 1-0 win over Burkina Faso",
      "description": "Algeria secure knock-out spot with 1-0 win over Burkina Faso",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251228-algeria-secure-knock-out-spot-with-1-0-win-over-burkina-faso",
      "published": "Sun, 28 Dec 2025 23:06:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'She speaks to all kinds of generations': Brigitte Bardot dies aged 91",
      "description": "French film legend Brigitte Bardot has died at 91, the Bardot foundation announced on Sunday (December 28). Bardot starred in more than 50 movies during her career before leaving the film industry to concentrate on animal rights activism. Bardot became a controversial figure in her later decades, with public comments and writing that led to five convictions for inciting hatred. For more on her career, FRANCE 24's Camille Knight is joined by Gad Edery, founder of the GADCOLLECTION gallery in Paris, that hosted an exhibition dedicated to Brigitte Bardot, a couple of years ago.",
      "url": "https://www.france24.com/en/video/20251228-she-speaks-to-all-kinds-of-generations-brigitte-bardot-dies-aged-91",
      "published": "Sun, 28 Dec 2025 16:51:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A lover of animals': French film icon Brigitte Bardot dies at 91",
      "description": "French film legend Brigitte Bardot has died at 91, the Bardot foundation announced on Sunday (December 28). Bardot starred in more than 50 movies during her career before leaving the film industry to concentrate on animal rights activism. For more on that topic, FRANCE 24 is joined by Elora Thevenet, producer of \"Bardot\" documentary.",
      "url": "https://www.france24.com/en/video/20251228-a-lover-of-animals-french-film-icon-brigitte-bardot-dies-at-91",
      "published": "Sun, 28 Dec 2025 16:04:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Algeria and Burkina Faso target second win",
      "description": "Algeria will be playing Burkina Faso this Sunday (December 28). FRANCE 24's Selina Sykes tells us more.",
      "url": "https://www.france24.com/en/video/20251228-afcon-2025-algeria-and-burkina-faso-target-second-win",
      "published": "Sun, 28 Dec 2025 15:29:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "At least 13 people dead after train derails in Mexico",
      "description": "At least 13 people have died and dozens more are being treated for their injuries after a train derailed in Mexico, authorities have said.",
      "url": "https://news.sky.com/story/at-least-13-people-dead-and-dozens-injured-after-train-derails-in-mexico-authorities-say-13488164",
      "published": "Mon, 29 Dec 2025 00:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brigitte Bardot: The bombshell and style icon who walked away from fame and glamour",
      "description": "Brigitte Bardot was the sultry film siren who helped ignite a sexual revolution, a woman whose cultural significance extended beyond her acting career.",
      "url": "https://news.sky.com/story/brigitte-bardot-film-siren-who-helped-ignite-a-sexual-revolution-13488006",
      "published": "Sun, 28 Dec 2025 10:47:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kyrgios defeats Sabalenka to win 'Battle of the Sexes' tennis match",
      "description": "Nick Kyrgios has defeated Aryna Sabalenka to win the latest \"Battle of the Sexes\" tennis exhibition match.",
      "url": "https://news.sky.com/story/nick-kyrgios-defeats-aryna-sabalenka-to-win-battle-of-the-sexes-tennis-match-13488078",
      "published": "Sun, 28 Dec 2025 17:26:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most shocking, unusual and WTF moments of 2025",
      "description": "In a year full of serious news, there were some stories that you may have had to look at twice in disbelief.",
      "url": "https://news.sky.com/story/the-most-shocking-unusual-and-wtf-moments-of-2025-13484181",
      "published": "Mon, 29 Dec 2025 01:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungary's 'water guardian' farmers fight back against desertification",
      "description": "Southern Hungary landowner Oszkár Nagyapáti has been battling severe drought on his land",
      "url": "https://abcnews.go.com/International/wireStory/hungarys-water-guardian-farmers-fight-back-desertification-128742465",
      "published": "Mon, 29 Dec 2025 00:11:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mexican president says 13 people died in the Interoceanic Train derailment in southern Mexico",
      "description": "Mexican president says 13 people died in the Interoceanic Train derailment in southern Mexico",
      "url": "https://abcnews.go.com/International/wireStory/mexican-president-13-people-died-interoceanic-train-derailment-128741805",
      "published": "Sun, 28 Dec 2025 23:59:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK leader criticized for applauding return of man freed from Egyptian prison as old tweets resurface",
      "description": "The U.K. prime minister is facing criticism after celebrating the return of human rights activist Alaa Abd el-Fattah from Egypt",
      "url": "https://abcnews.go.com/International/wireStory/uk-leader-criticized-applauding-return-man-freed-egyptian-128733140",
      "published": "Sun, 28 Dec 2025 10:17:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thailand's political parties name prime minister candidates for February election",
      "description": "Political parties in Thailand have registered their candidates to become prime minister after the upcoming general election, marking the unofficial start of campaigning",
      "url": "https://abcnews.go.com/International/wireStory/thailands-political-parties-prime-minister-candidates-february-election-128729832",
      "published": "Sun, 28 Dec 2025 06:01:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea vows to end foreign adoptions as UN presses Seoul to address past abuses",
      "description": "South Korea’s government says it plans to end the waning foreign adoptions of Korean children",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-vows-end-foreign-adoptions-presses-seoul-128699370",
      "published": "Fri, 26 Dec 2025 02:57:17 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza: Humanitarian response ongoing despite restrictions",
      "description": "Although “significant restrictions and impediments” continue to hamper humanitarian operations in Gaza, teams are still responding to the population’s needs, the UN aid coordination office OCHA said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166669",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN celebrates 10 years of progress in youth, peace and security agenda",
      "description": "The UN has long been at the forefront of efforts to involve young people in decision-making, and the last decade has seen significant progress, thanks to the adoption of a Security Council resolution on youth, peace and security which led to widespread changes in the ways that the voices of young people are not just heard, but also incorporated in peace plans and policies.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166637",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "DC pipe bomb suspect says someone needed to 'speak up' about stolen election claims",
      "description": "Man accused of Jan. 6 pipe bombs allegedly confessed he felt compelled to \"speak up\" for those who believed 2020 election was stolen, prosecutors say.",
      "url": "https://www.foxnews.com/us/dc-pipe-bomb-suspect-says-someone-needed-speak-up-about-stolen-election-claims",
      "published": "Sun, 28 Dec 2025 22:02:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Head of America's 'free enterprise' college optimistic about academia despite left-wing bias: 'there is hope'",
      "description": "University president shares new hope for higher education at AmericaFest, promoting free enterprise values and civility on campus amid academic challenges.",
      "url": "https://www.foxnews.com/us/head-americas-free-enterprise-college-optimistic-about-academia-despite-left-wing-bias-there-hope",
      "published": "Sun, 28 Dec 2025 08:00:24 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "2025 Most Memorable Viral Moments: December 28, 2025",
      "description": "Choose between the \"Kiss Cam\" Incident at the Coldplay Concert, the Labubu Toy Craze, or the Louvre Crown Jewels Heist.",
      "url": "https://www.foxnews.com/us/2025-most-memorable-viral-moments-december-28-2025",
      "published": "Sun, 28 Dec 2025 07:33:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Year in focus: Images that defined America in 2025",
      "description": "From moments of celebration to scenes of devastation, 2025 delivered images that defined a turbulent year in America. These photos captured some of those defining stories.",
      "url": "https://www.foxnews.com/us/year-focus-images-that-defined-america-2025",
      "published": "Sat, 27 Dec 2025 16:00:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Texas 19-year-old Camila Mendoza Olmos vanishes outside her home on Christmas Eve",
      "description": "Camila Mendoza Olmos, a 19-year-old who \"normally goes for a morning walk,\" was last seen outside her home on the morning of Christmas Eve, authorities said.",
      "url": "https://www.foxnews.com/us/texas-19-year-old-camila-mendoza-olmos-vanishes-outside-her-home-christmas-eve",
      "published": "Sat, 27 Dec 2025 12:21:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Defiant TPUSA leader won't quit despite chapter facing harassment, hostility after Kirk assassination",
      "description": "Northern Arizona University Turning Point USA leader Rose Lombardo is standing strong despite backlash from critics for her right-wing activism.",
      "url": "https://www.foxnews.com/us/defiant-tpusa-leader-wont-quit-despite-chapter-facing-harassment-hostility-after-kirk-assassination",
      "published": "Sat, 27 Dec 2025 10:00:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida man allegedly steals 400 pounds of avocados to buy Christmas presents for children",
      "description": "A Florida man was arrested after he allegedly trespassed in an avocado grove and stole roughly 400 pounds of the fruit in order to sell them for money to buy Christmas gifts.",
      "url": "https://www.foxnews.com/us/florida-man-allegedly-steals-400-pounds-avocados-buy-christmas-presents-children",
      "published": "Sat, 27 Dec 2025 05:15:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nude burglar arrested on Christmas night after allegedly breaking into two luxury Florida homes",
      "description": "A nude man allegedly broke into two luxury Golden Beach homes Christmas night and was found hiding in the garage of a $12 million home after drinking.",
      "url": "https://www.foxnews.com/us/nude-burglar-arrested-christmas-night-breaking-two-luxury-florida-homes",
      "published": "Fri, 26 Dec 2025 21:54:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trio of Palestinians arrested for allegedly torching Christmas tree at Catholic church in West Bank",
      "description": "Three Palestinians accused of torching a Christmas tree and damaging part of a Nativity scene at a West Bank Catholic church were arrested.",
      "url": "https://www.foxnews.com/world/trio-palestinians-arrested-allegedly-torching-christmas-tree-catholic-church-west-bank",
      "published": "Thu, 25 Dec 2025 21:31:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy encouraged by 'very good' Christmas talks with US",
      "description": "Ukrainian President Volodymyr Zelenskyy expresses optimism about Ukraine peace talks after Christmas conversation with U.S. envoys, as negotiations show progress.",
      "url": "https://www.foxnews.com/world/zelenskyy-encouraged-very-good-christmas-talks-us",
      "published": "Thu, 25 Dec 2025 13:53:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Poland scrambles jets on Christmas after detecting Russian reconnaissance aircraft near its airspace",
      "description": "Poland scrambled fighter jets on Christmas morning after detecting a Russian reconnaissance aircraft near its airspace over the Baltic Sea.",
      "url": "https://www.foxnews.com/world/poland-scrambles-jets-christmas-after-detecting-russian-reconnaissance-aircraft-near-its-airspace",
      "published": "Thu, 25 Dec 2025 11:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}