{
  "last_updated": "2025-12-21T01:54:43.015875Z",
  "event_count": 243,
  "events": [
    {
      "title": "Lifetime toll: 840 million women faced partner or sexual violence",
      "description": "Violence against women remains one of the world’s most persistent and under-addressed human rights crises, with very little progress in two decades, according to a landmark report released today by the World Health Organization (WHO) and UN partners. Nearly 1 in 3 women – estimated 840 million globally – have experienced partner or sexual violence during their lifetime, a figure that has barely changed since 2000. In the last 12 months alone, 316 million women – 11% of those aged 15 or older – were subjected to physical or sexual violence by an intimate partner. Progress on reducing intimate partner violence has been painfully slow with only 0.2% annual decline over the past two decades. For the first time, the report includes national and regional estimates of sexual violence by someone other than a partner. It finds 263 million women have experienced non-partner sexual violence since age 15, a figure experts caution is significantly under-reported due to stigma and fear. \"Violence against women is one of humanity’s oldest and most pervasive injustices, yet still one of the least acted upon,\" said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. \"No society can call itself fair, safe or healthy while half its population lives in fear. Ending this violence is not only a matter of policy; it is a matter of dignity, equality and human rights. Behind every statistic is a woman or girl whose life has been forever altered. Empowering women and girls is not optional, it's a prerequisite for peace, development and health. A safer world for women is a better world for everyone.\" Efforts face funding cuts amidst mounting needs The new report, released ahead of the International day for the elimination of violence against women and girls observed on 25 November, represents the most comprehensive study on the prevalence of these two forms of violence against women. It updates 2018 estimates released in 2021. It analyses data between 2000 and 2023 from 168 countries, revealing a stark picture of a deeply neglected crisis and critically underfunded response. Despite mounting evidence on effective strategies to prevent violence against women, the report warns that funding for such initiatives is collapsing – just as when humanitarian emergencies, technological shifts, and rising socio-economic inequality are further increasing risks for millions of women and girls. For instance, in 2022, only 0.2% of the global development aid was allocated to programmes focused on prevention of violence against women, and funding has further fallen in 2025. Widespread and lifelong risks Women subjected to violence face unintended pregnancies, a higher risk of acquiring sexually transmitted infections and experiencing depression. Sexual and reproductive health services are an important entry point for survivors to receive the high-quality care they need. The report underscores the reality that violence against women begins early and risks persist throughout life. For example, in the past 12 months alone, 12.5 million adolescent girls 15-19 years of age or 16% have experienced physical and/or sexual violence from an intimate partner. While violence occurs in every country, women in least-developed, conflict-affected, and climate-vulnerable settings are disproportionately affected. For example, Oceania (excluding Australia and New Zealand) reports 38% prevalence of intimate partner violence in the past year – more than 3 times the global average of 11%. A call for action – and accountability More countries than ever are now collecting data to inform policies, yet significant gaps remain – particularly on non-partner sexual violence, marginalized groups such as indigenous women, migrants, and women with disabilities, as well as data from fragile and humanitarian settings. Progress has been achieved in countries where there is political commitment to do so. For example, Cambodia is implementing a national project that will update legislation on domestic violence, improve service delivery, quality and access, refurbish shelters and leverage digital solutions in schools and communities to promote prevention especially with adolescents. Ecuador, Liberia, Trinidad and Tobago and Uganda have developed costed national action plans. Legislative and advocacy actions in these countries have contributed to some domestic financing for this issue, signalling increased political commitment at a time of decreasing aid budgets. To accelerate global progress and deliver meaningful change for the lives of affected women and girls, the report calls for decisive government action and funding to: scale up evidence-based prevention programmes strengthen survivor-centred health, legal and social services invest in data systems to track progress and reach the most at-risk groups enforce laws and policies empowering women and girls. The report is accompanied by the launch of the second edition of the RESPECT Women: preventing violence against women framework , offering updated guidance for violence prevention, including for humanitarian contexts. There can be no more silence or inaction. We need leaders to commit and act towards ending violence against women and girls now. Quotes from partners \"Ending violence against women and girls requires courage, commitment, and collective action. Advancing gender equality is how we build a more equal, safer world for everyone, where every woman and every girl can live a life free from violence.” Dr Sima Bahous, Executive Director, UN Women \"Violence against women inflicts deep and lasting harm that affects their lives, health and dignity. For many, violence is compounded by discrimination based on poverty, disability and other factors, exposing them to even higher risk. The devastating cycle of abuse often ripples through families and communities and across generations. The data paint a grim picture of the toll of inaction. This must change now. We must act urgently together to end this violence and ensure that every woman and girl, in all her diversity, can exercise her rights, realize her potential and contribute fully to more just, equal and prosperous societies.” Diene Keita, Executive Director, UNFPA “The data shows that many women first experience violence from a partner when they are adolescents. And many children grow up watching their mothers being pushed, hit or humiliated, with violence a part of daily life. The key is to break this pattern of violence against women and girls.” UNICEF Executive Director Catherine Russell Notes to the editors About the report The report, Global, regional and national prevalence estimates for intimate partner violence against women and non-partner sexual violence against women, 2023 was developed by WHO and the UNDP-UNFPA-UNICEF-WHO-World Bank Special Programme of Research, Development and Research Training in Human Reproduction (HRP) on behalf of, and with the United Nations Inter-Agency Working Group on Violence Against Women Estimation and Data. The Working Group includes representatives from WHO, UN Women, UNICEF, UNFPA, the United Nations Office on Drugs and Crime (UNODC) and the United Nations Statistics Division (UNSD). Modelling is used to enhance comparability of estimates across countries and regions to the extent allowed by existing data. All surveys likely underestimate the actual prevalence of violence against women as there will always be women who do not disclose these experiences, especially where this violence is highly stigmatized. Sexual violence is particularly underreported in many settings. Poorly designed or implemented surveys in some places further exacerbate this underestimation. About regional and country estimates The report and database present regional data in the following categories: Sustainable Development Goal (SDG) regions, WHO regions, Global Burden of Disease (GBD) regions, UNFPA regions and UNICEF regions. Data is also presented for 168 countries and areas for women aged 15-49 years old. The report presents data on both lifetime and past 12 months prevalence estimates. The rates of the Past 12 months prevalence of intimate partner violence among ever-married/-partnered women 15 years and older among the United Nations SDG regional and subregion classifications are ranked below from highest to lowest prevalence: Oceania ( excluding Australia and New Zealand): 38% Central and Southern Asia: 18% Southern Asia – 19% Least Developed Countries – 18% Sub-Saharan Africa – 17% Small Island Developing States – 17% Northern Africa and Western Asia – 14% Northern Africa – 16% Oceania ( including Australia and New Zealand) – 13% Eastern and South-Eastern Asia – 8% Latin American and the Caribbean – 7% Europe and Northern America – 5% About RESPECT RESPECT stands for: R elationship skills strengthening, E mpowerment of women and girls, S ervices ensured, P overty reduced, E nabling environments (i.e. schools, workplaces, public places), C hild and adolescent abuse prevented, and T ransformed gender attitudes, beliefs and norms. RESPECT women is endorsed by 13 agencies and is aimed at policy makers.",
      "url": "https://www.who.int/news/item/19-11-2025-lifetime-toll--840-million-women-faced-partner-or-sexual-violence",
      "published": "Wed, 19 Nov 2025 11:34:26 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 76,
      "severity_level": "Critical"
    },
    {
      "title": "Most countries make progress towards universal health coverage, but major challenges remain, WHO–World Bank report finds",
      "description": "Since 2000, most countries – across all income levels and regions – have made concurrent progress in expanding health service coverage and reducing the financial hardship associated with health costs, according to a new joint report from the World Health Organization (WHO) and the World Bank Group. These two indicators are the foundation of universal health coverage (UHC) – the global commitment that everyone, everywhere can access the care they need without financial hardship by 2030. The UHC Global Monitoring Report 2025 shows that health service coverage, measured by the Service Coverage Index (SCI), rose from 54 to 71 points between 2000 and 2023. Meanwhile, the share of people experiencing financial hardship due to large and impoverishing out-of-pocket (OOP) health payments declined from 34% to 26% between 2000 and 2022. However, the report cautions that the poorest populations continue to bear the greatest burden of unaffordable health costs, with 1.6 billion people further pushed into poverty. Overall, an estimated 4.6 billion people worldwide still lack access to essential health services and 2.1 billion people experience financial hardship to access health care, including the 1.6 billion people living in poverty or pushed deeper into it due to health expenses. \"Universal health coverage is the ultimate expression of the right to health, but this report shows that for billions of people who cannot access or afford the health services they need, that right remains out of reach,” said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. “In the context of severe cuts to international aid, now is the time for countries to invest in their health systems, to protect the health of their people and economies. WHO is supporting them to do that.” Financial hardship in health is defined as household spending more than 40% of its discretionary budget on OOP health expenses. Cost of medicines is a major driver of financial hardship: in three-quarters of countries with available data, medicines account for at least 55% of people’s OOP health expenses. The burden is even greater among people living in poverty who allocate a median of 60% of their OOP health expenses on medicines diverting their scarce resources from other essential needs. While the burden of OOP health costs falls mostly on poorer people, it also affects better-off segments of the population that allocate a large share of their budgets to health expenses, particularly in middle-income countries where this group of people is growing. Without faster progress, full-service coverage without financial hardship will remain out of reach for many: the global SCI is projected to reach only 74 out of 100 by 2030, with nearly 1 in 4 people worldwide still facing financial hardship at the end of the Sustainable Development Goals (SDG) era. Encouraging progress in low-income countries with largest gaps Despite positive direction, the global progress rate has slowed since 2015 with only one-third of countries improving in both increasing health coverage and reducing financial hardship. All WHO regions have improved service coverage, but only half – Africa, South-East Asia, the Western Pacific – also reduced financial hardship. Low-income countries achieved the fastest gains in both areas but are still facing the largest gaps. The global increase in health service coverage has been driven largely by advances in infectious disease programmes. Coverage for noncommunicable diseases (NCDs) has shown steady improvement, while gains in reproductive, maternal, newborn, and child health have been modest. The report notes that improved sanitation has supported service coverage gains. At the same time, inclusive economic growth, rising incomes, and stronger social protection mechanisms have driven poverty reduction, especially in low-income countries, contributing to declines in financial hardship. However, health costs have increasingly become a source of financial hardship among the poor. Inequalities are getting starker Despite progress, persistent gaps and inequalities are on the rise. In 2022, 3 out of 4 people among the poorest segment of the populations faced financial hardship from health costs, compared with fewer than 1 in 25 among the richest. Women, people living in poverty, or in rural areas, or with less education, reported greater difficulty accessing essential health services. The gap between women in the richest and poorest quintiles narrowed slightly, from about 38 to 33 percentage points over the past decade. Even in high-performing regions such as Europe, vulnerable groups – including the poorest and people with disabilities – continue to report higher unmet health needs. These findings likely underestimate the true extent of health inequalities, as the most vulnerable groups – such as displaced populations and people living in informal settlements – are often missing in data sources used to monitor progress toward UHC. Actions leading to 2030 Achieving the UHC goal by 2030 is central to realizing the human right to health. With five years remaining on the SDG agenda, urgent action is now needed to drive progress. The report underscores the critical role of political commitment in every country and community, and calls for action in six core areas: ensure essential health care is free at the point of care for people living in poverty and vulnerable situations; expand public investments in health systems; address high out-of-pocket spending on medicines; accelerate access to essential NCD services, especially as the disease burden rises; strengthen primary health care to promote equity and efficiency; and adopt multisectoral approaches, recognizing that determinants of health and UHC drivers extend beyond the health sector. Editor’s note This edition of the UHC Global Monitoring Report 2025 reflects the first round of UHC tracking to incorporate revised SDG indicators for health service coverage (SDG 3.8.1) and financial hardship (SDG 3.8.2), introduced in 2025. Using the revised indicators, and reproduction of the full time series, the report has presented global and regional trends in service coverage from 2000 to 2023, based on time series data for 195 countries or territories, and global and regional trends in financial hardship from 2000 to 2022, based on primary country time series for 168 countries. More about monitoring universal health coverage . The Report is presented at the UHC High-Level Forum, jointly hosted by the Government of Japan, the World Bank Group, and WHO, in Tokyo, Japan. The Forum will also mark the official launch of the UHC Knowledge Hub in Tokyo, established by WHO and the World Bank Group with the support of the Government of Japan. The Hub offers capacity strengthening programmes for Ministries of Health and Finance to support health financing reforms. More about the Universal Health Coverage (UHC) High-level Forum 2025 . WHO, the World Bank Group, UHC2030 and the Joint Learning Network for Universal Health Coverage will organize a technical webinar “Tracking Universal Health Coverage: 2025 Global Monitoring Report” on 8 December 2025, at 8:00–9:30am EST | 14:00–15:30 CET. You can join the webinar through this link . (Passcode: .W1MJT=@r3)",
      "url": "https://www.who.int/news/item/06-12-2025-most-countries-make-progress-towards-universal-health-coverage-but-major-challenges-remain-who-world-bank-report-finds",
      "published": "Sat, 06 Dec 2025 01:45:23 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 66,
      "severity_level": "Critical"
    },
    {
      "title": "Egypt becomes the seventh country in the Eastern Mediterranean Region to eliminate trachoma as a public health problem",
      "description": "The World Health Organization (WHO) today announced that Egypt has successfully eliminated trachoma as a public health problem, marking a historic public health milestone for the country and WHO’s Eastern Mediterranean Region (WHO EMR). It is the seventh country in WHO EMR to achieve this milestone. The validation of Egypt’s achievement brings the total number of countries that have eliminated trachoma as a public health problem worldwide to 27. “I congratulate Egypt for reaching this milestone and liberating its people from trachoma,” said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. “This demonstrates the effectiveness of sustained national leadership, strong surveillance and community engagement in ending a disease that has afflicted humanity since antiquity.” Following Egypt’s success, Trachoma remains a public health problem in 30 countries and is responsible for the blindness or visual impairment of about 1.9 million people. Blindness from trachoma is difficult to reverse. Based on April 2025 data, 103 million people live in trachoma endemic areas and are at risk of trachoma blindness. A century-long journey against trachoma Trachoma has been documented in Egypt for over 3,000 years. Public health efforts to address its burden began in the early 20th century, when pioneering ophthalmologist Arthur Ferguson MacCallan established Egypt’s first mobile and permanent eye hospitals and laid the groundwork for organized trachoma control globally. Yet by the 1980s, it still blinded many adults and affected over half of all children in some Nile Delta communities. Since 2002, the Ministry of Health and Population of Egypt, in partnership with WHO and other national and international stakeholders, has pursued trachoma elimination through the WHO-endorsed SAFE strategy, which represents Surgery for trichiasis, Antibiotics to clear the causative organism, Facial cleanliness and Environmental improvement. Between 2015 and 2025, extensive mapping and surveillance across all 27 of Egypt’s governorates showed steady reductions in the proportion of children aged 1–9 years affected by active (inflammatory) trachoma, and no significant burden of the blinding complications of trachoma in adults. Both indicators are now below WHO elimination prevalence thresholds nationwide. In 2024, Egypt integrated trachoma surveillance into its national electronic disease reporting system, which should facilitate rapid response to any future cases. “Egypt’s elimination of trachoma as a public health problem underscores the nation’s sustained commitment to equitable healthcare delivery and the transformative impact of initiatives such as Haya Karima, which have expanded access to safe water, sanitation, and primary care services in rural communities,” said Professor Dr. Khaled Abdel Ghaffar, Deputy Prime Minister and Minister of Health and Population. “This achievement is a collective triumph for Egypt’s health workers, communities, and partners who collaborated to eradicate this ancient disease.” Trachoma is the second neglected tropical disease (NTD) eliminated in Egypt, as in 2018 the country was validated by WHO for eliminating lymphatic filariasis as a public health problem. In total, 58 countries have eliminated at least one NTD globally, nine of which are in WHO Eastern Mediterranean Region. “This milestone adds to Egypt’s strong track record in eliminating communicable diseases, including polio, measles, rubella and most recently malaria. It demonstrates what can be achieved when political commitment, strong partnerships and years of sustained public health efforts, led by the Ministry of Health and Population, come together towards a shared vision,” said Dr Nima Abid, WHO Representative to Egypt. \"Egypt’s achievement serves as an inspiring example for other countries in the Region and beyond.\" Successful collaboration and partnerships Eliminating trachoma in Egypt was the result of strong national leadership, coordinated action and broad collaboration across sectors. WHO worked closely with the Ministry of Health and Population to provide technical guidance, monitoring and validation support throughout the elimination process. The achievement was made possible through the technical and financial contributions of many partners including the Haya Karima Foundation, the Eastern Mediterranean Region Trachoma Alliance, the Nourseen Charity Foundation, the International Trachoma Initiative, the Global Trachoma Mapping Project, Sightsavers, CBM, the Kilimanjaro Centre for Community Ophthalmology, the Magrabi Foundation and the Tropical Data global initiative. “Congratulations to Egypt on this historic achievement in eliminating trachoma as a public health problem,” said Dr Hanan Balkhy, WHO Regional Director for the Eastern Mediterranean. “Together, we have proven that with collaboration and persistence, elimination is achievable. This success reflects years of dedication and the tireless efforts of communities, health workers, and partners who stood firm in the conviction that everyone deserves to live free from preventable disease. Today, Egypt exemplifies what determination can accomplish.” Note to the editor About trachoma and neglected tropical diseases Trachoma, caused by the bacterium Chlamydia trachomatis , is spread through contact with infected eye discharges via hands, clothes, hard surfaces and flies. Repeated infections can lead to scarring of the inner eyelid, turning eyelashes inward to scratch the cornea: a painful condition, known as trachomatous trichiasis, that can result in blindness. Globally, the disease remains endemic in many vulnerable communities where access to clean water and sanitation is limited. In 1998, WHO launched the WHO Alliance for the Global Elimination of Trachoma by 2020 (GET2020), supported by a network of governments, nongovernmental organizations and academic institutions. WHO continues to support endemic countries to accelerate progress towards the global goal of eliminating trachoma as a public health problem worldwide.",
      "url": "https://www.who.int/news/item/12-11-2025-egypt-becomes-the-seventh-country-in-the-eastern-mediterranean-region-to-eliminate-trachoma-as-a-public-health-problem",
      "published": "Wed, 12 Nov 2025 09:43:51 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "WHO validates Brazil for eliminating mother-to-child transmission of HIV",
      "description": "The World Health Organization (WHO) has validated Brazil for the elimination of mother-to-child transmission (EMTCT) of HIV, making it the most populous country in the Americas to achieve this historic milestone. This accomplishment reflects Brazil’s long-standing commitment to universal and free access to health services through its Unified Health System (SUS), anchored in a strong primary health-care system and respect for human rights. “Eliminating mother-to-child transmission of HIV is a major public health achievement for any country, especially for a country as large and complex as Brazil,” said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. “Brazil has shown that with sustained political commitment and equitable access to quality health services, every country can ensure that every child is born free of HIV and every mother receives the care she deserves.” The milestone was marked during a ceremony in Brasília, attended by President Luiz Inácio Lula da Silva, Brazil’s Minister of Health Alexandre Padilha, and the Director of the Pan American Health Organization (PAHO) Dr Jarbas Barbosa, along with representatives from UNAIDS. Meeting validation criteria Brazil met all the criteria for EMTCT validation, including reducing vertical transmission of HIV to below 2% and achieving over 95% coverage for prenatal care, routine HIV testing, and timely treatment for pregnant women living with HIV. In addition to meeting the targets of the validation, Brazil demonstrated the delivery of quality services for mothers and their infants, robust data and laboratory systems, and a strong commitment to human rights, gender equality and community engagement. The country implemented a progressive, subnational approach by first certifying states and municipalities with over 100 000 inhabitants, adapting the PAHO/WHO validation methodology to its national context while maintaining coherence across the country. The evaluation, supported by PAHO, was conducted by independent experts who reviewed data, documentation, and health facility operations. Findings were then assessed by WHO’s Global Validation Advisory Committee, which formally recommended Brazil’s validation for elimination. “This achievement shows that eliminating vertical transmission of HIV is possible when pregnant women know their HIV status, receive timely treatment, and have access to maternal health services and safe delivery,” said Dr Jarbas Barbosa, Director of PAHO. “It is also the result of the tireless dedication of thousands of health professionals, community health workers, and civil society organizations. Every day, they sustain the continuity of care, identify obstacles, and work to overcome them, ensuring that even the most vulnerable populations can access essential health services.\" Part of a broader initiative Over the past decade (2015-2024), more than 50 000 pediatric HIV infections have been averted in the Region of the Americas as a result of the implementation of the initiative to eliminate mother-to-child transmission of HIV. Brazil’s success is part of the broader EMTCT Plus Initiative, which seeks to eliminate mother-to-child transmission of HIV, syphilis, hepatitis B, and congenital Chagas, in collaboration with UNICEF and UNAIDS. It is embedded within PAHO’s Elimination Initiative , a regional effort to eliminate more than 30 communicable diseases and related conditions in the Americas by 2030. \"I am delighted that Brazil has just been certified by WHO/PAHO for eliminating vertical transmission – the first country of more than 100 million people to do so,” said Winnie Byanyima, UNAIDS Executive Director. “And they did it by doing what we know works –prioritizing universal health care, tackling the social determinants that drive the epidemic, protecting human rights, and even – when necessary – breaking monopolies to secure access to medicines.\" Global context Brazil is one of 19 countries and territories worldwide that have been validated by WHO for EMTCT. Twelve of these are in the Region of the Americas. In 2015, Cuba became the first country in the world to be validated for EMTCT of HIV and the elimination of congenital syphilis. Other countries in the Region include Anguilla, Antigua and Barbuda, Bermuda, Cayman Islands, Montserrat, and Saint Kitts and Nevis in 2017; Dominica in 2020; Belize in 2023; and Jamaica and Saint Vincent and the Grenadines in 2024. Outside the Americas, countries validated for EMTCT of HIV include Armenia, Belarus, Malaysia, Maldives, Oman, Sri Lanka, and Thailand.",
      "url": "https://www.who.int/news/item/18-12-2025-who-validates-brazil-for-eliminating-mother-to-child-transmission-of-hiv",
      "published": "Thu, 18 Dec 2025 15:43:16 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 51,
      "severity_level": "Critical"
    },
    {
      "title": "Bondi terror attack updates: PM orders review of law and intelligence agencies; police urge public not to attend unauthorised Sydney anti-immigration rally",
      "description": "NSW parliament to sit this week to consider new legislation in response to shooting. Follow updates live NSW will move to ban phrase ‘globalise the intifada’ in crackdown on ‘hateful’ rhetoric. Here’s what we know so far Get our breaking news email , free app or daily news podcast Australian football star pays tribute to Bondi victims in Scottish league game A rising Australian player in Scotland has paid tribute to victims of the Bondi tragedy on an afternoon when Socceroo Martin Boyle shone again. Unfortunately, Zac knew a number of people involved in the tragedy in Bondi Beach. His family stay quite close to there. At 6:47pm, you can light a candle in your window to remember the victims of the antisemitic terrorist attack in Bondi and support those who are grieving. Standing together to show that hatred and violence will never define who we are. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2025/dec/21/bondi-beach-terror-attack-one-week-anniversary-day-of-reflection-reactions-sydney-vigil-memorial-nsw-protest-laws-police-powers-anthony-albanese-labor-sussan-ley-coalition-ntwnfb",
      "published": "Sun, 21 Dec 2025 01:32:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 50,
      "severity_level": "Critical"
    },
    {
      "title": "A key piece of Port Arthur-era gun reform remains unfinished. Could it have helped prevent the Bondi attack?",
      "description": "National register would have allowed police to better assess risk posed by alleged Bondi shooters before attack, expert says Victims of Bondi beach shooting Ten minutes of terror: how the Bondi mass shooting unfolded in real time – video Follow the latest live updates A national firearms register, which would track weapons across the country in real time, was a priority for law enforcement and gun control advocates after the 1996 Port Athur massacre. But almost 30 years later, it remains unfinished. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/21/gun-law-reform-after-port-arthur-national-forearms-register-ntwnfb",
      "published": "Sat, 20 Dec 2025 19:00:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 49,
      "severity_level": "Critical"
    },
    {
      "title": "Countries to reconvene sooner to accelerate progress on WHO Pathogen Access and Benefit Sharing system negotiations",
      "description": "WHO Member States today ended their latest round of intensive negotiations on the world’s first Pathogen Access andBenefit Sharing (PABS) system. Countries decided to resume deliberations in January in a reflection of the shared commitment and urgency needed to help make the world safer from future pandemics. Countries convened for the fourth meeting of the Intergovernmental Working Group (IGWG) on the WHO Pandemic Agreement in Geneva from 1–5 December 2025. They requested to extend the current fourth round of negotiations, agreeing to resume from 20–22 January 2026. The World Health Assembly established the IGWG to undertake several tasks, including, as a priority, to draft and negotiate the PABS annex to the WHO Pandemic Agreement. Member States requested the establishment of a PABS platform to operate as a global system to share pathogens and their genetic information, along with the benefits that arise from their use, in a timely, fair and transparent way. This would pave the way for a more effective and equitable response to the next pandemic. “As we cross the halfway mark in negotiations on the Pathogen Access and Benefit-Sharing (PABS) system, I am encouraged by the progress we’ve made towards enabling a faster and more equitable global response to future pandemics,\" said IGWG Bureau co-chair Mr Matthew Harpur of the United Kingdom. \"Member States have demonstrated real commitment to finding common ground and bridging differences, as we work to deliver a strong PABS system by the next World Health Assembly.” IGWG Bureau co-Chair Ambassador Tovar da Silva Nunes, of Brazil, said: “WHO Member States have shown their dedication to finishing this important task. The progress achieved on access, benefit-sharing and core governance areas provides the foundation to move the process forward. We are confident we can build a strong and balanced PABS system that will benefit all people.” WHO Director-General Dr Tedros Adhanom Ghebreyesus added: “This is both a generational opportunity and a generational responsibility. I thank Member States and the IGWG Bureau for rising to the occasion. As we get ready to close out this year, we are in a strong position to forge consensus, finalize the draft, and prepare for adoption at next year’s World Health Assembly. Together, we are moving toward a world that is better prepared for future pandemics.\" Before this fourth session, the IGWG Bureau organized informal dialogues with stakeholders, including representatives from the private sector, academia, laboratories and sequence information databases. Similar focused dialogues will continue over the following weeks, in preparation for the resumed session in January. The fifth IGWG meeting will take place on 9–14 February 2026.",
      "url": "https://www.who.int/news/item/05-12-2025-countries-to-reconvene-sooner-to-accelerate-progress-on-who-pathogen-access-and-benefit-sharing-system-negotiations",
      "published": "Fri, 05 Dec 2025 18:44:42 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 48,
      "severity_level": "Critical"
    },
    {
      "title": "New prevention tools and investment in services essential in the fight against AIDS",
      "description": "On World AIDS Day, the World Health Organization (WHO) calls on governments and partners to rapidly expand access to new WHO-approved tools including lenacapavir (LEN) to drive down infections and counter disruption to essential health services caused by cuts to foreign aid. Despite dramatic funding setbacks, the global HIV response has gained a remarkable momentum in 2025 with the introduction and WHO approval of twice-yearly injectable lenacapavir for HIV prevention. LEN, a highly effective, long-acting alternative to oral pills and other options, is a transformative intervention for people who face challenges with regular adherence and stigma in accessing health care. WHO released in July this year new guidelines recommending the use of lenacapavir as an additional pre-exposure prophylaxis (PrEP) option for HIV prevention. Sharp and sudden reductions in international funding this year led to disruptions in HIV prevention, treatment and testing services, with essential community-led programmes, including pre-exposure prophylaxis (PrEP) and harm reduction initiatives for people who inject drugs, being scaled back or shut down entirely in some countries. “We face significant challenges, with cuts to international funding, and prevention stalling,\" said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. “At the same time, we have significant opportunities, with exciting new tools with the potential to change the trajectory of the HIV epidemic. Expanding access to those tools for people at risk of HIV everywhere must be priority number one for all governments and partners.” Marking World AIDS Day under the theme “Overcoming disruption, transforming the AIDS response” , WHO is urging a dual track approach – solidarity and investment in innovations to protect and empower communities most at risk. After decades of progress, the HIV response stands at a crossroads. In 2024: HIV prevention efforts stagnated, with 1.3 million new infections, disproportionately impacting key and vulnerable populations; UNAIDS data reveal that almost half (49%) of new HIV infections occurred among key populations – including sex workers, men who have sex with men, transgender women, and people who inject drugs – and their sexual partners; while sex workers and transgender women face a 17-fold higher risk of acquiring HIV, men who have sex with men face an 18-fold higher risk, and people who inject drugs – a 34-fold higher risk; underlying drivers include stigma, discrimination, and legal, social and structural barriers these groups face to access HIV care; and globally, an estimated 40.8 million people were living with HIV, and 630 000 people died from HIV-related causes. While the full scale of the impact of foreign aid cuts is still being assessed, access to PrEP is believed to have declined dramatically. The AIDS Vaccine Advocacy Coalition estimates that, as of October 2025, 2.5 million people who used PrEP in 2024 lost access to their medications in 2025 due solely to donor funding cuts. Such disruptions could have far-reaching consequences for the global HIV response, jeopardizing efforts to end AIDS by 2030. Momentum for innovation “We are entering a new era of powerful innovations in HIV prevention and treatment,” said Dr Tereza Kasaeva, Director of WHO’s Department for HIV, TB, Hepatitis and STIs. “By pairing these advances with decisive action, supporting communities, and removing structural barriers, we can ensure that key and vulnerable populations have full access to life-saving services.” WHO prequalified LEN for HIV prevention on 6 October 2025, followed by national regulatory approvals that will increase access in South Africa (on 27 October), Zimbabwe (27 November) and Zambia (4 November). WHO’s Collaborative Registration Procedure (CRP) supported these approvals. WHO is also working closely with partners such as CIFF, the Gates Foundation, the Global Fund to Fight AIDS, Tuberculosis and Malaria and Unitaid to enable affordable access to LEN in countries. Ensuring that long-acting HIV medicines for prevention and treatment reach priority populations must be a global priority. Integrating HIV services into primary health care WHO emphasizes that ending the AIDS epidemic depends on a fully integrated, evidence-based and rights-driven approach under the umbrella of primary health care. WHO will continue working with partners and leaders to put those most affected at the centre of the HIV response. Despite funding setbacks, the resilience and leadership of communities offer a clear path forward. By strengthening health systems, increasing domestic investment, and protecting human rights, countries can safeguard gains and ensure no one is left behind.",
      "url": "https://www.who.int/news/item/01-12-2025-new-prevention-tools-and-investment-in-services-essential-in-the-fight-against-aids",
      "published": "Sun, 30 Nov 2025 17:04:40 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "WHO promotes lifesaving intervention for small and preterm babies on first official World Prematurity Day",
      "description": "The World Health Organization (WHO) is marking its first official observance of World Prematurity Day with the launch of a new global clinical practice guide for Kangaroo Mother Care (KMC) – a simple, proven and life-saving intervention that significantly improves survival for preterm and low birth weight babies. Each year, an estimated 15 million babies are born too soon (before 37 weeks of pregnancy), and complications from preterm birth are the leading cause of death among children under five years of age. In the poorest countries, most extremely preterm babies die within days – whereas in high-income countries, almost all survive. KMC – which combines prolonged skin to skin contact with breast-milk feeding – has been shown to dramatically improve outcomes for small and preterm newborns, and to be feasible and cost-effective in all settings. Among other positive impacts, it is associated with a more than 30% reduction in newborn deaths, a close to 70% reduction in hypothermia and a 15% reduction in severe infections – as well as improved weight gain and better longer-term health and cognitive development. “KMC is not just a clinical intervention – it empowers mothers and families and transforms newborn care,” said Dr Jeremy Farrar, WHO’s Assistant Director-General for Health Promotion, Disease Prevention and Care. “It should now be universal clinical practice for all small and preterm babies, ensuring they have the best chance to survive and thrive.” A lifesaving intervention for all babies born early or small Geared at health workers, facility managers as well as caregivers, the new WHO guide offers detailed, step-by-step, adaptable guidance for initiating, maintaining, and monitoring KMC. It states that all preterm or low birth weight newborns should receive KMC starting immediately after birth - unless they are unable to breathe on their own or their blood pressure and circulation drops to dangerously low levels, requiring urgent treatment. While mothers should typically be the primary providers, fathers and other family members can also give KMC if the mother is unable – as well as providing critical emotional and practical support. KMC can be practiced at all levels of health facilities – from the labour room or the operating theatre to postnatal wards and special or intensive newborn care units – and can be continued at home. The guide includes practical tips on how to secure the baby in the KMC position, whether using simple cloth wraps, elastic binders or specially designed garments. It also outlines how health facilities create enabling environments for KMC through supportive policies and training staff. Family-friendly approaches are crucial for successful implementation, the guide notes – including ensuring mothers can always be together in the same room as their babies. All small and sick newborns need dedicated medical care and attention On this World Prematurity Day, with the theme ‘ A strong start for a hopeful future’ , WHO is calling on governments, health systems and partners to prioritize quality care for preterm and low birth weight babies. This means ensuring dedicated wards or facilities with specially trained neonatal staff providing round-the-clock care for small and sick newborns, as well as universal access to essential equipment and medicines like antibiotics. Because they have less time in the womb, many preterm babies have underdeveloped lungs, brains, immune systems and capacity for temperature regulation. This increases risks from infections, hypothermia, heart problems, respiratory distress, and other life-threatening complications. “No newborn should die from preventable causes,” said Dr Per Ashorn, WHO’s Unit Head for Newborn and Child Health and Development. “It’s time to ensure every baby gets the attention they need, by investing in special care for small or sick babies, alongside quality maternity services that can prevent many occurrences of preterm birth.”",
      "url": "https://www.who.int/news/item/14-11-2025-who-promotes-lifesaving-intervention-for-small-and-preterm-babies-on-first-official-world-prematurity-day",
      "published": "Fri, 14 Nov 2025 17:39:52 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 41,
      "severity_level": "Critical"
    },
    {
      "title": "More countries report rising levels of drug-resistant gonorrhoea, warns WHO",
      "description": "The World Health Organization (WHO) warns that gonorrhoea, a sexually transmitted infection, is becoming increasingly resistant to antibiotics, according to new data from its Enhanced Gonococcal Antimicrobial Surveillance Programme (EGASP) , which monitors the spread of drug-resistant gonorrhoea. The report highlights the need to strengthen surveillance, improve diagnostic capacity and ensure equitable access to new treatments for sexually transmitted infections (STIs). The release of the new data coincides with World Antimicrobial Resistance (AMR) Awareness Week , reinforcing the importance of global action against drug-resistant infections. EGASP, launched by WHO in 2015, collects laboratory and clinical data from sentinel sites around the world to track AMR and inform treatment guidelines. “This global effort is essential to tracking, preventing, and responding to drug-resistant gonorrhoea and to protecting public health worldwide,” said Dr Tereza Kasaeva, Director of the WHO Department for HIV, TB, Hepatitis & STIs. “WHO calls on all countries to address the rising levels of sexually transmitted infections (STIs) and integrate gonorrhoea surveillance into national STI programmes.” Between 2022 and 2024, resistance to ceftriaxone and cefixime, the primary antibiotics used to treat gonorrhoea, rose sharply from 0.8% to 5% and from 1.7% to 11% respectively, with resistant strains detected in more countries. Resistance to azithromycin remained stable at 4%, while resistance to ciprofloxacin reached 95%. Cambodia and Viet Nam reported the highest resistance rates. In 2024, 12 EGASP countries in five WHO regions provided data, an increase from just four countries in 2022. This is a positive development reflecting growing commitment to track and contain drug-resistant infections in countries and regions. The countries- Brazil, Cambodia, India, Indonesia, Malawi, the Philippines, Qatar, South Africa, Sweden, Thailand, Uganda and Viet Nam reported 3615 cases of gonorrhoea. Over half of all cases of symptomatic gonorrhoea in men (52%) were reported from countries in the WHO Western Pacific Region, including the Philippines (28%), Viet Nam (12%), Cambodia (9%) and Indonesia (3%). Countries of the WHO African Region accounted for 28% of cases, followed by countries in the South-East Asia Region (13%, Thailand), the Eastern Mediterranean Region (4%, Qatar) and the Region of the Americas (2%, Brazil). The median patient age was 27 years (range: 12–94). Among cases, 20% were men who have sex with men, and 42% reported multiple sexual partners within the past 30 days. Eight percent reported recent antibiotic use, and 19% had travelled recently. Strengthening and expanding global surveillance In 2024, WHO advanced genomic surveillance, with nearly 3000 samples sequenced from eight countries. Landmark studies on new treatments such as zoliflodacin and gepotidacin, as well as studies on tetracycline resistance, were conducted by WHO’s Collaborating Centre on AMR in STI in Sweden, in coordination with WHO. These are helping guide future gonorrhoea control and doxycycline-based prevention (DoxyPEP) strategies. EGASP continued to expand its reach in 2024, with Brazil, Côte d’Ivoire and Qatar joining the programme, and India beginning implementation and data reporting starting in 2025 under its National AIDS and Sexually Transmitted Diseases Control Programme. Despite notable progress, EGASP faces challenges, including limited funding, incomplete reporting, and gaps in data from women and extragenital sites. WHO calls for urgent investment, particularly in national surveillance systems, to sustain and expand global gonococcal AMR surveillance.",
      "url": "https://www.who.int/news/item/19-11-2025-more-countries-report-rising-levels-of-drug-resistant-gonorrhoea--warns-who",
      "published": "Wed, 19 Nov 2025 10:01:44 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "At least four people killed in mass stabbing in Taipei",
      "description": "Man, 27, from northern Taiwan reported to have fallen to his death in police chase after rampage through capital At least four people have died in a rare mass stabbing incident in central Taipei after an attacker used smoke grenades to cause chaos as he went on a violent rampage through Taiwan’s capital. Several people were also injured. The suspected assailant is among the dead after he fell from a building during a police chase through a busy shopping district on Friday evening. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/mass-stabbing-tapei",
      "published": "Fri, 19 Dec 2025 16:32:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Trapped journalists rescued after mob sets fire to Bangladesh newspaper offices",
      "description": "Protesters have stormed the headquarters of two major newspapers in Bangladesh, amid widespread unrest following the death of a political activist.",
      "url": "https://news.sky.com/story/trapped-journalists-rescued-after-mob-sets-fire-to-bangladesh-newspaper-offices-13485471",
      "published": "Fri, 19 Dec 2025 08:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "Prime minister backs NSW premier’s call for a royal commission into the Bondi beach terror attack",
      "description": "Anthony Albanese said he would ‘support whatever action the NSW government takes’ Get our breaking news email , free app or daily news podcast Anthony Albanese has backed the NSW premier’s call for a state-based royal commission into last weekend’s terror attack at Bondi beach, after Chris Minns called for a full “comprehensive look” at the deadly shooting. Speaking to reporters on Saturday, Minns said the state needed a royal commission to investigate the mass shooting that killed 15 people. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/20/nsw-premier-announces-new-laws-banning-hate-speech-and-symbols-in-wake-of-bondi-beach-terror-attack",
      "published": "Sat, 20 Dec 2025 03:03:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Knife attacker kills three after smoke bombing Taiwan metro",
      "description": "At least three people have been killed and nine others injured as a knife-wielding attacker ‍went ‍on a ​rampage in the Taiwanese capital Taipei. Nicholas Rushworth has this story.",
      "url": "https://www.france24.com/en/video/20251220-knife-attacker-kills-three-after-smoke-bombing-taiwan-metro",
      "published": "Sat, 20 Dec 2025 09:52:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Australian state weighs ban on 'globalize the intifada' chants, masked protesters in wake of Hanukkah attack",
      "description": "Australia's New South Wales is proposing a ban on \"globalize the intifada\" chants after 15 people were killed in the ISIS-inspired Bondi Beach Hanukkah shooting.",
      "url": "https://www.foxnews.com/world/australian-state-weighs-ban-globalize-intifada-chants-masked-protesters-wake-hanukkah-attack",
      "published": "Sat, 20 Dec 2025 13:32:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Former Australian minister says ‘radical Islam pulled the trigger’ in nation's worst terror attack",
      "description": "Josh Frydenberg slams Anthony Albanese's government over rising antisemitic violence in Australia, warning years of inaction enabled extremism to flourish.",
      "url": "https://www.foxnews.com/world/former-australian-minister-says-radical-islam-pulled-trigger-australias-worst-terror-attack",
      "published": "Sat, 20 Dec 2025 16:38:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: More UN staff detentions in Yemen, peacekeepers killed in Sudan sent home, attacks in Ukraine",
      "description": "The UN Secretary-General on Friday condemned the arbitrary detention of 10 more UN personnel by Houthi de facto authorities in Yemen, warning that the growing crackdown is crippling humanitarian operations and putting millions of lives at risk.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166644",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Eight killed in Russian strike on Odessa",
      "description": "Russian missile strikes on port infrastructure in Odesa, southern Ukraine, killed eight people and left 27 wounded, Ukraine’s Emergency Service said Saturday morning. The strikes came as Russian envoys are set to travel to Miami to hold talks with US negotiators aimed at ending the war in Ukraine. Eliza Herbert and Léo Paichard tell us more.",
      "url": "https://www.france24.com/en/video/20251220-eight-killed-in-russian-strike-on-odessa",
      "published": "Sat, 20 Dec 2025 13:11:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Families mourn loved ones lost in Bondi Beach terror attack: ‘No words can describe the pain’",
      "description": "Families of Bondi Beach shooting victims share heartbreaking tributes to their loved ones killed in the deadly terror attack during Hanukkah celebration.",
      "url": "https://www.foxnews.com/world/families-mourn-loved-ones-lost-bondi-beach-terror-attack-no-words-can-describe-pain",
      "published": "Thu, 18 Dec 2025 04:20:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Taiwan attacker planned assault that killed 3 and injured 11, authorities say",
      "description": "Taiwanese authorities says the suspect who killed three people and injured 11 others in knife and smoke-grenade attacks in the island’s capital had planned the assaults and set fires at other locations earlier in the day",
      "url": "https://abcnews.go.com/International/wireStory/taiwan-attacker-planned-assault-killed-3-injured-11-128576755",
      "published": "Sat, 20 Dec 2025 19:25:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "WHO hosts the second Global Summit to advance evidence, integration and innovation for traditional medicine",
      "description": "The World Health Organization (WHO)’s Second Global Summit on Traditional Medicine , jointly organized with the Government of India, opens today, bringing together government ministers, scientists, Indigenous leaders, and practitioners from more than 100 countries. The Summit is expected to announce major scientific initiatives and new commitments aimed at advancing the implementation of the WHO Global Traditional Medicine Strategy 2025–2034 , centred on stronger evidence, better regulation, systems integration, collaboration and community engagement. Traditional medicine (TM) encompasses codified and non-codified systems that predate biomedicine and have continued to evolve for contemporary use. For many, TM remains the main source of health care—locally accessible, affordable and bio-culturally aligned—and for many more, it is a preferred, personalized and more natural health option. Nearly 90% of WHO Member States (170 out of 194) report that 40–90% of their populations use TM. “WHO is committed to uniting the wisdom of millennia with the power of modern science and technology to realise the vision of health for all,” said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. “By engaging responsibly, ethically, and equitably, and by harnessing innovation from AI to genomics, we can unlock the potential of traditional medicine to deliver safer, smarter, and more sustainable health solutions for every community and for our planet.” Strengthening evidence, regulation and integration of TM into health systems In a world facing increasing challenges to health systems, nearly half of the global population – 4.6 billion – lack access to essential health services, while a quarter – over 2 billion people – experience financial hardship to access health care . Integrating TM into health systems is critical to expanding access and choice to affordable, people-centred health care and advancing UHC, ensuring everyone can receive health care they need without financial strain. Emerging evidence indicates that integrating TM into health systems can deliver cost efficiencies and improve health outcomes. Such integration emphasizes prevention and health promotion, contributing to broader health benefits such as more appropriate use of antibiotics. Achieving effective integration requires robust science, global standards for quality and safety, and strong regulatory mechanisms. “We need to apply the same scientific rigour to the assessment and validation of biomedicine and traditional medicines, while respecting biodiversity, cultural specificities and ethical principles,” said Dr Sylvie Briand, WHO Chief Scientist. “Stronger collaborations and frontier technologies – such as AI, genomics, systems biology, neurosciences and advanced data analytics – can transform how we study and apply traditional medicine.” Advancing innovation, investment and sustainable benefits TM underpins fast-growing global industries, such as herbal medicines. All TM formulations, and more than half of biomedical pharmaceuticals, originate from natural resources, which remain a vital source for new drug discovery. Indigenous Peoples safeguard around 40% of the world’s biodiversity while representing just 6% of the global population. Advancing TM requires addressing Indigenous rights, fair trade, and benefit-sharing considerations. Despite TM’s widespread use and vital role in stewarding natural resources for health and well-being, less than 1% of global health research funding is dedicated to TM. To help close the knowledge and research gaps, WHO is launching the Traditional Medicine Global Library, the first of its kind, featuring more than 1.6 million scientific records spanning research, policies, regulations and thematic collections on diverse TM applications. Developed in response to calls by Heads of State during G20 and BRICS meetings in 2023, the Library also provides equitable online access to peer-reviewed content for institutions in lower-income countries through the Research4Life initiative. It also supports countries in documenting TM with intellectual property protections and in building scientific capacity to drive innovation. “Advancing traditional medicine is an evidence-based, ethical and environmental imperative,” said Dr Shyama Kuruvilla, Director a.i. of WHO’s Global Traditional Medicine Centre. “The Global Summit fosters the conditions and collaborations required for TM to contribute at scale to the flourishing of all people and the planet.” The Summit (17–19 December 2025, New Delhi) will also announce new commitments from governments and other stakeholders, alongside a call for a global consortium to address systemic gaps and accelerate implementation of the Global TM Strategy at scale.",
      "url": "https://www.who.int/news/item/17-12-2025-who-hosts-the-second-global-summit-to-advance-evidence--integration-and-innovation-for-traditional-medicine",
      "published": "Wed, 17 Dec 2025 08:09:29 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza famine over but situation 'remains critical', UN says",
      "description": "Improved aid access means there is no longer famine in Gaza, but the war-ravaged territory still faces emergency conditions, a UN-backed global hunger monitor said on Friday. Israel denied that there is a food shortage in Gaza, where around 1.6 million people are expected to face \"crisis\" levels of food insecurity in the coming months.",
      "url": "https://www.france24.com/en/video/20251220-gaza-famine-over-but-situation-remains-critical-un-says",
      "published": "Sat, 20 Dec 2025 07:40:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: UN to evacuate Kadugli base in Sudan, celebrating migrant contributions, ending colonialism",
      "description": "The United Nations Interim Security Force for Abyei (UNISFA) will evacuate its logistics base in Kadugli, Sudan, in the wake of the “heinous attack” this past weekend that killed six Bangladeshi peacekeepers and seriously injured eight others.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166631",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "U.S. launches strikes in Syria targeting Islamic State fighters after American deaths",
      "description": "The Trump administration launched military strikes in Syria to \"eliminate\" Islamic State group fighters in retaliation for an attack that killed two U.S. troops and an American interpreter a week ago.",
      "url": "https://www.npr.org/2025/12/19/g-s1-103194/u-s-launches-strikes-syria",
      "published": "Fri, 19 Dec 2025 23:18:30 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "At least 8 dead and dozens wounded in Russian strike on Ukraine's Odesa port",
      "description": "A Russian missile strike on port infrastructure in Odesa has killed eight people and wounded 27, according to Ukraine’s emergency service",
      "url": "https://abcnews.go.com/International/wireStory/8-dead-dozens-wounded-russian-strike-ukraines-odesa-128577627",
      "published": "Sat, 20 Dec 2025 15:13:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Claudio Manuel Neves-Valente identified as Brown University and MIT shooting suspect, found dead",
      "description": "Authorities identified the Brown University shooting suspect as Claudio Manuel Neves-Valente. Two students were killed and nine were injured in the campus attack.",
      "url": "https://www.foxnews.com/us/claudio-manuel-neves-valente-identified-brown-university-shooting-suspect-found-dead",
      "published": "Thu, 18 Dec 2025 21:41:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Measles deaths down 88% since 2000, but cases surge",
      "description": "Global immunization efforts have led to an 88% drop in measles deaths between 2000 and 2024, according to a new report from the World Health Organization (WHO). Nearly 59 million lives have been saved by the measles vaccine since 2000.",
      "url": "https://www.who.int/news/item/28-11-2025-measles-deaths-down-88--since-2000--but-cases-surge",
      "published": "Wed, 26 Nov 2025 18:24:57 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan war: World urged not to ignore ‘gruesome sexual violence’",
      "description": "Harrowing new details emerged on Thursday in a UN report detailing targeted sexual violence and summary executions in Sudan’s North Darfur region, attributed to paramilitary fighters who overran the city of El Fasher in late October.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166624",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "4 dead, 11 injured in Taiwan knife attack",
      "description": "Taiwan ordered sweeping security reforms after a knife attack killed three people and injured 11 in Taipei.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/4-dead-11-injured-in-taiwan-knife-attack?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 19:13:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "A sunrise crowd gathers at Bondi Beach in solace and defiance after a massacre",
      "description": "Thousands of people have returned to Australia's Bondi Beach in the first full day of opening since a mass shooting killed 15 people",
      "url": "https://abcnews.go.com/International/wireStory/sunrise-crowd-gathers-bondi-beach-solace-defiance-after-128548303",
      "published": "Fri, 19 Dec 2025 10:03:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: Humanitarian situation is 'worst crisis' of 2025",
      "description": "Despite ongoing fighting and horrific human rights violations, global attention on the world's worst humanitarian and displacement crises remains low. The situation in Kordofan is worsening.",
      "url": "https://www.dw.com/en/sudan-humanitarian-situation-is-worst-crisis-of-2025/a-75243232?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 09:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "US seizes another tanker off Venezuela - as Brazil issues warning",
      "description": "The US has been warned against risking a \"humanitarian catastrophe\" in Venezuela after it seized another tanker.",
      "url": "https://news.sky.com/story/us-seize-another-tanker-off-coast-of-venezuela-13486172",
      "published": "Sat, 20 Dec 2025 19:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Israel hits Hezbollah targets in Lebanon ahead of deadline to disarm terror group",
      "description": "Hezbollah faces new Israeli strikes in southern Lebanon as ceasefire committee prepares to enforce the U.S.-brokered agreement terms by Dec. 31 deadline.",
      "url": "https://www.foxnews.com/world/israel-hits-hezbollah-targets-lebanon-ahead-deadline-disarm-terror-group",
      "published": "Thu, 18 Dec 2025 09:28:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "UN urges calm in Bangladesh after killing of protest leader sparks unrest",
      "description": "The United Nations has urged calm in Bangladesh after the killing of a prominent youth protest leader sparked fresh unrest, raising concerns about political violence and the safety of civic space as the country prepares for elections early next year.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166642",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Civilians at risk amid escalating Thailand-Cambodia conflict: UN rights chief",
      "description": "Intensifying air strikes and heavy artillery fire across Thailand and Cambodia have left civilians increasingly at risk, UN High Commissioner for Human Rights Volker Türk warned on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166626",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Australia anti-terror police detain 7 men as country lays youngest Bondi Beach victim to rest",
      "description": "Australian police have detained seven men during anti-terror raids in Sydney on Thursday as the country lays to rest the youngest victim of the deadly Bondi Beach attack.",
      "url": "https://www.foxnews.com/world/australia-anti-terror-police-detain-7-men-country-lays-youngest-bondi-beach-victim-rest",
      "published": "Thu, 18 Dec 2025 11:26:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "US plan for $1.6m hepatitis B vaccine study in Africa called ‘highly unethical’",
      "description": "Experts decry ‘neocolonialist’ Guinea-Bissau study after Trump administration changed advice for US babies The Trump administration has indicated that it will fund a $1.6m study on hepatitis B vaccination of newborns in the west African country of Guinea-Bissau, where nearly one in five adults live with the virus – a move that researchers call “highly unethical” and “extremely risky”. The news follows an official change in recommendations on hepatitis B vaccines at birth from the US Centers for Disease Control and Prevention (CDC), which called the shots an “individual” decision, despite decades of safe and effective vaccination and no evidence of harm. It is part of sweeping changes to childhood immunizations by the US health secretary, Robert F Kennedy Jr, which have global repercussions – including cutting funding for programs that bring vaccines to countries around the world. Continue reading...",
      "url": "https://www.theguardian.com/society/2025/dec/19/hepatitis-b-vaccine-study-guinea-bissau-rfk",
      "published": "Fri, 19 Dec 2025 16:34:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Colombian mercenaries in Sudan ‘recruited by UK-registered firms’",
      "description": "Exclusive Guardian investigation finds companies set up by people sanctioned by US hired Colombian fighters for Rapid Support Forces, widely suspected of war crimes in Sudan Close to Tottenham Hotspur’s shiny football stadium in London is a squat, nondescript block of flats. It holds a grim secret beyond the unremarkable beige brickwork – a cramped, second-floor apartment in the British capital, linked to murderous atrocities unfolding 3,000 miles south. The one-bedroom flat off north London’s Creighton Road is, according to UK government records, tied to a transnational network of companies involved in the mass recruitment of mercenaries to fight in Sudan alongside paramilitaries accused of myriad war crimes and genocide. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/19/colombian-mercenaries-sudan-rsf-us-sanctions-recruited-uk-registered-firms-investigation",
      "published": "Fri, 19 Dec 2025 06:00:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Seven Colombian soldiers killed in rebel drone attack on base near Venezuela",
      "description": "Colombia’s ELN guerrilla group used drones and explosives in Thursday night attack that also injured at least 30 soldiers Colombia’s ELN guerrilla group has attacked a military base near Venezuela with drones and explosives, killing seven soldiers and wounding 30. Founded in 1964 and inspired by the Cuban revolution, the ELN is the oldest surviving guerrilla group in the Americas, and controls key drug-producing regions of Colombia. Efforts to negotiate a peace settlement have repeatedly stalled. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/colombia-eln-guerrilla-group-attack-military-base",
      "published": "Fri, 19 Dec 2025 16:43:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: US launches airstrikes on IS targets after attack",
      "description": "US officials said the strikes were aimed at IS targets, not the Syrian state, in retaliation for an attack which killed two American servicemen and an interpreter last week.",
      "url": "https://www.dw.com/en/syria-us-launches-airstrikes-on-is-targets-after-attack/a-75250651?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 00:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US pounds targets across Syria: five ISIS members killed",
      "description": "The US military launched large-scale strikes against dozens of Islamic State targets in Syria on Friday in retaliation for an attack on American personnel, US officials said. A US-led coalition has been carrying out airstrikes and ground operations in Syria targeting Islamic State suspects in recent months, often with the involvement of Syria's security forces. Simon Mortiz has more.",
      "url": "https://www.france24.com/en/video/20251220-us-pounds-targets-across-syria-five-isis-members-killed",
      "published": "Sat, 20 Dec 2025 13:09:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Brown University, MIT shootings: Are elite US universities prepared for targeted violence?",
      "description": "Campus shootings at Brown University and MIT linked to single suspect with ties to both elite schools. Two killed at Brown, MIT professor murdered.",
      "url": "https://www.foxnews.com/us/brown-university-mit-shootings-elite-us-universities-prepared-targeted-violence",
      "published": "Sat, 20 Dec 2025 08:00:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Former Hamas hostage warned Australian leaders about dangers of antisemitism months before Bondi Beach attack",
      "description": "Former Hamas hostage Eli Sharabi had warned Australian leaders about rising antisemitism months before the deadly Bondi Beach Hanukkah shooting attack.",
      "url": "https://www.foxnews.com/world/former-hamas-hostage-warned-australian-leaders-about-dangers-antisemitism-months-before-bondi-beach-attack",
      "published": "Sat, 20 Dec 2025 08:16:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Aid agencies warn Gaza response at breaking point as Israel urged to lift new restrictions",
      "description": "Humanitarian agencies working in the Occupied Palestinian Territory (OPT) have warned that life-saving aid operations risk collapse unless Israel immediately lifts new barriers that are blocking access and forcing international charities to shut down.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166622",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Bondi Beach shooting: Jewish community \"completely unbreakable\", PM says",
      "description": "Australian surf lifesavers lined Bondi Beach to observe three minutes of silence in memory of the 15 people who lost their lives. Volunteers across the country joined them in a show of solidarity with the Jewish community. Senior researcher and adjunct professor at Sciences Po (CERI), in Paris, David Camroux, shares his insights on the Bondi beach attack.",
      "url": "https://www.france24.com/en/video/20251220-bondi-beach-shooting-jewish-community-completely-unbreakable-pm-says",
      "published": "Sat, 20 Dec 2025 09:34:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Thousands gather as Bondi Beach reopens, commemorating victims of Hanukkah attack",
      "description": "Police reopened parts of Bondi Beach with thousands forming solidarity circle after mass shooting targeting Jewish community left 15 dead.",
      "url": "https://www.foxnews.com/world/thousands-gather-bondi-beach-reopens-commemorating-victims-hanukkah-attack",
      "published": "Fri, 19 Dec 2025 09:02:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "US intercepts second merchant vessel off coast of Venezuela in international waters",
      "description": "Vessel does not appear to be on list of US-sanctioned vessels, which would represent escalation in blockade US forces on Saturday apprehended a second merchant vessel carrying oil off the coast of Venezuela in international waters in the midst of an American blockade against the country’s oil, according to the US homeland security department. The stoppage follows the seizure by US forces of another oil tanker off Venezuela’s coast on 10 December. Both vessels were headed to Asia. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/20/us-second-merchant-vessel-venezuela",
      "published": "Sat, 20 Dec 2025 20:15:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Only US can persuade Russia to end Ukraine war, Zelensky says",
      "description": "Ukrainian President Volodymyr Zelensky Saturday said that only the US can persuade Russia to end the war in Ukraine. The comments come as Russian envoy Kirill Dmitriev arrived in Miami for talks with US counterparts Steve Witkoff and Jared Kushner. Earlier, Russian missile strikes hit port infrastructure in Odesa, killing eight and wounding 27, Ukraine’s Emergency Service said. Read our blog to see how the day's events unfolded.",
      "url": "https://www.france24.com/en/europe/20251220-live-us-russian-officials-to-meet-in-florida-for-more-ukraine-talks",
      "published": "Sat, 20 Dec 2025 06:29:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "WHO issues first global guideline on infertility",
      "description": "The World Health Organization (WHO) today called on countries to make fertility care safer, fairer and more affordable for all in its first-ever global guideline for the prevention, diagnosis and treatment of infertility.Infertility is estimated to affect 1 in 6 people of reproductive age at some point in their lives.",
      "url": "https://www.who.int/news/item/28-11-2025-who-issues-first-global-guideline-on-infertility",
      "published": "Fri, 28 Nov 2025 08:12:14 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Global gains in tuberculosis response endangered by funding challenges",
      "description": "Tuberculosis (TB) remains one of the world’s deadliest infectious killers, claiming over 1.2 million lives and affecting an estimated 10.7 million people last year, according to the WHO Global Tuberculosis Report 2025, released today.",
      "url": "https://www.who.int/news/item/12-11-2025-global-gains-in-tuberculosis-response-endangered-by-funding-challenges",
      "published": "Wed, 12 Nov 2025 14:08:15 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Syria’s humanitarian needs remain high despite reduced violence, UN warns",
      "description": "Humanitarian needs in Syria remain immense despite a year of reduced violence and political change, with millions still displaced, basic services strained and funding shortfalls threatening aid operations, senior UN officials said on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166629",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "On Maduro’s ‘terror island,’ Hezbollah operatives move in as tourists drift out",
      "description": "Israel's strikes on Hezbollah are driving the terror group to expand operations in Venezuela, creating new security threats closer to U.S. borders.",
      "url": "https://www.foxnews.com/world/hezbollah-shifts-operations-closer-us-border-israel-strikes-force-strategic-retreat-venezuela",
      "published": "Sat, 20 Dec 2025 07:00:21 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Knife attacker kills three after smoke bombing Taiwan metro",
      "description": "The suspect's spree began at Taipei's main metro before he moved to another station nearby.",
      "url": "https://www.bbc.com/news/articles/cx251p7k23mo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 20:33:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "UNSC condemns Rwanda, M23 rebels for offensive in eastern DR Congo",
      "description": "Resolution urges Rwandan troops to withdraw from area of conflict that has killed hundreds, displaced tens of thousands.",
      "url": "https://www.aljazeera.com/news/2025/12/20/un-security-council-urges-rwanda-to-withdraw-troops-from-eastern-dr-congo?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 14:11:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran executes man accused of spying for Israel’s Mossad: State media",
      "description": "Aghil Keshavarz is the latest person put to death for espionage since June conflict with Israel.",
      "url": "https://www.aljazeera.com/news/2025/12/20/iran-executes-man-accused-of-spying-for-israels-mossad-state-media?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 09:20:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "US announces more than $10bn of arms sales to Taiwan",
      "description": "Package includes medium-range missiles, howitzers and drones, and has drawn an angry response from China The maps that show how China’s military is squeezing Taiwan The Trump administration has announced a massive package of arms sales to Taiwan valued at more than $10bn that includes medium-range missiles, howitzers and drones, drawing an angry response from China. The state department announced the sales late on Wednesday during a nationally televised address by president Donald Trump, who made scant mention of foreign policy issues and did not speak about China or Taiwan at all. US-Chinese tensions have ebbed and flowed during Trump’s second term, largely over trade and tariffs but also over China’s increasing aggressiveness toward Taiwan, which Beijing has said must unify with the People’s Republic of China. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/18/us-announces-more-than-10bn-of-arms-sales-to-taiwan",
      "published": "Thu, 18 Dec 2025 15:01:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Opinion: Remembering the lives lost to a senseless act of terror",
      "description": "The attack at Australia's Bondi Beach earlier this week on people who were celebrating the first night of Hanukkah was horrific. Stories have emerged about those who died trying to stop the gunmen.",
      "url": "https://www.npr.org/2025/12/20/nx-s1-5643566/opinion-remembering-the-lives-lost-to-a-senseless-act-of-terror",
      "published": "Sat, 20 Dec 2025 08:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "WHO and Brazil urge swift action on Belém Health Action Plan at COP30",
      "description": "The COP30 Special report on health and climate change: delivering the Belém Health Action Plan, notes that rising temperatures and collapsing health systems are claiming more lives, and calls for immediate and coordinated action to protect health in a rapidly warming world. It follows the launch of the Belém Health Action Plan, a flagship initiative of Brazil’s COP 30 Presidency, unveiled on the dedicated Health Day of COP30 – 13 November 2025.",
      "url": "https://www.who.int/news/item/14-11-2025-who-and-brazil-urge-swift-action-on-bel-m-health-action-plan-at-cop30",
      "published": "Fri, 14 Nov 2025 09:02:01 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "World leaders adopt a historic global declaration on noncommunicable diseases and mental health",
      "description": "Leaders from across the world at the Eightieth United Nations General Assembly (UNGA) have adopted the political declaration to combat noncommunicable diseases (NCDs) and mental health challenges through a fully integrated approach. This is the outcome of the intergovernmental negotiations in advance of and considered by the fourth high-level meeting of the UNGA on the prevention and control of NCDs and the promotion of mental health and well-being, held on 25 September 2025.",
      "url": "https://www.who.int/news/item/16-12-2025-world-leaders-adopt-a-historic-global-declaration-on-noncommunicable-diseases-and-mental-health",
      "published": "Tue, 16 Dec 2025 08:06:59 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "World marks cervical cancer elimination day as countries accelerate action",
      "description": "Today marks the first World Cervical Cancer Elimination Day – mandated by the World Health Assembly – a historic milestone in global efforts to end a preventable cancer.",
      "url": "https://www.who.int/news/item/17-11-2025-world-marks-cervical-cancer-elimination-day-as-countries-accelerate-action",
      "published": "Mon, 17 Nov 2025 10:04:46 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "WHO launches global guidelines on diabetes during pregnancy on World Diabetes Day",
      "description": "The World Health Organization (WHO) today released its first global guidelines for the management of diabetes during pregnancy, a condition affecting about one in six pregnancies – or 21 million women annually. The new recommendations provide a critical roadmap to tackle this growing health challenge and prevent serious complications for both women and their children.",
      "url": "https://www.who.int/news/item/14-11-2025-who-launches-global-guidelines-on-diabetes-during-pregnancy-on-world-diabetes-day",
      "published": "Fri, 14 Nov 2025 08:01:45 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Calming the mind and promoting global peace on World Meditation Day",
      "description": "Meditation, which has its roots in religious, yogic and secular traditions from various civilisations, calls for living in the present moment.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166641",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran killing spree continues as regime sets new record for 2025 executions, dissident group says",
      "description": "Human rights crisis deepens as Iran's execution spree reportedly reaches unprecedented levels with over 2,000 prisoners killed so far this year by the Tehran regime.",
      "url": "https://www.foxnews.com/world/iran-killing-spree-continues-regime-sets-new-record-2025-executions-dissident-group-says",
      "published": "Fri, 19 Dec 2025 12:12:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Five key moments in the assault on the rights of women and girls in 2025",
      "description": "Since Trump’s second term began in January, global healthcare, especially for sexual and reproductive health, has been under constant attack This time last year, women’s rights organisations were bracing themselves for a second Trump term. Few were prepared for the chaos that would be unleashed in January. The volume and speed of executive orders coming out of the White House were seen as a deliberate tactic to overwhelm and create panic. In many ways it worked – there was confusion, anger and exhaustion as organisations scrambled to fill the gap left by the USAID freeze. But that was just the beginning. The US administration has been the key driver, supported by intense advocacy work by ultra-conservative groups using the moment to strengthen global ties with political allies. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/16/five-key-moments-in-the-assault-on-the-rights-of-women-and-girls-in-2025",
      "published": "Tue, 16 Dec 2025 12:00:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Sri Lanka tea workers struggle in poverty. Flooding cost many their lives",
      "description": "After Sri Lanka struggled through one of the worst storms in its history, tea plantation workers are taking temporary refuge in government schools and temples as entire villages were buried in mud in the central highlands",
      "url": "https://abcnews.go.com/International/wireStory/sri-lanka-tea-workers-struggle-poverty-flooding-cost-128574016",
      "published": "Fri, 19 Dec 2025 22:41:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "US carries out 'massive' strike against IS in Syria",
      "description": "The US says it struck dozens of targets across Syria in response to last week's deadly Islamic State attack on US forces there.",
      "url": "https://www.bbc.com/news/articles/c5yq7zzw618o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 11:44:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Putin vows no more wars if West treats Russia with respect",
      "description": "Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\".",
      "url": "https://www.bbc.com/news/articles/cp89p082y2xo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 21:43:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump and top aides refuse to rule out war with Venezuela",
      "description": "President Nicolás Maduro orders Venezuelan navy to escort oil tankers after seizure by US forces What action is Trump taking against Venezuela’s oil industry? Donald Trump and his top advisers have refused to rule out the potential for open conflict with Venezuela as Nicolás Maduro urged his navy to escort oil tankers defying the largest US fleet deployed in the region in decades. In an interview broadcast on Friday morning, Donald Trump told NBC News that going to war with Maduro’s regime remains on the table. “I don’t rule it out, no,” he said in a phone interview with the network. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/19/trump-venezuela-war",
      "published": "Fri, 19 Dec 2025 19:12:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Mercosur summit: Lula, Milei clash over US-Venezuela tensions",
      "description": "Speaking at a Mercosur summit, Lula warned that a US invasion of Venezuela could spark a humanitarian crisis. The Brazilian leader also called on the EU to show \"courage\" and conclude a deal with the South American bloc.",
      "url": "https://www.dw.com/en/mercosur-summit-lula-milei-clash-over-us-venezuela-tensions/a-75254977?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 19:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Germany news: Magdeburg memorial marks year since attack",
      "description": "German chancellor Friedrich Merz is attending a memorial service to mark one year since an attack at a Magdeburg Christmas market saw six people killed. Follow DW for more.",
      "url": "https://www.dw.com/en/germany-news-magdeburg-memorial-marks-year-since-attack/live-75251407?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 08:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "India: 7 elephants killed in passenger train collision",
      "description": "A herd of about 100 wild elephants were trying to cross a railway line when the train driver spotted them. He deployed the emergency brakes but it was too late.",
      "url": "https://www.dw.com/en/india-7-elephants-killed-in-passenger-train-collision/a-75251405?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 07:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Seven Colombian soldiers killed in guerrilla attack",
      "description": "Colombia's ELN guerrilla group attacked a military base near Venezuela with drones and explosives, killing seven soldiers and wounding 30, the army said Friday. Simon Moritz has more.",
      "url": "https://www.france24.com/en/video/20251220-seven-colombian-soldiers-killed-in-guerrilla-attack",
      "published": "Sat, 20 Dec 2025 09:48:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Indian high-speed train hits and kills seven elephants",
      "description": "A high-speed train carrying 650 people has collided with and killed seven wild Asiatic elephants and injured a calf in northern India.",
      "url": "https://news.sky.com/story/indian-high-speed-train-hits-and-kills-seven-elephants-13485855",
      "published": "Sat, 20 Dec 2025 08:57:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "High-speed passenger train kills 7 elephants crossing railway tracks in India",
      "description": "Seven wild Asiatic elephants were killed and a calf was injured when a high-speed passenger train collided with a herd in Assam, India",
      "url": "https://abcnews.go.com/International/wireStory/high-speed-passenger-train-kills-7-elephants-crossing-128576893",
      "published": "Sat, 20 Dec 2025 03:36:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UN agencies welcome news that famine has been pushed back in the Gaza Strip, but warn fragile gains could be reversed without increased and sustained support",
      "description": "The latest Integrated Food Security Phase Classification (IPC) analysis for Gaza confirms that no areas of the Strip are currently classified in famine following the October ceasefire and improved humanitarian and commercial access.",
      "url": "https://www.who.int/news/item/19-12-2025-un-agencies-welcome-news-that-famine-has-been-pushed-back-in-the-gaza-strip-but-warn-fragile-gains-could-be-reversed-without-increased-and-sustained-support",
      "published": "Fri, 19 Dec 2025 16:56:10 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sudan war: Kordofan’s El-Obeid ‘one or two steps’ away from being attacked",
      "description": "As fighting escalates in Sudan, “people are scared, people are fleeing their homes”, the UN migration agency, IOM, said on Friday, noting that more than 50,000 people have been uprooted since late October in the Kordofans region alone.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166633",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Cruise ship chaos mounts as deaths, crimes on board shatter illusions of safety at sea, experts warn",
      "description": "Cruise ship crimes expose legal loopholes in maritime law. From Amy Bradley's disappearance to recent deaths, experts reveal why ships become crime hotbeds.",
      "url": "https://www.foxnews.com/us/cruise-ship-chaos-mounts-deaths-crimes-on-board-shatter-illusions-safety-sea-experts-warn",
      "published": "Sat, 20 Dec 2025 16:00:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Luigi Mangione lawyers renew bid to toss death penalty charge, alleging Pam Bondi has a conflict of interest",
      "description": "Luigi Mangione's defense lawyers claim Pam Bondi has conflict of interest in death penalty case due to her former UnitedHealth Group lobbying ties in 2025.",
      "url": "https://www.foxnews.com/us/luigi-mangione-lawyers-renew-bid-toss-death-penalty-charge-alleging-pam-bondi-conflict-interest",
      "published": "Sat, 20 Dec 2025 08:59:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Putin says Russia won't launch new attacks on other countries 'if you treat us with respect'",
      "description": "Russian President Vladimir Putin said Moscow won't attack other nations if its treated \"with respect\" and claimed he is \"ready and willing\" to end the Ukraine war \"peacefully.\"",
      "url": "https://www.foxnews.com/world/putin-says-russia-launch-new-attacks-other-countries-if-you-treat-us-with-respect",
      "published": "Fri, 19 Dec 2025 19:57:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Santas and elves rob Montreal grocery store to ‘give food to the needy’",
      "description": "Group called Robins des Ruelles later said in statement stunt was intended to highlight cost of living crisis Dressed in red suits and backed by masked elves, a group of Santas marched into a Montreal supermarket, loaded their bags with thousands of dollars worth of groceries and disappeared into the night. The bandit Santas later released a statement saying the food would be distributed to the needy, and saying the Robin Hood-style stunt was intended to highlight the spiralling cost of living crisis that has pushed basic necessities increasingly out of reach for ordinary Canadians. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/montreal-grocery-store-santas-elves-robbery",
      "published": "Fri, 19 Dec 2025 17:06:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Lifeguards pay tribute to Bondi Beach victims",
      "description": "On an overcast morning, hundreds of Bondi lifeguards lined up on the beach, looked out at the sea and remembered the lives lost in the massacre at the Hanukkah celebration almost one week ago. Charlotte Lam reports.",
      "url": "https://www.france24.com/en/video/20251220-lifeguards-pay-tribute-to-bondi-beach-victims",
      "published": "Sat, 20 Dec 2025 16:19:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "US prisons battle evolving drone technology used to smuggle contraband to inmates",
      "description": "U.S. prisons are detecting more drones over their facilities than ever before, but federal regulations make it harder for state prisons to take out the threat.",
      "url": "https://www.foxnews.com/us/us-prisons-battle-evolving-drone-technology-used-smuggle-contraband-inmates",
      "published": "Fri, 19 Dec 2025 05:59:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Bangladesh newspaper staff recall 'gasping for air' as offices set ablaze",
      "description": "The fresh protests are sparked by the death of one of the leaders of protests that ousted ex-PM Sheikh Hasina.",
      "url": "https://www.bbc.com/news/articles/c2462r82864o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 10:54:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russian attack on Ukraine’s Odesa kills at least 8 as peace talks lumber on",
      "description": "Strikes intensify as Ukraine also hits Russian assets and US-led peace talks begin in Miami.",
      "url": "https://www.aljazeera.com/news/2025/12/20/russian-attack-on-ukraines-odesa-kills-at-least-8-as-peace-talks-lumber-on?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 11:29:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "TikTok signs Trump-backed deal to avoid US ban",
      "description": "Joint venture will take over part of app’s US operations, including data protection, algorithm security and content moderation Business live – latest updates US politics live – latest updates TikTok has reached a deal to form a joint venture that will allow it to continue operating in the US, five years after Donald Trump threatened to ban the social media platform over privacy and national security concerns, a move that further strained relations with China. ByteDance, TikTok’s Chinese owner, has signed a deal with Larry Ellison’s Oracle, the private-equity group Silver Lake and Abu Dhabi’s MGX that will allow it to retain control of its core US operations. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/18/tiktok-signs-deal-us-entity-sale",
      "published": "Fri, 19 Dec 2025 11:31:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Lithium battery fire on truck shuts down Hume Highway in NSW due to health risk",
      "description": "Two-trailer carrying 15 tonnes of lithium ion batteries caught alight near Yass on Saturday morning, closing traffic in both directions Get our breaking news email , free app or daily news podcast A truck carrying 15 tonnes of lithium ion batteries has caught alight and closed traffic on a major New South Wales highway, with disruptions expected to last for days. The two-trailer truck was carrying about 50 batteries weighing 300kg each in its B-trailer, Fire and Rescue NSW said. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/20/lithium-battery-fire-on-truck-shuts-down-hume-highway-in-nsw-due-to-health-risk",
      "published": "Sat, 20 Dec 2025 05:15:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Famine over in Gaza, situation still 'critical' — monitor",
      "description": "UN-backed hunger monitor IPC said Gaza was still facing \"emergency\" levels of hunger and called for increased aid deliveries despite improvements since an October 10 ceasefire between Israel and Hamas.",
      "url": "https://www.dw.com/en/famine-over-in-gaza-situation-still-critical-monitor/a-75249577?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 19 Dec 2025 21:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "At UN, nations pledge people-first digital future, tighter AI safeguards",
      "description": "UN Member States on Wednesday pledged to narrow widening digital divides and put stronger safeguards around artificial intelligence (AI), as the General Assembly concluded a major review of how the world manages the Internet and fast-evolving digital technologies.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166623",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Several elephants killed in train crash after impact causes multiple coaches to derail",
      "description": "A high-speed passenger train struck an elephant herd in northeastern India, killing seven wild animals while all 650 passengers escape unharmed.",
      "url": "https://www.foxnews.com/world/several-elephants-killed-train-collision-impact-causes-multiple-coaches-derail",
      "published": "Sat, 20 Dec 2025 17:26:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Australian state plans to ban intifada chants after Bondi shooting",
      "description": "New South Wales will look at passing hate speech laws after Australia's deadliest shooting in almost 30 years.",
      "url": "https://www.bbc.com/news/articles/c14v23vppz8o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 07:20:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The Me Too movement in the age of Trump and Epstein",
      "description": "Tarana Burke tells Marc Lamont Hill on Epstein, Trump and how widespread sexual violence is in the United States.",
      "url": "https://www.aljazeera.com/video/upfront/2025/12/20/the-me-too-movement-in-the-age-of-trump-and-epstein?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 20:54:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Tens of thousands flood streets for Bangladeshi activist’s funeral",
      "description": "Footage shows a massive crowd filling streets to mourn Sharif Osman Hadi, a leader of the 2024 student-led uprising.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/tens-of-thousands-flood-streets-for-bangladeshi-activists-funeral?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 14:14:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "'What they've seen, few people have ever seen': Lifeguards honour Bondi Beach victims",
      "description": "On an overcast morning, hundreds of Bondi lifeguards lined up on the beach, looked out at the sea and remembered the lives lost in the massacre at the Hanukkah celebration almost one week ago.",
      "url": "https://news.sky.com/story/bondi-beach-victims-honoured-by-lifeguards-who-saw-what-few-people-have-ever-seen-13485854",
      "published": "Sat, 20 Dec 2025 08:52:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Australian state plans tougher laws against displaying extremist flags after Bondi shooting",
      "description": "The Australian state of New South Wales is proposing a ban on public displays of Islamic State group flags and extremist symbols",
      "url": "https://abcnews.go.com/International/wireStory/australian-state-plans-tougher-laws-displaying-extremist-flags-128580980",
      "published": "Sat, 20 Dec 2025 12:29:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "WHO issues global guideline on the use of GLP-1 medicines in treating obesity",
      "description": "To address the growing global health challenge of obesity, which affects more than 1 billion people, WHO has released its first guideline on the use of Glucagon-Like Peptide-1 (GLP-1) therapies for treating obesity as a chronic, relapsing disease.",
      "url": "https://www.who.int/news/item/01-12-2025-who-issues-global-guideline-on-the-use-of-glp-1-medicines-in-treating-obesity",
      "published": "Mon, 01 Dec 2025 13:00:25 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Fifty days on, Jamaica struggles to rebuild after Hurricane Melissa’s unprecedented destruction",
      "description": "Fifty days have passed since Hurricane Melissa ravaged Jamaica, leaving behind an unprecedented trail of destruction.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166621",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Progress on hunger in Asia-Pacific, key Gaza pipeline repaired, flu hits Europe hard",
      "description": "While the Asia and Pacific region has made notable progress in reducing hunger, persistent challenges remain in addressing malnutrition, food insecurity and unequal access to healthy diets, a new UN report published on Wednesday concludes.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166620",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Canadian police expose alleged ISIS conspirator in plot against Jews, women's attempted kidnappings",
      "description": "Canadian police say Waleed Khan faces terrorism charges for allegedly conspiring with ISIS and committing hate crimes targeting Jewish community in Toronto.",
      "url": "https://www.foxnews.com/world/canadian-police-expose-alleged-isis-conspirator-plot-jews-womens-attempted-kidnappings",
      "published": "Fri, 19 Dec 2025 15:02:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Morocco accused of ‘horrific’ abuse of detained gen Z protesters",
      "description": "As country prepares to host Africa Cup of Nations, families and rights groups tell of police brutality, with hundreds still held The arbitrary detention of hundreds of gen Z protesters in Morocco and alleged “horrific” beatings have been condemned by human rights groups, as the country prepares to host the Africa Cup of Nations on Sunday. A wave of youth-led demonstrations swept across Morocco in late September and early October – the biggest since the 2011 Arab spring – in protest at underfunded healthcare and education. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/18/morocco-genz212-protests-police-mass-arrests-beatings-detentions-rights",
      "published": "Thu, 18 Dec 2025 06:00:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Australian authorities release 7 men detained over possible violent plot in wake of Bondi Beach shooting",
      "description": "Seven men who were arrested due to concerns that they were planning a \"violent act\" were released. The arrests came days after the shooting at Bondi Beach.",
      "url": "https://www.foxnews.com/world/australian-authorities-release-7-men-detained-over-possible-violent-plot-wake-bondi-beach-shooting",
      "published": "Fri, 19 Dec 2025 10:00:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Putin claims 'troops are advancing,' will achieve goals as EU approves massive Ukraine loan",
      "description": "As the war between Russia and Ukraine persists, Russian President Vladimir Putin said his nation's \"troops are advancing,\" The Associated Press reported.",
      "url": "https://www.foxnews.com/world/putin-claims-troops-advancing-achieve-goals-eu-approves-massive-ukraine-loan",
      "published": "Fri, 19 Dec 2025 08:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo summons cardinals for a key assembly to help him govern Catholic Church",
      "description": "Pope Leo XIV has summoned the world's cardinals for two days of meetings to help him govern the church, in the clearest sign yet that the new year will signal the unofficial start of his pontificate.",
      "url": "https://www.npr.org/2025/12/20/nx-s1-5650788/pope-leo-summons-cardinals-meeting-consistory",
      "published": "Sat, 20 Dec 2025 15:24:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "After years of war, Palestinians in Gaza bring back Christmas celebrations",
      "description": "Palestinians in Gaza are slowly bringing back Christmas celebrations after more than two years of war. The Holy Family Church in Gaza City gathered this week to decorate the church.",
      "url": "https://www.npr.org/2025/12/19/nx-s1-5648218/after-years-of-war-palestinians-in-gaza-bring-back-christmas-celebrations",
      "published": "Fri, 19 Dec 2025 04:46:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "How Trump has supercharged the new world dis-order",
      "description": "Welcome to the new world dis-order.",
      "url": "https://news.sky.com/story/how-trump-has-supercharged-the-new-world-dis-order-13485591",
      "published": "Sun, 21 Dec 2025 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Egypt's el-Sissi urges UN Security Council reforms for Africa's larger role",
      "description": "Egypt’s President Abdel-Fattah el-Sissi has called for changes in the U.N. Security Council to give Africa a bigger role in global decisions",
      "url": "https://abcnews.go.com/International/wireStory/egypts-el-sissi-urges-security-council-reforms-africas-128582569",
      "published": "Sat, 20 Dec 2025 14:33:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo summons world's cardinals for a key assembly to help him govern the church",
      "description": "Pope Leo XIV has summoned the world’s cardinals for meetings to help him govern the church, marking the unofficial start of his pontificate",
      "url": "https://abcnews.go.com/International/wireStory/pope-leo-summons-worlds-cardinals-key-assembly-govern-128579068",
      "published": "Sat, 20 Dec 2025 08:33:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "WHO expert group’s new analysis reaffirms there is no link between vaccines and autism",
      "description": "New analysis from a WHO global expert committee on vaccine safety has found that, based on available evidence, no causal link exists between vaccines and autism spectrum disorders (ASD). The conclusion reaffirms WHO’s position that childhood vaccines do not cause autism.",
      "url": "https://www.who.int/news/item/11-12-2025-who-expert-group-s-new-analysis-reaffirms-there-is-no-link-between-vaccines-and-autism",
      "published": "Thu, 11 Dec 2025 15:09:10 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza: Access to food improves but living conditions remain dire",
      "description": "A pregnant woman in Gaza thought she might lose her child because of malnourishment. Ten days ago, she gave birth and is now in recovery thanks to World Food Programme (WFP) facilities that are back up and running again, the agency’s representative for Palestine said on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166632",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU agrees €90bn loan for Ukraine but without using Russian assets",
      "description": "EU leaders said the loan would be repayable only when Russia paid reparations for the war.",
      "url": "https://www.bbc.com/news/articles/c3e025vyppeo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 12:47:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US to strip alleged Bosnian war criminal of citizenship",
      "description": "Kemal Mrndzic did not reveal that he had been a guard at a camp where atrocities occurred when seeking US naturalisation, officials say.",
      "url": "https://www.bbc.com/news/articles/c2k422e7ykvo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 22:42:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,396",
      "description": "These are the key developments from day 1,396 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2025/12/21/russia-ukraine-war-list-of-key-events-day-1396?traffic_source=rss",
      "published": "Sun, 21 Dec 2025 00:55:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US, Egypt, Qatar, Turkiye urge restraint in Gaza as Israeli attacks continue",
      "description": "The talks lauded the first stage of the truce, including humanitarian aid, return of captives and reduced hostilities.",
      "url": "https://www.aljazeera.com/news/2025/12/20/us-qatar-egypt-turkey-urge-gaza-restraint-as-israeli-strikes-continue?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 22:26:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "MSF urges Israel to let critical aid into Gaza as children freeze to death",
      "description": "At least 13 people in Gaza, including two-week-old and one-month-old babies, have died from winter weather.",
      "url": "https://www.aljazeera.com/news/2025/12/20/msf-urges-israel-to-let-critical-aid-into-gaza-as-children-freeze-to-death?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 10:19:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Africa in talks with Russia over men ‘tricked’ into fighting in Ukraine",
      "description": "Government says it received distress calls, as daughter of ex-president Jacob Zuma accused of luring men to frontline South Africa’s government is in talks with Russia to bring home 17 South African men fighting for Russia in Ukraine, after the men were allegedly tricked on to the frontlines of the war by a daughter of former South African president Jacob Zuma. Duduzile Zuma-Sambudla has been accused in multiple lawsuits of luring the 17 South African and two Botswanan men to Russia in July, by telling them they would be training as bodyguards for her father’s uMkhonto weSizwe political party or attending a personal development course. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/16/south-africa-russia-men-tricked-fighting-ukraine",
      "published": "Tue, 16 Dec 2025 09:08:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK Foreign Office victim of cyber-attack in October, says Chris Bryant",
      "description": "Minister says risk to ‘any individual’ from cyber-attack is low and that it is still unclear who is responsible The UK’s Foreign, Commonwealth and Development Office was hacked in October, a minister has said. Chris Bryant, a trade minister in Keir Starmer’s government, told Sky News there was a low risk to “any individual” from the cyber-attack. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/19/uk-foreign-office-victim-cyber-attack-october-",
      "published": "Fri, 19 Dec 2025 12:59:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A swim for unity at Bondi beach, the scene of Sydney’s darkest day. But on land tensions fray",
      "description": "Jewish voices say an attack of this kind was entirely predictable given the surge in antisemitic attacks in Australia since 2023 The sun rises early at this time of year, hitting the south of the beach first before chasing the shadows north, the gradual retreat of the darkness to the light. Hanukah, the Jewish festival of lights, was being celebrated here on Sunday evening, when the darkness came brutally roaring back. Continue reading...",
      "url": "https://www.theguardian.com/news/ng-interactive/2025/dec/20/a-swim-for-unity-at-bondi-beach-the-scene-of-sydneys-darkest-day-but-on-land-tensions-fray",
      "published": "Fri, 19 Dec 2025 20:39:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "He's the first African musician to get a Grammy Lifetime Achievement Award",
      "description": "The late, great Fela Kuti is known as the \"Black President\" for his role as both a musical and a political leader. Now he has become the first African artist to get this Grammy honor.",
      "url": "https://www.npr.org/sections/goats-and-soda/2025/12/19/g-s1-102766/grammy-fela-kuti-afrobeats",
      "published": "Fri, 19 Dec 2025 11:16:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine updates: Russia joins talks in Miami",
      "description": "Russia's envoy traveled to Florida to continue talks to end the war but is unlikely to meet European negotiators. Meanwhile, Volodymyr Zelenskyy ruled out holding elections in Russia-occupied parts of Ukraine. Follow DW.",
      "url": "https://www.dw.com/en/ukraine-updates-russia-joins-talks-in-miami/live-75252411?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 10:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Christmas brings rise in domestic violence in Germany",
      "description": "For many women, the holiday season is the most dangerous time of the year. Stress, financial worries, and cramped living conditions increase the risk of domestic violence. Women's shelters are overstretched.",
      "url": "https://www.dw.com/en/christmas-brings-rise-in-domestic-violence-in-germany/a-75225121?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 07:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Zelenskyy's Polish visit 'bad news for Moscow'",
      "description": "Poland's President Karol Nawrocki made the remark after talks with his Ukrainian counterpart in Warsaw, stressing the unity of the two countries. Meanwhile, Vladimir Putin held his annual press conference in Moscow.",
      "url": "https://www.dw.com/en/ukraine-zelenskyy-s-polish-visit-bad-news-for-moscow/live-75235822?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 19 Dec 2025 20:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Not just hocus pocus: when words were used to treat the sick",
      "description": "Incantations were not only meant to ward off demons, but also to calm patients. A look into medical history reveals what lies behind the idea of tooth worms and the power of utterances like \"hocus pocus.\"",
      "url": "https://www.dw.com/en/not-just-hocus-pocus-when-words-were-used-to-treat-the-sick/a-75185962?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 19 Dec 2025 17:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "MAGA civil war steals the spotlight at 'AmericaFest' conference",
      "description": "AmericaFest, the first major Turning Point USA conference since the murder of its founder Charlie Kirk, took place in Phoenix on Thursday – but instead of showing unity, it exposed sharp rifts within the MAGA movement over anti-Semitism, leadership, and its post-Trump future.",
      "url": "https://www.france24.com/en/americas/20251220-maga-civil-war-steals-spotlight-americafest-conference-turning-point-usa",
      "published": "Sat, 20 Dec 2025 16:46:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US, Russian officials to meet in Florida for latest round of Ukraine talks",
      "description": "Russian officials arrived in Florida on Saturday to meet with US negotiators for the latest round of talks aimed at ending the war in Ukraine. The meeting comes as talks between US, Ukrainian and European negotiators on Friday ended with all sides saying progress had been made on agreeing security guarantees for Kyiv.",
      "url": "https://www.france24.com/en/americas/20251220-us-russian-officials-to-meet-in-florida-for-latest-round-of-ukraine-talks",
      "published": "Sat, 20 Dec 2025 09:13:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Deadline-day release of Epstein files has White House media management written all over it",
      "description": "Can it be a coincidence that US planes attacked Syria around the very time the Epstein files were released?",
      "url": "https://news.sky.com/story/deadline-day-release-of-epstein-files-has-white-house-media-management-written-all-over-it-13485849",
      "published": "Sat, 20 Dec 2025 08:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia marks Day of Reflection for Bondi Beach shooting victims",
      "description": "Australians are lighting candles Sunday to remember the victims of a mass shooting at a Jewish festival in Sydney's Bondi Beach",
      "url": "https://abcnews.go.com/International/wireStory/australia-marks-day-reflection-bondi-beach-shooting-victims-128590005",
      "published": "Sat, 20 Dec 2025 19:46:20 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Burkina Faso releases Nigerian air force crew detained after emergency landing",
      "description": "Burkina Faso has released 11 Nigerian Air Force personnel detained after an emergency landing",
      "url": "https://abcnews.go.com/International/wireStory/burkina-faso-releases-nigerian-air-force-crew-detained-128512529",
      "published": "Thu, 18 Dec 2025 07:05:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Crimean Tatar artist moulds new path through clay in wartime Ukraine",
      "description": "Through her ceramics, Crimean Tatar artist Elvira Demerdzhi finds moments of calm and a sense of home amid the ongoing war in Ukraine.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166615",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "LA deputies caught on camera racing into foggy ocean to rescue disoriented paragliders",
      "description": "Two deputies swam 75 feet to save panicked paragliders entangled in safety equipment, cutting them free with knives in a dramatic ocean rescue operation.",
      "url": "https://www.foxnews.com/us/la-deputies-caught-camera-racing-foggy-ocean-rescue-disoriented-paragliders",
      "published": "Sat, 20 Dec 2025 17:45:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Desperate search for 2 men underway after fishing boat found empty 70 miles off Florida coast",
      "description": "The U.S. Coast Guard is searching for a missing uncle and nephew after their fishing boat was found empty 70 miles off the coast of Florida.",
      "url": "https://www.foxnews.com/us/desperate-search-two-men-fishing-boat-found-empty-70-miles-off-florida-coast",
      "published": "Sat, 20 Dec 2025 12:27:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brown University, MIT shooting suspect likely died days before body found: autopsy",
      "description": "The suspect in the deadly Brown University shooting and MIT professor killing was found dead by suicide inside a New Hampshire storage unit, ending a nearly weeklong manhunt.",
      "url": "https://www.foxnews.com/us/brown-university-mit-shooting-suspect-likely-died-days-before-body-found-autopsy",
      "published": "Fri, 19 Dec 2025 19:38:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fox News True Crime Newsletter: Brown and MIT shooting suspect, Nick Reiner's lawyer, Brian Walshe's sentence",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-brown-mit-shooting-suspect-nick-reiner-lawyer-brian-walshe-sentence",
      "published": "Fri, 19 Dec 2025 16:04:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Suspect in Brown shooting, MIT murder found dead and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/suspect-brown-shooting-mit-murder-found-dead-more-top-headlines",
      "published": "Fri, 19 Dec 2025 07:18:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US envoy Witkoff says high-level Miami talks focused on 'unified Gazan authority' as Israel ceasefire advances",
      "description": "The U.S. leads talks with Egypt, Qatar and Turkey on Gaza ceasefire Phase 2, focusing on unified governance and regional integration for long-term stability.",
      "url": "https://www.foxnews.com/world/us-envoy-witkoff-says-high-level-miami-talks-focused-unified-gazan-authority-israel-ceasefire-advances",
      "published": "Sat, 20 Dec 2025 14:55:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy calls for US to respond to 'signals' Russia is 'preparing to make next year a year of war'",
      "description": "Ukraine's Volodymyr Zelenskyy is calling on America and other allies to respond to \"signals\" that Russia is \"preparing to make next year a year of war.\"",
      "url": "https://www.foxnews.com/world/zelenskyy-calls-us-respond-signals-russia-preparing-make-next-year-year-war",
      "published": "Thu, 18 Dec 2025 12:12:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Putin derides European leaders as he insists Russia's war goals in Ukraine will be met by force or diplomacy",
      "description": "Russian President Vladimir Putin declares Russia's Ukraine war goals will be achieved through negotiations or military force with diplomatic efforts.",
      "url": "https://www.foxnews.com/world/putin-derides-european-leaders-he-insists-russias-war-goals-ukraine-met-force-diplomacy",
      "published": "Wed, 17 Dec 2025 14:32:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "New tools saved a million lives from malaria last year but progress under threat as drug resistance rises",
      "description": "This year’s report provides a critical and up-to-date snapshot of efforts to control and eliminate malaria across 80 countries. The report also presents the threat posed by antimalarial resistance and its impact.",
      "url": "https://www.who.int/news/item/04-12-2025-new-tools-saved-a-million-lives-from-malaria-last-year-but-progress-under-threat-as-drug-resistance-rises",
      "published": "Thu, 04 Dec 2025 08:23:36 Z",
      "source": "WHO News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "How Georgian creatives are fighting for their freedom",
      "description": "Artists in Georgia are weary but defiant as they face arbitrary arrests, tough new laws and financial hardship from the country's repressive government.",
      "url": "https://www.dw.com/en/how-georgian-creatives-are-fighting-for-their-freedom/a-75254471?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 17:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Rome to introduce entry fee for historic Trevi Fountain",
      "description": "Rome's mayor said tourists will have to pay to get close to Trevi Fountain, one of the Italian capital's most popular monuments, starting in February.",
      "url": "https://www.dw.com/en/rome-to-introduce-entry-fee-for-historic-trevi-fountain/a-75248561?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 19 Dec 2025 18:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "EX Pakistan PM Imran Khan and wife sentenced to 17 years",
      "description": "A Pakistani court on Saturday sentenced former Prime Minister Imran Khan and his wife Bushra Bibi to 17 years in prison each in a corruption case involving the under-priced purchase of luxury state gifts, the court and Khan's lawyers said. The latest conviction adds to a series of legal troubles for Khan, who has been behind bars since August 2023, and is currently serving a 14-year sentence in a separate land graft case. France24 Pakistan correspondent Hamza Azhar Salam reports the latest.",
      "url": "https://www.france24.com/en/video/20251220-ex-pakistan-pm-imran-khan-and-wife-sentenced-to-17-years",
      "published": "Sat, 20 Dec 2025 12:39:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "'We will finish Hamas if they don't give us Rani,' says mother of last Israeli hostage",
      "description": "Now the other hostages are home, the living and the dead, there is just one face whose image you will see across Israel, alongside the national flag and the ubiquitous yellow ribbon, symbol of solidarity with the hostages.",
      "url": "https://news.sky.com/story/we-will-finish-hamas-if-they-dont-give-us-rani-says-mother-of-last-israeli-hostage-in-gaza-13484882",
      "published": "Sun, 21 Dec 2025 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US tech enabled China's surveillance empire. Tibetan refugees in Nepal pay the price",
      "description": "Nepal is just one of at least 150 countries to which Chinese companies are supplying surveillance technology, from cameras in Vietnam to censorship firewalls in Pakistan to citywide monitoring systems in Kenya",
      "url": "https://abcnews.go.com/International/wireStory/us-tech-enabled-chinas-surveillance-empire-now-tibetan-128576520",
      "published": "Sat, 20 Dec 2025 00:19:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration restricts 2 Honduran election officials' visas over special vote count",
      "description": "The Trump administration has restricted visas for two leftist Honduran election officials, citing interference in the Central American country’s special vote count",
      "url": "https://abcnews.go.com/International/wireStory/trump-administration-restricts-2-honduran-election-officials-visas-128577256",
      "published": "Sat, 20 Dec 2025 01:53:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council hears of fading election prospects in Libya",
      "description": "The path to long-awaited elections in Libya is paved with complications but they can be overcome, the UN Special Representative for the country said on Friday in a briefing to the Security Council.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166646",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council renews DR Congo peacekeeping mission amid renewed M23 offensives in the east",
      "description": "The UN Security Council on Friday unanimously extended the mandate of the UN peacekeeping mission in the Democratic Republic of the Congo (DRC) for another year, as fighting in the country’s east intensified amid renewed offensives by the M23 rebel group.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166643",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Elizabeth Smart blasts Ghislaine Maxwell’s ‘country club’ prison treatment: ‘Makes me sick’",
      "description": "Kidnapping survivor Elizabeth Smart speaks out against Jeffrey Epstein associate Ghislaine Maxwell's prison privileges while advocating for trafficking victims.",
      "url": "https://www.foxnews.com/us/elizabeth-smart-blasts-ghislaine-maxwell-country-club-prison-treatment-makes-me-sick",
      "published": "Sat, 20 Dec 2025 14:00:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Chinese researcher on US visa charged with smuggling E. coli into the country, FBI Director Kash Patel says",
      "description": "FBI charges Youhuang Xiang, a post-doctoral researcher and J-1 visa holder from China, with smuggling Escherichia coli (E. coli) into the U.S.",
      "url": "https://www.foxnews.com/us/chinese-researcher-us-visa-charged-smuggling-e-coli-country-fbi-director-kash-patel-says",
      "published": "Fri, 19 Dec 2025 10:42:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Milwaukee County judge found guilty of obstructing federal immigration agents in courthouse incident",
      "description": "Milwaukee County Judge Hannah Dugan found guilty of federal obstruction for helping man evade ICE agents at courthouse, faces up to five years in prison.",
      "url": "https://www.foxnews.com/us/milwaukee-county-judge-found-guilty-obstructing-federal-immigration-agents-courthouse-incident",
      "published": "Thu, 18 Dec 2025 22:26:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "India express train kills seven elephants crossing tracks",
      "description": "The collision happened early on Saturday in the north-eastern state of Assam, local officials say.",
      "url": "https://www.bbc.com/news/articles/c9qe2yln2nlo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 01:18:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US aerial bombardment strikes ‘ISIS thugs’ in Syria",
      "description": "The US military launched more than 70 strikes on alleged ISIL targets in Syria.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/us-aerial-bombardment-strikes-isis-thugs-in-syria?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 16:17:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Cuba on edge as U.S. moves against Venezuela risk fuel shortages and deeper isolation",
      "description": "Cuba is watching nervously as the U.S. ramps up pressure on Venezuela, threatening a lifeline and deepening the island's isolation.",
      "url": "https://www.npr.org/2025/12/19/nx-s1-5647662/cuba-on-edge-as-u-s-moves-against-venezuela-risk-fuel-shortages-and-deeper-isolation",
      "published": "Fri, 19 Dec 2025 04:46:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Pakistan says India 'weaponizing water' at border",
      "description": "Pakistan says it has seen \"abrupt variations\" of water in the Chenab River that threaten Pakistan's safety and well-being. This comes 10 months after India unilaterally withdrew from a treaty covering shared water use.",
      "url": "https://www.dw.com/en/pakistan-says-india-weaponizing-water-at-border/a-75242809?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 19 Dec 2025 15:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine strikes Russian shadow fleet tanker in Mediterranean sea",
      "description": "Ukraine on Friday said its drones had hit a vessel from Russia's shadow fleet – the first such strike in the neutral waters of the Mediterranean sea. Russia's shadow fleet transports sanctioned Russia oil by frequently changing flags and concealing ownership.",
      "url": "https://www.france24.com/en/video/20251220-ukraine-strikes-russian-shadow-fleet-tanker-in-mediterranean-sea",
      "published": "Sat, 20 Dec 2025 08:08:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Christmas spirit returns to Bethlehem after ceasefire in Gaza",
      "description": "At midnight on Christmas Eve, the hymn “The Night of Christmas” will ring out in Bethlehem’s Church of the Nativity, built on the site where Christians believe Jesus was born",
      "url": "https://abcnews.go.com/International/wireStory/christmas-spirit-returns-bethlehem-after-ceasefire-gaza-128576391",
      "published": "Sat, 20 Dec 2025 00:17:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "South Sudan: UN condemns killing of staff member in Wau, calls for swift investigation",
      "description": "The United Nations on Friday condemned the killing of a civilian staff member serving with its peacekeeping mission in South Sudan (UNMISS), calling on the authorities to swiftly bring those responsible to justice.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166640",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza famine pushed back, but millions still face hunger and malnutrition, UN says",
      "description": "Food security in Gaza has improved since the ceasefire declared in October, pushing back famine conditions, but the situation remains critical with more than three-quarters of the population still facing acute hunger and malnutrition, a new UN-backed analysis has found.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166638",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Imran Khan and wife given further jail terms after state gift fraud case",
      "description": "Pakistan's former PM, who is already serving time in prison, plans to challenge the verdict.",
      "url": "https://www.bbc.com/news/articles/c62vx2pgl0eo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 10:32:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Israel launches new raids in Syria’s Quneitra, establishes checkpoints",
      "description": "Syrian state television denounces the Israeli incursion as another violation of the nation's sovereignty.",
      "url": "https://www.aljazeera.com/news/2025/12/20/israel-launches-fresh-raids-in-syrias-quneitra-establishes-checkpoints?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 15:16:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Ex-Pakistan PM Imran Khan, wife sentenced to 17 years in corruption case",
      "description": "Khan and his wife have denied accusations that they misrepresented the value of state gifts, including jewellery.",
      "url": "https://www.aljazeera.com/news/2025/12/20/ex-pakistan-pm-imran-khan-wife-sentenced-to-17-years-in-corruption-case?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 12:19:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Where ISIS is still active today",
      "description": "The Islamic State lost its territorial stronghold in the Middle East years ago, but its influence didn't disappear. NPR's Mary Louise Kelly speaks with Aaron Zelin about how ISIS looks now.",
      "url": "https://www.npr.org/2025/12/19/nx-s1-5647394/where-isis-is-still-active-today",
      "published": "Fri, 19 Dec 2025 16:20:59 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Pakistan sentences ex-PM Imran Khan, wife Bushra Bibi to 17 years in prison",
      "description": "Imran Khan and his wife Bushra Bibi were found guilty of corruption in relation to selling state gifts. The ruling is the latest legal setback for the former prime minister, who has been jailed since 2023.",
      "url": "https://www.dw.com/en/pakistan-sentences-ex-pm-imran-khan-wife-bushra-bibi-to-17-years-in-prison/a-75253492?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 14:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Elon Musk closer to becoming first-ever trillionaire as he marks major milestone",
      "description": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions.",
      "url": "https://news.sky.com/story/elon-musk-closer-to-becoming-first-ever-trillionaire-as-he-marks-major-milestone-13486155",
      "published": "Sat, 20 Dec 2025 18:36:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Former Pakistani prime minister Imran Khan jailed for 17 years over state gift fraud",
      "description": "Former Pakistan prime minister and cricketer Imran Khan and his wife Bushra Bibi have been jailed for 17 years for buying state gifts at a knock-down price.",
      "url": "https://news.sky.com/story/former-pakistani-prime-minister-imran-khan-jailed-for-17-years-over-state-gift-fraud-13485873",
      "published": "Sat, 20 Dec 2025 10:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Palestinians tell BBC they were sexually abused in Israeli prisons",
      "description": "Two men say they experienced the kind of abuse highlighted in recent reports on Israel's treatment of prisoners, which Israel denies.",
      "url": "https://www.bbc.com/news/articles/c8dy8r7lq0go?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 22:01:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘Matter of survival’: South Korean president urges public health cover for hair loss",
      "description": "Medical professionals and some in conservative circles feel argument of Lee Jae Myung may be a bit thin South Korean president Lee Jae Myung has instructed his government to consider extending public health insurance to cover hair-loss treatments, arguing that baldness has become a “matter of survival” rather than a cosmetic concern for young people. The proposal, which has since faced a backlash from medical professionals and conservative figures, was announced during a policy briefing on Tuesday and would expand coverage beyond the limited medical treatments currently available for certain types of hair loss. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/south-korean-president-urges-public-health-cover-hair-loss",
      "published": "Fri, 19 Dec 2025 10:39:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US forces intercept second merchant vessel off Venezuela amid blockade of sanctioned vessels",
      "description": "US forces on Saturday stopped an oil tanker off the coast of Venezuela for the second time in less than two weeks, following President Donald Trump’s announcement of a blockade on sanctioned vessels. Homeland Security Secretary Kristi Noem said the operation, carried out with the Defense Department, targeted a tanker last docked in Venezuela, as Washington ramps up the pressure on Caracas.",
      "url": "https://www.france24.com/en/americas/20251220-us-forces-stop-second-merchant-vessel-off-venezuela-after-trump-announces-oil-blockade",
      "published": "Sat, 20 Dec 2025 19:17:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump administration restricts Mexican train crews over English proficiency-related safety concerns",
      "description": "The Trump administration is restricting Mexican train crews in U.S. over English proficiency concerns, limiting operations to 10 miles from border entry points.",
      "url": "https://www.foxnews.com/us/trump-administration-restricts-mexican-train-crews-english-proficiency-related-safety-concerns",
      "published": "Fri, 19 Dec 2025 16:04:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Sports reporter’s 3-year-old opened door for grandpa who then found couple dead in home: report",
      "description": "The 3-year-old son of Alabama sports reporter Christina Chambers reportedly opened the door for his grandfather, who then discovered Chambers and her husband dead in a suspected murder-suicide.",
      "url": "https://www.foxnews.com/us/sports-reporters-3-year-old-opened-door-grandpa-who-found-couple-dead-home-report",
      "published": "Fri, 19 Dec 2025 07:29:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "‘I can’t think of a place more pristine’: 133,000 hectares of Chilean Patagonia preserved after local fundraising",
      "description": "Exclusive: Ancient forests and turquoise rivers of the Cochamó Valley protected from logging, damming and development A wild valley in Chilean Patagonia has been preserved for future generations and protected from logging, damming and unbridled development after a remarkable fundraising effort by local groups, the Guardian can reveal. The 133,000 hectares (328,000 acres) of pristine wilderness in the Cochamó Valley was bought for $63m (£47m) after a grassroots campaign led by the NGO Puelo Patagonia , and the title to the wildlands was officially handed over to the Chilean nonprofit Fundación Conserva Puchegüín on 9 December. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/i-cant-think-of-a-place-more-pristine-133000-hectares-of-chilean-patagonia-preserved-after-local-fundraising",
      "published": "Fri, 19 Dec 2025 09:00:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "City of Rome imposes 2-euro fee on visiting Trevi Fountain",
      "description": "Starting Feb. 1, the city of Rome is imposing a 2-euro fee for tourists to get close to the fountain made famous by Federico Fellini’s “La Dolce Vita” during prime-time daylight hours. Nicholas Rushworth has more.",
      "url": "https://www.france24.com/en/video/20251220-city-of-rome-imposes-2-euro-fee-on-visiting-trevi-fountain",
      "published": "Sat, 20 Dec 2025 09:50:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "US seizes second oil tanker off Venezuela's coast",
      "description": "The move comes after US President Donald Trump ordered a \"blockade\" of sanctioned oil tankers entering and leaving Venezuela.",
      "url": "https://www.bbc.com/news/articles/c0mpy1ynnzzo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 00:44:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Survivors 'nervous and sceptical' about release of remaining Epstein files",
      "description": "US lawmakers who pushed for the documents to be made public have criticised the initial release as incomplete.",
      "url": "https://www.bbc.com/news/articles/c14vy02847vo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 20:33:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Engineer becomes first wheelchair user to go to space",
      "description": "\"It was the coolest experience!\" said Michaela Benthaus after the 10-minute Blue Origin flight.",
      "url": "https://www.bbc.com/news/articles/c5y9z0g7lleo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 19:16:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who and what are in the Epstein files?",
      "description": "High-profile figures, including Bill Clinton and Michael Jackson, can be seen in the long-awaited files.",
      "url": "https://www.bbc.com/news/articles/c8r38ne1x2mo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 14:42:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tourists to face €2 fee to get near Rome's Trevi Fountain",
      "description": "Visitors who don't live in Rome will have to pay to view the Baroque monument up close from February.",
      "url": "https://www.bbc.com/news/articles/cp89p41gr06o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 20:05:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Charlie Kirk's widow Erika endorses JD Vance for president",
      "description": "Conservatives traded criticims at this year's annual Turning Point USA America Fest conference.",
      "url": "https://www.bbc.com/news/articles/cp84p722m3do?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 18:05:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French court rejects Shein website suspension over childlike sex dolls",
      "description": "The fast-fashion giant welcomed the judgement and said its priority remains protecting French consumers.",
      "url": "https://www.bbc.com/news/articles/c5y9x4pj54eo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 15:49:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Norway's crown princess likely needs lung transplant, palace says",
      "description": "Mette-Marit has pulmonary fibrosis, a disease that stiffens the lungs, making it hard to breathe.",
      "url": "https://www.bbc.com/news/articles/cpq4p535347o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 15:33:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German court jails man for drugging, raping and filming wife for years",
      "description": "The 61-year-old has been sentenced to eight-and-a-half years in prison after posting the videos online.",
      "url": "https://www.bbc.com/news/articles/cm21pxen1jno?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 17:40:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Removed Ben & Jerry's chair says Magnum aimed to 'smear' her",
      "description": "Anuradha Mittal was ejected from the board of the ice cream maker this week.",
      "url": "https://www.bbc.com/news/articles/cn98pzr8x79o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 20:48:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US seizes second oil tanker off Venezuela’s coast",
      "description": "Caracas slams the US over 'the theft and hijacking' of a second oil tanker and says it will file a complaint at the UN.",
      "url": "https://www.aljazeera.com/news/2025/12/20/us-seizes-second-oil-vessel-off-venezuela-coast-officials-say?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 20:26:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ekitike and Isak help Liverpool squeeze past nine-man Tottenham",
      "description": "Defending champions Liverpool win 2-1 at Tottenham to climb to fifth in the Premier League table.",
      "url": "https://www.aljazeera.com/sports/2025/12/20/ekitike-and-isak-help-liverpool-squeeze-past-nine-man-tottenham?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 20:19:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Red Ribbon’ vigil for Palestinian prisoners held by Israel",
      "description": "Red ribbons and Palestinian flags were seen at aLondon vigil calling for the Israeli release of imprisoned Palestinians.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/red-ribbon-vigil-for-palestinian-prisoners-held-by-israel?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 20:16:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why has signing the EU-Mercosur deal been delayed?",
      "description": "Sealing of deal postponed despite decades of preparation.",
      "url": "https://www.aljazeera.com/video/inside-story/2025/12/20/why-has-signing-the-eu-mercosur-deal-been-delayed?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 17:56:43 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Lebanon claims first phase of Hezbollah’s disarmament close to complete",
      "description": "The PM says the part of the plan on south of the Litani River is 'only days away from completion'.",
      "url": "https://www.aljazeera.com/news/2025/12/20/first-phase-of-hezbollahs-disarmament-close-to-complete-lebanons-salam?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 17:38:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON moves to 4-year cycle as new Africa Nations League created",
      "description": "On the eve of the 2025 AFCON, football's governing body in Africa create new four-year cycle and form a Nations League.",
      "url": "https://www.aljazeera.com/sports/2025/12/20/afcon-moves-to-4-year-cycle-as-new-africa-nations-league-created?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 16:42:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tottenham vs Liverpool 1-2: Premier League – as it happened",
      "description": "All our updates, with post-match reaction and interviews, following our text commentary stream of the EPL game.",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/12/20/live-tottenham-vs-liverpool-premier-league?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 14:30:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uruguay’s FM on US claims to police Latin America and rising tensions",
      "description": "Mario Lubetkin on Washington’s revived sphere-of-influence doctrine, Venezuela, and China’s growing footprint.",
      "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2025/12/20/uruguays-fm-on-us-claims-to-police-latin-america-and-rising-tensions?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 09:04:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.0 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:56:09 UTC 2025-12-20 03:56:09 UTC at epicenter Location 37.744°N 121.953°W Depth 9.63 km (5.98 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283031",
      "published": "2025-12-21T00:17:39.950Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.6 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:49:28 UTC 2025-12-20 03:49:28 UTC at epicenter Location 37.743°N 121.954°W Depth 9.56 km (5.94 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283016",
      "published": "2025-12-21T00:03:34.885Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.0 - 6 km W of Glen Ellen, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2025-12-14 23:30:43 UTC 2025-12-14 23:30:43 UTC at epicenter Location 38.373°N 122.604°W Depth 3.13 km (1.94 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75279971",
      "published": "2025-12-20T23:40:44.990Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "U.S. forces stop a 2nd merchant vessel off Venezuela coast, officials say",
      "description": "U.S. forces stopped a vessel off the coast of Venezuela for the second time in less than two weeks as President Trump continues to ramp up pressure on Venezuelan President Nicolás Maduro.",
      "url": "https://www.npr.org/2025/12/20/nx-s1-5650779/venezuela-merchant-vessel-stopped-us-military",
      "published": "Sat, 20 Dec 2025 14:21:31 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "In the shadow of U.S. export controls, China rallies its own chip industry",
      "description": "The chip industry in China is hustling to overcome a Western tech choke hold, even as President Trump appears poised to loosen U.S. chip restrictions.",
      "url": "https://www.npr.org/2025/12/19/nx-s1-5637428/china-chip-industry-trade-restrictions",
      "published": "Fri, 19 Dec 2025 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU leaders agree on $105bn Ukraine loan, but without relying on frozen Russian assets",
      "description": "European Union leaders have agreed to provide a massive interest-free loan to Ukraine to meet its military and economic needs for the next two years. The loan will not rely on frozen Russian assets.",
      "url": "https://www.npr.org/2025/12/19/g-s1-102967/eu-leaders-agree-on-ukraine-loan",
      "published": "Fri, 19 Dec 2025 02:14:54 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US seizes another oil tanker off Venezuela",
      "description": "The seizure comes as US President Trump has ordered a blockade to prevent sanctioned oil tankers from entering and exiting Venezuela. Caracas said the US engaged in \"theft and hijacking\" of a private vessel.",
      "url": "https://www.dw.com/en/us-seizes-another-oil-tanker-off-venezuela/a-75255467?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 21:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German engineer becomes first wheelchair user to visit space",
      "description": "German engineer Michaela Benthaus, who has paraplegia, traveled to space with Jeff Bezos' company Blue Origin.",
      "url": "https://www.dw.com/en/german-engineer-becomes-first-wheelchair-user-to-visit-space/a-75254342?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 18:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Perfume's multicultural journey: From antiquity to TikTok",
      "description": "Though often marketed through a Eurocentric lens, perfume's multilayered history spans Mesopotamia, India, Egypt and Europe, besides being retold on PerfumeTok.",
      "url": "https://www.dw.com/en/perfume-s-multicultural-journey-from-antiquity-to-tiktok/a-75106869?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 13:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Labor rights in Europe: Who's working over Christmas?",
      "description": "From the number of paid days off to the size of the Christmas bonus, not all European countries are equal for workers over the holidays.",
      "url": "https://www.dw.com/en/labor-rights-in-europe-who-s-working-over-christmas/a-75246315?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 20 Dec 2025 11:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Justice Department begins release of some Epstein files",
      "description": "The Justice Department has dropped some of the files related to convicted sex offender Jeffrey Epstein. Former president Bill Clinton features heavily, but the documents make scant reference to Donald Trump. DW has more.",
      "url": "https://www.dw.com/en/us-justice-department-begins-release-of-some-epstein-files/live-75250220?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 19 Dec 2025 21:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France court rejects request to suspend Shein",
      "description": "The French government aimed to suspend Shein after child-like sex dolls and other illicit items were found on the platform. The site instead has been ordered to implement age-verification measures.",
      "url": "https://www.dw.com/en/france-court-rejects-request-to-suspend-shein/a-75247011?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 19 Dec 2025 16:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Breaking barriers: Teen racer Skye Parker takes on Formula 4",
      "description": "Why should Formula 1 be a male preserve? While no regulations bar women from competing, they remain notably absent from the grid. This question is at the heart of the stories of Skye Parker, a young Welsh woman, alongside Eliza Herbert and Elise Gallé-Tessonneau.",
      "url": "https://www.france24.com/en/video/20251220-breaking-barriers-teen-racer-skye-parker-takes-on-formula-4",
      "published": "Sat, 20 Dec 2025 15:14:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Key takeaways from the Justice Department release of thousands of Epstein files",
      "description": "The US Justice Department on Friday released a tranche of files related to convicted sex-offender Jeffrey Epstein in accordance with a congressional mandate. The partial disclosure has already drawn criticism from lawmakers and victims’ advocates, who cite the wholesale redaction of some pages and say key documents were withheld.",
      "url": "https://www.france24.com/en/americas/20251220-key-takeaways-us-justice-department-epstein-files-release",
      "published": "Sat, 20 Dec 2025 13:57:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Three-Michelin-star expert gives Christmas dinner tips",
      "description": "With less than a week to go until Christmas, hosts everywhere are finalising plans for their festive meal, whether it’s dinner or lunch depending on where they celebrate. Amid the abundance of advice, we’re turning to the best, as food guide and restaurant critic Andy Hayler joins us live from London to walk us through the key dos and don’ts for Christmas.",
      "url": "https://www.france24.com/en/video/20251220-three-michelin-star-expert-gives-christmas-dinner-tips",
      "published": "Sat, 20 Dec 2025 13:28:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pakistan sentences ex-PM Imran Khan and wife to another 17 years in prison for corruption",
      "description": "A Pakistani court on Saturday sentenced former prime minister Imran Khan and his wife Bushra Bibi to 17 years in prison after it found them guilty of corruption over the selling of expensive gifts they were given while in office. Khan has been in prison since 2023 on multiple corruption convictions.",
      "url": "https://www.france24.com/en/asia-pacific/20251220-pakistani-court-sentences-former-pm-imran-khan-wife-17-years-corruption-case",
      "published": "Sat, 20 Dec 2025 10:44:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Coupe de France: Avranches Pull Off Giant-Killing, Lens Deliver, PSG Step In",
      "description": "The Coupe de France Round of 64 got underway on Friday, marking the entry of Ligue 1 clubs into the competition. Fourth-tier Avranches produced a stunning upset by knocking out top-flight Brest, while Ligue 1 leaders Lens held firm against Feignies-Aulnoye. PSG, meanwhile, begin their quest for a third straight French Cup title on Saturday.",
      "url": "https://www.france24.com/en/sport/20251220-sports-coupe-de-france-avranches-pull-off-giant-killing-lens-deliver-psg-step-in",
      "published": "Sat, 20 Dec 2025 08:55:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'No major revelations' in heavily redacted release of Epstein files",
      "description": "Democrats on Friday voiced frustration that the long-awaited release of the Epstein files included many heavily redacted pages, claming that the amount of information concealed contravened what was mandated by the Epstein Files Transparency Act and would encourage conspiracy theories around the Epstein case.",
      "url": "https://www.france24.com/en/video/20251220-no-major-revelations-in-heavily-redacted-release-of-epstein-files",
      "published": "Sat, 20 Dec 2025 07:36:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine 'hits Russian tanker in Mediterranean Sea for first time'",
      "description": "Ukraine has struck a Russian tanker in the Mediterranean Sea for the first time, a Kyiv intelligence source has said.",
      "url": "https://news.sky.com/story/ukraine-hits-russian-tanker-in-mediterranean-sea-for-first-time-13485687",
      "published": "Fri, 19 Dec 2025 18:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A Brazilian judge allows ex-President Bolsonaro to leave prison for a hernia surgery",
      "description": "Brazil’s former President Jair Bolsonaro, who has been serving a 27-year prison sentence for an attempted coup since November, will be allowed to leave prison for a hernia surgery",
      "url": "https://abcnews.go.com/International/wireStory/brazilian-judge-allows-president-bolsonaro-leave-prison-hernia-128572057",
      "published": "Fri, 19 Dec 2025 19:29:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pakistani court sentences former PM Imran Khan and wife to 17 years in graft case",
      "description": "A Pakistani court has convicted former Prime Minister Imran Khan and his wife, Bushra Bibi, sentencing them to 17 years in prison",
      "url": "https://abcnews.go.com/International/wireStory/pakistani-court-sentences-former-prime-minister-imran-khan-128577662",
      "published": "Sat, 20 Dec 2025 07:13:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Funeral for slain Bangladeshi activist draws hundreds of thousands",
      "description": "Hundreds of thousands of people have attended the funeral of a leading Bangladeshi activist, Sharif Osman Hadi, who died from gunshot wounds",
      "url": "https://abcnews.go.com/International/wireStory/funeral-slain-bangladeshi-activist-draws-hundreds-thousands-128578492",
      "published": "Sat, 20 Dec 2025 07:13:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN urges Rwanda to leave eastern Congo, extends peacekeeping mission for a year",
      "description": "The U.N. Security Council has urged Rwanda to withdraw its forces from eastern Congo and extended the U.N. peacekeeping mission in Congo for a year",
      "url": "https://abcnews.go.com/International/wireStory/urges-rwanda-leave-eastern-congo-extends-peacekeeping-mission-128577759",
      "published": "Sat, 20 Dec 2025 07:14:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Artist's battlefield collection captures the lived experience of Ukraine's resistance to invasion",
      "description": "Ukrainian street artist Maxim Kilderov is building a powerful collection of battlefield artifacts documenting Russia’s invasion of Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/artists-battlefield-collection-captures-lived-experience-ukraines-resistance-128576519",
      "published": "Sat, 20 Dec 2025 00:10:56 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Prisoners freed by Belarus say their passports are taken away in a final 'dirty trick' by officials",
      "description": "Even though Belarus has released dozens of prisoners, those who've been freed say the authoritarian government often delivers one final act of repression by confiscating their passports before deporting them",
      "url": "https://abcnews.go.com/International/wireStory/prisoners-freed-belarus-passports-final-dirty-trick-officials-128576796",
      "published": "Sat, 20 Dec 2025 01:05:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Singapore to punish scammers with up to 24 strokes of the cane from Dec 30",
      "description": "Singapore’s government has announced that scammers will face mandatory caning of up to 24 strokes starting December 30",
      "url": "https://abcnews.go.com/International/wireStory/singapore-punish-scammers-24-strokes-cane-dec-30-128549262",
      "published": "Fri, 19 Dec 2025 07:24:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Can traditional medicine strengthen modern healthcare? An expert weighs in",
      "description": "Ginger and cinnamon are more than just ingredients. Along with other spices, their medicinal value is gaining both attention and legitimacy.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166628",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sudan: Needs rise as people continue to flee fighting in Kordofan",
      "description": "Families continue to flee intense hostilities across the Kordofan region of Sudan and humanitarian needs are surging, the UN said in an update on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166619",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gun jams as shoplifting suspect tries to shoot Ohio police officer at point-blank range in wild bodycam video",
      "description": "Wild bodycam footage shows a shoplifting suspect allegedly attempting to shoot an Ohio police officer at Walmart, but the gun malfunctioned during the incident.",
      "url": "https://www.foxnews.com/us/gun-jams-shoplifting-suspect-tries-shoot-ohio-police-officer-point-blank-range-wild-bodycam-video",
      "published": "Sat, 20 Dec 2025 18:48:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "DHS packages latest ICE arrests as 'Christmas gift to Americans'",
      "description": "The Department of Homeland Security calls ICE arrests of illegal immigrants with criminal records the agency's \"Christmas gift to Americans.\"",
      "url": "https://www.foxnews.com/us/dhs-packages-latest-ice-arrests-christmas-gift-americans",
      "published": "Sat, 20 Dec 2025 11:51:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "University of Illinois lesson materials push leftist race, class struggles on future teachers: leaked lectures",
      "description": "Leaked PowerPoint slides from University of Illinois teacher education course reveal left-wing ideology woven into curriculum for future educators.",
      "url": "https://www.foxnews.com/us/university-illinois-lesson-materials-push-leftist-race-class-struggles-future-teachers-leaked-lectures",
      "published": "Sat, 20 Dec 2025 10:00:08 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida cold case breakthroughs: Sheriff’s unit cracks two long-unsolved killings",
      "description": "Authorities in Florida announced breakthroughs in two long-unsolved Kissimmee homicide cases, bringing closure to one family and charges in another.",
      "url": "https://www.foxnews.com/us/florida-cold-case-breakthroughs-sheriffs-unit-cracks-two-long-unsolved-killings-police",
      "published": "Fri, 19 Dec 2025 13:12:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Minneapolis police chief blasts ICE after agent seen dragging woman through street, kneeling on her back",
      "description": "Minneapolis' police chief condemns \"disturbing\" incident where an ICE agent was caught on video kneeling on pregnant woman's back and dragging her through the street.",
      "url": "https://www.foxnews.com/us/minneapolis-police-chief-blasts-ice-after-agent-seen-dragging-woman-through-street-kneeling-her-back",
      "published": "Thu, 18 Dec 2025 21:54:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Albanian opposition lawmakers light flares, scuffle with police amid parliament chaos over corruption probe",
      "description": "Albania's parliament erupted in chaos as opposition lawmakers clashed with police over corruption charges against Deputy Prime Minister Belinda Balluku.",
      "url": "https://www.foxnews.com/world/albanian-opposition-lawmakers-light-flares-scuffle-police-amid-parliament-chaos-over-corruption-probe",
      "published": "Thu, 18 Dec 2025 09:34:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Vatican confirms resignation of Cardinal Timothy Dolan, announces new archbishop of New York",
      "description": "Vatican accepts Cardinal Dolan resignation as New York archbishop, naming Ronald Hicks as successor to lead the archdiocese starting February 2026.",
      "url": "https://www.foxnews.com/world/vatican-confirms-resignation-cardinal-timothy-dolan-announces-new-archbishop-new-york",
      "published": "Thu, 18 Dec 2025 06:25:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Can Maduro survive as Trump's oil pressure campaign hits his regime’s weak spot?",
      "description": "U.S. limits on Venezuelan oil exports are cutting the revenue that once sustained Nicolás Maduro, weakening his cash flow and putting the regime’s stability at risk.",
      "url": "https://www.foxnews.com/world/can-maduro-survive-trumps-oil-pressure-campaign-hits-his-regimes-weak-spot",
      "published": "Thu, 18 Dec 2025 06:19:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}