{
  "last_updated": "2025-12-31T20:25:04.468314Z",
  "event_count": 224,
  "events": [
    {
      "title": "Trump’s shadow war in Venezuela grows, but country’s strongman leader still clings to power",
      "description": "Report of a drone attack on a port facility signals new phase in US military campaign against Nicolás Maduro US wargames played out scenarios for Maduro’s fall. None of them ended well for Venezuela Nearly a week after Donald Trump first announced what he said was the first US ground strike in a four-month-long military pressure campaign against Venezuela , details remain very thin on the ground. CNN and the New York Times reported late on Monday that they had confirmed the CIA had used a drone to target a “port facility” allegedly used by the Tren de Aragua street gang. No casualties were reported, but the date, time and location of the attack remain unknown. Venezuela’s strongman leader, Nicolás Maduro , and his government have remained silent. If confirmed, the first strike on land would mark a new phase in a campaign that since August has involved the deployment of a massive US naval fleet, airstrikes that have so far killed 107 people, a “total blockade” of sanctioned oil tankers, the seizure of two vessels and the pursuit of a third. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/military-drone-strike-venezuela-trump-maduro",
      "published": "Tue, 30 Dec 2025 19:34:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s camp confirm two of his close friends died in Nigeria car crash",
      "description": "British former boxing champion sustained minor injuries Sina Ghami and Kevin ‘Lateef’ Ayodel killed in accident The British heavyweight boxer Anthony Joshua has issued a statement after he was injured in a car crash in Nigeria on Monday morning which killed two of his close friends. The former world heavyweight boxing champion was taken to an undisclosed hospital after his car hit a stationary vehicle at about 11am on the Lagos-Ibadan Expressway, the Ogun state police commissioner, Lanre Ogunlowo, said. The driver of Joshua’s vehicle was also injured, he added. Continue reading...",
      "url": "https://www.theguardian.com/sport/2025/dec/29/anthony-joshua-injured-car-crash-nigeria",
      "published": "Tue, 30 Dec 2025 00:17:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "UN, US sign $2 billion humanitarian funding agreement for 17 crisis-hit countries",
      "description": "The United Nations and the United States on Monday formalized an agreement under which the US committed $2 billion in humanitarian assistance for global relief programmes, a move the UN’s top relief official hailed as a landmark commitment to saving lives amid escalating humanitarian needs worldwide.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166678",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Hamas confirms five leaders killed, including 'masked spokesperson' in major blow to terror group",
      "description": "Five Hamas military commanders confirmed dead by terrorist group's armed wing, marking significant blow to Palestinian militant organization's leadership structure in Gaza conflict.",
      "url": "https://www.foxnews.com/world/hamas-confirms-five-leaders-killed-including-masked-spokesperson-major-blow-terror-group",
      "published": "Mon, 29 Dec 2025 20:15:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan civil war: Health system ‘on the verge of collapse’",
      "description": "The war in Sudan has been tearing the country apart for almost 1,000 days, putting the country’s health system under intolerable pressure. The World Health Organization (WHO) is reporting widespread disease outbreaks, severe shortages, malnutrition and rising deaths.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166673",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Here is to a quarter century of US military havoc",
      "description": "The US has waged its 'war on terror' for 25 years now, sowing death and destruction across the world.",
      "url": "https://www.aljazeera.com/opinions/2025/12/31/here-is-to-a-quarter-century-of-us-military-havoc?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 11:40:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: Guterres deplores deadly mosque blast in Homs",
      "description": "UN Secretary-General António Guterres “unequivocally condemns” the deadly terrorist attack on a mosque in Homs, Syria during Friday prayers, his spokesperson said in a statement",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166674",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Tens of thousands of Somalians protest against Israel's recognition of Somaliland",
      "description": "Tens of thousands of Somalis gathered across the country Tuesday to protest Israel’s recognition of the breakaway region of Somaliland, a move condemned by more than 20 countries as an attack on the East African nation's sovereignty. At a UN Security Council emergency meeting Monday, Somalia protested the recognition saying it poses regional security issues. The Israeli representative decried those comments as a double standard because other nations have recognized Palestine as a state. Details by FRANCE 24 correspondent in New York, Jessica Le Masurier.",
      "url": "https://www.france24.com/en/video/20251231-tens-of-thousands-of-somalians-protest-against-israel-s-recognition-of-somaliland",
      "published": "Wed, 31 Dec 2025 13:42:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Australian police find no evidence of 'broader terrorist cell' in Bondi Beach antisemitic shooting",
      "description": "Police say an investigation that extended to the Philippines of two men accused of killing 15 people at a Sydney Jewish festival has found no evidence they were part of a “broader terrorist cell.”",
      "url": "https://abcnews.go.com/International/wireStory/australian-police-find-evidence-broader-terrorist-cell-bondi-128770999",
      "published": "Mon, 29 Dec 2025 22:49:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Dispatch records from Brown University shooting capture chaos of deadly campus attack",
      "description": "Newly obtained police records reveal chaotic emergency response to Brown University shooting that left two students dead and multiple wounded on Dec. 13.",
      "url": "https://www.foxnews.com/us/dispatch-records-brown-university-shooting-capture-chaos-deadly-campus-attack",
      "published": "Wed, 31 Dec 2025 11:45:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "At least 13 people killed and 98 injured in train derailment in Mexico",
      "description": "Train accident in Oaxaca is likely to raise criticisms about public works projects from the previous administration At least 13 people were killed when a train derailed in the Mexican state of Oaxaca, in an accident which is likely to revive opposition criticisms of the speed and dealings with which the country’s government builds its flagship public works projects. The incident took place on the Interoceanic Train, which was built to link the Atlantic and Pacific oceans across the narrowest part of the Isthmus of Tehuantepec, creating an alternative rail cargo route to the Panama canal intended to drive development in the region. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/mexico-train-derailment-oaxaca",
      "published": "Mon, 29 Dec 2025 18:48:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief urges world leaders to ‘get priorities straight’ as New Year message calls for peace over war",
      "description": "As the world enters 2026 amid mounting crises, the UN Secretary-General António Guterres has issued a stark but hopeful New Year appeal, urging global leaders to shift resources away from destruction and towards development, peace and people.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166677",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Sri Lanka cyclone: More than a million still need aid weeks after Ditwah floods",
      "description": "Nearly a month after Cyclone Ditwah tore across Sri Lanka, more than a million people – including over half a million children – remain in urgent need of humanitarian assistance, as floods, landslides and renewed rainfall continue to compound one of the country’s worst disasters in decades.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166671",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Brown University implements campus-wide security overhaul after mass shooting leaves 2 dead, 9 wounded",
      "description": "Brown University announces new safety measures including security cameras after Dec. 13 mass shooting that killed two students in engineering building.",
      "url": "https://www.foxnews.com/us/brown-university-implements-campus-wide-security-overhaul-after-mass-shooting-leaves-2-dead-9-wounded",
      "published": "Tue, 30 Dec 2025 16:14:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran reportedly developing chemical, biological missile warheads as protests spread over collapsing economy",
      "description": "As Netanyahu meets Trump, intelligence suggests Iran accelerating chemical weapons work while facing unprecedented domestic unrest and economic crisis.",
      "url": "https://www.foxnews.com/world/iran-reportedly-developing-chemical-biological-missile-warheads-protests-spread-over-collapsing-economy",
      "published": "Mon, 29 Dec 2025 10:52:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's pres. says answer to attack would be harsh in response to Trump warning",
      "description": "Iranian President Masoud Pezeshkian says his country’s answer to an attack would be harsh",
      "url": "https://abcnews.go.com/International/wireStory/irans-president-answer-attack-harsh-apparent-response-trump-128776925",
      "published": "Tue, 30 Dec 2025 09:22:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "California farming tycoon accused of fatally shooting wife through window amid fight over fortune: report",
      "description": "California farming tycoon charged with murdering estranged wife in Arizona home after cross-state investigation reveals evidence allegedly linking him to the shooting.",
      "url": "https://www.foxnews.com/us/california-farming-tycoon-accused-fatally-shooting-wife-through-window-amid-fight-over-fortune-report",
      "published": "Tue, 30 Dec 2025 18:08:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Afghanistan to remain major crisis in 2026, UN, partners warn",
      "description": "Afghanistan is expected to remain one of the world’s largest humanitarian crises in 2026, UN agencies and humanitarian partners warned on Tuesday, launching a $1.7 billion appeal to assist nearly 18 million people in urgent need.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166684",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Greetings from Vienna, where an imperial palace hosts a holiday market for all",
      "description": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "url": "https://www.npr.org/2025/12/31/g-s1-103737/vienna-christmas-market-austria",
      "published": "Wed, 31 Dec 2025 08:09:22 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Germany news: Police face risk of violence on New Year's Eve",
      "description": "The German Police Trade Union warned of possible violence against emergency services during New Year's Eve celebrations. DW has more.",
      "url": "https://www.dw.com/en/germany-news-police-face-risk-of-violence-on-new-year-s-eve/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 16:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN peacekeeper injured in gunfire near ‘Blue Line’ in south Lebanon",
      "description": "One United Nations peacekeeper was injured on Friday after heavy machine gunfire from Israel Defense Forces (IDF) positions south of the Blue Line, following a nearby grenade explosion, impacted close to a UN patrol in southern Lebanon.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166676",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Israel to bar 37 aid groups as UK and EU warn of severe impact in Gaza",
      "description": "Israel's move is criticised by 10 countries, which say the new registration rules for international NGOs are \"restrictive\" and \"unacceptable\".",
      "url": "https://www.bbc.com/news/articles/c1evp7weyv2o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 17:10:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "SECURITY COUNCIL LIVE: Briefing on threats to international peace and security",
      "description": "The UN Security Council meets today to hear a briefing on threats to international peace and security following Israel’s recent recognition of the northern region of Somalia as an independent and sovereign state. Follow live below and UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166679",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "'Shivering from cold and fear': Winter rains flood Gaza camps",
      "description": "Winter rain lashed the Gaza Strip over the weekend, flooding camps with ankle-deep puddles as Palestinians displaced by two years of war attempted to stay dry in tents frayed by months of use. The foreign ministers of 10 nations on Tuesday expressed \"serious concerns\" about a \"renewed deterioration of the humanitarian situation\" in Gaza, saying the situation was \"catastrophic\". Story by Solange Mougin.",
      "url": "https://www.france24.com/en/video/20251231-shivering-from-cold-and-fear-winter-rains-flood-gaza-camps",
      "published": "Wed, 31 Dec 2025 15:46:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How climate change is threatening human rights",
      "description": "With rising effects of climate change across the globe, the world has started recognising that climate change is not just an ecological collapse, but also a human rights crisis.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166649",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Industrialisation without destruction: A UN blueprint for the future",
      "description": "Since the 19th century, industrialisation has had a transformative effect on the world, both positive and negative. It has created jobs and lifted millions out of poverty. But it has also had devastating consequences; destroying ecosystems, polluting the air, and driving the climate crisis that threatens to make large parts of the planet uninhabitable.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166635",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian protesters clash with security forces as tear gas fills Tehran streets amid nationwide unrest",
      "description": "Iran protests escalated as demonstrators clashed with security forces in Tehran and Mashhad, with tear gas deployed amid nationwide strikes, reports say.",
      "url": "https://www.foxnews.com/world/iranian-protesters-clash-security-forces-tear-gas-fills-tehran-streets-amid-nationwide-unrest",
      "published": "Mon, 29 Dec 2025 20:05:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump vows to 'knock the hell out of' Iran if nuclear program is rebuilt again after high-stakes meeting",
      "description": "Trump warns Iran he'll 'knock the hell out of them' if nuclear program rebuilds, as new reports allegedly detail chemical weapons development for missiles.",
      "url": "https://www.foxnews.com/world/trump-vows-knock-hell-out-of-iran-nuclear-program-rebuilt-again-after-high-stakes-meeting",
      "published": "Mon, 29 Dec 2025 14:40:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Protesters take to the streets of Iran as the country's economy collapses",
      "description": "Protests over the economy are sweeping through Iran. The country's currency is plummeting amid concerns Israel will restart its war with Iran, a move President Trump signaled he would approve.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5660851/protesters-take-to-the-streets-of-iran-as-the-countrys-economy-collapses",
      "published": "Wed, 31 Dec 2025 04:45:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Protests spread across Iran, as the country faces unrest over economic struggles",
      "description": "Iranian students staged street protests in Tehran on Tuesday, a day after the capital's shopkeepers demonstrated against economic hardship and won a message of understanding from the president. Story by Emily Boyle.",
      "url": "https://www.france24.com/en/video/20251231-protests-spread-across-iran-as-the-country-faces-unrest-over-economic-struggles",
      "published": "Wed, 31 Dec 2025 17:39:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "UN renews ceasefire push in Sudan",
      "description": "The UN has urged Sudan’s warring parties to pursue compromise and an immediate ceasefire, even as drone attacks, displacement and the killing of peacekeepers underscore the growing risks to civilians and humanitarians.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166675",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Anti-Iran regime protests grow across country as Trump admin boosts demonstrators offering support",
      "description": "U.S. officials voice support for Iranian demonstrators as protests intensify following currency crisis, with reports of tear gas and security crackdowns.",
      "url": "https://www.foxnews.com/world/anti-iran-regime-protests-grow-across-country-trump-admin-boosts-demonstrators-offering-support",
      "published": "Tue, 30 Dec 2025 12:47:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Russia's nuclear-capable Oreshnik missiles have entered active service, Moscow says",
      "description": "Russia’s nuclear-capable Oreshnik missile system has entered active service, Russia’s Ministry of Defense says, as negotiators continue to search for a breakthrough in peace talks to end Moscow’s war in Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/russias-nuclear-capable-oreshnik-missiles-entered-active-service-128774458",
      "published": "Tue, 30 Dec 2025 07:13:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Missing elderly person found in bitter cold woods after police deploy thermal imaging drone",
      "description": "Philadelphia police rescued a missing elderly person from a wooded area Sunday using thermal imaging drone technology in coordinated search effort.",
      "url": "https://www.foxnews.com/us/missing-elderly-person-found-bitter-cold-woods-after-police-deploy-thermal-imaging-drone",
      "published": "Tue, 30 Dec 2025 22:28:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘Only Trump can stop Russia’: Millions face freezing winter, Ukraine energy executive warns",
      "description": "Ukraine's largest private energy company reports 90% of generation capacity damaged by Russian attacks, leaving over 1 million without power during freezing temperatures.",
      "url": "https://www.foxnews.com/world/only-trump-can-stop-russia-millions-face-freezing-winter-ukraine-energy-executive-warns",
      "published": "Mon, 29 Dec 2025 17:18:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Trump says US hit 'big facility' linked to alleged Venezuelan drug boats",
      "description": "The US president would not confirm US media reports that the explosion was caused by a CIA drone strike.",
      "url": "https://www.bbc.com/news/articles/cp8484p7ggmo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 03:23:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "The 'thorny' issues that threaten to derail a Russia-Ukraine peace deal",
      "description": "Two of the main sticking points involve territory and the fate of Europe's biggest nuclear plant, which is currently occupied by Russia.",
      "url": "https://www.bbc.com/news/articles/c78v5dj3x39o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 17:33:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Australia says ‘deeply concerning, destabilising’ Chinese exercises near Taiwan risk inflaming regional tension",
      "description": "Foreign affairs department statement says Australia opposes any actions that ‘increase the risk of accident, miscalculation or escalation’ Get our breaking news email , free app or daily news podcast Australia says it is deeply concerned about Chinese military exercises near Taiwan, and has raised the issue with Chinese officials. In a statement released on Wednesday , the Department of Foreign Affairs and Trade (Dfat) said the large-scale simulations risked destabilising the region and could result in an accident or escalation. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/australia-says-deeply-concerning-destabilising-chinese-exercises-near-taiwan-risk-inflaming-regional-tension",
      "published": "Wed, 31 Dec 2025 07:28:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran on the brink? Key information about the protests",
      "description": "Iran has been gripped by demonstrations amid the country's economic crisis, with social discontent fueling open protest against the regime. Media and authorities have pinned the blame on foreign intelligence services.",
      "url": "https://www.dw.com/en/iran-on-the-brink-key-information-about-the-protests/a-75346485?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 07:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Attacks disrupt heating as temperatures plunge",
      "description": "Recent attacks across Ukraine have killed civilians, damaged critical infrastructure and cut heating and power supplies for millions, UN humanitarians report, as temperatures drop below freezing.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166687",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "These are the countries attacked by Israel in 2025",
      "description": "In 2025, Israel carried out thousands of attacks in Gaza, with at least 10,600 attacks record across multiple countries",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/31/these-are-the-countries-attacked-by-israel-in-2025?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 15:11:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iran's economic crisis, political discontent threaten regime",
      "description": "Protests triggered by soaring inflation and a collapsing currency have highlighted widespread political discontent. Analysts say the deep economic woes are a major challenge to the regime's authority.",
      "url": "https://www.dw.com/en/iran-s-economic-crisis-political-discontent-threaten-regime/a-75350062?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 14:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "New Year's Eve live: World ushers in 2026",
      "description": "DW has all the updates as the world celebrates the end of 2025 and looks forward to 2026.",
      "url": "https://www.dw.com/en/new-year-s-eve-live-world-ushers-in-2026/live-75348280?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 13:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Taiwan remains on alert as China ends military drills",
      "description": "China had fired rockets and deployed dozens of aircraft and naval vessels in exercises simulating a blockade of Taiwan's ports. Taipei condemned the drills as a threat to regional security.",
      "url": "https://www.dw.com/en/taiwan-remains-on-alert-as-china-ends-military-drills/a-75347891?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 08:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Anthony Joshua stable after car accident in Nigeria which killed two of his team members",
      "description": "Fondly known as AJ, Anthony Joshua is one of Britain’s most popular sports personalities. The British boxer was in a \"stable condition\" in hospital after the Monday car accident that killed two close associates, his promoter said on Monday. A Nigeria traffic compliance agency said that preliminary investigations showed the car involved in an accident had a burst tyre before hitting a stationary truck. Story by Clarisse Fortuné.",
      "url": "https://www.france24.com/en/video/20251231-anthony-joshua-stable-after-car-accident-in-nigeria-which-killed-two-of-his-team-members",
      "published": "Wed, 31 Dec 2025 13:46:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "This is how the GHF weaponised food aid in Gaza",
      "description": "Thousands of Palestinians were killed or injured at or near food distribution sites in Gaza this year.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/31/this-is-how-the-ghf-weaponised-food-aid-in-gaza?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 13:45:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Which aid groups is Israel banning from Gaza now – and what will it mean?",
      "description": "Israel's latest move could amplify a deep humanitarian crisis spawned by its genocidal war on Gaza.",
      "url": "https://www.aljazeera.com/news/2025/12/31/which-aid-groups-is-israel-banning-from-gaza-now-and-what-will-it-mean?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 11:57:54 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Tensions between Saudis and Emiratis over future of Yemen reach boiling point",
      "description": "Dispute has potential to create civil war in south of Yemen and spill over into neighbouring countries Tensions between the United Arab Emirates and Saudi Arabia over the future of Yemen and the imminent possibility of the declaration of an independent southern state have reached boiling point with Saudi Arabia in effect accusing the UAE of threatening its future security. The dispute has the potential to create a civil war within the south of Yemen and also spill over into other disputes including in Sudan and the Horn of Africa where the two countries often find themselves backing opposite sides. Yemen could yet become only one theatre in which the two vastly wealthy Gulf states vie for political influence, control of shipping lanes and commercial access. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/saudi-arabia-uae-tension-future-yemen-boiling-point",
      "published": "Tue, 30 Dec 2025 17:19:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "‘Tonga is not a threat’: anger as small Pacific nation falls under Trump visa restrictions",
      "description": "Community leaders raise alarm over study links and Polynesian ties, with Tonga to face restrictions from January as US says too many overstay The small Pacific nation of Tonga is one of more than a dozen countries to be hit with visa and entry restrictions on 1 January as the Trump administration tightens its crackdown on immigration. In December , the US said it would further restrict and limit the entry of foreign nationals to protect the country from “national security and public safety threats”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/tonga-under-usa-trump-visa-ban",
      "published": "Wed, 31 Dec 2025 01:30:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iranian protesters attempt to break in to government building as demonstrations escalate",
      "description": "Iranian protesters attempted to storm a local government building on Wednesday, state media reported, as demonstrations over the cost of living reached their fourth day.",
      "url": "https://news.sky.com/story/iranian-protesters-attempt-to-break-in-to-government-building-13489061",
      "published": "Wed, 31 Dec 2025 14:38:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Indonesia raises alert for the Mount Bur Ni Telong volcano",
      "description": "Authorities in Indonesia have raised the alert level for the Mount Bur Ni Telong volcano to its second highest following a series of increased activity and volcanic earthquakes",
      "url": "https://abcnews.go.com/International/wireStory/indonesia-raises-alert-mount-bur-ni-telong-volcano-128797820",
      "published": "Wed, 31 Dec 2025 08:57:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sexual violence against children ‘entrenched, systemic and widespread’ across DR Congo, UNICEF warns",
      "description": "Sexual violence against children has become entrenched, systemic and increasingly widespread across the Democratic Republic of the Congo (DRC), with new data showing a sharp rise in cases since 2022, according to the UN Children’s Fund (UNICEF).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166683",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Judge halts Homeland Security plan to end Temporary Protected Status for South Sudan",
      "description": "A federal judge temporarily blocked DHS from ending TPS for South Sudan, preserving legal status for hundreds amid ongoing conflict concerns.",
      "url": "https://www.foxnews.com/us/judge-halts-homeland-security-plan-end-temporary-protected-status-south-sudan",
      "published": "Tue, 30 Dec 2025 14:51:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Central African Republic goes to polls as president seeks third term",
      "description": "Opposition hopes to tap into frustrations of people living in country where conflict remains a daily reality Central African Republic goes to the polls on Sunday with the president, Faustin-Archange Touadéra, seeking a third term. As many as 2.3 million registered voters will cast ballots for what observers are calling a quadruple election: votes for the presidency and parliament as well as local and municipal offices. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/central-african-republic-goes-to-polls-as-president-seeks-third-term",
      "published": "Sun, 28 Dec 2025 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela says it released 99 people detained for 2024 election protests",
      "description": "Government said the move was due to its ‘unrestricted respect for human rights’ in the face of US aggression Venezuela has said it has carried out its largest release of political prisoners this year, claiming to have freed 99 people detained for taking part in protests after the 2024 election, widely believed to have been stolen by the dictator Nicolás Maduro , as it comes under increasing military pressure from the US. Civil society organisations have treated the news with caution and stressed that the releases were insufficient, noting that at least 900 political prisoners remain in the country. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/venezuela-political-prisoner-release",
      "published": "Fri, 26 Dec 2025 14:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Israel bans dozens of aid groups from Gaza, despite immense needs",
      "description": "Dozens of international aid groups, like Doctors Without Borders, are now banned from entering Gaza under new rules set by Israel.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5662408/israel-bans-dozens-of-aid-groups-from-gaza-despite-immense-needs",
      "published": "Wed, 31 Dec 2025 07:34:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran launches satellites on Russian rockets as Moscow-Tehran ties deepen",
      "description": "Iran launches three satellites with Russian assistance, showcasing deepening cooperation as they resist Western sanctions and international pressure.",
      "url": "https://www.foxnews.com/world/iran-launches-satellites-russian-rockets-moscow-tehran-ties-deepen",
      "published": "Wed, 31 Dec 2025 11:26:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "In pictures: New Year welcomed around the world",
      "description": "From spectacular firework displays to chilly sea dips, nations celebrate the start of 2026.",
      "url": "https://www.bbc.com/news/articles/c050j896q2do?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 19:07:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "An escalation in Yemen threatens to reignite civil war and widen tensions in the Gulf",
      "description": "Saudi Arabia bombed Yemen's port city of Mukalla, targeting a shipment of weapons from the United Arab Emirates for separatist forces. The UAE later said it would withdraw its forces from Yemen.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103991/yemen-conflict",
      "published": "Tue, 30 Dec 2025 11:48:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "In pictures: Sydney helps kick off celebrations as world ushers in 2026",
      "description": "Australia, New Zealand and several eastern Asian nations were the first countries to ring in 2026 with spectacular fireworks displays. The rest of Asia, Africa and Europe will be the next regions to watch as the countdown clock ticks down to midnight.",
      "url": "https://www.france24.com/en/asia-pacific/20251231-in-pictures-spectacular-fireworks-light-up-skies-as-world-ushers-in-2026",
      "published": "Wed, 31 Dec 2025 14:45:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Kohberger plea, Cincinnati beating, Read verdict fuel 2025’s most viral, controversial moments",
      "description": "Viral video of Cincinnati racial beating sparks national outrage as Charlie Kirk's assassination and Shamsud-Din Jabbar's New Orleans attack dominate 2025 headlines.",
      "url": "https://www.foxnews.com/us/kohberger-plea-cincinnati-beating-read-verdict-fuel-2025-most-viral-controversial-moments",
      "published": "Wed, 31 Dec 2025 08:00:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Sydney sends message of peace for New Year's after Bondi attack",
      "description": "The words peace and unity were projected onto the Sydney Harbour Bridge as thousands gathered to watch the annual fireworks.",
      "url": "https://www.bbc.com/news/articles/clye3xz52e5o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 15:24:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Machu Picchu train crash leaves one dead and dozens injured",
      "description": "A train driver died and at least 40 people were injured in the crash on the single-track line to Machu Picchu.",
      "url": "https://www.bbc.com/news/articles/cn9zl309dz8o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 12:27:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Saving South Africa's threatened albatross from lethal fishing lines",
      "description": "A task force is trying to save seabirds from getting caught and killed in fishing boat nets.",
      "url": "https://www.bbc.com/news/articles/cwywv4ndwqxo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 00:23:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Finland seizes vessel suspected of damaging undersea cable",
      "description": "European countries are on high alert following a series of suspected sabotage attacks on underwater cables and pipelines.",
      "url": "https://www.dw.com/en/finland-seizes-vessel-suspected-of-damaging-undersea-cable/a-75349419?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 12:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Six ways the 2026 World Cup will be different",
      "description": "The United States is set to host the 2026 World Cup, along with Canada and Mexico. DW fills you in on why this tournament will be different than its predecessors.",
      "url": "https://www.dw.com/en/six-ways-the-2026-world-cup-will-be-different/a-75077593?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 09:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Israel moves to suspend major aid groups in Gaza",
      "description": "Israel has been tightening oversight of humanitarian groups in Gaza, warning that dozens of organizations face suspension for failing to submit lists of their Palestinian employees.",
      "url": "https://www.dw.com/en/israel-moves-to-suspend-major-aid-groups-in-gaza/a-75347346?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 08:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Aid to Gaza under threat: Dozens of NGOs to be barred under new Israeli rules",
      "description": "Dozens of NGOs expect to see their licenses to operate in Gaza revoked on January 1 for failing to comply with Israel’s new rules for the Palestinian territory. Their expulsion comes as Gazans face harsh winter conditions and a deepening humanitarian crisis.",
      "url": "https://www.france24.com/en/middle-east/20251231-access-to-gaza-under-threat-msf-among-dozens-of-ngos-to-be-barred-under-new-israeli-rules",
      "published": "Wed, 31 Dec 2025 15:46:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand releases 18 Cambodian prisoners of war as part of ceasefire agreement",
      "description": "Thailand has repatriated 18 Cambodian prisoners of war",
      "url": "https://abcnews.go.com/International/wireStory/thailand-releases-18-cambodian-prisoners-war-part-ceasefire-128798649",
      "published": "Wed, 31 Dec 2025 08:01:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains 125 more Islamic State suspects as nationwide sweep continues",
      "description": "Turkish authorities have detained 125 suspected Islamic State members in raids across 25 provinces",
      "url": "https://abcnews.go.com/International/wireStory/turkey-detains-125-islamic-state-suspects-nationwide-sweep-128800259",
      "published": "Wed, 31 Dec 2025 07:13:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Body found during search for missing Texas teen Camila Mendoza Olmos as another teen girl disappears",
      "description": "Texas authorities find body and firearm during search for 19-year-old Camila Olmos who vanished Christmas Eve from Bexar County in ongoing case.",
      "url": "https://www.foxnews.com/us/body-found-during-search-missing-texas-teen-camila-mendoza-olmos-another-teen-girl-disappears",
      "published": "Tue, 30 Dec 2025 20:23:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "China launches largest military drills off Taiwan in 8 months with live-fire exercises caught on camera",
      "description": "China launches biggest military encirclement of Taiwan in 8 months with live-fire drills, rockets and warships in massive 'Justice Mission 2025' exercise.",
      "url": "https://www.foxnews.com/world/china-launches-largest-military-drills-taiwan-8-months-live-fire-exercises-caught-camera",
      "published": "Tue, 30 Dec 2025 17:50:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "U.S. announces more military actions against ISIS: 'We will not relent'",
      "description": "CENTCOM declared that the U.S. and partner forces in Syria killed and captured ISIS figures in the time since a December 19 strike in Syria.",
      "url": "https://www.foxnews.com/world/u-s-announces-more-military-actions-against-isis-we-not-relent",
      "published": "Tue, 30 Dec 2025 10:17:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "France targets Australia-style social media ban for children next year",
      "description": "Draft bill to be submitted for legal checks as France aims to follow Australia’s world-first ban on platforms including Facebook, Snapchat and YouTube France intends to follow Australia and ban social media platforms for children from the start of the 2026 academic year. A draft bill preventing under-15s from using social media will be submitted for legal checks and is expected to be debated in parliament early in the new year. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/france-plans-social-media-ban-for-under-15s-from-september-2026",
      "published": "Wed, 31 Dec 2025 15:31:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "France plans social media ban for children under 15: reports",
      "description": "After Australia's world-first social-media ban for minors, France has drafted a similar law to block under-15s from major platforms, which could take effect from September.",
      "url": "https://www.dw.com/en/france-plans-social-media-ban-for-children-under-15-reports/a-75352145?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 18:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Israel bans 37 aid groups from Gaza, where the humanitarian situation remains dire",
      "description": "Israel plans to ban 37 aid organisations from operating in Gaza from Thursday unless they hand over detailed information on their Palestinian staff, despite mounting criticism from the United Nations and the European Union. Several NGOs have told AFP the new rules will have a major impact on food and medical shipments to Gaza, and humanitarian groups warn there is already not enough aid to cover the devastated territory's needs. Details by FRANCE 24 correspondent in Jerusalem, Noga Tarnopolsky.",
      "url": "https://www.france24.com/en/video/20251231-israel-bans-37-aid-groups-from-gaza-where-the-humanitarian-situation-remains-dire",
      "published": "Wed, 31 Dec 2025 17:38:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Another child dies in extreme conditions in Gaza: UNICEF",
      "description": "A sixth child has died in Gaza this month as the enclave’s people continue to endure dire living conditions linked to freezing rains and the Israel-Hamas war, the UN Children’s Fund (UNICEF) has announced. The development comes as aid agencies urged Israeli authorities to reconsider revoking the licences of dozens of humanitarian partners that provide assistance across the devastated enclave from 1 January.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166686",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Unseen Walmart video shows Bryan Kohberger acting differently after Idaho student murders",
      "description": "New video reveals Bryan Kohberger made 13 Walmart trips during Idaho semester, with suspicious behavior changes after November 2022 student massacre.",
      "url": "https://www.foxnews.com/us/unseen-walmart-video-shows-bryan-kohberger-acting-differently-after-idaho-student-murders",
      "published": "Wed, 31 Dec 2025 10:09:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UK PM Starmer–praised Egyptian extremist faces counter-terror probe over resurfaced tweets",
      "description": "U.K. counterterrorism police assess controversial social media posts by Egyptian-British activist after his return to Britain sparked political backlash.",
      "url": "https://www.foxnews.com/world/uk-pm-starmer-praised-egyptian-extremist-faces-counter-terror-probe-over-resurfaced-tweets",
      "published": "Tue, 30 Dec 2025 17:48:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "How many countries has Trump bombed in 2025?",
      "description": "Venezuela is the latest country to be hit by US strikes as the Trump administration ramps up military interventions.",
      "url": "https://www.aljazeera.com/news/2025/12/31/how-many-countries-has-trump-bombed-in-2025?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 11:53:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Why flu cases are surging this season. And, protests erupt in Iran over the economy",
      "description": "The flu is spreading rapidly across the U.S. this season, and it is expected to get worse. And, protests have erupted across Iran over the country's troubled economy.",
      "url": "https://www.npr.org/2025/12/31/g-s1-104088/up-first-newsletter-flu-cases-surge-venezuela-iran-protests",
      "published": "Wed, 31 Dec 2025 07:30:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iranian university students join protests over soaring cost of living",
      "description": "University students in Iran have joined shopkeepers and bazaar merchants in protests over the country's soaring cost of living.",
      "url": "https://news.sky.com/story/iranian-university-students-join-protests-over-soaring-cost-of-living-13488739",
      "published": "Tue, 30 Dec 2025 16:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Sudan: UN warns of unprecedented child hunger in Darfur as fighting fuels refugee exodus",
      "description": "Sudan’s deepening war is driving unprecedented levels of hunger, child malnutrition and displacement, UN agencies report, as new data from Darfur and a renewed refugee influx into Chad underscore the rapidly deteriorating situation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166682",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Gaza battered by heavy rains as humanitarian response continues",
      "description": "Severe weather conditions have led to further casualties and heightened health risks in Gaza over the past 24 hours, the UN aid coordination office (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166680",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Girl begged for help months before alleged killing by father, girlfriend — earlier abuse case closed: report",
      "description": "Newly released police records reveal 10-year-old Rebekah Baptiste pleaded for help months before allegedly being killed by her father and girlfriend.",
      "url": "https://www.foxnews.com/us/girl-begged-help-months-before-alleged-killing-father-girlfriend-earlier-abuse-case-closed-report",
      "published": "Wed, 31 Dec 2025 12:13:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Leaps and bounds - how the power of AI expanded further in 2025",
      "description": "It's only been three years since ChatGPT leaped onto the world stage, but artificial intelligence is now becoming an integral part of daily life. The technology has been integrated into search engines, social media apps and online shopping sites, but also shaken financial markets. Here's a look back at how AI moved the world in 2025. But first, as Bulgaria remains divided on the eve of joining the euro, we take a look at possible implications of switching to the single currency.",
      "url": "https://www.france24.com/en/tv-shows/business/20251231-leaps-and-bounds-how-the-power-of-ai-expanded-further-in-2025",
      "published": "Wed, 31 Dec 2025 20:08:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Countries around the worlds begin to welcome 2026, starting with New Zealand",
      "description": "New Zealand has opened the New Years ceremonies as always with an impressive display. Story by Ludovic de Foucaud and Emily Boyle.",
      "url": "https://www.france24.com/en/video/20251231-countries-around-the-worlds-begin-to-welcome-2026-starting-with-new-zealand",
      "published": "Wed, 31 Dec 2025 17:40:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Danish Post bids farewell to paper mail after 400 years",
      "description": "Tuesday marks the end of an era that's lasted over four hundred years - at least in Denmark, where the nation's postal service has delivered its last ever letter, a result of changing habits in a digital world, and the inevitable cost-cutting that goes with it. Story by Luke Shrago.",
      "url": "https://www.france24.com/en/video/20251231-danish-post-bids-farewell-to-paper-mail-after-400-years",
      "published": "Wed, 31 Dec 2025 14:24:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "China’s Xi hails nation's technological progress, renews Taiwan promise",
      "description": "Chinese President Xi Jinping has hailed his country’s technological progress in areas such as artificial intelligence and semiconductors",
      "url": "https://abcnews.go.com/International/wireStory/chinas-xi-hails-nations-technological-progress-renews-promise-128803644",
      "published": "Wed, 31 Dec 2025 08:57:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "First Person: Felipe Paullier, the youngest ever senior UN official, charged with giving a voice to young people around the world",
      "description": "A paediatrician by training, Felipe Paullier has long been an advocate for youth. Formerly Director of the Uruguayan Government's Youth Institute, a role which involved several joint actions with various UN agencies, he was appointed to run the UN Youth Office in 2023, the youngest senior appointment in United Nations history.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166651",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "ISIS exploiting Syria’s chaos as US strikes expose growing threat",
      "description": "Despite years of defeat claims, ISIS adapts and persists in Syria's chaos, prompting major U.S. military response and raising containment questions.",
      "url": "https://www.foxnews.com/world/isis-exploiting-syrias-chaos-us-strikes-expose-growing-threat",
      "published": "Wed, 31 Dec 2025 06:00:48 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU's top diplomat rejects Russian claims of Ukrainian attack on government sites",
      "description": "It comes as Russia releases video which it claims shows a downed Ukrainian drone launched at one of Putin's residences.",
      "url": "https://www.bbc.com/news/articles/c0q4e4e4ldyo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 16:06:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Passenger describes 'chaos' after head-on Machu Picchu train collision",
      "description": "Tourist Niels Honkoop says shattered glass littered the carriage floor and injured people were lying in the aisles.",
      "url": "https://www.bbc.com/news/articles/c4gweww8rjro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 16:42:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Sticky inflation, metal prices and the AI bubble risk: key trends to watch in the Australian economy in 2026",
      "description": "Can inflation be tamed without further interest rate hikes? And will the hot streak for gold and silver continue in 2026? Get our breaking news email , free app or daily news podcast The Australian share market delivered a 6.8% return in 2025, representing a third consecutive year of gains in a volatile period marked by trade wars, reigniting inflation and fears of an artificial intelligence-fuelled bubble. Here are three things to watch for in 2026. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/01/australian-economy-forecast-2026-interest-rates-inflation-crypto-ai-gold-silver",
      "published": "Wed, 31 Dec 2025 14:00:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Bangladesh mourns death of first female Prime Minister Khaleda Zia",
      "description": "Bangladesh is mourning the death of its first female Prime Minister, Khaleda Zia, who died Tuesday.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5661552/bangladesh-mourns-death-of-first-female-prime-minister-khaleda-zia",
      "published": "Wed, 31 Dec 2025 04:47:05 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "CIA behind strike at Venezuelan dock that Trump claims was used by drug smugglers, AP sources say",
      "description": "The CIA was behind a drone strike last week at a docking area believed to have been used by Venezuelan drug cartels. That's according to two people familiar with details of the operation.",
      "url": "https://www.npr.org/2025/12/31/g-s1-104073/cia-behind-strike-at-venezuelan-dock-that-trump-claims-was-used-by-drug-smugglers-ap-sources-say",
      "published": "Wed, 31 Dec 2025 02:57:47 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: Merz says 2026 can be a 'year of new beginnings'",
      "description": "Chancellor Friedrich Merz touched on war in Ukraine, increased defense spending, changing ties to the US, technological upheaval, industrial stagnation, sluggish reforms, migration and more in his New Year's address.",
      "url": "https://www.dw.com/en/germany-merz-says-2026-can-be-a-year-of-new-beginnings/a-75344460?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 19:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Eurostar back on track after Channel Tunnel power fault",
      "description": "The operator of the train service connecting Britain with continental Europe has warned that delays may persist as travelers head out in the run-up to the New Year.",
      "url": "https://www.dw.com/en/eurostar-back-on-track-after-channel-tunnel-power-fault/a-75348030?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 09:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: War medics confront their trauma in mountain retreat",
      "description": "Deep in the Carpathian mountains in west Ukraine, a government programme offers Ukrainian military medics a ten-day respite from the war while helping them confront their traumas. #ukraine #ukrainewar #ukrainearmy",
      "url": "https://www.france24.com/en/video/20251231-ukraine-war-medics-confront-their-trauma-in-mountain-retreat-1",
      "published": "Wed, 31 Dec 2025 16:13:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia PM commends 'courage and compassion' after Bondi Beach attack in New Year's message",
      "description": "Anthony Albanese has commended the \"courage and compassion\" shown in Australia after the Bondi Beach attack in his New Year's message.",
      "url": "https://news.sky.com/story/australian-pm-anthony-albanese-commends-courage-and-compassion-after-bondi-beach-attack-in-new-years-message-13488963",
      "published": "Wed, 31 Dec 2025 04:46:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Search for Malaysia Airlines flight MH370 resumes",
      "description": "The deep-sea search for missing Malaysia Airlines flight MH370 has begun - more than a decade after the jet vanished with 239 people on board.",
      "url": "https://news.sky.com/story/search-for-malaysia-airlines-flight-mh370-resumes-11-years-after-it-went-missing-13489040",
      "published": "Wed, 31 Dec 2025 09:42:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Leaders from Europe and Canada discuss US-led peace efforts as Russia-Ukraine tensions spike",
      "description": "Leaders from Europe and Canada have held talks on U.S.-led peace efforts to end the war between Russia and Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/european-leaders-discuss-us-led-peace-efforts-russia-128775457",
      "published": "Tue, 30 Dec 2025 09:13:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Latest deep-sea search for missing Malaysia Airlines Flight 370 gets underway",
      "description": "A deep-sea search for Malaysia Airlines Flight 370 has begun in the Indian Ocean, reviving efforts to solve one of aviation’s greatest mysteries",
      "url": "https://abcnews.go.com/International/wireStory/latest-deep-sea-search-missing-malaysia-airlines-flight-128801273",
      "published": "Wed, 31 Dec 2025 08:37:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Queen Camilla recalls assault in 1960s as she campaigns against domestic violence",
      "description": "Britain’s Queen Camilla has spoken publicly for the first time about her personal experience of indecent assault",
      "url": "https://abcnews.go.com/International/wireStory/uks-queen-camilla-recalls-assault-1960s-campaigns-domestic-128803866",
      "published": "Wed, 31 Dec 2025 08:57:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ex-police officer given prison time in case prosecuted under Soros DA sees conviction overturned a year later",
      "description": "A court has overturned the conviction of a former Austin Police Officer Christopher Taylor, acquitting him of all charges in connection to a 2019 shooting.",
      "url": "https://www.foxnews.com/us/ex-police-officer-given-prison-time-case-prosecuted-soros-da-conviction-overturned-year-later",
      "published": "Wed, 31 Dec 2025 15:07:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Texas sheriff 'strongly' believes remains found belong to missing teen Camila Mendoza Olmos",
      "description": "Texas sheriff believes remains found in field belong to missing teen Camila Mendoza Olmos, who vanished from hone on Christmas Eve near San Antonio.",
      "url": "https://www.foxnews.com/us/texas-sheriff-strongly-believes-remains-found-belong-missing-teen-camila-mendoza-olmos",
      "published": "Wed, 31 Dec 2025 13:36:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Body found during search for missing Texas teen as another girl disappears and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/body-found-during-search-missing-texas-teen-another-girl-disappears-more-top-headlines",
      "published": "Wed, 31 Dec 2025 07:07:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Putin vows victory in Ukraine in New Year’s address amid Trump-backed peace talks",
      "description": "Russian President Vladimir Putin's defiant New Year's message contrasts sharply with President Donald Trump's diplomatic push as Ukraine-Russia war approaches fourth year.",
      "url": "https://www.foxnews.com/world/putin-vows-victory-ukraine-new-years-address-amid-trump-backed-peace-talks",
      "published": "Wed, 31 Dec 2025 13:18:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Putin residence drone attack dismissed as implausible as Ukraine accusations mount",
      "description": "Russian President Vladimir Putin's residence allegedly targeted by Ukrainian drones, but drone expert Cameron Chell says the claims lack credibility due to tactical impossibilities.",
      "url": "https://www.foxnews.com/world/putin-residence-drone-attack-dismissed-hard-fathom-ukraine-accusations-mount",
      "published": "Tue, 30 Dec 2025 21:59:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy denies Russian claim that Ukraine attacked Putin residence",
      "description": "Ukrainian President Volodymyr Zelenskyy calls alleged drone attack on Russian President Vladimir Putin's residence a \"complete fabrication\" as tensions escalate between Ukraine and Russia.",
      "url": "https://www.foxnews.com/world/zelenskyy-denies-russian-claim-ukraine-attacked-putin-residence",
      "published": "Mon, 29 Dec 2025 11:56:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "In India, youths are quiet as Gen Z protests rock South Asia",
      "description": "Gen Z protests have shaken Sri Lanka, Bangladesh and Nepal in recent years — but not India. Why? In a Delhi coffee-house chat with DW, young Indians debate power, politics and the future.",
      "url": "https://www.dw.com/en/in-india-youths-are-quiet-as-gen-z-protests-rock-south-asia/a-75349517?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 14:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Iran: Students join economic protests, president seeks talks",
      "description": "Students demonstrated at several universities in Iran, semi-official media reported, after demonstrations by shopkeepers and bazaar merchants moved the president to announce plans for talks with protesters online.",
      "url": "https://www.dw.com/en/iran-students-join-economic-protests-president-seeks-talks/a-75346547?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 22:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Almost half of all Germans want a ban on fireworks",
      "description": "In Germany, it's only permitted to sell fireworks in the three days leading up to New Year's Eve. Some line up early to buy them, while others have safety concerns and want to see them banned altogether.",
      "url": "https://www.dw.com/en/almost-half-of-all-germans-want-a-ban-on-fireworks/a-75345435?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 19:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "How does the French police prepare itself for the New Year's Eve festivities?",
      "description": "Here in France, some ninety thousand police officers and gendarmes will be patrolling cities and towns across the country for the New Year's eve festivities. Story by Solange Mougin.",
      "url": "https://www.france24.com/en/video/20251231-how-does-the-french-police-prepare-itself-for-the-new-year-s-eve-festivities",
      "published": "Wed, 31 Dec 2025 14:27:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Bulgarians worry over rising prices as country adopts euro",
      "description": "Bulgaria is saying goodbye to the lev and officially adopting the euro, but some citizens worry about higher prices.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/31/bulgarians-worry-over-rising-prices-as-country-adopts-euro?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 18:37:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US jobless claims slow in last full week of 2025 amid weak labour market",
      "description": "November saw highest unemployment since 2021, largely attributed to federal worker reductions under Trump.",
      "url": "https://www.aljazeera.com/economy/2025/12/31/us-jobless-claims-slow-in-last-full-week-of-2025-amid-weak-labour-market?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 16:12:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea’s junta chief elected president after opposition boycott",
      "description": "Mamady Doumbouya reneged on promise not to stand and hand west African country back to civilian rule The head of Guinea’s junta, Mamady Doumbouya, who had pledged not to run for office after seizing power four years ago, has been elected president after the country’s electoral commission said he had secured a sweeping majority of the vote. Doumbouya, 41, faced eight rivals for the presidency but the main opposition leaders were barred from running and had urged a boycott of the vote held over the weekend. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/guinea-junta-chief-mamady-doumbouya-elected-president-after-opposition-boycott",
      "published": "Wed, 31 Dec 2025 07:54:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "What's inside Mexico's Popocatépetl volcano? Scientists obtain first 3D images",
      "description": "Scientists from Mexico’s National Autonomous University have created the first three-dimensional image of the Popocatépetl volcano's interior",
      "url": "https://abcnews.go.com/International/wireStory/inside-mexicos-popocatpetl-volcano-scientists-obtain-3d-images-128772717",
      "published": "Tue, 30 Dec 2025 00:26:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mali and Burkina Faso impose retaliatory travel ban on US nationals",
      "description": "Mali and Burkina Faso have banned U.S. citizens from entering their countries",
      "url": "https://abcnews.go.com/International/wireStory/mali-burkina-faso-impose-retaliatory-travel-ban-us-128795911",
      "published": "Tue, 30 Dec 2025 22:15:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Authorities investigating damage to undersea telecom cable in Gulf of Finland",
      "description": "Authorities are investigating damage to an undersea telecommunications cable in the Gulf of Finland that occurred between the capitals of Finland and Estonia",
      "url": "https://abcnews.go.com/International/wireStory/authorities-investigating-damage-undersea-telecom-cable-gulf-finland-128801568",
      "published": "Wed, 31 Dec 2025 07:43:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "George Clooney ditches Hollywood culture for France, gains citizenship with wife and twins",
      "description": "George Clooney and wife Amal become French citizens with their twins, trading Hollywood glamor for peaceful farm life in the French countryside together.",
      "url": "https://www.foxnews.com/world/george-clooney-ditches-hollywood-culture-france-gains-citizenship-wife-twins",
      "published": "Mon, 29 Dec 2025 16:37:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Thailand releases 18 Cambodian soldiers held since July",
      "description": "The release is part of a new ceasefire deal after weeks of deadly clashes along the Thai-Cambodia border.",
      "url": "https://www.bbc.com/news/articles/c74wjqvpkj0o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 05:33:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Hezbollah weapons deadline: What’s next for Lebanon amid Israeli strikes?",
      "description": "End of 2025 marks deadline for first phase of disarming Hezbollah, but group says it will not give up its weapons.",
      "url": "https://www.aljazeera.com/news/2025/12/31/hezbollah-weapons-deadline-whats-next-for-lebanon-amid-israeli-strikes?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 19:40:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Four reasons why Benjamin Netanyahu may not want a Gaza ceasefire to hold",
      "description": "After his trip to the US, Israel's prime minister returns home in an apparently strong position.",
      "url": "https://www.aljazeera.com/news/2025/12/31/four-reasons-why-benjamin-netanyahu-may-not-want-a-gaza-ceasefire-to-hold?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 16:40:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Saudi-UAE fallout and its impact on Yemen’s recognised government",
      "description": "Saudi Arabia's strike on Yemeni port has triggered tensions with the UAE, and it will have an impact on Yemen's future.",
      "url": "https://www.aljazeera.com/opinions/2025/12/31/saudi-uae-fallout-and-its-impact-on-yemens-recognised-government?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 14:46:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US struck ‘big facility’ in Venezuela, Trump claimed without offering details",
      "description": "Trump alleged that US forces hit ‘very hard’ in what would mark his team’s first land strike on Venezuela if confirmed Donald Trump has claimed that US forces struck a “big facility” in Venezuela last week – but the president did not specify what it was, or where, and the White House has not commented further. “We just knocked out – I don’t know if you read or you saw – they have a big plant, or a big facility, where the ships come from. Two nights ago, we knocked that out. So we hit them very hard,” Trump told Republican donor and New York supermarket owner John Catsimatidis on Friday. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/29/trump-venezuela-facility-strike",
      "published": "Mon, 29 Dec 2025 17:30:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian-American journalist offers an inside look at the protests sweeping Iran",
      "description": "NPR's A Martinez speaks with Iranian-American author and journalist Hooman Majd about the current wave of protests facing Iran and what they mean for its future.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5661547/iranian-american-journalist-offers-an-inside-look-at-the-protests-sweeping-iran",
      "published": "Wed, 31 Dec 2025 04:45:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What we know about the Saudi-led air strikes on ships in Yemen",
      "description": "Open-source imagery and data confirm that the vessels targeted by the Saudi-led coalition air strike on Mukalla, Yemen, on December 30, originated from the United Arab Emirates. The ships were carrying Emirati military vehicles used by a separatist group.",
      "url": "https://www.france24.com/en/middle-east/20251231-strike-ships-yemen-saudi-arabia-uae",
      "published": "Wed, 31 Dec 2025 16:54:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anthony Joshua was 'shocked' and 'couldn't talk' after crash, eyewitness says",
      "description": "Boxer Anthony Joshua was \"shocked\" and \"couldn't talk\" after a car crash in Nigeria, according to an eyewitness.",
      "url": "https://news.sky.com/story/anthony-joshua-stable-after-nigeria-car-crash-as-tributes-paid-to-inspirational-friend-13488669",
      "published": "Mon, 29 Dec 2025 20:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Dead birds on Florida beaches have experts worried about avian flu",
      "description": "Dead birds along Florida's Space Coast spark fears of a possible avian flu outbreak. Samples were sent for testing as wildlife officials monitor the situation.",
      "url": "https://www.foxnews.com/us/dead-birds-florida-beaches-have-experts-worried-about-avian-flu",
      "published": "Wed, 31 Dec 2025 14:20:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Florida firefighters allegedly waterboarded, whipped rookie over TikTok video as 4 face criminal charges",
      "description": "Four Florida firefighters face criminal charges after allegedly waterboarding and whipping a 19-year-old rookie firefighter. Nearly a dozen employees fired.",
      "url": "https://www.foxnews.com/us/florida-firefighters-allegedly-waterboarded-whipped-rookie-tiktok-video-4-face-criminal-charges",
      "published": "Tue, 30 Dec 2025 21:16:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Bear remains under California home after weeks of failed removal attempts",
      "description": "Bear trap in Altadena accidentally catches wrong animal as 550-pound black bear continues living under California home despite month-long removal efforts.",
      "url": "https://www.foxnews.com/us/bear-remains-under-california-home-after-weeks-failed-removal-attempts",
      "published": "Tue, 30 Dec 2025 21:15:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Wild video shows speeding car going airborne, ejects driver into backyard pool",
      "description": "Surveillance footage captures car crashing through Nevada home's backyard, ejecting female driver into pool.",
      "url": "https://www.foxnews.com/us/wild-video-shows-speeding-car-going-airborne-ejects-driver-backyard-pool",
      "published": "Tue, 30 Dec 2025 20:27:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Huge crowds mourn Bangladesh's first female PM at state funeral",
      "description": "A sea of mourners have gathered in Dhaka to pay final respects to Khaleda Zia, who died on Tuesday aged 80.",
      "url": "https://www.bbc.com/news/articles/c5yvdjxeqv6o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 10:17:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Mali and Burkina Faso impose travel ban on US citizens in tit-for-tat move",
      "description": "The two states say they are taking reciprocal measures after the US announced full-entry restrictions on their citizens.",
      "url": "https://www.bbc.com/news/articles/cgrdjx1d1vjo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 09:45:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Will Mali, Niger, Burkina Faso bloc reshape the Sahel?",
      "description": "A recent summit of The Alliance of Sahel States has raised security and economic hopes for Mali, Burkina Faso and Niger.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/31/will-mali-niger-burkina-faso-bloc-reshape-the-sahel?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 17:43:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Turkish police detain 357 suspects in raids against the Islamic State group",
      "description": "Turkish police have conducted large-scale operations against the Islamic State group across Turkey, detaining 357 suspects",
      "url": "https://abcnews.go.com/International/wireStory/turkish-police-detain-357-suspects-raids-islamic-state-128773939",
      "published": "Tue, 30 Dec 2025 04:09:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Development cooperation agreement marks new phase in UN-Iraq partnership",
      "description": "Better access to education, the protection of the environment and good governance are some of the areas in which the United Nations helps countries improve.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166670",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2025-12-31T20:24:33.904104Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "French lawmakers to debate social media ban for children under 15",
      "description": "French lawmakers are set to debate a ban on social media for children under the age of 15 – as well as a prohibition on the use of mobile phones in high schools – that could begin with the next school year in September 2026.",
      "url": "https://www.france24.com/en/france/20251231-france-to-debate-social-media-ban-for-children-under-15",
      "published": "Wed, 31 Dec 2025 16:09:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Two African nations ban American citizens in diplomatic tit-for-tat following Trump admin move",
      "description": "Two West African nations issue travel bans on American citizens in retaliatory diplomatic move, following expansion of Trump administration travel restrictions list.",
      "url": "https://www.foxnews.com/world/two-african-nations-ban-american-citizens-diplomatic-tit-for-tat-following-trump-admin-move",
      "published": "Wed, 31 Dec 2025 05:18:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar to resume services to and from London after 'major disruption' in Channel Tunnel forced cancellations",
      "description": "Eurostar suspends all London services due to major power supply issues in Channel Tunnel and failed LeShuttle train, forcing passengers to rebook journeys.",
      "url": "https://www.foxnews.com/world/eurostar-forced-cancel-all-services-from-london-after-major-disruption-channel-tunnel",
      "published": "Tue, 30 Dec 2025 10:25:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "From Gaza to Iran: What’s at stake in Trump-Netanyahu Mar-a-Lago talks?",
      "description": "Gaza peace plan and Iran both reportedly on agenda as President Donald Trump is set to meet Israeli Prime Minister Benjamin Netanyahu at Mar-a-Lago on Monday.",
      "url": "https://www.foxnews.com/world/from-gaza-iran-whats-stake-trump-netanyahu-mar-a-lago-talks",
      "published": "Mon, 29 Dec 2025 06:00:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Heated Rivalry author says TV success led to help with her Parkinson's",
      "description": "Rachel Reid says the publicity from the hit TV adaptation led a Parkinson's specialist to get in touch.",
      "url": "https://www.bbc.com/news/articles/ce8gd0qvyrpo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 09:45:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Thai forces blockade Cambodian village with shipping containers",
      "description": "Cambodian villagers have told Al Jazeera they’re being prevented from returning to their homes by Thai forces.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/31/thai-forces-blockade-cambodian-village-with-shipping-containers?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 12:20:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "How do Parisian chefs decide on their New Year's Eve menu?",
      "description": "What better way to round out the year than with some good food? Cooking at home may be your thing, but in a city like Paris, diners are spoilt for choice for amazing restaurants. Often, they feature special festive menus designed to awaken the senses ahead of the traditional countdown to midnight. Details by Jason Gouzy, chef at the Michelin-starred Pantagruel restaurant in Paris.",
      "url": "https://www.france24.com/en/video/20251231-how-do-parisian-chefs-decide-on-their-new-year-s-eve-menu",
      "published": "Wed, 31 Dec 2025 14:25:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Saudi Arabia bombs Yemen over shipment of weapons that arrived from UAE",
      "description": "Saudi Arabia says it bombed Yemen’s port city of Mukalla over a shipment of weapons for a separatist force that arrived from the United Arab Emirates",
      "url": "https://abcnews.go.com/International/wireStory/saudi-arabia-bombs-yemen-shipment-weapons-separatists-arrived-128769161",
      "published": "Tue, 30 Dec 2025 21:05:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Pope asks that Rome welcome foreigners as he closes out 2025",
      "description": "Pope Leo XIV has closed out 2025 with a prayer that the city of Rome might be a welcoming place for foreigners and fragile people young and old",
      "url": "https://abcnews.go.com/International/wireStory/pope-asks-rome-foreigners-closes-2025-128810683",
      "published": "Wed, 31 Dec 2025 12:26:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Finnish police seize ship suspected of sabotaging undersea cable",
      "description": "Police arrested 14 crew members on the ship sailing from the St Petersburg to the Israeli port of Haifa.",
      "url": "https://www.bbc.com/news/articles/c62040np372o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 16:48:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jailed HK tycoon's 'teeth rotting and fingernails falling off', daughter tells BBC",
      "description": "The daughter of Jimmy Lai tells the BBC that her father's health is deteriorating in prison.",
      "url": "https://www.bbc.com/news/articles/cr57nvrjrlno?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 08:12:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar services return to normal after major Channel Tunnel disruption",
      "description": "The high-speed rail firm urged passengers to check before they travel as last-minute delays and cancellations are still possible.",
      "url": "https://www.bbc.com/news/articles/c0q4eg03eyzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 09:55:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tatiana Schlossberg, granddaughter of John F Kennedy, dies aged 35",
      "description": "She shared her cancer diagnosis in an essay last month, writing that she had less than a year to live.",
      "url": "https://www.bbc.com/news/articles/c338ne3relzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 08:55:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea junta chief wins presidential election by landslide",
      "description": "The victory, which gives the junta leader a seven-year mandate, was widely expected.",
      "url": "https://www.bbc.com/news/articles/cx2520nyp8yo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 10:47:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's Bolsonaro undergoes third medical procedure for hiccups",
      "description": "The former far-right leader's wife said he had more treatment because the hiccups \"had not stopped' since the weekend.",
      "url": "https://www.bbc.com/news/articles/c4g4g0y4m1do?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 00:25:11 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-Australia batter Martyn in coma with meningitis",
      "description": "Former Australia batter Damien Martyn, 54, who played 67 Test matches, is in an induced coma in a Queensland hospital after being diagnosed with meningitis..",
      "url": "https://www.bbc.com/sport/cricket/articles/c3013de0g88o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 03:53:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finland seizes ship sailing from Russia after suspected cable sabotage",
      "description": "New telecommunications cable damage discovered in Finland's exclusive economic zone.",
      "url": "https://www.aljazeera.com/news/2025/12/31/police-investigating-damage-to-undersea-telecom-cable-in-gulf-of-finland?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 19:41:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Oxfam, Doctors Without Borders slam Israel’s Gaza ban",
      "description": "Humanitarian organisations Oxfam and Doctors Without Borders are slamming Israel’s decision to ban them from Gaza.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/31/oxfam-doctors-without-borders-slam-israels-gaza-ban?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 19:10:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sudan lose to Burkina Faso as Algeria win again at AFCON 2025",
      "description": "Burkina Faso ‌book second place in Group E at ‍the Africa ‍Cup of Nations with a 2-0 win over Sudan.",
      "url": "https://www.aljazeera.com/sports/2025/12/31/sudan-lose-to-burkina-faso-as-algeria-win-again-at-afcon-2025?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 18:26:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A marriage of three: Will Mali, Niger, Burkina Faso bloc reshape the Sahel?",
      "description": "Since withdrawing from ECOWAS, the post-coup countries have inaugurated a new bank, TV station and joint military force.",
      "url": "https://www.aljazeera.com/features/2025/12/31/a-marriage-of-three-will-mali-niger-burkina-faso-bloc-reshape-the-sahel?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 16:41:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How is Trump’s Big Beautiful Bill changing US taxes and healthcare in 2026?",
      "description": "Big changes are coming in the new year as healthcare subsidies expire and requirements for food assistance take effect.",
      "url": "https://www.aljazeera.com/economy/2025/12/31/how-is-trumps-big-beautiful-bill-changing-us-taxes-and-healthcare-in-2026?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 16:19:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Putin says Russia believes it will win in Ukraine in New Year’s Eve address",
      "description": "'We believe in you and our victory,' Putin says in his address, calling on Russians to support the troops.",
      "url": "https://www.aljazeera.com/news/2025/12/31/putin-says-russia-believes-it-will-win-in-ukraine-in-new-years-eve-address?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 14:15:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How Donald Trump launched a new push to amass US government data in 2025",
      "description": "Proponents say compiling personal information in a single database is more efficient. But critics fear risks to privacy.",
      "url": "https://www.aljazeera.com/news/longform/2025/12/31/how-donald-trump-launched-a-new-push-to-amass-us-government-data-in-2025?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 13:48:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German thieves steal up to $105m in ‘Ocean’s Eleven’ heist: What we know",
      "description": "While the robbers remain at large, customers are furious about the Christmas break robbery.",
      "url": "https://www.aljazeera.com/news/2025/12/31/german-thieves-steal-up-to-105m-in-oceans-eleven-heist-what-we-know?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 12:24:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "More than 3,000 migrants died trying to reach Spain in 2025",
      "description": "Tighter border controls caused arrivals to decline sharply but forced people on to more dangerous routes, activists say More than 3,000 people died trying to reach Spain by sea over the past year, a sharp fall from the previous 12 months. However, activists cautioned that the drop reflected tighter border controls that have forced migrants to take increasingly dangerous routes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/more-than-3000-migrants-died-spain-figure-down",
      "published": "Mon, 29 Dec 2025 17:31:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jair Bolsonaro undergoes second procedure to treat persistent hiccups",
      "description": "Former Brazilian president underwent a phrenic nerve block while temporarily released from prison for surgery Jair Bolsonaro underwent a second “phrenic nerve block procedure” on Monday to treat persistent hiccups. The treatment went well and the former Brazilian president’s condition is stable, according to his medical team. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/brazil-ex-president-jair-bolsonaro-hiccups-treatment",
      "published": "Mon, 29 Dec 2025 22:07:50 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Xi Jinping vows to reunify China and Taiwan in New Year’s Eve speech",
      "description": "Reunification ‘is unstoppable’, says Chinese president, a day after the conclusion of intense military drills China’s president, Xi Jinping, has vowed to reunify China and Taiwan in his annual New Year’s Eve speech in Beijing. Speaking the day after the conclusion of intense Chinese military drills around Taiwan, Xi said: “The reunification of our motherland, a trend of the times, is unstoppable.” Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/xi-jinping-vows-reunification-china-taiwan-new-years-eve-speech",
      "published": "Wed, 31 Dec 2025 13:47:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China forecast to have sold one in every 10 new cars in UK in 2025",
      "description": "Carmakers such as MG, BYD and Chery are set to pass 200,000 mark in sales, analysis suggests, double 2024’s total Chinese brands are on course to account for one in every 10 new cars sold in Britain during 2025, a marked increase on last year as sales increase across Europe. Manufacturers led by MG, BYD, and Chery are on track to break the 200,000 mark in UK new car sales in 2025, meaning they are very likely to account for 10% of the market, according to Matthias Schmidt, an analyst tracking electric cars across Europe. Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/31/china-forecast-to-have-sold-one-in-every-10-new-cars-in-uk-in-2025",
      "published": "Wed, 31 Dec 2025 09:42:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "​Two cubicles, 73 women, one long queue: Japan’s female MPs fight for more loos",
      "description": "PM Sanae Takaichi joins petition asking for better facilities for women to match improved representation Nearly 60 female lawmakers in Japan, including the prime minister, Sanae Takaichi, have submitted a petition calling for more toilets in the parliament building for women to match their improved representation. Japanese politics remains hugely male-dominated, although the number of women in the parliament rose at the last election – and Takaichi became the first female prime minister in October. This is reflected by there being only one lavatory containing two cubicles for the lower house’s 73 women to use near the Diet’s main plenary session hall in central Tokyo. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/female-lawmakers-in-japan-lobby-for-more-toilets-in-parliament",
      "published": "Wed, 31 Dec 2025 08:29:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian beef industry ‘extremely disappointed’ after China hits imports with 55% tariff",
      "description": "Levy on beef exceeding quotas to begin immediately as Beijing seeks to protect domestic industry Australian beef producers said they were “extremely disappointed” after China announced a 55% tariff on imports that exceed quota levels in a move to protect a domestic cattle industry slowly emerging from oversupply. China’s commerce ministry said on Wednesday the total import quota for 2026 for Australia and other countries such as Brazil and the US covered under its new “safeguard measures” is 2.7m metric tons, roughly in line with the record 2.87m tons it imported overall in 2024. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/australian-beef-industry-extremely-disappointed-after-china-hits-imports-with-55-tariff",
      "published": "Wed, 31 Dec 2025 18:49:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Damien Martyn, former Australian Test cricketer, in induced coma with meningitis",
      "description": "The 54-year-old was admitted to hospital on Boxing Day Martyn played total of 67 Tests between 1992 and 2006 The former Australian Test cricketer Damien Martyn has been admitted to hospital and placed in an induced coma after being diagnosed with meningitis. The sporting community is rallying around the 54-year-old, who “is in for the fight of his life”, according to the former AFL player Brad Hardie, who revealed Martyn’s condition on 6PR on Tuesday. Continue reading...",
      "url": "https://www.theguardian.com/sport/2025/dec/31/former-australian-test-cricketer-damien-martyn-in-induced-coma",
      "published": "Wed, 31 Dec 2025 14:31:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From inflation to infighting, the six factors that will shape Australian politics in 2026",
      "description": "Albanese will face a crucial test on the economy while the Coalition deals with existential questions after an election drubbing Get our breaking news email , free app or daily news podcast Before 14 December, Anthony Albanese was enjoying the most successful year of his long parliamentary career. A landslide election win delivered Labor 94 lower house seats and crushed its political opponents. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/01/events-trends-shaping-australian-politics-2026",
      "published": "Wed, 31 Dec 2025 14:00:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 15 km NNW of Susanville, CA",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VII Time 2025-12-31 05:49:32 UTC 2025-12-31 05:49:32 UTC at epicenter Location 40.544°N 120.692°W Depth 5.32 km (3.31 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75288851",
      "published": "2025-12-31T20:22:50.774Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.2 - 36 km W of Puerto Santa, Peru",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-28 02:51:50 UTC 2025-12-28 02:51:50 UTC at epicenter Location 8.960°S 78.974°W Depth 66.41 km (41.27 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl57",
      "published": "2025-12-31T01:12:43.205Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.6 - 31 km ESE of Yilan, Taiwan",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-27 15:05:56 UTC 2025-12-27 15:05:56 UTC at epicenter Location 24.657°N 122.041°E Depth 67.53 km (41.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl2n",
      "published": "2025-12-30T03:24:14.885Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Out with the mayo: How Ukrainians reclaim holiday food",
      "description": "For many people from former Soviet countries, New Year's is a big holiday feast time. A Ukrainian restaurant in Washington gives NPR a taste of what's on the menu.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5660765/ukrainian-food-holidays",
      "published": "Wed, 31 Dec 2025 07:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel says it will bar aid groups, including Doctors Without Borders, from Gaza",
      "description": "Israel accused Doctors Without Borders, one of the largest health organizations operating in Gaza, of failing to clarify the roles of some staff that Israel accused of cooperation with militants.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103986/israel-gaza-aid-ngos",
      "published": "Tue, 30 Dec 2025 11:04:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine updates: Kyiv says it struck Russia's oil facilities",
      "description": "According to officials in Kyiv, Ukrainian long-range drones struck an oil depot north of Moscow, as well as an oil refinery and an oil terminal in Russia's southern Krasnodar region. Follow DW for more.",
      "url": "https://www.dw.com/en/ukraine-updates-kyiv-says-it-struck-russia-s-oil-facilities/live-75346952?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 17:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A German tip for your New Year's resolutions",
      "description": "Starting off the year with ambitious plans to become a better person is a widespread Western tradition. What are the most popular resolutions in Germany? And here's how the German language can help you deal with yours.",
      "url": "https://www.dw.com/en/a-german-tip-for-your-new-year-s-resolutions/a-46737262?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 16:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From education to marriage, major human rights gains of 2025",
      "description": "Though 2025 saw flagrant human rights abuses across the globe, the year also brought many positive developments.",
      "url": "https://www.dw.com/en/from-education-to-marriage-major-human-rights-gains-of-2025/a-75317439?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 09:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fact check: Content farm videos on Merz, Starmer and Trump",
      "description": "Fake videos of political leaders often go viral online. DW's Fact check department analyzes how content farms use algorithm-driven formats, and what narratives they reinforce.",
      "url": "https://www.dw.com/en/fact-check-content-farm-videos-on-merz-starmer-and-trump/a-75262035?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 09:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea's junta leader declared winner of presidential election",
      "description": "Mamadi Doumbouya secured almost 87% of the vote, while several opposition figures were either barred from contesting or were in exile. Doumbouya seized power after staging a coup in 2021.",
      "url": "https://www.dw.com/en/guinea-s-junta-leader-declared-winner-of-presidential-election/a-75346950?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 03:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tatiana Schlossberg, granddaughter of JFK, dies aged 35",
      "description": "Tatiana Schlossberg revealed she had been diagnosed with a rare type of leukemia in an essay in The New Yorker last month. She was highly critical of her relative Robert F. Kennedy Jr., the US health secretary.",
      "url": "https://www.dw.com/en/tatiana-schlossberg-granddaughter-of-jfk-dies-aged-35/a-75346596?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 23:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Minister criticises Clooney's fast-tracked French passport as 'double standard'",
      "description": "A junior minister on Wednesday said the French citizenship granted to Hollywood star George Clooney despite his poor level of French suggested a \"double standard\". The Clooney family became citizens just days before language requirements were toughened under new rules from January 1.",
      "url": "https://www.france24.com/en/live-news/20251231-french-minister-criticises-clooney-s-double-standard-passport",
      "published": "Wed, 31 Dec 2025 17:45:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Unity, strength, hope’: Macron calls for a fruitful 2026 in New Year’s address",
      "description": "French President Emmanuel Macron said in his New Year's address that 2026 \"can be and must be a fruitful year\" as he attempts to regain some momentum and launch the final projects of his second five-year term.",
      "url": "https://www.france24.com/en/france/20251231-macron-delivers-annual-new-years-address-2025-from-elysee",
      "published": "Wed, 31 Dec 2025 17:37:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finland seizes ship sailing from Russia after suspected undersea cable sabotage",
      "description": "Finnish authorities seized a vessel on Wednesday, suspected of sabotaging an undersea telecommunications cable in the Baltic Sea.",
      "url": "https://www.france24.com/en/europe/20251231-finland-seizes-ship-sailing-from-russia-after-suspected-undersea-cable-sabotage",
      "published": "Wed, 31 Dec 2025 16:25:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What is at stake in AFCON's Ivory Coast - Gabon game?",
      "description": "The last games of the AFCON group stage will take place tomorrow night in Morocco. Among them, the defending champion, Ivory Coast, which has already qualified for the final stage, will play against Gabon, already eliminated from the competition. What’s left at stake? Answers with our correspondent Harold Girard in Marrakech.",
      "url": "https://www.france24.com/en/video/20251231-what-is-at-stake-in-afcon-s-ivory-coast-gabon-game",
      "published": "Wed, 31 Dec 2025 13:51:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar to return to normal after massive power supply leaves travellers stranded",
      "description": "A power failure in the Channel Tunnel suspended holiday plans for thousands of Eurostar passengers on Tuesday, after services between London and the continent were suspended for hours. Although train services were slowly returning to normal by Tuesday evening, many passengers had already postponed the plans at a peak time for travel. Details by Andrew Hilliar and Ludovic de Foucaud.",
      "url": "https://www.france24.com/en/video/20251231-eurostar-to-return-to-normal-after-massive-power-supply-leaves-travellers-stranded",
      "published": "Wed, 31 Dec 2025 13:39:32 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finland police seize vessel suspected of damaging Baltic Sea cable",
      "description": "Finnish police have seized a cargo vessel suspected of damaging an undersea cable.",
      "url": "https://news.sky.com/story/finland-police-seize-vessel-suspected-of-damaging-baltic-sea-cable-13489056",
      "published": "Wed, 31 Dec 2025 14:13:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Passenger describes being stranded on Eurostar train overnight - as disruption continues",
      "description": "Passengers have been stuck on a Eurostar train for hours overnight, after the train network was forced to cancel large parts of its London-Europe service on Tuesday.",
      "url": "https://news.sky.com/story/eurostar-passengers-brace-for-further-disruption-after-day-of-cancellations-13488920",
      "published": "Tue, 30 Dec 2025 22:39:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "$40m worth of motorcycles seized in hunt for ex-Olympic snowboarder turned 'drug kingpin'",
      "description": "Mexican officials have seized dozens of motorcycles worth around $40m in the hunt for a former Olympic snowboarder who is on the FBI's Ten Most Wanted list.",
      "url": "https://news.sky.com/story/motorcycles-worth-40m-seized-in-hunt-for-ex-olympic-snowboarder-on-fbis-ten-most-wanted-list-13488972",
      "published": "Wed, 31 Dec 2025 07:57:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-Australia batter in induced coma after contracting meningitis",
      "description": "Ex-Australia batter Damien Martyn has been placed in an induced coma after contracting meningitis.",
      "url": "https://news.sky.com/story/ex-australia-batter-damien-martyn-in-induced-coma-after-contracting-meningitis-13488986",
      "published": "Wed, 31 Dec 2025 08:39:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel suspends 37 aid organisations from operating in Gaza",
      "description": "Israel says it is suspending more than 30 humanitarian organisations, including Doctors Without Borders, from operating in Gaza for failing to comply with new registration rules.",
      "url": "https://news.sky.com/story/israel-suspends-37-aid-organisations-from-operating-in-gaza-13488815",
      "published": "Tue, 30 Dec 2025 20:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Khaleda Zia, former Bangladeshi prime minister and archrival of a previous premier, dies at 80",
      "description": "Former Bangladeshi Prime Minister Khaleda Zia has died at 80, her political party has announced Tuesday",
      "url": "https://abcnews.go.com/International/wireStory/khaleda-zia-former-bangladeshi-prime-minister-archrival-hasina-128768275",
      "published": "Tue, 30 Dec 2025 04:09:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China announces it 'successfully completed' Taiwan military maneuvers",
      "description": "China’s People’s Liberation Army says it has “successfully completed” two days of military exercises in the waters off Taiwan",
      "url": "https://abcnews.go.com/International/wireStory/china-announces-successfully-completed-taiwan-military-maneuvers-128801777",
      "published": "Wed, 31 Dec 2025 08:17:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China flexes blockade capabilities near Taiwan on second day of military drills",
      "description": "China's People's Liberation Army is conducting large-scale military drills around Taiwan as part of \"Justice Mission 2025.\"",
      "url": "https://abcnews.go.com/International/wireStory/china-flexes-blockade-capabilities-taiwan-day-military-drills-128773369",
      "published": "Tue, 30 Dec 2025 21:05:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Italy's Parliament approves 2026 budget with deficit-cutting measures",
      "description": "Italy’s Parliament has approved the government’s 2026 budget, which includes deficit-cutting measures",
      "url": "https://abcnews.go.com/International/wireStory/italys-parliament-approves-2026-budget-deficit-cutting-measures-128782467",
      "published": "Tue, 30 Dec 2025 11:02:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "General Assembly approves $3.45 billion UN regular budget for 2026",
      "description": "The General Assembly has approved a $3.45 billion regular budget for the United Nations for 2026, following weeks of intensive negotiations and one of the Organization’s most important reform initiatives, UN80.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166685",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: General Assembly decides on 2026 UN budget",
      "description": "Follow our live coverage as the General Assembly and its Fifth Committee meet today to finalize negotiations and vote on the United Nations’ regular budget for 2026. The Fifth Committee is responsible for administrative and budgetary matters, including the Organization’s finances and staffing. UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166681",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Texas woman tries to flee to Mexico across Rio Grande with infant after human smuggling bust, authorities say",
      "description": "A Texas woman accused of human smuggling allegedly tried to flee across Rio Grande with infant after high-speed chase near the Mexico border.",
      "url": "https://www.foxnews.com/us/texas-woman-tries-flee-mexico-across-rio-grande-infant-after-human-smuggling-bust-authorities-say",
      "published": "Wed, 31 Dec 2025 13:49:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "40-year Harvard professor pens scathing piece on school's 'exclusion of white males,' anti-Western trends",
      "description": "Harvard professor leaves after 40 years, alleges woke policies destroyed academic standards and excellence in scathing \"Why I'm Leaving Harvard\" critique.",
      "url": "https://www.foxnews.com/us/40-year-harvard-professor-pens-scathing-piece-schools-exclusion-white-males-anti-western-trends",
      "published": "Wed, 31 Dec 2025 07:00:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Minnesota's new Medicaid fraud prevention fix won't make 'any difference,' former FBI agent says",
      "description": "Minnesota adds new Medicaid fraud verification after alleged $9B+ taxpayer losses since 2018, but former FBI agent says one layer won't stop fraud.",
      "url": "https://www.foxnews.com/us/minnesota-new-medicaid-fraud-prevention-fix-wont-make-any-difference-former-fbi-agent-says",
      "published": "Wed, 31 Dec 2025 06:00:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Priest catches suspect breaking into church ‘poor box’ days before Christmas, police say",
      "description": "A priest caught a suspect breaking into a church \"poor box\" days before Christmas in Philadelphia. Police shared surveillance video of the incident.",
      "url": "https://www.foxnews.com/us/priest-catches-suspect-breaking-church-poor-box-days-before-christmas-police-say",
      "published": "Tue, 30 Dec 2025 19:08:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy claims Trump said US will consider giving Ukraine decades of security guarantees",
      "description": "Ukrainian President Volodymyr Zelenskyy indicated that American President Donald Trump said the U.S. will entertain the prospect of providing Ukraine with decades of security guarantees.",
      "url": "https://www.foxnews.com/world/zelenskyy-claims-trump-said-us-consider-giving-ukraine-decades-security-guarantees",
      "published": "Mon, 29 Dec 2025 10:58:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK prime minister slammed for welcoming home freed Egyptian prisoner after social media posts resurface",
      "description": "U.K. Prime Minister Keir Starmer is facing criticism after welcoming human rights activist Alaa Abd el-Fattah home, as the man's past posts sparked political backlash.",
      "url": "https://www.foxnews.com/world/uk-prime-minister-slammed-welcoming-home-freed-egyptian-prisoner-after-social-media-posts-resurface",
      "published": "Mon, 29 Dec 2025 03:42:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}