{
  "last_updated": "2026-01-20T14:33:02.974304Z",
  "event_count": 223,
  "events": [
    {
      "title": "Security Council LIVE: UN raises alarm over deadly Iran protests and ‘possible military strikes’",
      "description": "The UN Security Council is meeting in New York in emergency session on Iran, amid escalating concern over reports that hundreds have been killed during weeks of nationwide anti-government protests. The meeting was requested by the United States. Demonstrations that began in late December, fuelled by soaring inflation, rising food prices and the collapse of the national currency, triggered a deadly and widespread crackdown with thousands injured and detained, according to numerous firsthand accounts. The UN has called for independent investigations into all killings and warned against the possible use of the death penalty against protesters. Follow live coverage below, and UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "Chilean president declares state of catastrophe as wildfires kill at least 18",
      "description": "Fires blaze through 8,500 hectares, forcing 50,000 people to evacuate as firefighters struggle to extinguish flames Wildfires raging across central and southern Chile have killed at least 18 people, scorched thousands of hectares of forest and destroyed scores of homes, authorities said, as the South American country swelters under a heatwave. Chile’s president, Gabriel Boric, declared a state of catastrophe in the country’s central Biobío region and the neighbouring Ñuble region, about 500km (300 miles) south of Santiago, the capital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chile-president-declares-state-of-catastrophe-as-wildfires-kill",
      "published": "Sun, 18 Jan 2026 20:16:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of emergency after eight police officers killed in prison gang violence",
      "description": "President announces 30-day order after inmates also took 46 people hostage at three prisons Guatemala’s president has declared a 30-day nationwide state of emergency to combat criminal gangs after authorities accused them of killing eight police officers and holding hostages at three prisons. The killings occurred in the capital, Guatemal City, and surrounding areas a day after gang-affiliated inmates took 46 people hostage in the three prisons across the country to demand incarcerated gang leaders be moved to lower-security facilities. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/guatemala-state-of-emergency-police-officers-killed-prison-gang-violence",
      "published": "Mon, 19 Jan 2026 12:53:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s first year back in office: Mass layoffs, deportations and global moves",
      "description": "FRANCE 24 Washington Correspondent Fraser Jackson reviews US President Donald Trump’s first year back in the White House. The year began with the creation of DOGE, the Department of Government Efficiency, which oversaw mass layoffs across federal agencies. Trump also expanded ICE and ordered large-scale deportations. On the international front, he helped achieve a ceasefire in Gaza and continued to push for an end to the war in Ukraine. Meanwhile, Trump launched an audacious military raid on Venezuela aimed at capturing President Nicolás Maduro and, weeks later, threatened to seize Greenland.",
      "url": "https://www.france24.com/en/trump-s-first-year-back-in-office-mass-layoffs-deportations-and-global-moves",
      "published": "Tue, 20 Jan 2026 13:20:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 42,
      "severity_level": "Critical"
    },
    {
      "title": "Labor’s hate speech laws pass Senate in late-night vote as Nationals split from Liberals to oppose bill",
      "description": "Coalition divided over reforms in response to Bondi beach terror attack, with Bridget McKenzie accusing government of ‘trashing normal process of parliamentary scrutiny’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Laws to ban hate groups and establish a national gun buyback scheme have passed the Senate after the Albanese government struck separate deals with the Liberals and Greens to legislate its response to the Bondi beach massacre. The two bills were rushed through on Tuesday night at the end of a special two-day sitting to deal with the political fallout to the 14 December shooting. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/labor-albanese-hate-speech-laws-expected-pass-parliament",
      "published": "Tue, 20 Jan 2026 12:17:53 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Men charged with contract killing of Indigenous leader to go on trial in Peru",
      "description": "Prosecution over death of Quinto Inuma Alvarado seen as test of ability to curb attacks on environmental defenders Five men are due to go on trial on Tuesday over the killing of an Amazonian Indigenous leader, in a legal case that could test whether Peru can hold perpetrators accountable for violence linked to illegal logging and drug trafficking in one of the world’s most dangerous regions for environmental defenders. The Kichwa tribal leader Quinto Inuma Alvarado was killed on 29 November 2023, after repeatedly denouncing illegal activity within his community’s territory. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/trial-peru-amazon-quinto-inuma-alvarado-indigenous-leader",
      "published": "Tue, 20 Jan 2026 10:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns of a world in chaos as impunity and unpredictability spreads",
      "description": "In his final annual address outlining his priorities, UN Secretary-General António Guterres warned that the world is “brimming with conflict, impunity, inequality and unpredictability” – even as international cooperation is fraying at the moment it is most needed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166772",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Parents of police killed in Wieambilla urge gun buyback as Queensland set to reject federal scheme",
      "description": "Families call for end to political ‘bickering’ amid concerns the state LNP will not back proposed program Get our breaking news email , free app or daily news podcast The parents of police murdered in a 2022 ambush in western Queensland have thrown their support behind the federal government’s proposed gun buyback scheme in the wake of the Bondi beach terror attack. The Guardian understands that the state LNP government decided not to support the buyback program at a marathon cabinet meeting on Monday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/gun-buyback-bondi-queensland-lnp-labor-wieambilla-ntwnfb",
      "published": "Tue, 20 Jan 2026 07:30:52 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Rising hunger and displacement pose growing economic risk, UN tells Davos",
      "description": "As global leaders gather at the World Economic Forum in Davos this week, UN agencies are warning that rising hunger and displacement are not only humanitarian emergencies but growing threats to global economic stability.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166791",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Surfer injured in fourth shark attack in Australian state in 48 hours",
      "description": "Authorities are warning people to stay out of the Australian state's waterways after recent rainfall.",
      "url": "https://www.bbc.com/news/articles/cqxy3523nq2o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 07:05:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: Atrocities ‘repeated town by town’, ICC prosecutor tells UN Security Council",
      "description": "Atrocities in Sudan’s Darfur region are spreading from town to town in an organized campaign of violence that includes mass executions, rape and ethnic targeting, amounting to war crimes and crimes against humanity, the prosecutor of the International Criminal Court told the UN Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166790",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Viral protest video against Iran’s supreme leader sparks copycat demonstrations worldwide",
      "description": "Viral video shows Iranian refugee lighting cigarette with burning photo of supreme leader, sparking global defiance movement amid Iran protests.",
      "url": "https://www.foxnews.com/world/viral-protest-video-against-irans-supreme-leader-sparks-copycat-demonstrations-worldwide",
      "published": "Sun, 18 Jan 2026 21:52:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Video: Blast kills seven at hotel restaurant in Afghan capital Kabul",
      "description": "An explosion in at a Chinese-run restaurant in the Afghan capital Kabul has killed a Chinese national and six Afghans.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/video-blast-kills-seven-at-hotel-restaurant-in-afghan-capital-kabul?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 08:31:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Spain train crash: What we know about the fatal derailment so far",
      "description": "At least 40 people have been killed and 170 others injured after two high-speed trains derailed in southern Spain on Sunday.",
      "url": "https://news.sky.com/story/what-we-know-so-far-about-the-fatal-train-crash-in-spain-13496110",
      "published": "Mon, 19 Jan 2026 08:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russia plots major strike on Europe's largest nuclear plant power lines: source",
      "description": "Ukraine nuclear facilities face Russian attack threats as Moscow weighs strikes on power substations to force capitulation, officials say. Zaporizhzhia is a primary target.",
      "url": "https://www.foxnews.com/world/russia-threaten-ukraine-europe-nuclear-plant-winter-energy-war-escalates",
      "published": "Sun, 18 Jan 2026 19:21:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "World Economic Forum boots Iranian foreign minister from Davos summit amid deadly crackdown on protesters",
      "description": "World Economic Forum withdraws Iranian foreign minister's Davos invitation amid deadly nationwide protests that have killed thousands of civilians.",
      "url": "https://www.foxnews.com/world/world-economic-forum-boots-iranian-foreign-minister-from-davos-summit-amid-deadly-crackdown-protesters",
      "published": "Mon, 19 Jan 2026 09:49:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘Alarming’ increase in use of death penalty last year, despite global trend towards abolition",
      "description": "Despite a downward trend in the use of the death penalty globally, 2025 saw an ‘alarming’ increase in the number of executions in a small number of retentionist countries, the UN human rights office (OHCHR) warned on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166789",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Amid Sudan’s humanitarian crisis, Chad shows ‘act of solidarity’",
      "description": "In war-torn Sudan, local communities say they don’t have enough settlements for the internally displaced, few solutions for women who have suffered sexual violence – and there’s a lack of aid available for people with disabilities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166777",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Episcopal bishop warns clergy to prepare for 'new era of martyrdom' after ICE shooting",
      "description": "An Episcopal bishop warned New Hampshire clergy to prepare wills for \"new era of martyrdom\" after woman killed in ICE shooting, urging readiness.",
      "url": "https://www.foxnews.com/us/episcopal-bishop-warns-clergy-prepare-new-era-martyrdom-ice-shooting",
      "published": "Mon, 19 Jan 2026 17:43:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Rights groups warn on Israeli abuse of Palestinian prisoners",
      "description": "A new report has published harrowing testimonies by Palestinians who were released as part of the Israel-Hamas ceasefire deal. Meanwhile, rights activists are worried that Israel is now considering the death penalty.",
      "url": "https://www.dw.com/en/rights-groups-warn-on-israeli-abuse-of-palestinian-prisoners/a-75568097?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 11:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Why did the ceasefire fail in Syria and what about IS group detainees?",
      "description": "A day after a sweeping deal was announced between the Syrian government and the country's main Kurdish-led force, the agreement appeared to be falling apart Monday. After new outbreaks of clashes Monday, the Kurdish-led Syrian Democratic Forces issued a statement calling for “all of our youth” to “join the ranks of the resistance”. FRANCE 24's Wassim Nasr brings you this analysis.",
      "url": "https://www.france24.com/en/why-did-the-ceasefire-fail-in-syria-and-what-about-isis-detainees",
      "published": "Tue, 20 Jan 2026 11:14:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Game-changing international ocean treaty comes into force",
      "description": "Almost two decades in the making, an international agreement to protect and sustainably use marine life in international waters and the international seabed is due to come into force on Saturday, marking a major step forward in efforts to ensure the health of ocean ecosystems for decades to come.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166762",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN urges ‘maximum restraint’ to avert more death, wider escalation",
      "description": "As nationwide protests in Iran appear to ease after nearly three weeks of unrest and bloodshed, a senior UN official called on Thursday for action to prevent further escalation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166773",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "ISIL claims Kabul attack on Chinese restaurant that killed seven people",
      "description": "Group links attack to China’s 'crimes' against Uighurs. Beijing urges Taliban government to protect its nationals.",
      "url": "https://www.aljazeera.com/news/2026/1/20/isil-claims-kabul-attack-on-chinese-restaurant-that-killed-7-people?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 12:35:48 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "After four shark attacks in 48 hours, NSW authorities urge beachgoers ‘just go to a pool’",
      "description": "Surfer taken to hospital with minor injuries after latest shark attack at Point Plomer beach on mid-north coast Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A surfer has been taken to hospital after being bitten by a shark off the coast of New South Wales’ Limeburners Creek national park, the state’s fourth incident in 48 hours. The local health district said the man, 39, was in hospital in a stable condition with minor injuries. The attack took place near the Point Plomer campground, less than 20km north of Port Macquarie, on Tuesday morning. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/shark-attack-nsw-coast-fourth-incident-man-surfer",
      "published": "Tue, 20 Jan 2026 07:42:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Australia's Parliament passes gun laws, and debates anti-hate speech bill after Sydney attack",
      "description": "Australia’s Parliament has passed new gun restrictions and begun debating proposed anti-hate speech laws after two shooters killed 15 people at a Jewish festival in Sydney last month in an attack that authorities say was inspired by the Islamic State g...",
      "url": "https://abcnews.go.com/International/wireStory/australias-parliament-passes-gun-laws-debates-anti-hate-129372828",
      "published": "Tue, 20 Jan 2026 06:01:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Over 5,000 homes without power in Kyiv after Russian strikes on energy grid",
      "description": "Russia bombarded Ukraine with more than 300 drones and ballistic and cruise missiles in its latest nighttime attack on the Ukrainian power grid, President Volodymyr Zelenskyy said Tuesday. The attack knocked out heating to more than 5,600 apartment buildings in the capital, Kyiv Mayor Vitali Klitschko said. FRANCE 24's Gulliver Cragg reports from Kyiv.",
      "url": "https://www.france24.com/en/video/20260120-over-5-000-homes-without-power-in-kyiv-after-russian-strikes-on-energy-grid",
      "published": "Tue, 20 Jan 2026 10:17:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "New Orleans tourists shot when man fleeing gunfire ducks into famed restaurant",
      "description": "Three tourists wounded in a deadly New Orleans shooting at the famed Dooky Chase's Restaurant when a man ran inside to escape gunfire, authorities said.",
      "url": "https://www.foxnews.com/us/new-orleans-tourists-shot-when-man-fleeing-gunfire-ducks-famed-restaurant",
      "published": "Mon, 19 Jan 2026 14:39:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Nigeria: Gunmen kidnap more than 160 in church attacks",
      "description": "Armed gangs with \"sophisticated weapons\" kidnapped worshipers from at least two churches in Kaduna state. Nigeria faces several internal conflicts that have affected both Christians and Muslims — often indiscriminately.",
      "url": "https://www.dw.com/en/nigeria-gunmen-kidnap-more-than-160-in-church-attacks/a-75572335?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 23:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Trump hits Macron with tariff threats, underscores tense US-France relations",
      "description": "Donald Trump posted a private message from France’s leader and threatened hefty tariffs on French wine and champagne, targeting an ally who has taken a firm stance against US pressure over Greenland. “Macron is learning the hard way that there is no friendship with Donald Trump,” FRANCE 24 International Affairs commentator Douglas Herbert said, adding: “The flattering and cajoling only work as long as all you do is flatter and cajole Donald Trump.”",
      "url": "https://www.france24.com/en/trump-hits-macron-with-tariff-threats-underscores-tense-us-france-relations",
      "published": "Tue, 20 Jan 2026 11:38:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Hackers disrupt Iran state TV to broadcast exiled crown prince",
      "description": "Hackers disrupted Iranian state television satellite transmissions to air footage supporting the country's exiled crown prince and calling on security forces to not “point your weapons at the people,” online video showed early Monday, the latest disruption to follow nationwide protests in the country.",
      "url": "https://www.france24.com/en/video/20260120-hackers-disrupt-iran-state-tv-to-broadcast-exiled-crown-prince",
      "published": "Tue, 20 Jan 2026 10:18:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Have global justice institutions failed?",
      "description": "Can the world agree on a shared system of morality and justice?",
      "url": "https://www.aljazeera.com/video/doha-debates/2026/1/20/have-global-justice-institutions-failed?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 12:58:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "As Trump dismantles the existing world order, his version is still taking shape",
      "description": "In his second term, the president is embracing a foreign policy that breaks sharply from U.S. tradition. Both supporters and critics say he's upending a global system in place for 80 years.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5678927/trump-world-order-foreign-policy",
      "published": "Tue, 20 Jan 2026 05:02:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "European leaders call for emergency summit as tensions with the U.S. rise",
      "description": "European leaders will meet for an emergency summit Thursday to form an official response to President Trump's pursuit of Greenland and his threat of tariffs for any country that tries to stop him.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5682235/european-leaders-call-for-emergency-summit-as-tensions-with-the-u-s-rise",
      "published": "Tue, 20 Jan 2026 04:49:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Spain begins 3 days of mourning for deadly train wreck while death toll ticks up to 41",
      "description": "Spain has woken to flags at half staff on Tuesday as the nation began three days of mourning for the victims of the deadly train accident in the country’s south",
      "url": "https://abcnews.go.com/International/wireStory/spain-begins-3-days-mourning-deadly-train-wreck-129372449",
      "published": "Tue, 20 Jan 2026 06:41:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran state TV hacked to show exiled Crown Prince Pahlavi",
      "description": "Iranian state TV hacked to show exiled Crown Prince Reza Pahlavi urging military to join protesters as death toll reportedly reaches nearly 4,000.",
      "url": "https://www.foxnews.com/world/iran-state-tv-hacked-show-exiled-crown-prince-pahlavi",
      "published": "Mon, 19 Jan 2026 07:46:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "IMF warns of trade tension risk to global growth",
      "description": "Trade tensions and a reversal in the AI boom are among the main risks to global economic growth, the IMF says.",
      "url": "https://www.bbc.com/news/articles/c0r47ey0d1vo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 11:04:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Colombian ex-paramilitary leader jailed for crimes against Indigenous groups",
      "description": "Salvatore Mancuso given 40-year sentence, which could be reduced after truth and reparation activities A Colombian court has sentenced a former paramilitary leader to 40 years in prison for crimes committed against Indigenous communities in the province of La Guajira, including homicides, forced disappearances and the displacement of people from 2002 to 2006. The special tribunal that hears cases from the country’s armed conflict said in its ruling that Salvatore Mancuso was responsible for 117 crimes committed by fighters under his command in La Guajira. However, it added that Mancuso’s time in prison could be reduced to eight years, if he collaborated with truth and reparation activities that benefited victims of his former paramilitary group. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/colombia-ex-paramilitary-leader-salvatore-mancuso-jailed-crimes-against-indigenous-groups",
      "published": "Tue, 20 Jan 2026 12:12:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Guterres in London: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ISIS takes credit for Kabul suicide bombing at Chinese restaurant",
      "description": "ISIS-K claims responsibility for deadly suicide blast at Chinese restaurant in Kabul, killing seven people, including one Chinese national.",
      "url": "https://www.foxnews.com/world/isis-takes-credit-kabul-suicide-bombing-chinese-restaurant",
      "published": "Tue, 20 Jan 2026 08:24:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Twelve schoolchildren killed after bus collides with lorry in South Africa",
      "description": "The fatal collision is just the latest in South Africa, where the road safety record is poor.",
      "url": "https://www.bbc.com/news/articles/cvgdmkxl1mko?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 11:23:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar junta 'can't last forever': Military in 'worse position now' than ever before",
      "description": "Catherine Viette welcomes Kim Aris, son of Nobel Peace Prize laureate Aung San Suu Kyi, who bears witness to the fraught political landscape of Myanmar five years after the 2021 military coup. Mr. Aris sounds the alarm on the deteriorating condition of his ailing mother who remains imprisoned and whose whereabouts are unknown. He offers a scathing critique of the \"sham election\" and the contradictions between the junta’s claims of legitimacy and civilians on-going resistance to brutal oppression, political violence and civil conflict.",
      "url": "https://www.france24.com/en/myanmar-junta-can-t-last-forever-military-in-worse-position-now-than-ever-before",
      "published": "Tue, 20 Jan 2026 13:38:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "What may have caused deadly train crash in Spain - and why it's been described as 'truly strange'",
      "description": "A faulty rail joint may be key to understanding the cause of one of Spain's deadliest railway disasters in years, experts have said.",
      "url": "https://news.sky.com/story/spain-train-crash-how-it-unfolded-13496307",
      "published": "Mon, 19 Jan 2026 16:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Philippine coast guard rescues 1 and searches for 12 missing after motorboat vanishes",
      "description": "Philippine authorities have rescued a crew member from a missing motorboat and are searching for 12 others, including business people",
      "url": "https://abcnews.go.com/International/wireStory/philippine-coast-guard-rescues-1-searches-12-missing-129374761",
      "published": "Tue, 20 Jan 2026 07:03:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Canadian woman found dead on Australian beach in suspected dingo attack",
      "description": "Authorities are investigating whether a Canadian woman found dead on an Australian beach was killed by dingoes",
      "url": "https://abcnews.go.com/International/wireStory/canadian-woman-found-dead-australian-beach-suspected-dingo-129367199",
      "published": "Mon, 19 Jan 2026 21:37:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Aid cuts push millions in West and Central Africa deeper into hunger",
      "description": "A staggering 55 million people across West and Central Africa are expected to suffer crisis levels of hunger, or worse, during the lean season from June to August as funding cuts to humanitarian operations continue amid rising violence and displacement.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166776",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Florida repeat offender allegedly killed 3 tourists minutes from Magic Kingdom after run of violence: records",
      "description": "Florida man accused of killing three tourists near Magic Kingdom had lengthy criminal history including prior insanity acquittal for attempted murder.",
      "url": "https://www.foxnews.com/us/florida-repeat-offender-allegedly-killed-3-tourists-minutes-from-magic-kingdom-after-run-violence-records",
      "published": "Mon, 19 Jan 2026 18:52:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UFO task force eyed as lawmaker warns of strange objects in skies and waters defying known technology",
      "description": "Vermont UFO task force proposed by Rep. Troy Headrick would investigate unidentified anomalous phenomena reports and assess airspace safety risks in coordination with federal partners.",
      "url": "https://www.foxnews.com/us/ufo-task-force-eyed-lawmaker-warns-strange-objects-skies-waters-defying-known-technology",
      "published": "Mon, 19 Jan 2026 12:23:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Australian boy fighting for life after shark attack, rescued by friends in Sydney Harbor waters",
      "description": "A 12-year-old boy is fighting for his life after a catastrophic shark attack in Sydney Harbor. He was rescued by heroic friends who leaped from a cliff to save him.",
      "url": "https://www.foxnews.com/world/australian-boy-fighting-life-after-shark-attack-rescued-friends-sydney-harbor-waters",
      "published": "Mon, 19 Jan 2026 09:23:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US believes its power matters more than international law, UN chief tells BBC",
      "description": "António Guterres says Washington's \"clear conviction\" is that multilateral solutions are irrelevant.",
      "url": "https://www.bbc.com/news/articles/c4g0zx0llpzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 06:17:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump leaks world leaders' messages. And, Indiana wins its first national title",
      "description": "President Trump explains why he wants to acquire Greenland in private messages with world leaders. And, Indiana caps off a perfect football season with a national championship win over Miami.",
      "url": "https://www.npr.org/2026/01/20/g-s1-106532/up-first-newsletter-trump-world-leaders-immigration-detention-college-football-champion",
      "published": "Tue, 20 Jan 2026 07:19:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "African fans fume at 'disgraceful' World Cup travel ban",
      "description": "Senegal's football team are champions of Africa, but fans from the country are banned from going to the US for the World Cup. They aren't the only ones, with Donald Trump's hostility and FIFA ticket prices hitting hard.",
      "url": "https://www.dw.com/en/african-fans-fume-at-disgraceful-world-cup-travel-ban/a-75572110?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 09:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "China, Russia conclude BRICS+ naval drills in South Africa amid controversy",
      "description": "China and Russia concluded a week of joint naval exercises in South African waters on Friday, described by the host country as a BRICS Plus operation aimed at “ensuring the safety of shipping and maritime economic activities.” The drills stirred controversy as they coincided with deadly protests in Iran, which had originally planned to participate but withdrew following diplomatic discussions. FRANCE 24’s Eunice Masson noted that the exercises also sparked debate over the absence of key BRICS nations such as India and Brazil.",
      "url": "https://www.france24.com/en/china-russia-conclude-brics-naval-drills-in-south-africa-amid-controversy",
      "published": "Tue, 20 Jan 2026 11:45:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Floods in Mozambique displace more than 300,000 people in one province, governor says",
      "description": "Flooding in Mozambique has displaced over 300,000 people, according to the Gaza province governor",
      "url": "https://abcnews.go.com/International/wireStory/floods-mozambique-displace-300000-people-province-governor-129357204",
      "published": "Mon, 19 Jan 2026 14:57:56 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators disrupt Minnesota church, shout down worshippers during Sunday service",
      "description": "Anti-ICE protesters allegedly disrupted Minneapolis church services, shouting at parishioners over immigration enforcement. Federal investigation launched.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-disrupt-minnesota-church-shout-worshippers-sunday-service",
      "published": "Mon, 19 Jan 2026 16:00:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran locks nation into ‘darker’ digital blackout, viewing internet as an ‘existential threat’",
      "description": "Iran enters 22nd day of internet shutdown with limited connectivity restored as NetBlocks reports shift toward \"filternet plus\" censorship scheme whitelisting only business services.",
      "url": "https://www.foxnews.com/world/iran-locks-nation-darker-digital-blackout-viewing-internet-existential-threat",
      "published": "Mon, 19 Jan 2026 16:33:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Top GOP senator says Syria ceasefire welcome but actions must match words",
      "description": "Syria reaches fragile ceasefire with Kurdish forces as U.S. senator warns about reported crimes by government troops during military operation against SDF.",
      "url": "https://www.foxnews.com/world/top-gop-senator-says-syria-ceasefire-welcome-actions-must-match-words",
      "published": "Mon, 19 Jan 2026 11:42:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of killing 16,500 in sweeping ‘genocide’ crackdown: report",
      "description": "Supreme Leader Ayatollah Ali Khamenei acknowledges thousands killed in Iran protests as regime allegedly accelerates executions to more than eight per day.",
      "url": "https://www.foxnews.com/world/iran-accused-killing-16500-sweeping-genocide-crackdown-report",
      "published": "Sun, 18 Jan 2026 22:07:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Nigeria police deny reports of mass church abductions in north",
      "description": "A state police commissioner said the information was \"mere falsehood... peddled by conflict entrepreneurs\".",
      "url": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 08:39:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Rare twins born in DRC raise cautious hope for endangered mountain gorillas",
      "description": "Virunga park ranger says babies are well cared for by mother Mafuko but high infant mortality makes first weeks critical It was noon by the time Jacques Katutu first saw the newborn mountain gorillas. Cradled in the arms of their mother, Mafuko, the tiny twins clung to her body for warmth in the forest clearing in Virunga national park, in eastern Democratic Republic of the Congo (DRC). Katutu, head of gorilla monitoring in Virunga, has seen dozens of newborns in his 15 years as a ranger. But, he tells the Guardian, even he was touched by the sight of the fragile infant males, who face serious obstacles if they are to become silverbacks one day. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/17/twin-baby-mountain-gorilla-virunga-drc-survival-conservation-aoe",
      "published": "Sat, 17 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "NDIS tool to determine support not tested on variety of disability types – including diverse autism, experts warn",
      "description": "Exclusive: Experts also alarmed I-CAN tool – a three-hour interview – may be conducted by people with no allied health background Get our breaking news email , free app or daily news podcast The head of Australia’s peak body of psychologists and disability experts have warned the NDIS’s new assessment tool hasn’t been tested on a variety of disability types – including diverse autistic needs – which may lead to “tragedies” occurring, if more research is not conducted. The National Disability Insurance Agency (NDIA) announced in September it had procured the Instrument for the Classification and Assessment of Support Needs (I-CAN) to be used as the basis for determining support plans for NDIS participants. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/ndis-tool-to-determine-support-not-tested-on-variety-of-disability-types-including-diverse-autism-experts-warn",
      "published": "Tue, 20 Jan 2026 14:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Dame Marie Bashir, former NSW governor and distinguished psychiatrist, dies age 95",
      "description": "The first female governor of New South Wales, Dame Marie was widely respected and will be honoured with a state funeral Dame Marie Bashir, the first female governor of New South Wales, has died. She was 95. The NSW premier, Chris Minns, confirmed her death on Tuesday on behalf of her family, writing in a statement that he was saddened to share the news of her passing. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/dame-marie-bashir-former-nsw-governor-and-distinguished-psychiatrist-dies-age-95",
      "published": "Tue, 20 Jan 2026 11:48:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Overnight Russian attack cuts off power in Kyiv",
      "description": "Russia pounded Ukraine's Kyiv region with combined drone and missile strikes overnight. Thousands of homes have been left without electricity and heating in freezing weather.",
      "url": "https://www.dw.com/en/ukraine-overnight-russian-attack-cuts-off-power-in-kyiv/a-75574053?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 09:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Northern lights dazzle US, Europe amid intense solar storm",
      "description": "The sun has ejected the largest solar radiation storm in over 20 years. The phenomenon caused auroras to light up the skies in some parts of the world.",
      "url": "https://www.dw.com/en/northern-lights-dazzle-us-europe-amid-intense-solar-storm/a-75573074?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 04:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Fighting erupts near prisons holding IS extremists one day after ceasefire agreed",
      "description": "Fighting has broken out between Syrian government troops and the Kurdish-led Syrian Democratic Forces (SDF), just a day after a ceasefire was announced by the country's state media.",
      "url": "https://news.sky.com/story/fighting-erupts-near-prisons-holding-is-extremists-in-syria-a-day-after-kurdish-led-sdf-agreed-ceasefire-with-damascus-13496377",
      "published": "Mon, 19 Jan 2026 20:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Nigeria police deny attacks as residents insist 168 people are held by armed groups",
      "description": "The Nigerian police deny reports of church attacks in Kaduna state over the weekend",
      "url": "https://abcnews.go.com/International/wireStory/nigeria-police-deny-church-attacks-residents-insist-168-129378474",
      "published": "Tue, 20 Jan 2026 09:18:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Colombia's ELN rebels free 5 police officers as they push for national accord",
      "description": "Colombia’s largest remaining rebel group on Monday released five police officers it had kidnapped during the first week of January, as it pushes for a “national accord” to overcome political conflicts in the South American nation",
      "url": "https://abcnews.go.com/International/wireStory/colombias-eln-rebels-free-5-police-officers-push-129360200",
      "published": "Mon, 19 Jan 2026 16:01:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Alexander brothers trade trophy listings for jury trial as accuser’s recent death shadows case",
      "description": "Jury selection begins for the Alexander brothers' federal sex trafficking trial, with defense attorneys facing a challenging jury selection environment.",
      "url": "https://www.foxnews.com/us/alexander-brothers-trade-trophy-listings-jury-trial-accusers-recent-death-shadows-case",
      "published": "Tue, 20 Jan 2026 07:00:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Spain train crash recovery continues as investigators probe 'gap' in rail",
      "description": "Authorities say the twisted train wreckage makes it difficult to recover people trapped inside.",
      "url": "https://www.bbc.com/news/articles/c5y2qjy9l4yo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 14:28:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Anthony Joshua's driver appears in court after crash that killed two",
      "description": "The former heavyweight champion was a passenger in the crash, which killed two of his team members.",
      "url": "https://www.bbc.com/news/articles/cew8jxze027o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 11:16:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Video: More than 100 vehicles involved in pile-up during US snowstorm",
      "description": "More than 100 vehicles crashed into each other or slid off a highway during a snowstorm in the US state of Michigan.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/video-more-than-100-vehicles-involved-in-pile-up-during-us-snowstorm?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 11:38:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Train crash kills more than three dozen in Spain",
      "description": "More than three dozen people were killed as two high-speed trains collided in southern Spain.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5682013/train-crash-kills-more-than-three-dozen-in-spain",
      "published": "Mon, 19 Jan 2026 16:20:36 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Greenland: Europe vows 'unflinching' response to Trump",
      "description": "The EU's Ursula von der Leyen has warned Donald Trump that his tariff threat against European countries would be a \"mistake.\" Follow DW.",
      "url": "https://www.dw.com/en/greenland-europe-vows-unflinching-response-to-trump/live-75575266?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 10:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The Bright Side: Geomagnetic storm to bring northern lights to parts of US",
      "description": "A major solar storm began hitting Earth on Monday and could cause disruptions to power grids and satellite networks, as well as produce impressive aurora borealis, US weather authorities warned.",
      "url": "https://www.france24.com/en/americas/20260120-bright-side-geomagnetic-storm-northern-lights-parts-us",
      "published": "Tue, 20 Jan 2026 10:45:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Hopes fade in fourth day of search for dozens missing in Karachi shopping plaza fire",
      "description": "Hopes of finding survivors of a Karachi shopping plaza fire have faded",
      "url": "https://abcnews.go.com/International/wireStory/hopes-fade-fourth-day-search-dozens-missing-karachi-129377362",
      "published": "Tue, 20 Jan 2026 08:19:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Food insecurity in Lebanon, Libya migrants freed, UNHCR tackles multiple emergencies – despite cuts",
      "description": "Since 2026, nearly 17 percent of Lebanon’s population has been living in a state of major food insecurity – a situation that is likely to worsen in the coming year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166787",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen: Children are dying and it’s going to get worse, warns aid veteran",
      "description": "In Yemen, renewed political instability and economic woes linked to the war threaten to complicate the already difficult task of helping vulnerable people suffering from deepening hunger, illness and displacement, the UN’s top aid official there said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166786",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Judge and wife shot in broad daylight in Indiana, sparking massive multi-agency investigation",
      "description": "A manhunt is underway after Indiana judge Steven Meyer and his wife, Kimberly Meyer, were shot in their home on Sunday. Both victims survived the shooting.",
      "url": "https://www.foxnews.com/us/judge-wife-shot-broad-daylight-indiana-sparking-massive-multi-agency-investigation",
      "published": "Mon, 19 Jan 2026 21:45:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Japan’s prime minister calls snap election as approval ratings ride high",
      "description": "Sanae Takaichi tells senior figures in ruling Liberal Democratic party she plans to dissolve lower house on 23 January Japan’s prime minister, Sanae Takaichi , has called a snap election as she attempts to capitalise on high approval ratings since becoming the country’s first female prime minister three months ago. Takaichi, a conservative who is embroiled in a deepening dispute with China over the security of Taiwan, said on Monday she would dissolve the lower house of the Diet – Japan’s parliament – on 23 January, with an election to follow on 8 February. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/japan-snap-election-sanae-takaichi-ldp",
      "published": "Mon, 19 Jan 2026 09:39:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Lawyers for Swiss bar owners condemn 'vindictiveness' after deadly fire",
      "description": "Lawyers for the Moretti couple say \"lies\" have been circulating about their clients, in their first public statement since the fire.",
      "url": "https://www.bbc.com/news/articles/c5yvl4x3nqeo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 14:53:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Clashes reported after Syria and Kurdish-led forces agree ceasefire",
      "description": "An agreement between the government and the SDF will bring an autonomous region in the north-east under state control.",
      "url": "https://www.bbc.com/news/articles/c4gwk37ewvwo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 20:59:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Israeli prisons are akin to ‘torture camps’, Israeli rights group finds",
      "description": "B’Tselem's latest report sounds alarm on abuse, dozens of deaths of Palestinian prisoners in Israeli jails.",
      "url": "https://www.aljazeera.com/news/2026/1/20/israeli-prisons-are-akin-to-torture-camps-israeli-rights-group-finds?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 12:20:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Researchers find Antarctic penguin breeding is heating up sooner",
      "description": "Warming temperatures are forcing Antarctic penguins to breed earlier and that's a big problem for two of the cute tuxedoed species that face extinction by the end of the century, a study said.",
      "url": "https://www.npr.org/2026/01/20/g-s1-106516/antarctic-penguin-breeding-heating-up-sooner",
      "published": "Tue, 20 Jan 2026 05:19:20 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Syrian govt says 120 Islamic State detainees escaped prison",
      "description": "Syria's ⁠Interior Ministry said on Tuesday that about 120 Islamic State detainees escaped from Shaddadi prison, after ​the Kurdish website Rudaw reported that ‍a spokesperson for the Kurdish-led Syrian Democratic Forces, Farhad ​Shami, said around 1,500 Islamic State members ​had escaped. The Syrian ministry said Syrian army units and ministry special forces entered Shaddadi following the breakout. It said security forces had recaptured 81 of the escapees after search and sweep operations in ‍the town and surrounding areas, with efforts continuing to ​arrest the remaining fugitives.",
      "url": "https://www.france24.com/en/syrian-govt-says-120-islamic-state-detainees-escaped-prison",
      "published": "Tue, 20 Jan 2026 11:17:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators occupy Minnesota Target store, demand retailer stop helping federal agents",
      "description": "Anti-ICE protesters staged a sit-in at Minneapolis Target store, claiming retailer allows federal immigration agents to use parking lot as staging ground.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-occupy-minnesota-target-store-demand-retailer-stop-helping-federal-agents",
      "published": "Mon, 19 Jan 2026 16:22:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "How a year of Trump reshaped the world in seven charts",
      "description": "First year of Trump 2.0 saw deportations, tariffs and a captured President Maduro. Al Jazeera breaks down the numbers.",
      "url": "https://www.aljazeera.com/news/2026/1/20/how-a-year-of-trump-reshaped-the-world-in-seven-charts?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 12:24:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump’s first year back live: US president ramps up pressure on allies",
      "description": "US President Donald Trump marks first year back by expanding presidential power and reshaping global relations.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/20/trump-first-year-back-live-us-president-ramps-up-pressure-on-allies?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 11:10:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "How a year of Trump has reshaped the US and the world",
      "description": "The first year of Trump 2.0 featured deportations, tariffs and an abducted president.",
      "url": "https://www.aljazeera.com/video/by-the-numbers-3/2026/1/20/how-a-year-of-trump-has-reshaped-the-us-and-the-world?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 10:31:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UK approves Chinese ‘mega embassy’ in London after reassurances from spy chiefs",
      "description": "Critics expected to mount legal challenge to plans for vast complex at Royal Mint Court amid security concerns UK politics live – latest updates The UK communities secretary, Steve Reed, has given permission for China to build a vast new embassy near the Tower of London after spy chiefs told him that the risks to national security could be controlled and dealt with. The decision paves the way for Keir Starmer to visit Beijing in the coming weeks – though local residents plan to legally challenge the decision, potentially delaying the development by months or years. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/20/china-mega-embassy-approved-london",
      "published": "Tue, 20 Jan 2026 13:57:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Italian fashion designer Valentino dies at 93",
      "description": "Garavani built one of the most recognizable luxury brands in the world. His clients included royalty, Hollywood stars, and first ladies.",
      "url": "https://www.npr.org/2026/01/19/1114518694/valentino-garavani-dead",
      "published": "Mon, 19 Jan 2026 14:58:23 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "French President Emmanuel Macron delivers speech at Davos Forum",
      "description": "Watch French President Emmanuel Macron's speech at the World Economic Forum in Davos, Switzerland.",
      "url": "https://www.france24.com/en/video/20260120-french-president-emmanuel-macron-delivers-speech-at-davos-forum-1",
      "published": "Tue, 20 Jan 2026 13:52:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump's first year has been 'faster and more shocking than expected', expert says",
      "description": "US President Donald Trump's actions during his first year back in office have been \"faster and more shocking than we even expected\". That's the view of US domestic and foreign policy specialist Laurie Dundon. She told us that Trump's mind is set on the historical legacy he will leave and that he aims to upend how the US functions internally and how it is seen in the world. She spoke to us in Perspective.",
      "url": "https://www.france24.com/en/tv-shows/perspective/20260120-trump-s-first-year-has-been-faster-and-more-shocking-than-expected-expert-says",
      "published": "Tue, 20 Jan 2026 13:50:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'We're shifting to a world without rules': Watch Macron speak live at World Economic Forum in Davos",
      "description": "No description available.",
      "url": "https://www.france24.com/en/europe/20260120-live-trump-says-europeans-won-t-push-back-too-much-over-greenland",
      "published": "Tue, 20 Jan 2026 13:30:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "European Commission President Ursula ​von der Leyen presser",
      "description": "Watch European Commission President Ursula ​von der Leyen's presser at the World Economic Forum in Davos, Switzerland.",
      "url": "https://www.france24.com/en/video/20260120-european-commission-president-ursula-von-der-leyen-presser-1",
      "published": "Tue, 20 Jan 2026 10:48:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "A chance to negotiate as Trump heads to Davos - but Starmer is the odd one out",
      "description": "This time last year Donald Trump was beamed into Davos from Washington to deliver a virtual address that put business and political leaders on notice; the free-trading, liberal economic model, reaffirmed and celebrated every January at the World Economic Forum, was over.",
      "url": "https://news.sky.com/story/trump-to-take-advantage-of-deal-making-paradise-in-davos-following-greenland-threat-13496293",
      "published": "Mon, 19 Jan 2026 16:09:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "South Sudan president fires interior minister in a move threatening peace agreement",
      "description": "President Salva Kiir of South Sudan has dismissed his interior minister, Angelina Teny, who is the wife of detained opposition leader Riek Machar",
      "url": "https://abcnews.go.com/International/wireStory/south-sudan-president-fires-interior-minister-move-threatening-129375041",
      "published": "Tue, 20 Jan 2026 06:56:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Six countries confirm US invitations to Gaza peace board",
      "description": "Trump invites multiple countries, including Jordan, Greece and India, to join his \"Board of Peace\" for Gaza reconstruction and governance oversight.",
      "url": "https://www.foxnews.com/world/six-countries-confirm-us-invitations-gaza-peace-board",
      "published": "Sun, 18 Jan 2026 14:21:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Economic Forum invites Iranian foreign minister to Davos after regime slaughter of Iranian civilians",
      "description": "World Economic Forum is facing calls to exclude Iranian officials from Davos after the regime slaughtered thousands of its civilians, rights groups say.",
      "url": "https://www.foxnews.com/world/world-economic-forum-invites-iranian-foreign-minister-davos-after-regime-slaughter-iranian-civilians",
      "published": "Sun, 18 Jan 2026 12:04:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Syria’s war-ravaged oil sector faces tough road to recovery, analysts say",
      "description": "Syrian government's control of energy reserves from SDF has raised hopes of return to pre-war production levels.",
      "url": "https://www.aljazeera.com/economy/2026/1/20/syrias-war-ravaged-oil-sector-faces-tough-road-to-recovery-analysts-say?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 10:56:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Tymoshenko vs Zelenskyy: Political clash over graft rocks wartime Ukraine",
      "description": "Opposition politician Tymoshenko is accused of trying to obstruct cabinet appointments as she clashes with Zelenskyy.",
      "url": "https://www.aljazeera.com/news/2026/1/20/outrageous-crime-how-ex-pms-corruption-probe-changes-ukraines-politics?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 10:29:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "China stays resilient in first year of Trump 2.0",
      "description": "Donald Trump's second term in the White House has tested China's tit-for-tat approach in response to the the US president's trade war. While stiff competition remains moving forward, there are signs of more stable ties.",
      "url": "https://www.dw.com/en/china-stays-resilient-in-first-year-of-trump-2-0/a-75577333?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 13:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump floats 200% tariff on French wine over perceived snub",
      "description": "Donald Trump has warned of steep tariffs on French wine and champagne as he presses France's president Emmanuel Macron to join a US-led \"Board of Peace.\" Paris has signalled that it does not plan to join the initiative.",
      "url": "https://www.dw.com/en/trump-floats-200-tariff-on-french-wine-over-perceived-snub/a-75574134?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 08:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia hit by 4 shark attacks in 2 days",
      "description": "A surfer has been attacked by a shark in the fourth incident along the coast of New South Wales in 48 hours. Meanwhile, beaches have been closed across Sydney.",
      "url": "https://www.dw.com/en/australia-hit-by-4-shark-attacks-in-2-days/a-75573075?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 04:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Surfer 'lucky to survive' Sydney's fourth shark attack in three days",
      "description": "A surfer has become the latest victim of a shark attack in Australia - the fourth off Sydney in just three days.",
      "url": "https://news.sky.com/story/surfer-lucky-to-survive-sydneys-fourth-shark-attack-in-three-days-13496507",
      "published": "Tue, 20 Jan 2026 08:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting",
      "description": "Australia's politicians have fast-tracked reforms to toughen gun control and hate crime laws in response to December's Bondi Beach shooting.",
      "url": "https://news.sky.com/story/australia-fast-tracks-tougher-gun-and-hate-laws-after-bondi-beach-shooting-13496476",
      "published": "Tue, 20 Jan 2026 07:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nanny love triangle murders trial pits dueling stories of mastermind behind case ‘out of a TV movie’: expert",
      "description": "First week of testimony in Virginia murder trial exposes alleged affair between Brendan Banfield and family nanny, leading to wife's death and cover-up.",
      "url": "https://www.foxnews.com/us/nanny-love-triangle-murders-trial-pits-dueling-stories-mastermind-behind-case-tv-movie-expert",
      "published": "Tue, 20 Jan 2026 09:00:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "ICE says immigrant who died in Texas detention center committed suicide",
      "description": "ICE said that an immigrant who was found dead at an immigration detention center in El Paso, Texas, last week had killed himself, as authorities continue to investigate.",
      "url": "https://www.foxnews.com/us/ice-says-immigrant-who-died-texas-detention-center-committed-suicide",
      "published": "Tue, 20 Jan 2026 01:09:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Minneapolis software engineers mistaken for ICE agents while eating lunch harassed by anti-ICE crowd",
      "description": "Software engineers mistakenly accused of being ICE agents face harassment and shocking allegations while eating lunch at Minneapolis restaurant during incident.",
      "url": "https://www.foxnews.com/us/minneapolis-software-engineers-mistaken-ice-agents-eating-lunch-harassed-anti-ice-crowd",
      "published": "Mon, 19 Jan 2026 18:18:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fourth shark attack in three days rocks Australia as authorities close beaches and deploy drumlines",
      "description": "A string of shark attacks near Sydney prompted beach closures across New South Wales. The latest victim attacked at Point Plomer suffered only minor cuts.",
      "url": "https://www.foxnews.com/world/fourth-shark-attack-three-days-rocks-australia-authorities-close-beaches-deploy-drumlines",
      "published": "Tue, 20 Jan 2026 07:24:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian regime elites allegedly move millions of dollars out of country amid sanctions",
      "description": "Treasury sanctions target Iran's shadow banking as Mojtaba Khamenei allegedly transferred $328 million overseas according to Treasury Department reports.",
      "url": "https://www.foxnews.com/world/iranian-regime-elites-allegedly-move-tens-millions-dollars-out-country-amid-sanctions",
      "published": "Sun, 18 Jan 2026 20:29:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian drone strikes leave hundreds of thousands without power across Russian-controlled area",
      "description": "Ukrainian drone strikes against Russian energy infrastructure left over 200,000 without power as both sides continue targeting electrical grids.",
      "url": "https://www.foxnews.com/world/ukrainian-drone-strikes-leave-hundreds-thousands-without-power-across-russian-controlled-area",
      "published": "Sun, 18 Jan 2026 14:07:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland is not just a territorial concern. It is a reckoning",
      "description": "It is quite ironic that the imperialism Denmark helped normalise for decades now threatens Danish sovereignty.",
      "url": "https://www.aljazeera.com/opinions/2026/1/20/greenland-is-not-just-a-territorial-concern-it-is-a-reckoning?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 10:28:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Kim Jong-un fires vice-premier and likens him to ‘a goat yoked to an ox cart’",
      "description": "North Korean leader reportedly blames Yang Sung-ho for ‘confusion’ at factory project as major congress looms The North Korean leader, Kim Jong-un , has dismissed a vice-premier over troubles in a factory modernisation project, in an apparent move to tighten discipline among officials and push them to deliver greater results before a major political conference. The upcoming ruling Workers’ party congress, the first of its kind in five years , is one of North Korea’s biggest propaganda spectacles and is intended to review past projects, establish new political and economic priorities and reshuffle officials. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/kim-jong-un-fires-vice-premier-yang-sung-ho-goat-ox-cart",
      "published": "Tue, 20 Jan 2026 11:46:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea's Kim fires vice premier over factory failures ahead of major party congress",
      "description": "North Korean leader Kim Jong Un has dismissed a vice premier over issues in a factory modernization project",
      "url": "https://abcnews.go.com/International/wireStory/north-koreas-kim-dismisses-vice-premier-factory-project-129369235",
      "published": "Tue, 20 Jan 2026 06:33:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota AG dismisses FACE Act concerns after anti-ICE agitators storm church and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/minnesota-ag-dismisses-face-act-concerns-anti-ice-agitators-storm-church-more-top-headlines",
      "published": "Tue, 20 Jan 2026 07:23:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "US veteran gets 5 years in Russian prison after authorities reportedly force him to dock with firearm onboard",
      "description": "U.S. Navy veteran Charles Wayne Zimmerman was sentenced to 5 years in Russian prison after allegedly failing to declare a firearm oboard his yacht in Sochi port.",
      "url": "https://www.foxnews.com/world/us-veteran-gets-5-years-russian-prison-authorities-reportedly-force-him-dock-firearm",
      "published": "Mon, 19 Jan 2026 18:06:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration says deporting college student trying to surprise family was a ‘mistake’",
      "description": "Any Lucía López Belloza was detained at Boston’s airport in November and flown to Honduras two days later US citizens and permanent residents: have you been racially profiled by ICE? The Trump administration apologized in court for a “mistake” in the deportation of a Massachusetts college student who was detained trying to fly home to surprise her family in Texas for Thanksgiving. But the administration still argued that the federal government error should not affect her immigration case. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/16/trump-administration-mistake-college-student-detained",
      "published": "Fri, 16 Jan 2026 20:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "IS fighters flee prison as Syria's army clashes with SDF",
      "description": "Hundreds of IS members escaped a prison amid clashes between Syrian government forces and the SDF, the country's main Kurdish-led force.",
      "url": "https://www.dw.com/en/is-fighters-flee-prison-as-syria-s-army-clashes-with-sdf/a-75572648?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 02:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "French far-right leader Marine Le Pen takes the stand in high-stakes appeals trial",
      "description": "French far-right leader Marine Le Pen’s political future hangs in the balance as she faces an appeals trial in Paris, a case that could derail her party’s ambitions to radically reshape France with anti-immigration and nationalist policies. It will be Le Pen’s first opportunity to speak since the trial opened last week, FRANCE 24’s Olivia Bizot said, adding that prosecutors are expected to question her on the role of key individuals involved in the case, in which she was found guilty of misusing EU funds.",
      "url": "https://www.france24.com/en/french-far-right-leader-marine-le-pen-takes-the-stand-in-high-stakes-appeals-trial",
      "published": "Tue, 20 Jan 2026 13:24:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Arts24 in Nashville: Country music, the soundtrack to America under Trump (2/2)",
      "description": "One year after Donald Trump's return to power, country music finds itself at the heart of America's deepening political and cultural divide. In this second episode, arts24 explores how a genre once seen as a unifying symbol of tradition and shared values has become a battleground for competing visions of America.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260120-arts24-in-nashville-country-music-the-soundtrack-to-america-under-trump-2-2",
      "published": "Tue, 20 Jan 2026 12:23:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "One year since Trump's return to the White House: The US's two-track economy",
      "description": "It's been one year since Donald Trump started his second term as US president, and he's pointing to the country's strong GDP growth rate and stock market performances to paint a glowing picture of the economy. But a closer look shows that while activity is booming, it's mostly benefitting the country's wealthier households. Also in this edition, we see how Trump's tariffs have pushed German winemakers to look to China for their exports.",
      "url": "https://www.france24.com/en/tv-shows/business/20260120-one-year-since-trump-s-return-to-the-white-house-the-us-s-two-track-economy",
      "published": "Tue, 20 Jan 2026 10:33:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea's Kim Jong Un dismisses vice premier, comparing him to 'a goat yoked to pull an ox cart'",
      "description": "North Korean leader Kim Jong Un has dismissed a vice premier over a factory modernisation project in a rare public rebuke ahead of a ruling party congress, state media has reported.",
      "url": "https://news.sky.com/story/north-koreas-kim-jong-un-dismisses-vice-premier-comparing-him-to-a-goat-yoked-to-pull-an-ox-cart-13496580",
      "published": "Tue, 20 Jan 2026 12:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Jailed Ugandan opposition figure Besigye's health is failing, his party says",
      "description": "The health of jailed Ugandan opposition figure Kizza Besigye is failing, his party says, after he was driven overnight to a medical facility in the capital of Kampala",
      "url": "https://abcnews.go.com/International/wireStory/jailed-ugandan-opposition-figure-besigyes-health-failing-party-129373380",
      "published": "Tue, 20 Jan 2026 04:09:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Universal Orlando visitor dies after riding Revenge of the Mummy roller coaster, state report says",
      "description": "A 70-year-old woman died after riding Universal Orlando's Revenge of the Mummy roller coaster in November, according to a new state report.",
      "url": "https://www.foxnews.com/us/universal-orlando-visitor-dies-after-riding-revenge-mummy-roller-coaster",
      "published": "Mon, 19 Jan 2026 13:30:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
      "description": "Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".",
      "url": "https://www.bbc.com/news/articles/c4g5345ylk0o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 06:08:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump’s Greenland tariffs: What’s Europe’s ‘bazooka’ option to hit back?",
      "description": "After tariff threats against Europe, Trump renews bid for Greenland in message to Norway as EU mulls retaliation.",
      "url": "https://www.aljazeera.com/economy/2026/1/20/trumps-greenland-tariffs-whats-europes-bazooka-option-to-hit-back?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 12:52:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Dual citizenship: Bangladesh’s latest political flashpoint before elections",
      "description": "A divide over whether dual citizens should be allowed to contest is threatening Bangladesh's February elections.",
      "url": "https://www.aljazeera.com/features/2026/1/20/dual-citizenship-bangladeshs-latest-political-flashpoint-before-elections?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 10:15:48 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Davos 2026: 'We prefer respect to bullies,' Macron says",
      "description": "France's president said it was \"fundamentally unacceptable\" for the US to use tariff threats as \"leverage against territorial sovereignty.\" His speech came ahead of US President Trump's visit to Davos. DW has more.",
      "url": "https://www.dw.com/en/davos-2026-we-prefer-respect-to-bullies-macron-says/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 14:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany updates: Merz hosts reception for soldiers, police",
      "description": "German Chancellor Friedrich Merz is meeting with police officers and soldiers, as well as their families, to express his appreciation. Meanwhile, a strike is causing delays on the German Autobahn. DW has more.",
      "url": "https://www.dw.com/en/germany-updates-merz-hosts-reception-for-soldiers-police/live-75574052?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 09:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What is an exiled Iranian opposition group doing in Albania?",
      "description": "Far from Tehran in a Balkan nation, some 3,000 members of the banned group Mujahedeen-e-Khalq (MEK) have been sheltering. What's their role in the protests?",
      "url": "https://www.dw.com/en/what-is-an-exiled-iranian-opposition-group-doing-in-albania/a-75574006?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 08:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "North Korean leader fires vice premier, slams 'incompetent' officials",
      "description": "North Korea's leader Kim Jong Un publicly dismissed a cabinet vice premier over a factory project. He also blasted officials for \"defeatism\" and \"irresponsibility.\"",
      "url": "https://www.dw.com/en/north-korean-leader-fires-vice-premier-slams-incompetent-officials/a-75573550?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 07:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump publishes Macron's message, threatens French wine tariffs",
      "description": "Emmanuel Macron and Donald Trump have long exchanged firm handshakes, but their relationship is showing cracks. In a striking break from diplomatic norms, Trump publicly shared what he called a private message from Macron – proposing a G7 meeting in Paris and discussing Syria, Iran, and Greenland.",
      "url": "https://www.france24.com/en/trump-publishes-macron-message-threatens-french-wine-tariffs",
      "published": "Tue, 20 Jan 2026 13:22:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens France 200% tariffs if Macron refuses to join Board of Peace",
      "description": "US President Donald Trump has threatened 200% tariffs on French wines and champagnes after his French counterpart Emmanuel Macron refused to join his Board of Peace. The initiative has been likened by analysts as a pay-to-play version of the UN Security Council. #trump #macron #tariffs",
      "url": "https://www.france24.com/en/video/20260120-trump-threatens-france-200-tariffs-if-macron-refuses-to-join-board-of-peace-1",
      "published": "Tue, 20 Jan 2026 12:49:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Six-year-old girl the sole survivor of a family that perished in Spanish train wreck",
      "description": "A 6-year-old girl has survived Sunday's deadly train crash in southern Spain",
      "url": "https://abcnews.go.com/International/wireStory/miracle-6-year-girl-sole-survivor-family-perished-129378631",
      "published": "Tue, 20 Jan 2026 08:52:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Top EU official questions Trump’s trustworthiness over Greenland tariff threat",
      "description": "The European Union’s top official has described U_S_ President Donald Trump’s planned new tariffs over Greenland as “a mistake especially between long-standing allies.\"",
      "url": "https://abcnews.go.com/International/wireStory/top-eu-official-questions-trumps-trustworthiness-greenland-tariff-129372454",
      "published": "Tue, 20 Jan 2026 08:09:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Families in ‘survival mode’ amid Russian strikes and deadly cold",
      "description": "Families across Ukraine are in “constant survival mode” amid ongoing waves of Russian missile and drone strikes that have left blocks without power for days at a time, while temperatures plunge to deadly lows, the UN Children's Fund (UNICEF) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166774",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US Marshals nab fugitive hiding under child's bed: officials",
      "description": "Fugitive found hiding under child's bed during dramatic U.S. Marshals arrest operation in Spokane. Authorities said suspect was wanted on firearm charges.",
      "url": "https://www.foxnews.com/us/us-marshals-nab-fugitive-hiding-under-childs-bed-officials",
      "published": "Tue, 20 Jan 2026 08:01:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "West Virginia teacher fired after arrest on child sex abuse charge",
      "description": "West Virginia teacher Emily Joy Wise, 38, was fired after allegedly sexually abusing a child under 16. She's held on $250,000 bail following her arrest.",
      "url": "https://www.foxnews.com/us/west-virginia-teacher-fired-after-arrest-child-sex-abuse-charge",
      "published": "Mon, 19 Jan 2026 14:17:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China demands Taliban protect its citizens after deadly Kabul blast",
      "description": "The Islamic State group says they were behind the blast in Kabul, but police say they are still investigating the cause.",
      "url": "https://www.bbc.com/news/articles/c5yvqx22dyvo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 11:16:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Who hacked Iranian state TV?",
      "description": "Iranian state TV has been hacked, to show messages from the exiled son of the late Shah.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/who-hacked-iranian-state-tv?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 13:04:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syrian military claims that Kurdish-led forces abandoned camp housing families of Islamic State militants",
      "description": "Syrian military claims that Kurdish-led forces abandoned camp housing families of Islamic State militants",
      "url": "https://abcnews.go.com/International/wireStory/syrian-military-claims-kurdish-led-forces-abandoned-camp-129377438",
      "published": "Tue, 20 Jan 2026 08:17:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syrian interior ministry: 120 Islamic State group members escape from prison amid clashes",
      "description": "Syria's interior ministry says 120 Islamic State group members have escaped from a prison in northeast Syria",
      "url": "https://abcnews.go.com/International/wireStory/syrian-interior-ministry-120-islamic-state-group-members-129374085",
      "published": "Tue, 20 Jan 2026 05:29:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters break free from Syrian jail amid chaotic government handover",
      "description": "U.S. military boosts regional presence with F-15 fighter jets and USS Abraham Lincoln deployment as ISIS prison break highlights security risks amid Syria's political realignment.",
      "url": "https://www.foxnews.com/world/isis-fighters-break-free-from-syrian-jail-amid-chaotic-government-handover",
      "published": "Mon, 19 Jan 2026 22:10:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Gunmen abduct dozens of worshippers from multiple Nigerian churches using sophisticated weapons",
      "description": "Gunmen allegedly abducted dozens of worshippers from two churches in Nigeria's Kaduna state, with security forces deployed to track the captors.",
      "url": "https://www.foxnews.com/world/gunmen-abduct-dozens-worshippers-multiple-nigerian-churches-using-sophisticated-weapons",
      "published": "Mon, 19 Jan 2026 21:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "China’s population falls again as birthrate drops 17% to record low",
      "description": "Fourth year of decline deepens concerns over ageing, shrinking workforce and long-term economic impact China’s population fell for a fourth consecutive year in 2025 as the birthrate plunged to another record low despite the introduction of polices aimed at encouraging people to have children. Registered births dropped to 7.92 million in 2025 – or 5.63 for every 1,000 members of the population – down 17% from 9.54 million in 2024, and the lowest since records began in 1949. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/china-population-falls-again-birthrate-record-low",
      "published": "Mon, 19 Jan 2026 12:12:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "EU prosecutor: Third of VAT fraud cases linked to Slovakia",
      "description": "The EU's most senior prosecutor told Slovak MPs that a staggering one in three VAT fraud cases investigated by her office has links to Slovakia. How can such fraud flourish in Slovakia and is it a new problem?",
      "url": "https://www.dw.com/en/eu-prosecutor-third-of-vat-fraud-cases-linked-to-slovakia/a-75577538?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 12:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Germany-US rift is looming after a year of Trump",
      "description": "The second term of US President Donald Trump has brought unprecedented strain on once-solid German-American relations. The issue of Greenland could be a tipping point. DW looks back on a year of trans-Atlantic tensions.",
      "url": "https://www.dw.com/en/germany-us-rift-is-looming-after-a-year-of-trump/a-75562705?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 06:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Congolese soldiers reenter key eastern city after M23 rebels' withdrawal, army and residents say",
      "description": "Congolese soldiers and pro-government militia fighters have reentered the strategic town of Uvira",
      "url": "https://abcnews.go.com/International/wireStory/congolese-soldiers-reenter-key-eastern-city-after-m23-129363064",
      "published": "Mon, 19 Jan 2026 17:53:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting leader was once a DEA 'priority target': report",
      "description": "Venezuela's interim president Delcy Rodríguez was reportedly labeled a DEA \"priority target\" in 2022, appearing in intelligence files since at least 2018.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-leader-once-dea-priority-target-report",
      "published": "Sun, 18 Jan 2026 11:33:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump",
      "description": "Transatlantic relations aren't broken, though they are damaged. And if Europeans want to try to cut through with Trump, they'll have to stick together, writes Europe Editor Katya Adler",
      "url": "https://www.bbc.com/news/articles/c0lx7j1lrwro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 08:09:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ros Atkins on...President Trump's year in numbers",
      "description": "Executive orders, pardons, trips and Truth Social posts - the BBC’s Analysis Editor breaks down Donald Trump’s first year back in office, in numbers.",
      "url": "https://www.bbc.com/news/videos/cvgpr95npplo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 00:08:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Palestinian children's football pitch faces Israeli demolition ultimatum",
      "description": "The football club is ordered to remove the pitch, which Israel says was illegally built, or have it torn down.",
      "url": "https://www.bbc.com/news/articles/cjrz0j9p5jqo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 07:23:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Europe is at a total loss': Russia gloats over Greenland tensions",
      "description": "The BBC's Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump's desire to buy Greenland.",
      "url": "https://www.bbc.com/news/articles/c17zpvkddpzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 16:26:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bobi Wine tells the BBC from hiding he will not contest Uganda election results in court",
      "description": "The losing presidential candidate calls for \"peaceful change\", saying Uganda's judiciary is not independent.",
      "url": "https://www.bbc.com/news/articles/c394pk4p707o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 10:05:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland 'will stay Greenland', former Trump adviser declares",
      "description": "Donald Trump's former chief economic adviser said the US president's actions are a negotiating tactic.",
      "url": "https://www.bbc.com/news/articles/c98p6m0r53no?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 10:36:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ghana arrests Nigerians accused of running cyber-crime networks",
      "description": "There is a growing trend of foreigners being lured to Ghana under the pretext of lucrative work.",
      "url": "https://www.bbc.com/news/articles/cr4k35q6yr0o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 15:15:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's birth rate hits record low as population continues to shrink",
      "description": "Beijing has been trying hard to encourage more young people to marry and have children.",
      "url": "https://www.bbc.com/news/articles/c79r7v7qr53o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 07:12:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan PM Takaichi calls snap election three months after taking office",
      "description": "Sanae Takaichi, who took office last October, hopes the vote will give her a stronger mandate.",
      "url": "https://www.bbc.com/news/articles/c1dk0x0v6pdo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 12:00:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How the Syrian army pushed Kurdish-led forces out of oil-rich territory",
      "description": "In a lightning-fast offensive, the Syrian government has taken oil-rich territory long held by the Kurdish-led SDF.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/how-the-syrian-army-pushed-kurdish-led-forces-out-of-oil-rich-territory?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 13:51:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bobi Wine tells Al Jazeera he escaped police raid amid Uganda elections",
      "description": "Uganda’s opposition leader Bobi Wine says he escaped a raid on his home after a disputed presidential election.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/bobi-wine-tells-al-jazeera-he-escaped-police-raid-amid-uganda-elections?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 13:23:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Naomi Osaka’s outfit, entrance and win headline Australian Open day three",
      "description": "Former champion Osaka's walkout steals the show in Melbourne as holder Jannik Sinner eases into the second round.",
      "url": "https://www.aljazeera.com/sports/2026/1/20/naomi-osakas-outfit-entrance-and-win-headline-australian-open-day-three?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 12:45:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump undermines key allies UK and France before Davos visit",
      "description": "US president posts provocative messages on Greenland, Danish PM says sovereignty of Danish territory non-negotiable.",
      "url": "https://www.aljazeera.com/news/2026/1/20/trump-undermines-key-allies-uk-and-france-ahead-of-davos-visit?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 11:19:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel bulldozes UNRWA buildings in occupied East Jerusalem",
      "description": "The destruction comes as Israel clamps down on NGOs providing humanitarian aid to Palestinians in Gaza.",
      "url": "https://www.aljazeera.com/news/2026/1/20/israel-bulldozes-unrwa-buildings-in-occupied-east-jerusalem?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 09:45:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Manhunt for ISIL prisoners in Syria after fighting near jails",
      "description": "Syrian government forces have been searching for dozens of ISIL fighters who escaped prison.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/manhunt-for-isil-prisoners-in-syria-after-fighting-near-jails?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 08:47:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Chinese tourists shun Japan in wake of Taiwan invasion row",
      "description": "Number of high-spending Chinese tourists visiting Japan halved last month after PM said an invasion of Taiwan could spark Japanese military involvement Chinese tourism to Japan almost halved in December amid a bitter diplomatic row between Beijing and Tokyo over the security of Taiwan . The number of tourists from mainland China dropped by about 45% from the same month a year earlier to about 330,000, Japan’s transport ministry said on Tuesday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/chinese-japan-tourist-numbers-halve-wake-taiwan-invasion-row",
      "published": "Tue, 20 Jan 2026 04:58:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.247°W Depth 8.80 km (5.47 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-20T14:28:43.357Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 19 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.892°N 116.171°W Depth 3.01 km (1.87 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-20T14:27:00.593Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-20T03:35:57.734Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's birth rate fell to a record low last year despite attempts to boost it",
      "description": "Despite government efforts to boost fertility, China's birth rate fell to a record low in 2025.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5682326/chinas-birth-rate-fell-to-a-record-low-last-year-despite-attempts-to-boost-it",
      "published": "Tue, 20 Jan 2026 06:44:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's Board of Peace has several invited leaders trying to figure out how it'll work",
      "description": "It's unclear how many leaders have been asked to join the board, and the large number of invitations being sent out, including to countries that don't get along, has raised questions about the board's mandate and decision-making processes.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5682816/trumps-board-of-peace-has-several-invited-leaders-trying-to-figure-out-how-itll-work",
      "published": "Tue, 20 Jan 2026 06:01:23 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India tightened its egg donation rules, creating a vibrant black market for sellers",
      "description": "India radically tightened its rules on egg donation to make it altruistic, but that move triggered a vibrant black market for human eggs.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5653357/india-tightened-its-egg-donation-rules-creating-a-vibrant-black-market-for-sellers",
      "published": "Tue, 20 Jan 2026 04:49:13 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Norway says Trump cited Nobel loss when discussing Greenland",
      "description": "The prime minister of Norway says President Trump cited the Nobel Prize as a reason for not pursuing a peaceful resolution on Greenland.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5682119/norway-says-trump-cited-nobel-loss-when-discussing-greenland",
      "published": "Mon, 19 Jan 2026 16:20:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "High inflation in Nigeria weighs heavily on everyday life",
      "description": "Nigerians are grappling with rising inflation, particularly in food prices, driven by subsidy cuts. President Bola Tinubu's government hopes that such measures will improve the situation in the long term.",
      "url": "https://www.dw.com/en/high-inflation-in-nigeria-weighs-heavily-on-everyday-life/a-75503303?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 13:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How bringing back a humble algae to Arctic waters makes all the difference",
      "description": "For decades researchers in northern Norway had tried to bring back vital kelp forests after overfishing damaged marine ecosystems. Now a simple solution is proving successful.",
      "url": "https://www.dw.com/en/how-bringing-back-a-humble-algae-to-arctic-waters-makes-all-the-difference/a-75182003?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 10:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran's economic woes expose regime's tight grip",
      "description": "As religious elites and Revolutionary Guards strengthen their hold on the economy, experts question how long the regime can survive.",
      "url": "https://www.dw.com/en/iran-s-economic-woes-expose-regime-s-tight-grip/a-75567127?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 10:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "4 million kilos of potatoes given away for free in Berlin",
      "description": "As an initiative redistributes a bumper surplus of spuds, here's a look at the Germans' great love affair with the potato.",
      "url": "https://www.dw.com/en/4-million-kilos-of-potatoes-given-away-for-free-in-berlin/a-75524577?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 08:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Will Trump's 'board of peace' in Gaza really rival the UN?",
      "description": "PRESS REVIEW – Tuesday, January 20: Donald Trump's \"board of peace\" in Gaza aims to oversee the peace process between Israel and Hamas, but critics say he intends to create a rival body to the UN. Also, the Italian dailies pay tribute to the \"ultimate emperor\" of Italian fashion, Valentino, who has died aged 93. The Beckham family's disputes are the focus of the British tabloids. Finally, an Austrian cow proves that the animals are extremely intelligent.",
      "url": "https://www.france24.com/en/tv-shows/press-review/20260120-will-trump-s-board-of-peace-in-gaza-really-rival-the-un",
      "published": "Tue, 20 Jan 2026 12:14:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's first year back in office: Relationship between Europe and US 'changed forever'",
      "description": "As US President Donald Trump reaches the one-year mark of his second term in the White House, FRANCE 24's Oliver Farry looks back at his foreign policies and Washington's increasingly fraught relations with its European allies. Regardless of who succeeds Trump, \"the relationship between Europe and US is changed forever\", he said.",
      "url": "https://www.france24.com/en/trump-s-first-year-back-in-office-relationship-between-europe-and-us-changed-forever",
      "published": "Tue, 20 Jan 2026 10:20:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's extraordinary letter to Norway about Greenland - in full and fact-checked",
      "description": "The letter from US President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary.",
      "url": "https://news.sky.com/story/trumps-extraordinary-letter-to-norway-about-greenland-in-full-and-fact-checked-13496272",
      "published": "Mon, 19 Jan 2026 15:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "As Trump brands decision 'act of great stupidity' - what is in the Chagos Islands deal?",
      "description": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base.",
      "url": "https://news.sky.com/story/what-is-in-the-chagos-islands-deal-and-why-is-it-controversial-13496512",
      "published": "Tue, 20 Jan 2026 08:38:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's peace board invitation is a gift for Putin",
      "description": "So invading your neighbour is apparently no barrier to being an arbiter of peace.",
      "url": "https://news.sky.com/story/donald-trumps-peace-board-invitation-is-a-gift-for-vladimir-putin-but-it-will-disgust-ukraine-13496257",
      "published": "Mon, 19 Jan 2026 14:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What to know about the Chagos Islands as Trump slams the UK's sovereignty deal",
      "description": "President Trump has criticized a deal between Britain and Mauritius over the Chagos Islands, calling it \"an act of GREAT STUPIDITY.\"",
      "url": "https://abcnews.go.com/International/wireStory/chagos-islands-trump-slams-uks-sovereignty-deal-129375040",
      "published": "Tue, 20 Jan 2026 06:58:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK approves a ‘mega’ Chinese Embassy in London despite criticism of security risks",
      "description": "Britain's government has approved a massive new Chinese Embassy in central London",
      "url": "https://abcnews.go.com/International/wireStory/uk-approves-mega-chinese-embassy-london-despite-criticism-129374853",
      "published": "Tue, 20 Jan 2026 07:02:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ASEAN won't endorse election in military-ruled Myanmar, Malaysia says",
      "description": "Malaysia-s foreign minister says The Association of Southeast Asian Nations will not endorse elections in military-ruled Myanmar",
      "url": "https://abcnews.go.com/International/wireStory/asean-endorse-election-military-ruled-myanmar-malaysia-129373796",
      "published": "Tue, 20 Jan 2026 06:50:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marine Le Pen faces crucial Paris appeals trial over misuse of EU funds",
      "description": "Marine Le Pen's political future is uncertain as she faces an appeals trial in Paris",
      "url": "https://abcnews.go.com/International/wireStory/marine-le-pen-faces-crucial-paris-appeals-trial-129372031",
      "published": "Tue, 20 Jan 2026 01:21:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-husband charged in Ohio dentist murders allegedly tried to 'disguise' himself with fake information: expert",
      "description": "Ohio dentist double murder case takes turn as accused ex-husband allegedly used fake address and phone number to \"disguise\" himself before killings.",
      "url": "https://www.foxnews.com/us/ex-husband-charged-ohio-dentist-murders-allegedly-tried-disguise-himself-fake-information-expert",
      "published": "Tue, 20 Jan 2026 08:00:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Man stabbed, officer assaulted as fight breaks out after MLK Day parade in Los Angeles",
      "description": "Los Angeles Police respond to an alleged stabbing, and an officer was assaulted following the Martin Luther King Jr. parade as multiple fights broke out.",
      "url": "https://www.foxnews.com/us/man-stabbed-officer-assaulted-fight-breaks-out-after-mlk-day-parade-los-angeles",
      "published": "Tue, 20 Jan 2026 06:06:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Judge presiding over Tyler Robinson case urged to rein in defense delay tactics",
      "description": "Utah judge urged to crack down on defense delay tactics in Tyler Robinson case as legal analysts call motions \"frivolous\" in assassination charges.",
      "url": "https://www.foxnews.com/us/judge-presiding-over-tyler-robinson-case-urged-rein-defense-delay-tactics",
      "published": "Tue, 20 Jan 2026 06:00:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Retired South Carolina couple found dead in homicides at home",
      "description": "Beloved church members Larry and Sandra Moore found dead in their South Carolina home. The faithful couple described as \"backbones\" of their congregation.",
      "url": "https://www.foxnews.com/us/retired-south-carolina-couple-found-dead-homicides-home",
      "published": "Mon, 19 Jan 2026 14:55:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Charlie Kirk’s widow Erika Kirk demands speedy trial, alleging 'undue delay' from Tyler Robinson defense",
      "description": "In a court filing made public over the weekend, Erika Kirk's attorney notified the court that she is invoking her rights to a speedy trial as a victim under Utah law.",
      "url": "https://www.foxnews.com/us/charlie-kirk-widow-erika-kirk-demands-speedy-trial-alleging-undue-delay-from-tyler-robinson-defense",
      "published": "Mon, 19 Jan 2026 13:23:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump confirms he invited Putin to join his Board of Peace: 'He's been invited'",
      "description": "U.S. President Donald Trump on Monday confirmed Russian President Vladimir Putin was invited to the Board of Peace for supervision of the Gaza plan.",
      "url": "https://www.foxnews.com/world/trump-confirms-he-invited-putin-join-his-board-peace-hes-been-invited",
      "published": "Tue, 20 Jan 2026 02:40:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark ramps up defenses in Greenland as Trump zeros in on control of territory",
      "description": "Denmark deploys additional troops to Greenland after President Donald Trump claims the island is not secure from Russia or China.",
      "url": "https://www.foxnews.com/world/denmark-ramps-up-defenses-greenland-trump-zeros-control-territory",
      "published": "Mon, 19 Jan 2026 20:09:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}