{
  "last_updated": "2026-01-16T05:27:14.381077Z",
  "event_count": 221,
  "events": [
    {
      "title": "Security Council LIVE: UN raises alarm over deadly Iran protests and ‘possible military strikes’",
      "description": "The UN Security Council is meeting in New York in emergency session on Iran, amid escalating concern over reports that hundreds have been killed during weeks of nationwide anti-government protests. The meeting was requested by the United States. Demonstrations that began in late December, fuelled by soaring inflation, rising food prices and the collapse of the national currency, triggered a deadly and widespread crackdown with thousands injured and detained, according to numerous firsthand accounts. The UN has called for independent investigations into all killings and warned against the possible use of the death penalty against protesters. Follow live coverage below, and UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "Amnesty calls for global diplomatic action amid unprecedented mass killings to crush dissent",
      "description": "Amnesty International Iran Researcher Raha Bahreini paints a harrowing portrait of a nation under siege by its own government. Amid an internet blackout, reports of systemic, indiscriminate violence have emerged as part of a pattern of brutal repression aimed at crushing dissent. Through firsthand accounts and verified footage, Amnesty documents what it calls an “unprecedented scale” of lethal force and mass indiscriminate killings. As a \"militarised climate\" takes hold of the country, there are widespread reports of rooftop sniper attacks as bodies pile up at the morgues. It's calculated strategy is emerging not just to suppress, but to terrorize.",
      "url": "https://www.france24.com/en/amnesty-calls-for-global-diplomatic-action-amid-unprecedented-mass-killings-to-crush-dissent",
      "published": "Thu, 15 Jan 2026 20:23:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 53,
      "severity_level": "Critical"
    },
    {
      "title": "Brazilian cinema strikes gold, confronting harrowed past while captivating audiences worldwide",
      "description": "Brazil's cinematic renaissance can be attributed to cultural investment, international collaboration, and a country coming to terms with its authoritarian past. Nadia Massih welcomes France 24's correspondent in Rio de Janeiro Jan Onoszko to offer us a world of perspective on Brazil's 7th Art. The Secret Agent, winner of Two Golden Globes, touches on themes of dictatorship and paranoia, albeit in nuanced fashion, avoiding explicit historical references.",
      "url": "https://www.france24.com/en/video/20260115-brazilian-cinema-strikes-gold-confronting-harrowed-past-while-captivating-audiences-worldwide-1",
      "published": "Thu, 15 Jan 2026 21:56:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns of a world in chaos as impunity and unpredictability spreads",
      "description": "In his final annual address outlining his priorities, UN Secretary-General António Guterres warned that the world is “brimming with conflict, impunity, inequality and unpredictability” – even as international cooperation is fraying at the moment it is most needed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166772",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Security and ethnic dimensions of Iran crisis spark warnings across the region",
      "description": "Saudi Arabia, Qatar and Oman have led efforts to talk President Donald Trump out of a US attack on Iran, according to news reports. Turkey is also concerned about a collapse of central authority in Iran. FRANCE 24’s Leela Jacinto explains the ethnic dimension of security concerns in Middle East capitals.",
      "url": "https://www.france24.com/en/security-and-ethnic-dimensions-of-iran-crisis-spark-warnings-across-the-region",
      "published": "Thu, 15 Jan 2026 16:34:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Explosion and fire in Dutch city of Utrecht caused by gas leak, officials say",
      "description": "At least four people are injured and several buildings collapsed as a result.",
      "url": "https://www.bbc.com/news/articles/cm2xv0w07dgo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 22:48:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Will the US use cyberwarfare to ‘help’ Iranian protesters?",
      "description": "The United States has repeatedly said that it will send \"help\" to Iranian protesters as demonstrations across the country have led to the death of at least 3,428 people. As Iranian authorities use internet blackouts to quell dissent, the US may resort to cyberwarfare instead of physical strikes.",
      "url": "https://www.france24.com/en/asia-pacific/20260115-will-the-us-use-cyberwarfare-help-iranian-protesters",
      "published": "Thu, 15 Jan 2026 17:31:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Global employment stable but decent jobs in short supply",
      "description": "Global unemployment remains stable, but progress toward decent work has stalled, according to a new report from the International Labour Organization (ILO), which warns that young people continue to struggle in a job market which risks being further undermined by AI and trade policy uncertainty.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166751",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "At least 32 killed as crane collapses on train in Thailand",
      "description": "Crane in use on high-speed rail project hits passing train, causing it to derail At least 32 people in Thailand have been killed and scores injured after a crane collapsed on to a passenger train and derailed it, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars and smoke rising from the wreckage of the train below. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths",
      "published": "Wed, 14 Jan 2026 15:44:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Trump threatens Insurrection Act as protests spread in Minnesota",
      "description": "US President Donald Trump threatened to activate the Insurrection Act to send military forces to Minnesota as protests escalated after federal agents shot and wounded a man and, days earlier, fatally shot a woman during immigration enforcement actions. Demonstrators condemned the use of force and broad federal immigration raids.",
      "url": "https://www.france24.com/en/americas/20260116-trump-insurrection-minnesota-protests",
      "published": "Fri, 16 Jan 2026 01:09:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Floods in South Africa force evacuations from famed Kruger National Park; 19 dead in other regions",
      "description": "Flooding caused by weeks of torrential rains in northern South Africa has forced the famed Kruger National Park to suspend visits and evacuate some guests and staff members",
      "url": "https://abcnews.go.com/International/wireStory/floods-south-africa-force-evacuations-famed-kruger-national-129243140",
      "published": "Thu, 15 Jan 2026 10:25:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "G7 threatens Iran with new sanctions over nationwide protest crackdown killing thousands",
      "description": "Iran protests death toll reaches over 2,400, according to Human Rights Activist News Agency as G7 foreign ministers warn of new sanctions over regime's violent response.",
      "url": "https://www.foxnews.com/world/g7-threatens-iran-new-sanctions-nationwide-protest-crackdown-killing-thousands",
      "published": "Wed, 14 Jan 2026 15:22:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "'What will Trump and Board of Peace do to empower Palestinian technocratic committee?'",
      "description": "The announcement of the ceasefire's second phase marked a significant step forward but left many questions unanswered. Those include the makeup of a proposed, apolitical governing committee of Palestinian experts and an international “Board of Peace.\" For in-depth analysis and deeper perspective, Nadia Massih welcomes Yezid Sayigh, Senior Fellow at the Malcolm H. Kerr Carnegie Middle East Center in Beirut. He challenges the Board of Peace to 'put its politics where its mouth is' and reminds us that phase 1 has yet to be fully implemented.",
      "url": "https://www.france24.com/en/what-will-trump-and-board-of-peace-do-to-empower-palestinian-technocratic-committee",
      "published": "Thu, 15 Jan 2026 17:05:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "‘A torture that never stops’: Sri Lanka failing survivors of conflict sexual violence, UN says",
      "description": "Conflict-related sexual violence in Sri Lanka remains largely unaddressed more than 15 years after the end of the civil war, with survivors still denied justice, recognition and reparations, according to a new report by the UN human rights office, OHCHR, on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166755",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Turkey says Syria using force is an option against US-backed fighters who helped defeat ISIS",
      "description": "Syria conflict escalates as Turkey warns Damascus may use force against Kurdish SDF fighters after deadly clashes near Aleppo reportedly killed 23.",
      "url": "https://www.foxnews.com/world/turkey-says-syria-using-force-option-against-us-backed-fighters-who-helped-defeat-isis",
      "published": "Thu, 15 Jan 2026 14:48:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Trump administration ends temporary protected status for Somalis in US",
      "description": "Critics condemn ‘bigoted attack’ as Trump bids to revoke citizenship of naturalized immigrants convicted of fraud The Trump administration is terminating temporary protected status (TPS) for Somalis living in the United States, giving hundreds of people two months to leave the country or face deportation. The homeland security secretary, Kristi Noem , said in a statement that conditions in the east African country had improved sufficiently and that Somalis no longer qualified for the designation under federal law. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/13/trump-administration-ends-tps-somalia",
      "published": "Tue, 13 Jan 2026 22:59:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's protests appear increasingly smothered after a deadly crackdown",
      "description": "The nationwide protests challenging Iran's theocracy appear increasingly smothered a week after authorities shut the country off from the world and escalated a bloody crackdown.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5678539/iran-protests-trump",
      "published": "Thu, 15 Jan 2026 11:56:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "ISS crew returns to Earth in first-ever medical evacuation",
      "description": "For the first time in the International Space Station's history, NASA safely returned a crew of four astronauts to Earth ahead of schedule due to medical issues affecting one of the group.",
      "url": "https://www.dw.com/en/iss-crew-returns-to-earth-in-first-ever-medical-evacuation/a-75517587?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 11:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "WFP warns Sudan food aid could run out in March",
      "description": "The World Food Programme (WFP) said on Thursday that it is struggling to keep emergency operations running in Sudan, where more than 1,000 days of war have pushed families to the brink.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166766",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: A ceasefire that still kills children is not enough, says UNICEF",
      "description": "Airstrikes, drone attacks and hypothermia continue in Gaza despite the ceasefire, with more than 100 youngsters killed since early October, the UN Children’s Fund (UNICEF) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166750",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Storms worsen already dire humanitarian situation, UN warns",
      "description": "The humanitarian crisis across the Gaza Strip remains extremely serious, with harsh winter weather threatening to reverse recent gains in aid delivery, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166747",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "NASA brings astronauts home early after health issue in first-ever evacuation",
      "description": "NASA completed its first-ever medical evacuation from space, bringing four astronauts back to Earth early after a health issue aboard the International Space Station.",
      "url": "https://www.foxnews.com/us/nasa-brings-astronauts-home-early-after-health-issue-first-ever-evacuation",
      "published": "Thu, 15 Jan 2026 04:27:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "'Negotiating down barrel of a gun': Greenland seeks US cooperation on trade, investment, mining",
      "description": "The recent White House meeting between officials from Greenland, Denmark and the US highlights the island’s delicate balancing act. Historical ties, modern aspirations, and the projection of global power are playing out in the Arctic, where climate, commerce, and sovereignty are tightly interwoven. Greenland stands firm in the face of an encroaching superpower. It is “not for sale, but open for business,” says Ulrik Pram Gad, Senior Researcher at Danish Institute for International Studies (DIIS)",
      "url": "https://www.france24.com/en/video/20260115-negotiating-down-barrel-of-a-gun-greenland-seeks-us-cooperation-on-trade-investment-mining-1",
      "published": "Thu, 15 Jan 2026 23:29:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Ukrainians facing bitter cold of -15C after Russia's repeated strikes on energy supplies",
      "description": "Ukrainians are facing -15C with no power to warm them as President Volodymyr Zelenskyy said he would declare a state of emergency in the energy sector.",
      "url": "https://news.sky.com/story/ukrainians-facing-bitter-cold-of-15c-after-russias-repeated-strikes-on-energy-supplies-13494568",
      "published": "Thu, 15 Jan 2026 10:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN World Court begins landmark hearings on Rohingya genocide case against Myanmar",
      "description": "Public hearings opened on Monday at the International Court of Justice (ICJ) in a landmark case brought by the Gambia against Myanmar, alleging violations of the Genocide Convention over the military’s treatment of the Rohingya minority.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166746",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Multiple people killed after construction crane falls, derails train in Thailand",
      "description": "A deadly construction accident unfolded in northeastern Thailand when a crane collapsed onto a moving passenger train, officials said.",
      "url": "https://www.foxnews.com/world/multiple-people-killed-after-construction-crane-falls-derails-train-thailand",
      "published": "Wed, 14 Jan 2026 03:07:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Federal agent shoots man in leg after Minneapolis shovel attack, officials say",
      "description": "The incident comes as President Donald Trump threatens to use the Insurrection Act on protesters.",
      "url": "https://www.bbc.com/news/articles/c205677pxvxo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:22:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "International Space Station astronauts back on Earth after first ever emergency return",
      "description": "An astronaut who had a \"serious medical condition\" onboard the International Space Station is safely back on Earth, after the first-ever emergency return space flight.",
      "url": "https://news.sky.com/story/international-space-station-astronauts-back-after-first-ever-emergency-return-13494628",
      "published": "Thu, 15 Jan 2026 12:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Escalating fighting in Sudan, displacement in Syria’s Aleppo, $1.5 billion appeal for South Sudan",
      "description": "More civilians in Sudan continue to be killed and displaced as fighting escalates in multiple parts of the country, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166756",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: ‘The killing of peaceful demonstrators must stop,’ UN rights chief says",
      "description": "As anti-government demonstrations continue across Iran, the UN human rights chief said on Tuesday that he was horrified at the mounting violence directed by security forces against protestors, with reports of hundreds killed and thousands arrested.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166752",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Armed Kurdish fighters try to breach Iran border as regional threat grows amid protests: reports",
      "description": "Turkey's intelligence agency, MIT, warned Iran's Revolutionary Guard about Kurdish fighters trying to cross the Iran-Iraq border during ongoing government crackdowns.",
      "url": "https://www.foxnews.com/world/kurdish-fighters-try-exploit-iran-chaos-regional-threat-grows-amid-nationwide-protests",
      "published": "Wed, 14 Jan 2026 20:44:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran shuts down airspace; foreign officials warn against travel to Israel",
      "description": "Iran closes airspace to most flights amid rising U.S. tensions. Trump says Iranian protest killings have stopped, but military officials reportedly warned an attack was imminent.",
      "url": "https://www.foxnews.com/world/iran-shuts-down-airspace-foreign-officials-warn-against-travel-israel",
      "published": "Wed, 14 Jan 2026 18:54:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Blankets, batteries, fires: How Kyiv is surviving an icy winter as Russia attacks its energy grid",
      "description": "Russia has deliberately attacked Ukraine's energy grid, as sub-zero temperatures take hold. Many are without power, heating or water so locals in Kyiv have been sharing their solutions for staying warm.",
      "url": "https://www.dw.com/en/blankets-batteries-fires-how-kyiv-is-surviving-an-icy-winter-as-russia-attacks-its-energy-grid/a-75525775?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 18:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine war: UN appeals for $2.3 billion to support aid teams’ ‘heroic work’",
      "description": "Amid ongoing and intensifying Russian attacks across Ukraine, the UN on Tuesday launched a $2.3 billion humanitarian appeal for 2026 to support 4.1 million of the country’s most vulnerable people.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166749",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Deadly Russian strikes push civilians deeper into winter crisis",
      "description": "Ukraine has entered the new year under intensifying and deadly Russian attacks which have crippled energy systems and left millions without heating, electricity or water amid freezing temperatures, senior UN officials told the Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166748",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Agitators attack federal agents in Minneapolis after second ICE-involved shooting and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/agitators-attack-federal-agents-minneapolis-after-second-ice-involved-shooting-more-top-headlines",
      "published": "Thu, 15 Jan 2026 06:57:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Israel kills 10 in Gaza as US declares phase two of ceasefire deal launched",
      "description": "Israeli forces carry out various attacks across the war-torn enclave, including hits on family homes in Deir el-Balah.",
      "url": "https://www.aljazeera.com/news/2026/1/15/israel-kills-six-in-gaza-as-us-declares-phase-two-of-peace-plan-launched?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 21:40:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran's regime crushing protests in bloody crackdown",
      "description": "Protesters are putting their lives on the line in Iran as the state mounts a coordinated and brutal response to the unrest. As the death toll grows, hopes of outside help seem faint.",
      "url": "https://www.dw.com/en/iran-s-regime-crushing-protests-in-bloody-crackdown/a-75524677?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 16:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Live: White House says Iran halted 800 executions, warns all options remain on table",
      "description": "A White House spokesperson said Thursday that Iran had backed away from plans to execute 800 protesters following intervention threats from President Donald Trump, but warned that “all options” remain on the table for the United States. Follow our liveblog for all the latest developments.",
      "url": "https://www.france24.com/en/asia-pacific/20260116-live-the-white-house-says-iran-has-suspended-800-executions",
      "published": "Fri, 16 Jan 2026 03:56:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Death of Renee Good: How AI was used to falsely identify the ICE agent who shot her",
      "description": "In the aftermath of Renee Good's death during an immigration raid in Minnesota, an internet manhunt began to identify the ICE agent. Using artificial intelligence, internet users 'unmasked' the officer at the scene and falsely identified him, triggering threats and vitriol towards 2 unrelated people with that name. Vedika Bahl explains in Truth or Fake.",
      "url": "https://www.france24.com/en/tv-shows/truth-or-fake/20260115-death-of-renee-good-how-ai-falsely-identified-the-ice-agent-who-shot-her",
      "published": "Thu, 15 Jan 2026 20:29:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Pope consoles families of young Italian victims of New Year's Swiss Alps bar fire",
      "description": "Pope Leo XIV has consoled families of Italian teenagers killed or injured in the Swiss bar fire at a New Year's party",
      "url": "https://abcnews.go.com/International/wireStory/pope-seeks-console-families-young-italian-victims-new-129238234",
      "published": "Thu, 15 Jan 2026 08:52:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Bodies of 32 Cuban officers killed during US strike on Venezuela repatriated",
      "description": "The bodies of 32 Cuban officers killed during a stunning U.S. attack on Venezuela have been repatriated o their homeland",
      "url": "https://abcnews.go.com/International/wireStory/bodies-32-cuban-officers-killed-us-strike-venezuela-129238243",
      "published": "Thu, 15 Jan 2026 08:50:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "S Korean firefighters tackle huge blaze in last of Seoul’s ‘shanty towns’",
      "description": "No casualties reported as huge fire breaks out in makeshift homes on fringe of Seoul's upmarket Gangnam district.",
      "url": "https://www.aljazeera.com/news/2026/1/16/south-korean-firefighters-tackle-huge-blaze-in-seouls-last-shanty-town?traffic_source=rss",
      "published": "Fri, 16 Jan 2026 04:41:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Australia news live: Christian and Muslim faith leaders express ‘deep concerns’ about Labor bill’s impact on free speech",
      "description": "Plea comes amid standoff between Albanese government, Coalition and Greens over bill. Follow the latest updates live Could Labor’s hate speech laws damage Australia’s free speech? Here’s what you need to know about the contentious bill Get our breaking news email , free app or daily news podcast Larissa Waters , the Greens’ leader, also says she’s concerned there has not been enough time to evaluate the legislation, warning there are a “raft of unintended consequences that could occur”. Waters told RN Breakfast: We’ve only had a handful of days to look at this legislation, and it’s very consequential legislation … And with every turn, experts and stakeholders and faith leaders and academics are finding new concerns with it. A key concern is that you can’t combat hate if you don’t combat it for everyone. A key concern that we have … is that these laws, as they’re drafted right now, could be weaponised to shut down legitimate political protest. Given the tightness of the timeframe … there is a real risk that locking in laws that aren’t right could criminalise people for legitimate political expression. That is a dangerous path. We’ve got serious concerns with respect to whether or not the bill meets its objective … It really is concerning that we’re in this stage where we’re less than one business day away from parliament coming together and these serious concerns persist. We’re in a situation where we’re dealing with such a significant piece of legislation, complicated legislation, legislation which deals with the raft of matters which are contained in this one monster omnibus bill, which is a totally inappropriate way to address this situation. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/16/hate-speech-legislation-political-reaction-anthony-albanese-labor-sussan-ley-coalition-greens-adelaide-festival-writers-week-backlash-sydney-protest-ban-ntwnfb",
      "published": "Fri, 16 Jan 2026 05:09:54 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Why the change of heart? Trump dials down threats of strikes against Iran",
      "description": "Donald Trump had started his Wednesday pondering military strikes before pouring cold water on the concept, even expressing doubts that Iranians would accept as leader the late Shah’s son. More on that with our panel. In a sign of how fast a news cycle can flip, Iran’s foreign minister expressing his assurances in English on Trump-friendly Fox News. After a ruthless response to nationwide protest, has the Islamic Republic once again seen off an existential challenge?",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260115-why-the-change-of-heart-trump-dials-down-threats-of-strikes-against-iran",
      "published": "Thu, 15 Jan 2026 19:19:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE threat spray-painted on vehicle believed to be used by federal officers during Minneapolis unrest",
      "description": "Minneapolis rioters vandalized vehicles with anti-ICE messages and threats after a federal agent shot an illegal immigrant during an alleged ambush.",
      "url": "https://www.foxnews.com/us/anti-ice-threat-spray-painted-vehicle-believed-used-federal-officers-during-minneapolis-unrest",
      "published": "Thu, 15 Jan 2026 12:02:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran pushes for fast trials and executions of suspects detained in protests despite Trump's warning: report",
      "description": "Iran chief justice Gholamhossein Mohseni-Ejei calls for fast trials and executions of suspects in ongoing anti-government demonstrations, a report said.",
      "url": "https://www.foxnews.com/world/iran-pushes-fast-trials-executions-suspects-detained-protests-despite-trumps-warning-report",
      "published": "Wed, 14 Jan 2026 11:05:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "How Trump's 'America First' is upending the world order",
      "description": "President Trump is dismantling the global system the U.S. built in the 20th century. Foreign policy experts say he wants a world that looks more like the 19th century.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5667212/how-trumps-america-first-is-upending-the-world-order",
      "published": "Wed, 14 Jan 2026 16:54:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump to meet Venezuela opposition leader Machado at White House",
      "description": "President Donald Trump is set to meet Thursday at the White House with Venezuelan opposition leader María Corina Machado, whose political party is widely considered to have won 2024 elections rejected by then-President Nicolás Maduro before the United States captured him in an audacious military raid this month. Details and analysis by Kethevane Gorjestani, FRANCE 24 international affairs editor.",
      "url": "https://www.france24.com/en/trump-to-meet-venezuela-opposition-leader-machado-at-white-house",
      "published": "Thu, 15 Jan 2026 16:19:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "FBI arrests suspect after federal courthouse in Minneapolis windows smashed",
      "description": "The FBI arrested a man accused of smashing federal courthouse windows during a violent protest in Minneapolis on Jan. 7 in the wake of Renee Good's death.",
      "url": "https://www.foxnews.com/us/fbi-arrests-suspect-after-federal-courthouse-minneapolis-windows-smashed",
      "published": "Thu, 15 Jan 2026 15:41:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "South Africa braces for more rain as Kruger National Park is evacuated due to deadly flooding",
      "description": "South Africa's most renowned national reserve has shut its gates amid escalating floodwaters and heavy rainfall, which has already claimed at least 19 lives.",
      "url": "https://www.dw.com/en/south-africa-braces-for-more-rain-as-kruger-national-park-is-evacuated-due-to-deadly-flooding/a-75525640?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 18:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Syria: The man behind the mission to heal decade-old wounds in the Sunni majority",
      "description": "Since Bashar al-Assad was toppled in December 2024, one of the huge challenges the new government has faced is that of division. Syrian society is made up of different sectarian and ethnic groups -- the Alawites, the Kurds, the Druze... -- but division also exists within the country’s biggest group: the Sunni Muslim majority. Our terrorism expert, Wassim Nasr, travelled to Syria last month and tells us what he learnt about this nascent new government led by ex-jihadist Ahmad al-Sharaa.",
      "url": "https://www.france24.com/en/syria-the-man-behind-the-mission-to-heal-decade-old-wounds-in-the-sunni-majority",
      "published": "Thu, 15 Jan 2026 16:34:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "11-year streak of record global warming continues, UN weather agency warns",
      "description": "The past 11 years have been the warmest in the modern era, while oceans continue to heat up, too, says the UN weather agency.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166758",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Increase taxes on sugary drinks and alcohol to save lives, urges WHO",
      "description": "Beverages like sugary drinks and alcohol are too accessible and cost too little in most of the world – helping fuel obesity, diabetes, cancer and injury, the World Health Organization (WHO) warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166754",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Ethiopia says seized ammunition sent by Eritrea to rebels as tensions rise",
      "description": "Eritrea denies the claim and accuses Ethiopia of seeking a pretext to attack, amid fears of renewed conflict.",
      "url": "https://www.bbc.com/news/articles/czr46ypzl4yo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:57:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Cuba pays tribute to 32 soldiers killed in US attack on Venezuela",
      "description": "Cuban president says soldiers fell defending 'sovereignty of a sister nation' amid escalating tensions with Washington.",
      "url": "https://www.aljazeera.com/news/2026/1/15/cuba-pays-tribute-to-soldiers-killed-in-us-attack-on-venezuela?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 19:23:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Andean artist Antonio Paucar wins Artes Mundi prize in Wales",
      "description": "Artist and beekeeper who highlights eco crisis plans to spend £40,000 award on building cultural centre in Peru An artist and beekeeper from a remote corner of the Andes has won one of the UK’s most prestigious contemporary arts awards and plans to spend the £40,000 prize on building a cultural centre in the Peruvian mountains. Antonio Paucar was declared the winner of the biennial Artes Mundi prize after presenting work ranging from a spiral made of alpaca wool to a video of him writing a poem – in his own blood – about the environmental crisis facing his region as he sits at a table high in the mountains. Continue reading...",
      "url": "https://www.theguardian.com/artanddesign/2026/jan/15/antonio-paucar-andes-peru-wins-artes-mundi-prize-wales",
      "published": "Thu, 15 Jan 2026 20:00:49 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Civilians flee on foot as Syrian military offensive looms east of Aleppo",
      "description": "A trickle of civilians has left a contested area east of Aleppo after a Syrian military warning to evacuate",
      "url": "https://abcnews.go.com/International/wireStory/civilians-flee-foot-syrian-military-offensive-looms-east-129243691",
      "published": "Thu, 15 Jan 2026 10:35:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Rights group warns on failure to deliver justice after sectarian killings in Syria's Sweida",
      "description": "Human Rights Watch criticizes the Syrian government for lacking accountability in sectarian violence",
      "url": "https://abcnews.go.com/International/wireStory/rights-group-warns-failure-deliver-justice-after-sectarian-129234740",
      "published": "Thu, 15 Jan 2026 06:58:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar’s Rohingya people called ‘Muslim dogs’ before attacks, ICJ hears",
      "description": "Hearings continued on Thursday at the UN’s top court into the Gambia’s claim that Myanmar committed genocide against the Rohingya people, with allegations that military officials incited violence through hate speech, calling the ethnic minority “Muslim dogs” who should be made “extinct”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166764",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iran appears to reopen airspace after Trump says killing is 'stopping'",
      "description": "Iran appeared to reopen its airspace after a sudden overnight closure disrupted regional flights amid ongoing security warnings and mounting regional tensions.",
      "url": "https://www.foxnews.com/world/iran-appears-reopen-airspace-after-trump-says-killing-stopping",
      "published": "Thu, 15 Jan 2026 08:19:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia losing 'massive' 25,000 troops monthly in Ukraine as war grinds on, NATO chief says",
      "description": "Russia's \"massive\" military losses in Ukraine are unsustainable, NATO's secretary general warned with the conflict about to enter its fourth year with no clear end in sight.",
      "url": "https://www.foxnews.com/world/russia-losing-massive-25000-troops-monthly-ukraine-war-grinds-on-nato-chief-mark-rutte-says",
      "published": "Wed, 14 Jan 2026 14:38:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iran judiciary denies plan to execute detained protester Erfan Soltani",
      "description": "The judiciary says Soltani is not facing charges carrying the death penalty, while a rights group reports that the execution has been \"postponed\".",
      "url": "https://www.bbc.com/news/articles/cp80zjx091yo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 19:15:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela regime claims release of political prisoners is sign of new era",
      "description": "NGOs estimate that there are still close to 1,000 political prisoners in Venezuela despite claims by new leaders Venezuela’s acting president has claimed that the regime’s release of political prisoners sent a “very clear message” that the country was “opening up to a new political moment”, days after the seizure and rendition of the dictator Nicolás Maduro. Delcy Rodríguez also vowed to continue the releases and accused NGOs that have described the process as slow and opaque of “lying to the world and trying to sell falsehoods about Venezuela”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/venezuelan-political-prisoners-released",
      "published": "Wed, 14 Jan 2026 19:25:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Korean prosecutors demand death penalty for former president Yoon Suk Yeol",
      "description": "Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol",
      "published": "Wed, 14 Jan 2026 00:43:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "East Jerusalem: Forced shutdown of UN clinic signals escalating disregard for international law",
      "description": "The temporary closure of a UN-run health centre in East Jerusalem is the latest phase in “a pattern of deliberate disregard” for international law, the head of the UN agency that assists Palestine refugees, UNRWA, said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166760",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Tanzania president remorseful over internet shutdown on election day",
      "description": "Tanzania’s president has, for the first time since the disputed October election, commented on a six-day internet shutdown that disrupted operations as the country went through its worst postelection violence",
      "url": "https://abcnews.go.com/International/wireStory/tanzania-president-remorseful-internet-shutdown-election-day-129255144",
      "published": "Thu, 15 Jan 2026 16:41:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Florida teens buried alive in deadly sand tunnel collapse",
      "description": "Two 14-year-old best friends died when a sandpit collapsed on them at a Florida beach near Tampa. The boys were reportedly digging for fun.",
      "url": "https://www.foxnews.com/us/florida-teens-buried-alive-deadly-sand-tunnel-collapse",
      "published": "Thu, 15 Jan 2026 19:45:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Rift at top of the Taliban: BBC reveals clash of wills behind internet shutdown",
      "description": "The Taliban leader once warned of a split: A BBC investigation reveals how attitudes to women, the internet and religion are dividing the group at the very top.",
      "url": "https://www.bbc.com/news/articles/cg7vdpy1l2vo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 06:05:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "UN Security Council holds emergency meeting on deadly protests in Iran",
      "description": "Iran, the US and Iranian civil society spoke about the deadly protests which have been obscured by an internet blackout.",
      "url": "https://www.aljazeera.com/news/2026/1/16/un-security-council-holds-emergency-meeting-on-deadly-protests-in-iran?traffic_source=rss",
      "published": "Fri, 16 Jan 2026 02:44:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "British indie band Pulp agree to play Adelaide festival after boycott U-turn",
      "description": "The band pulled out over treatment of Randa Abdel-Fattah but delayed revealing their decision before confirming 27 February gig Get our breaking news email , free app or daily news podcast The British indie band Pulp will play at the Adelaide festival in February after initially pulling out of the event in protest at the cancellation of Palestinian writer Randa Abdel-Fattah. The band issued a statement on social media on Thursday night announcing that they would “honour our invitation to perform in Adelaide on 27 February” after the festival organisers performed a U-turn, apologised to Abdel-Fattah for her treatment and invited her to speak at next year’s event. Continue reading...",
      "url": "https://www.theguardian.com/culture/2026/jan/15/british-indie-band-pulp-agree-to-play-adelaide-festival-after-boycott-u-turn",
      "published": "Thu, 15 Jan 2026 12:36:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Zelenskyy declares energy emergency in cold snap",
      "description": "Ukraine's president declared an emergency in the energy sector amid freezing weather and Russian strikes on infrastructure. Meanwhile, Donald Trump blamed Kyiv for the lack of peace talk progress.",
      "url": "https://www.dw.com/en/ukraine-zelenskyy-declares-energy-emergency-in-cold-snap/live-75517611?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 12:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump says Gaza ‘board of peace’ formed as ceasefire enters next phase",
      "description": "US President Donald Trump said on Thursday he had formed a Gaza “board of peace,” a phase two element of a US-backed plan to end the war in the Palestinian territory. Trump said members would be announced shortly and the body would oversee a Palestinian technocratic committee managing post-war Gaza.",
      "url": "https://www.france24.com/en/middle-east/20260116-trump-board-of-peace-gaza",
      "published": "Fri, 16 Jan 2026 00:37:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US court ruling puts pro-Palestinian activist Mahmoud Khalil back at risk of detention",
      "description": "Mahmoud Khalil, a Columbia University graduate and pro-Palestinian activist, suffered a legal setback on Thursday that could lead to his rearrest. Khalil, previously detained for three months over campus protests against Israel’s war in Gaza, has been targeted by the Trump administration, which accuses him of disseminating Hamas propaganda.",
      "url": "https://www.france24.com/en/americas/20260116-us-court-pro-palestinian-activist-mahmoud-khalil-detention",
      "published": "Fri, 16 Jan 2026 00:05:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Denmark warns of 'fundamental disagreements' over Greenland after White House talks",
      "description": "The UK has deployed a military officer to Greenland as Denmark and its European allies seek to counter Donald Trump's threats to take the territory, after talks at the White House ended with \"fundamental disagreement\".",
      "url": "https://news.sky.com/story/denmark-says-fundamental-disagreement-remains-with-trump-but-agrees-to-high-level-talks-over-greenland-13494401",
      "published": "Wed, 14 Jan 2026 22:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand suffers another construction accident just a day after rail tragedy that killed 32",
      "description": "A new construction accident near Bangkok has occurred just 24 hours after a deadly train accident in another part of Thailand",
      "url": "https://abcnews.go.com/International/wireStory/thailand-suffers-construction-accident-day-after-rail-tragedy-129230897",
      "published": "Thu, 15 Jan 2026 01:05:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "UCLA DEI director says he was fired over controversial Charlie Kirk posts: 'Glad when bigots die'",
      "description": "UCLA fires DEI director after controversial social media posts about Charlie Kirk's death, former employee says. Johnathan Perkins claims First Amendment violation, plans lawsuit.",
      "url": "https://www.foxnews.com/us/ucla-dei-director-says-he-fired-over-controversial-charlie-kirk-posts-glad-when-bigots-die",
      "published": "Thu, 15 Jan 2026 12:17:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Passenger’s Wi-Fi name triggers bomb scare, forces Turkish Airlines emergency landing",
      "description": "Turkish Airlines flight makes emergency landing in Barcelona after passenger creates hoax bomb threat using Wi-Fi hotspot name. No explosives found.",
      "url": "https://www.foxnews.com/world/passengers-wi-fi-name-triggers-bomb-scare-forces-turkish-airlines-emergency-landing",
      "published": "Thu, 15 Jan 2026 22:01:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US sending military assets to Middle East as Trump weighs Iran strike, sources say",
      "description": "A U.S. military aircraft carrier is in motion toward the Middle East amid rising tensions against the Iranian regime, well-placed military sources have confirmed to Fox News.",
      "url": "https://www.foxnews.com/world/us-sending-military-assets-middle-east-trump-weighs-iran-strike-sources-say",
      "published": "Thu, 15 Jan 2026 16:15:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Tragic death of Adichie's young son highlights poor state of Nigeria's health sector",
      "description": "Novelist Chimamanda Ngozi Adichie says her child's death was caused by medical negligence, which the hospital denies.",
      "url": "https://www.bbc.com/news/articles/c2d70kx6nn3o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 00:04:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UK is taking political prisoners to evade accountability for genocide",
      "description": "The use of anti-terror law against Palestine Action aims to block scrutiny of the UK’s role in Gaza's devastation.",
      "url": "https://www.aljazeera.com/opinions/2026/1/15/the-uk-is-taking-political-prisoners-to-evade-accountability-for-genocide?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:39:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Explosion damages homes and injures at least 4 in the Netherlands",
      "description": "An explosion in a residential street in Utrecht, Netherlands, has caused a blaze and widespread damage",
      "url": "https://abcnews.go.com/International/wireStory/explosion-damages-homes-injures-4-netherlands-129248326",
      "published": "Thu, 15 Jan 2026 22:57:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Illegal immigrant indicted in alleged assault on ICE agents in Texas",
      "description": "A Honduran national in the U.S. illegally is accused of assaulting federal immigration agents during a Texas traffic stop before fleeing on foot.",
      "url": "https://www.foxnews.com/us/illegal-immigrant-indicted-assault-ice-agents-texas",
      "published": "Thu, 15 Jan 2026 12:36:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "BTS announces return with new world tour in 2026 and 2027",
      "description": "K-pop band to start tour in April after nearly four-year hiatus due to all seven members needing to complete South Korea’s mandatory military service The BTS comeback is upon us: the K-pop septet has announced a 2026-2027 world tour, kicking off in South Korea in April and running through to March 2027 with more than 70 dates across Asia, North America, South America, Australia and Europe. The tour marks the group’s first headline performances since their 2021–22 Permission to Dance on Stage tour. 9 April and 11-12 April – Goyang, South Korea 17-18 April – Tokyo 25-26 April – Tampa, Florida 2-3 May – El Paso, Texas 7 May and 9-10 May – Mexico City 16-17 May – Stanford, California 23-24 and 27 May – Las Vegas 12-13 June – Busan, South Korea 26-27 June – Madrid 1-2 July – Brussels 6-7 July – London 11-12 July – Munich 17-18 July – Paris 1-2 Aug – East Rutherford, New Jersey 5-6 Aug – Foxborough, Massachusetts 10-11 Aug – Baltimore 15-16 Aug – Arlington, Texas 22-23 Aug – Toronto 27-28 Aug – Chicago 1-2 Sept and 5-6 Sept – Los Angeles 2-3 Oct – Bogotá, Colombia 9-10 Oct – Lima, Peru 16-17 Oct – Santiago, Chile 23-24 Oct – Buenos Aires, Argentina 28 Oct and 30-31 Oct – São Paulo 19 Nov and 21-22 Nov – Kaohsiung, Taiwan 3 Dec and 5-6 Dec – Bangkok 12-13 Dec – Kuala Lumpur, Malaysia 17 Dec, 19-20 Dec and 22 Dec – Singapore 26-27 Dec – Jakarta 12-13 Feb – Melbourne, Australia 20-21 Feb – Sydney 4 March and 6-7 March – Hong Kong 13-14 March – Manila, Philippines Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/14/bts-announces-return-with-new-world-tourm-includin-in-2026-and-2027",
      "published": "Wed, 14 Jan 2026 00:40:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "‘Not regulated’: launch of ChatGPT Health in Australia causes concern among experts",
      "description": "Calls for clear guardrails and consumer education before wider rollout of OpenAI’s health advice platform Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A 60-year-old man with no history of mental illness presented at a hospital emergency department insisting that his neighbour was poisoning him. Over the next 24 hours he had worsening hallucinations, and tried to escape the hospital. Doctors eventually discovered the man was on a daily diet of sodium bromide, an inorganic salt mainly used for industrial and laboratory purposes including cleaning and water treatment. Continue reading...",
      "url": "https://www.theguardian.com/technology/2026/jan/15/chatgpt-health-ai-chatbot-medical-advice",
      "published": "Thu, 15 Jan 2026 14:00:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "A ‘ghoulish reminder’ to be knocked down or a memorial to the dead: council debates future of Bondi footbridge",
      "description": "Waverley to consult with NSW government, the families of victims and the Jewish community over whether bridge should be pulled down Get our breaking news email , free app or daily news podcast The future of the Bondi footbridge has been placed on hold after a meeting of Waverley council heard it was “really upsetting” that the matter had ignited such fierce public debate. The future of the heritage-listed pedestrian footbridge used by the alleged Bondi attackers was on the agenda of Thursday evening’s extraordinary meeting called to discuss a range of matters a month after the tragedy. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/future-of-the-bondi-footbridge-undecided-after-council-agrees-to-consider-options-ntwnfb",
      "published": "Thu, 15 Jan 2026 11:14:54 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens to invoke the Insurrection Act in Minnesota",
      "description": "US President Donald Trump threatens to deploy military forces to quell protests in Minnesota, as tensions run high over the role of ICE officers in the city.",
      "url": "https://www.dw.com/en/trump-threatens-to-invoke-the-insurrection-act-in-minnesota/a-75522140?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 14:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "US says ‘all options on the table’ if Iran protest killings continue",
      "description": "Trump administration reiterates threat of 'grave consequences', but says executions of Iranian protesters halted.",
      "url": "https://www.aljazeera.com/news/2026/1/15/us-says-all-options-on-the-table-if-iran-protest-killings-continue?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 20:47:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UN chief’s last annual speech slams world leaders for lack of cooperation",
      "description": "Antonio Guterres appears to take aim at the US, which recently slashed its contribution, telling UN to 'adapt or die'.",
      "url": "https://www.aljazeera.com/news/2026/1/15/uns-guterres-slams-world-leaders-putting-intl-cooperation-on-deathwatch?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:45:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "More than 4.7m social media accounts blocked after Australia’s under-16 ban came into force, PM says",
      "description": "Accounts removed or restricted on Twitch, Kick, YouTube, Threads, Facebook, Instagram, Snap, X, TikTok and Reddit in world-leading ban Get our breaking news email , free app or daily news podcast More than 4.7m social media accounts held by Australians who platforms have judged to be under 16 years of age were deactivated, removed or restricted in the first days after the ban came into effect on 10 December, the prime minister has said. The eSafety commissioner sent questions to each of the platforms covered by the ban asking how many accounts had been removed to comply with the law. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/australia-u16-social-media-ban-millions-accounts-blocked",
      "published": "Thu, 15 Jan 2026 11:30:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Does Moldovan President Maia Sandu really want unification with Romania?",
      "description": "Moldova's president Maia Sandu recently stated in a podcast that she would vote in favor of her country joining Romania in the event of a referendum. Her comments have caused outrage.",
      "url": "https://www.dw.com/en/does-moldovan-president-maia-sandu-really-want-unification-with-romania/a-75523793?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 19:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "How a tiny change could tip the balance of life at the end of the world",
      "description": "Even though it's high summer in the Antarctic, the ocean around the Rothera research station is -1 Celsius.",
      "url": "https://news.sky.com/story/antarctica-the-tiny-change-that-could-tip-the-balance-at-the-end-of-the-world-13494858",
      "published": "Fri, 16 Jan 2026 01:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'It's like a road closure' - Uganda's president on shutting down the internet as his country votes",
      "description": "A church service at Nakasero State House marks the end of a frenetic election cycle.",
      "url": "https://news.sky.com/story/its-like-a-road-closure-ugandas-president-on-shutting-down-the-internet-as-his-country-votes-in-election-13494517",
      "published": "Thu, 15 Jan 2026 08:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Is America surrendering Antarctica to its rivals?",
      "description": "As Donald Trump fights for control of arctic Greenland, is he losing at the other end of the world and leaving it open for rivals like China?",
      "url": "https://news.sky.com/story/is-america-surrendering-antarctica-to-its-rivals-13494444",
      "published": "Wed, 14 Jan 2026 23:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Alexander brothers accused of cruise ship sex abuse ahead of real estate moguls' trafficking trial",
      "description": "Federal prosecutors expand add against Alexander brothers weeks before trial, adding cruise ship assault allegations to sex trafficking case.",
      "url": "https://www.foxnews.com/us/alexander-brothers-accused-cruise-ship-sex-abuse-ahead-real-estate-moguls-trafficking-trial",
      "published": "Thu, 15 Jan 2026 19:24:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Fox News ‘Antisemitism Exposed’ Newsletter: Israel to honor 'incredible human being' Charlie Kirk",
      "description": "Fox News' \"Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.",
      "url": "https://www.foxnews.com/us/fox-news-antisemitism-exposed-newsletter-israel-honor-incredible-human-being-charlie-kirk",
      "published": "Thu, 15 Jan 2026 14:40:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Watchdog highlights nations where Christians face persecution around the globe",
      "description": "Open Doors' World Watch List 2026 discusses Christian persecution in nations around the globe, including North Korea, Somalia, Yemen, Sudan and others.",
      "url": "https://www.foxnews.com/world/watchdog-highlights-nations-where-christians-face-persecution-around-globe",
      "published": "Wed, 14 Jan 2026 13:53:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cuba counts cost of alliance after 32 troops killed in Venezuela",
      "description": "The recent events in Venezuela have exposed the strategic risks of Cuba’s foreign entanglements.",
      "url": "https://www.bbc.com/news/articles/c0q4l3g183jo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 02:49:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Astronauts splash down to Earth after medical evacuation from space station",
      "description": "The four members of Crew-11 beamed as they stepped out of their spacecraft after a safe landing.",
      "url": "https://www.bbc.com/news/articles/c205r8n0276o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 12:06:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Aid workers cleared of human trafficking charges in Greece",
      "description": "The former volunteers, who were facing lengthy jail terms, worked for an NGO that rescued asylum-seekers.",
      "url": "https://www.bbc.com/news/articles/c98j7n2xj1xo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 22:27:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pitfalls loom as Trump's Gaza peace plan enters second phase",
      "description": "As the US announces the next of its plan to end the war, serious obstacles mean implementation will be difficult.",
      "url": "https://www.bbc.com/news/articles/cp3z7441nz7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 12:31:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,422",
      "description": "These are the key developments from day 1,422 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/16/russia-ukraine-war-list-of-key-events-day-1422?traffic_source=rss",
      "published": "Fri, 16 Jan 2026 00:37:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Death of Chimamanda Ngozi Adichie’s son prompts calls for overhaul of Nigeria’s healthcare sector",
      "description": "Pleas for scrutiny of system fraught with accusations of negligence after one-year-old’s death in hospital Nigerians have called for urgent reforms to the healthcare sector after the death of Chimamanda Ngozi Adichie’s 21-month-old son prompted an outpouring of grief and accounts of negligence and inadequate care. In a leaked WhatsApp message, the bestselling author said she had been told by a doctor that the resident anaesthesiologist at the Lagos hospital treating her son Nkanu Nnamdi had administered an overdose of the sedative propofol. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/nigeria-call-overhaul-healthcare-sector-death-bestselling-author-toddler",
      "published": "Fri, 16 Jan 2026 05:00:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "How the Trump administration's threats to Iran are stoking tensions in the region",
      "description": "NPR's Michel Martin talks to Vali Nasr, a professor of Middle East studies at Johns Hopkins University, about how President Trump's threats against Iran are escalating regional tensions.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677278/how-the-trump-administrations-threats-to-iran-are-stoking-tensions-in-the-region",
      "published": "Thu, 15 Jan 2026 04:45:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: The harsh reality of cutting development aid",
      "description": "Germany is cutting its development aid budget. But since development policy is also part of national security, alongside diplomacy and defense, these budget cuts may cause problems.",
      "url": "https://www.dw.com/en/germany-the-harsh-reality-of-cutting-development-aid/a-75516453?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 15:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Seoul, Tokyo watch US foreign policy twists with rising fear",
      "description": "Donald Trump's hostile signals over Greenland and the aftermath of the Venezuela attack have raised fears in Japan and South Korea that Washington is no longer committed to its allies in East Asia.",
      "url": "https://www.dw.com/en/seoul-tokyo-watch-us-foreign-policy-twists-with-rising-fear/a-75516264?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 13:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump given Nobel Peace Prize by its Venezuelan winner at White House",
      "description": "Donald Trump has been presented with a Nobel Peace Prize medal by Maria Corina Machado, the leader of the Venezuelan opposition, who won the award last year.",
      "url": "https://news.sky.com/story/trump-presented-with-nobel-peace-prize-by-its-venezuelan-winner-at-white-house-13494837",
      "published": "Thu, 15 Jan 2026 22:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US launches phase two of plan to end Gaza conflict, including creation of transitional authority",
      "description": "Donald Trump's special envoy Steve Witkoff has announced the launch of phase two ​of ​the plan to end the conflict in Gaza.",
      "url": "https://news.sky.com/story/us-launches-phase-two-of-plan-to-end-gaza-conflict-including-creation-of-transitional-authority-13494283",
      "published": "Wed, 14 Jan 2026 16:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel to honor Charlie Kirk with award for fighting antisemitism",
      "description": "Israel plans to honor the late Charlie Kirk for his efforts against antisemitism",
      "url": "https://abcnews.go.com/International/wireStory/israel-honor-charlie-kirk-award-fighting-antisemitism-129233134",
      "published": "Thu, 15 Jan 2026 06:18:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Suspect accused of killing sleeping passenger on Chicago train filmed himself carrying out attack: prosecutors",
      "description": "Chicago man accused of stabbing sleeping passenger on a train allegedly recorded the deadly attack, prosecutors say. Victim had no interaction.",
      "url": "https://www.foxnews.com/us/chicago-train-passenger-filmed-himself-fatally-stabbing-sleeping-stranger-unprovoked-attack-prosecutors",
      "published": "Thu, 15 Jan 2026 22:19:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Three Venezuelan illegals arrested after ICE officer 'ambushed and attacked' during traffic stop: Noem",
      "description": "DHS calls Minneapolis incident \"attempted murder\" as ICE officer fights for life following alleged violent attack by three Venezuelan illegal immigrants.",
      "url": "https://www.foxnews.com/us/three-venezuelan-illegals-arrested-ice-officer-ambushed-attacked-traffic-stop-noem",
      "published": "Thu, 15 Jan 2026 17:19:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Texas police officer gunned down by wanted fugitive in violent arrest attempt: officials",
      "description": "Texas police officer Elijah Garretson, a 27-year-old Army veteran, was shot and killed while trying to arrest a wanted fugitive in Copperas Cove.",
      "url": "https://www.foxnews.com/us/texas-police-officer-gunned-down-wanted-fugitive-violent-arrest-attempt-officials",
      "published": "Thu, 15 Jan 2026 12:42:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Man runs into Florida street to save two young children who wandered away from rental home",
      "description": "Hero driver saves two toddlers who wandered into busy Florida roadway. John Brittingham stopped traffic on A1A to rescue the children in just six seconds.",
      "url": "https://www.foxnews.com/us/man-runs-florida-street-save-two-young-children-who-wandered-away-from-rental-home",
      "published": "Thu, 15 Jan 2026 07:47:02 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Virginia nanny’s jailhouse letters reveal conflicting loyalties in love triangle murder trial",
      "description": "Au pair Juliana Peres Magalhães reads emotional jailhouse letters professing love for Brendan Banfield, charged with murdering his wife Christine Banfield and Joseph Ryan in 2023.",
      "url": "https://www.foxnews.com/us/virginia-nannys-jailhouse-letters-reveal-conflicting-loyalties-love-triangle-murder-trial",
      "published": "Thu, 15 Jan 2026 06:00:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korean prosecutor seeks death penalty for ex-President Yoon over martial law declaration: 'Self-coup'",
      "description": "An independent counsel demanded a death sentence for former South Korean President Yoon Suk Yeol on rebellion charges over his controversial martial law decree.",
      "url": "https://www.foxnews.com/world/south-korean-prosecutor-seeks-death-penalty-ex-president-yoon-over-martial-law-declaration-self-coup",
      "published": "Wed, 14 Jan 2026 03:29:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boeing knew of flaw in part linked to UPS plane crash, US safety board report says",
      "description": "An aircraft that crashed in November had a structural flaw that had been identified by Boeing 15 years ago, investigators say.",
      "url": "https://www.bbc.com/news/articles/cly56w0p9e1o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 12:49:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Why big oil giants may not rush to buy into Donald Trump’s Venezuelan vision",
      "description": "It may well be safer, easier and cheaper for US companies to procure whatever oil the US economy needs at home There are a few reasons that Donald Trump – now self-anointed acting president of Venezuela , as well as the United States – might be so excited about appropriating Venezuela’s oil . Trump may be counting on some boost from cheap oil to the US economy: he is obsessed with the price of gas . As the midterm elections approach, he has become concerned about unemployment . Deeply imprinted memories of scarcity during the oil crises of the 1970s may prime his belief that cheap oil cures it all. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/15/trump-big-oil-venezuela",
      "published": "Thu, 15 Jan 2026 11:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuelan opposition member Freddy Guevara talks about the future of his country",
      "description": "Freddy Guevara, former vice president of the Venezuelan Parliament and a member of the Venezuelan opposition, talks about what's next for his country.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5672484/venezuelan-opposition-member-freddy-guevara-talks-about-the-future-of-his-country",
      "published": "Thu, 15 Jan 2026 04:46:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Hong Kong: Life sentence looms for media tycoon Jimmy Lai",
      "description": "With the last stage of Jimmy Lai's national security trial drawing to a close, Hong Kong's High Court is set to decide on the sentence for the pro-democracy tycoon. Will Lai get life in prison?",
      "url": "https://www.dw.com/en/hong-kong-life-sentence-looms-for-media-tycoon-jimmy-lai/a-75516554?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 13:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Macron calls for €36 billion increase in defence budget by 2030",
      "description": "In his New Year address to the armed forces, French President Emmanuel Macron unveiled a plan to add €36 billion to the country's multi-year defence budget in its next update, as he said France needed to be more powerful in order to be feared amid rising geopolitical tensions.",
      "url": "https://www.france24.com/en/tv-shows/business/20260115-macron-calls-for-%E2%82%AC36-billion-increase-in-defence-budget-by-2030",
      "published": "Thu, 15 Jan 2026 21:52:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Russia expels British diplomat from Moscow embassy over spying claims",
      "description": "Russian authorities have ordered a British diplomat to leave the country, accusing the official of spying",
      "url": "https://abcnews.go.com/International/wireStory/russia-expels-british-diplomat-moscow-embassy-spying-claims-129233338",
      "published": "Thu, 15 Jan 2026 06:17:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Japan's Prime Minister Takaichi plans to dissolve Parliament and call early election to strengthen coalition",
      "description": "Japan's first female Prime Minister, Sanae Takaichi, plans a snap election to capitalize on 70% approval ratings and strengthen her coalition majority.",
      "url": "https://www.foxnews.com/world/japans-prime-minister-takaichi-plans-dissolve-parliament-call-early-election-strengthen-coalition",
      "published": "Wed, 14 Jan 2026 19:56:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Iran authorities demanding large sums for return of protesters' bodies, BBC told",
      "description": "Multiple sources have told BBC Persian that security forces will not release bodies unless relatives hand over money.",
      "url": "https://www.bbc.com/news/articles/c4g5md1n1yxo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 20:19:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Palestinians ‘not optimistic’ about second phase of Gaza ceasefire",
      "description": "Palestinians in Gaza have told Al Jazeera the second phase of the ceasefire won’t improve their lives.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/palestinians-not-optimistic-about-second-phase-of-gaza-ceasefire?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 20:31:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran’s key leaders",
      "description": "A look at who leads Iran as they confront protesters",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/irans-key-leaders?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 18:52:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US sanctions Khamenei aide, other Iranian officials over protest crackdown",
      "description": "New penalties come as Trump welcomes purported Iranian decision to halt execution of antigovernment demonstrators.",
      "url": "https://www.aljazeera.com/news/2026/1/15/us-sanctions-khamenei-aide-other-iranian-officials-over-protest-crackdown?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:34:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Timeline of Israel’s genocide on Gaza",
      "description": "The Trump administration has announced its ceasefire plan for Gaza is now in ‘Phase Two’.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/timeline-of-israels-genocide-on-gaza?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:46:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. says second phase of Gaza ceasefire has begun, but major challenges remain",
      "description": "The White House says the ceasefire deal between Israel and Hamas is moving into its second phase, which includes the demilitarization of Gaza, a key point in President Trump's peace plan.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677315/u-s-says-second-phase-of-gaza-ceasefire-has-begun-but-major-challenges-remain",
      "published": "Thu, 15 Jan 2026 04:45:47 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Port Assab becomes flashpoint for Ethiopia–Eritrea relations",
      "description": "Addis Ababa's renewed calls for sea access threaten an already fragile relationship with Eritrea, drawing anger from Asmara.",
      "url": "https://www.dw.com/en/port-assab-becomes-flashpoint-for-ethiopia-eritrea-relations/a-75453946?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 16:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Charlie Hebdo' cartoon on Swiss fire tragedy sparks outrage",
      "description": "A cartoon by the French satirical weekly portraying the deadly fire in Crans-Montana as the \"comedy of the year\" provokes disgust.",
      "url": "https://www.dw.com/en/charlie-hebdo-cartoon-on-swiss-fire-tragedy-sparks-outrage/a-75513790?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 11:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "German military personnel set to arrive in Greenland",
      "description": "Germany said that the European mission in Greenland was there to counter \"threats\" from Russia and China. The German team is among the groups of European military personnel who are scheduled to arrive in Greenland.",
      "url": "https://www.dw.com/en/german-military-personnel-set-to-arrive-in-greenland/a-75514480?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What will Europe actually do to defend Greenland?",
      "description": "European countries - including France - have begun deploying troops to Greenland, in what Germany describes as a mission aimed at countering 'Russian and Chinese threats'. The White House says the show of unity for the Arctic island will have 'no impact' on Trump's ambitions for it. It comes a day after high-level talks in Washington highlighted 'fundamental disagreements' over the future of the Danish territory.",
      "url": "https://www.france24.com/en/tv-shows/a-propos/20260115-what-will-europe-actually-do-to-defend-greenland",
      "published": "Thu, 15 Jan 2026 22:54:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "In Haiti’s storm-hit south, food vouchers restore choice and dignity for families",
      "description": "Standing outside a colourfully painted building in southeastern Haiti, at the entrance to a bustling shop called Gods Will Depot where bags of food are stacked to the ceiling, Ketia surveys the large pile of groceries she has selected for her family: a big sack of flour, packages of spaghetti, boxed milk, some bars of soap.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166757",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Driver of U-Haul truck that entered Iran protest crowd speaks out: 'All I want is peace'",
      "description": "The U-Haul driver claims LAPD waved him into Iranian protesters in Los Angeles, leading to arrest on suspicion of reckless driving after going through crowd.",
      "url": "https://www.foxnews.com/us/driver-u-haul-truck-entered-iran-protest-crowd-speaks-out-all-i-want-peace",
      "published": "Thu, 15 Jan 2026 10:12:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran allegedly airs 97 'coercive confessions' amid record-breaking North Korea-style internet blackout",
      "description": "The Iranian regime aired alleged forced confessions from handcuffed protesters during a record-breaking internet blackout lasting over 144 hours.",
      "url": "https://www.foxnews.com/world/iran-allegedly-airs-97-coercive-confessions-amid-record-breaking-north-korea-style-internet-blackout",
      "published": "Wed, 14 Jan 2026 18:30:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "France condemns Iran protest crackdown, weighs satellite internet aid amid blackout",
      "description": "France condemns Iran's violent crackdown on protests as Paris considers satellite communications support to help Iranians bypass internet blackout.",
      "url": "https://www.foxnews.com/world/france-condemns-iran-protest-crackdown-weighs-satellite-internet-aid-amid-blackout",
      "published": "Wed, 14 Jan 2026 15:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel moves Yellow Line deeper into Gaza, satellite images show",
      "description": "Israel placed and later moved control markers in three areas, with placed deeper inside Gaza than maps suggested.",
      "url": "https://www.bbc.com/news/articles/ckgxl6zkenqo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 00:02:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China reports record trillion-dollar trade surplus despite Trump tariffs",
      "description": "Results for 2025 risk further unsettling economies about China’s trade practices and overcapacity, and their own over-reliance on Chinese products China has reported a strong export run in 2025 with a record trillion-dollar surplus, as its producers brace for three more years of a Trump administration set on slowing the manufacturing powerhouse by shifting US orders to other markets. Beijing’s resilience to renewed tariff tensions since Donald Trump returned to the US presidency last January has emboldened Chinese firms to shift their focus to south-east Asia, Africa and Latin America to offset US duties. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/china-reports-record-trillion-dollar-trade-surplus-despite-trump-tariffs",
      "published": "Wed, 14 Jan 2026 04:50:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US, Taiwan reach trade deal with lower tariffs",
      "description": "A new deal calls for Taiwan's chip-making companies to invest and build in the United States. In return, Washington will lower the tariff on Taiwanese goods to 15% from a previous 20%.",
      "url": "https://www.dw.com/en/us-taiwan-reach-trade-deal-with-lower-tariffs/a-75529792?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 16 Jan 2026 02:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland for training after fraught US talks",
      "description": "European troops are arriving in Greenland for training in the territory following fraught talks in Washington between the territory, Denmark and the US. US President Donald Trump has repeatedly said he wants the mineral-rich, strategic territory to be taken over by the United States. #greenland #trump #nato",
      "url": "https://www.france24.com/en/video/20260115-european-troops-arrive-in-greenland-for-training-amid-tension-with-the-us",
      "published": "Thu, 15 Jan 2026 17:20:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "British Columbia ending its 3-year drug decriminalization pilot project",
      "description": "Canada’s Pacific coast province of British Columbia is ending its three-year experiment in decriminalizing possession of small amounts of drugs",
      "url": "https://abcnews.go.com/International/wireStory/british-columbia-ending-3-year-drug-decriminalization-pilot-129222631",
      "published": "Wed, 14 Jan 2026 18:09:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Second-largest Minnesota school district to offer temporary virtual learning amid ICE operations",
      "description": "Saint Paul Public Schools launches temporary virtual learning option amid Immigration and Customs Enforcement operations in Minnesota.",
      "url": "https://www.foxnews.com/us/second-largest-minnesota-school-district-offer-temporary-virtual-learning-amid-ice-operations",
      "published": "Thu, 15 Jan 2026 11:06:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ICE deputy director resigns from agency to run for Congress",
      "description": "Madison Sheahan, the deputy director of U.S. Immigration and Customs Enforcement, has resigned to run for Congress in Ohio's 9th Congressional District.",
      "url": "https://www.foxnews.com/us/ice-deputy-director-resigns-agency-run-congress",
      "published": "Thu, 15 Jan 2026 10:00:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Opposition candidate Bobi Wine claims ‘massive ballot stuffing’ as Uganda goes to polls",
      "description": "Wine calls for voters to ‘reject the criminal regime’ on tense day of voting as some poll stations remain closed for hours Uganda’s most prominent opposition presidential candidate has accused the government of ballot stuffing and arresting and abducting his party’s officials during Thursday’s general election, which took place against against the backdrop of an internet shutdown. The pop star turned politician Bobi Wine wrote on X : “Internet switched off. Massive ballot stuffing reported everywhere. Our leaders … arrested. Many of our polling agents and supervisors abducted, and others chased off polling stations. RISE TO THE OCCASION AND REJECT THE CRIMINAL REGIME.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/15/uganda-vote-election-yoweri-museveni-bobi-wine",
      "published": "Thu, 15 Jan 2026 16:36:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Denmark and U.S. to form working group to talk about U.S. security concerns",
      "description": "After meeting with President Trump's top aides, Danish officials say they will form a working group to talk through U.S. security concerns about control of Greenland.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677517/denmark-and-u-s-to-form-working-group-to-talk-about-u-s-security-concerns",
      "published": "Thu, 15 Jan 2026 04:46:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Report highlights how Russia lures young Africans to fight in Ukraine",
      "description": "In tonight's edition, a report highlights how Russia lures young Africans to fight in Ukraine. Also, widespread delays in Uganda's presidential election. And the official draw for the Women’s African Cup of Nations, kicking off on 17 March.",
      "url": "https://www.france24.com/en/report-highlights-how-russia-lures-young-africans-to-fight-in-ukraine",
      "published": "Thu, 15 Jan 2026 21:51:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Uganda’s presidential election experiences hours of delays at some polling stations",
      "description": "Voting delays have been reported in Uganda’s presidential election",
      "url": "https://abcnews.go.com/International/wireStory/voting-begins-ugandas-presidential-election-internet-shutdown-polling-129231347",
      "published": "Thu, 15 Jan 2026 14:12:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting president touts ‘new political moment,’ hints at further release of political prisoners",
      "description": "Venezuela's new leadership hints at additional prisoner releases amid political transition, with hundreds of detainees reportedly still in custody.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-president-touts-new-political-moment-hints-further-release-political-prisoners",
      "published": "Wed, 14 Jan 2026 19:12:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Chinese woman's plea for help killing pigs draws thousands to her village",
      "description": "The woman appealed for help after realising her father could not slaughter the pigs for a village feast alone.",
      "url": "https://www.bbc.com/news/articles/cx2y9805g8go?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 23:47:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump to discuss Venezuela’s future with Machado after Maduro’s capture",
      "description": "Venezuelan opposition leader and Nobel prize winner had been sidelined by White House after US seized Maduro Donald Trump will host María Corina Machado , the Venezuelan opposition leader and 2025 Nobel peace prize winner, at the White House on Thursday for high-stakes talks on the oil-rich nation’s future following the US capture of Nicolás Maduro . Many in Venezuela and abroad had expected Machado to take charge after an elite US military team seized Maduro in a pre-dawn raid on 3 January and transported him to a New York City jail . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/trump-maria-corina-machado-venezuela",
      "published": "Thu, 15 Jan 2026 11:07:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Massachusetts town faces lawsuit for allowing criminal immigrant, sex offender to renew business license",
      "description": "A teen worker allegedly assaulted at Hillers Pizza sues town officials, claiming they ignored offender's criminal history when renewing a business license.",
      "url": "https://www.foxnews.com/us/massachusetts-town-faces-lawsuit-allowing-criminal-immigrant-sex-offender-renew-business-license",
      "published": "Thu, 15 Jan 2026 19:28:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan Nobel Peace Prize winner presents her medal to Trump",
      "description": "Trump thanked Venezuelan opposition leader María Corina Machado, calling it \"a wonderful gesture of mutual respect\".",
      "url": "https://www.bbc.com/news/articles/cx2w94wp4p1o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 01:27:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Troops and vessels from European Nato allies arrive in Greenland",
      "description": "The limited deployment involves Germany, France, Sweden, Norway, Finland, the Netherlands and the UK.",
      "url": "https://www.bbc.com/news/videos/c0q4lplxzzlo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 21:41:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Baby, don't move': Australian woman wakes to find massive python on her chest",
      "description": "Rachel Bloor had assumed the heavy weight on her chest was her dog.",
      "url": "https://www.bbc.com/news/articles/cdex34930r4o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 02:32:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces seize a sixth Venezuela-linked oil tanker in Caribbean Sea",
      "description": "The tanker, Veronica, was seized in a predawn operation \"without incident\", the US military's Southern Command says.",
      "url": "https://www.bbc.com/news/articles/cy4qdnj5vl9o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 20:09:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European military personnel arrive in Greenland as Trump says US needs island",
      "description": "France says a small military contingent has arrived and more forces will be there in the coming days.",
      "url": "https://www.bbc.com/news/articles/cd0ydjvxpejo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 20:04:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Votes being counted in Uganda election as opposition alleges rigging",
      "description": "The election is a rematch between Bobi Wine and Yoweri Museveni, who has been president for 40 years.",
      "url": "https://www.bbc.com/news/articles/cx2xn1yvgr4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:48:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US seizes sixth tanker as Venezuela’s interim leader vows oil sector reform",
      "description": "US forces say another Venezuela-linked tanker seized as Trump moves to take control of nation's oil reserves.",
      "url": "https://www.aljazeera.com/news/2026/1/16/us-seizes-sixth-tanker-as-venezuelas-interim-leader-vows-oil-sector-reform?traffic_source=rss",
      "published": "Fri, 16 Jan 2026 03:27:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump welcomes Venezuela’s Maria Corina Machado in closed-door meeting",
      "description": "The Venezuelan opposition leader said she presented Trump with her Nobel Peace Prize, an honour he has long coveted.",
      "url": "https://www.aljazeera.com/news/2026/1/16/trump-welcomes-venezuelas-maria-corina-machado-in-closed-door-meeting?traffic_source=rss",
      "published": "Fri, 16 Jan 2026 01:54:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump unveils healthcare plan without clear funding or execution timeline",
      "description": "Trump's healthcare plan promises lower costs but lacks specifics and faces challenges from a divided Congress.",
      "url": "https://www.aljazeera.com/economy/2026/1/15/trump-unveils-healthcare-plan-without-clear-funding-or-execution-timeline?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 21:17:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Polls close in Uganda presidential election as internet blackout continues",
      "description": "Poll workers are counting ballots cast in Uganda’s contentious general election. Al Jazeera’s Catherine Soi has more.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/polls-close-in-uganda-presidential-election-as-internet-blackout-continues?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:58:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada’s Carney hails improving ties with China",
      "description": "Carney is on a four-day trip to China, the first by a Canadian PM since 2017, in a move to thaw tense relations.",
      "url": "https://www.aljazeera.com/economy/2026/1/15/canadas-carney-hails-improving-ties-with-china?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:17:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US seizes another Venezuela-linked oil tanker",
      "description": "Video released by the US military shows troops boarding an oil tanker, said to have links to Venezuela.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/us-seizes-another-venezuela-linked-oil-tanker-2?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:53:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fifteen former NCAA players charged in US-China basketball rigging case",
      "description": "Former players among those charged in alleged scheme to rig basketball games in US and China.",
      "url": "https://www.aljazeera.com/sports/2026/1/15/prosecutors-charge-15-former-ncaa-players-in-latest-basketball-rigging-case?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:50:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What lies ahead for Venezuelan opposition leader Maria Corina Machado?",
      "description": "Machado has argued that the opposition has a 'mandate' to succeed Venezuelan President Nicolas Maduro.",
      "url": "https://www.aljazeera.com/news/longform/2026/1/15/what-lies-ahead-for-venezuelan-opposition-leader-maria-corina-machado?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:43:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cloth wraps treated with ‘dirt cheap’ insecticide cut malaria cases in babies",
      "description": "Soaking fabrics in a commonly used insect repellent is a simple and effective tool as mosquito bites become more common during daytime, study shows From Africa to Latin America to Asia, babies have been carried in cloth wraps on their mothers’ backs for centuries. Now, the practice of generations of women could become a lifesaving tool in the fight against malaria. Researchers in Uganda have found that treating wraps with the insect repellent permethrin cut rates of malaria in the infants carried in them by two-thirds. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/16/cloth-wraps-treated-with-insecticide-cut-malaria-cases-in-babies",
      "published": "Fri, 16 Jan 2026 05:00:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Controversial US study on hepatitis B vaccines in Africa is cancelled",
      "description": "$1.6m project drew outrage over ethical questions about withholding vaccines proven to prevent disease The controversial US-funded study on hepatitis B vaccines among newborns in Guinea-Bissau has been halted, according to Yap Boum, a senior official at the Africa Centres for Disease Control and Prevention (CDC). “The study has been cancelled,” Boum told journalists at a press conference on Thursday morning. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/hepatitis-b-vaccines-study-africa-cancel",
      "published": "Thu, 15 Jan 2026 18:11:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Three US citizens sue Trump with the ACLU over encounters with ICE agents – as it happened",
      "description": "This live blog is now closed. Trump news at a glance: The medal may be in Trump’s hands, but peace prize is not his, Nobel officials say Donald Trump is in Washington today. He’s due to meet with Mariá Corina Machado – Venezuela’s opposition leader – at 12:3opm ET. At the moment that’s closed to the press but we’ll let you know if that changes and bring you the latest. Later, Trump is set to host the champions of the 2025 Stanley Cup, the Florida Panthers, at the White House. We’ll be watching to get his reaction to the news of the day. Continue reading...",
      "url": "https://www.theguardian.com/us-news/live/2026/jan/15/us-politics-latest-news-updates-donald-trump-venezuela-maria-corina-machado",
      "published": "Fri, 16 Jan 2026 03:04:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US says it reached deal with Taiwan to lower tariffs and boost investments",
      "description": "US to lower tariffs on Taiwanese goods to 15% as chip and tech businesses pledge $250bn spending in US operations The US said on Thursday that it had signed a deal with Taiwan to reduce tariffs on goods from the democratic island, while increasing Taiwanese semiconductor and tech companies’ investments in America. The agreement, the US commerce department said, “will drive a massive reshoring of America’s semiconductor sector”. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/us-taiwan-tariff-deal",
      "published": "Thu, 15 Jan 2026 22:07:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland to boost the Arctic island's security",
      "description": "Troops from several European countries, including France, Germany, Norway and Sweden, are arriving in Greenland after talks between Denmark, Greenland and the U.S. on Wednesday highlighted disagreement.",
      "url": "https://www.npr.org/2026/01/15/g-s1-106113/european-troops-arrive-greenland",
      "published": "Thu, 15 Jan 2026 05:26:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What Teddy Roosevelt has to do with Trump's moves in Venezuela and Greenland",
      "description": "Presidents James Monroe and Theodore Roosevelt helped shape a policy that rationalizes U.S. intervention in Latin America and elsewhere. But Trump has brought that idea to a whole new level.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5675874/trump-monroe-doctrine-roosevelt-latin-america-intervention",
      "published": "Thu, 15 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda goes to the polls amid heavy security and internet blackout",
      "description": "Ugandans are voting in a tense presidential election as 81-year-old President Yoweri Museveni seeks to extend his four-decade rule amid an internet shutdown and heavy military deployment.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5675906/uganda-election-museveni-bobi-wine",
      "published": "Thu, 15 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Julio Iglesias accused of sexual assault as Spanish prosecutors study the allegations",
      "description": "Spanish prosecutors are studying allegations that Grammy-winning singer Julio Iglesias sexually assaulted two former employees at his residences in the Dominican Republic and the Bahamas.",
      "url": "https://www.npr.org/2026/01/15/g-s1-106108/julio-iglesias-accused-sexual-assault",
      "published": "Thu, 15 Jan 2026 02:46:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US downplays European troops in Greenland",
      "description": "Several European countries have dispatched soldiers to Greenland in a show of support for Denmark. But the US said the move won't change President Trump's intention to acquire the island.",
      "url": "https://www.dw.com/en/us-downplays-european-troops-in-greenland/a-75529951?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 16 Jan 2026 04:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's ex-President Bolsonaro moved to a bigger cell",
      "description": "Bolsonaro's family has repeatedly complained about the conditions in which he was being held. The former president is serving a 27-year prison sentence for attempting a coup following his 2022 election loss.",
      "url": "https://www.dw.com/en/brazil-s-ex-president-bolsonaro-moved-to-a-bigger-cell/a-75529469?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 16 Jan 2026 01:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NBA Europe to 'respect' European basketball tradition",
      "description": "The NBA is pressing ahead with plans to launch a basketball league in Europe, with a slated launch date of 2027.",
      "url": "https://www.dw.com/en/nba-europe-to-respect-european-basketball-tradition/a-75529236?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 23:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: Machado presents Trump her Nobel Peace Prize",
      "description": "Sidelined by Trump, Venezuelan opposition leader Maria Corina Machado visited Washington, while interim President Delcy Rodriguez has called for \"diplomacy\" with the US, and aims to attract more oil investment.",
      "url": "https://www.dw.com/en/venezuela-machado-presents-trump-her-nobel-peace-prize/a-75526772?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 21:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US visa suspensions: What you need to know",
      "description": "The US is suspending visa processing for 75 countries. What does this mean, when will it start and who does it affect?",
      "url": "https://www.dw.com/en/us-visa-suspensions-what-you-need-to-know/a-75522177?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 17:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Women poised to take India sports to the next level",
      "description": "India has been experiencing major growth in women's sports in recent years. This is being fuelled by investment from both the public and private sector – as well as many role models.",
      "url": "https://www.dw.com/en/women-poised-to-take-india-sports-to-the-next-level/a-75506901?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada’s PM Carney, China’s Xi Jinping hold first Beijing talks in eight years",
      "description": "Canadian Prime Minister Mark Carney met Xi Jinping in Beijing on Friday, the first leaders’ talks there in eight years. Carney hailed a “new strategic partnership” as Canada seeks to diversify trade after US tariffs imposed under President Donald Trump.",
      "url": "https://www.france24.com/en/asia-pacific/20260116-canada-mark-carney-china-xi-jinping-beijing-talks",
      "published": "Fri, 16 Jan 2026 04:15:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil’s Bolsonaro transferred to prison with ‘more favorable’ conditions",
      "description": "Brazil’s former president Jair Bolsonaro was transferred to prison on Thursday to begin serving a 27-year sentence for orchestrating a failed coup, under conditions described by a court as “more favorable.” The 70-year-old was convicted over efforts to overturn his 2022 election loss to Luiz Inacio Lula da Silva.",
      "url": "https://www.france24.com/en/americas/20260116-brazil-bolsonaro-prison",
      "published": "Fri, 16 Jan 2026 03:26:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda votes as its pop star politician Bobi Wine goes up against President Museveni",
      "description": "Bobi Wine's house is heavily surveilled.",
      "url": "https://news.sky.com/story/uganda-votes-as-its-pop-star-politician-bobi-wine-goes-up-against-president-museveni-13494819",
      "published": "Thu, 15 Jan 2026 21:56:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Machado gave Trump her Nobel Peace Prize medal in pursuit of a greater prize",
      "description": "The Nobel Peace Prize means a lot to Maria Corina Machado but, clearly, giving it away means even more.",
      "url": "https://news.sky.com/story/venezuelas-machado-gave-trump-her-gold-medal-in-pursuit-of-a-greater-prize-13494861",
      "published": "Fri, 16 Jan 2026 03:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New Czech government of populist leader Andrej Babiš wins a mandatory confidence vote",
      "description": "The Czech Republic's new government of populist Prime Minister Andrej Babiš has won a confidence vote in Parliament",
      "url": "https://abcnews.go.com/International/wireStory/new-czech-government-populist-leader-andrej-babi-wins-129256774",
      "published": "Thu, 15 Jan 2026 16:10:08 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's Macron laughs off 'harmless' eye condition as he addresses troops",
      "description": "French President Emmanuel Macron joked about an unintentional “Eye of the Tiger” during his New Year address to France's armed forces",
      "url": "https://abcnews.go.com/International/wireStory/frances-macron-laughs-off-harmless-eye-condition-addresses-129240895",
      "published": "Thu, 15 Jan 2026 09:30:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What's next for Greenland and Denmark after difficult meeting with Trump administration",
      "description": "U.S., Danish and Greenlandic officials have met face to face to discuss President Donald Trump’s ambitions to take control of Greenland, a semiautonomous territory of Denmark",
      "url": "https://abcnews.go.com/International/wireStory/greenland-denmark-after-difficult-meeting-trump-administration-129236119",
      "published": "Thu, 15 Jan 2026 08:01:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK's Conservative Party leader sacks chief rival after apparent plot to defect",
      "description": "Britain's Conservative Party faces fresh turmoil as leader Kemi Badenoch sacks justice spokesperson Robert Jenrick",
      "url": "https://abcnews.go.com/International/wireStory/uks-conservative-party-leader-sacks-chief-rival-after-129234909",
      "published": "Thu, 15 Jan 2026 08:01:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland as talks with US highlight 'disagreement'",
      "description": "Troops from NATO countries, including France and Germany, are arriving in Greenland to boost security",
      "url": "https://abcnews.go.com/International/wireStory/european-troops-arrive-greenland-talks-us-highlight-disagreement-129233667",
      "published": "Thu, 15 Jan 2026 07:36:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A new era for Canada-China relations? Prime Minister Carney signals change in Beijing",
      "description": "Prime Minister Mark Carney says Canada and China are entering a new era of relations",
      "url": "https://abcnews.go.com/International/wireStory/new-era-canada-china-relations-prime-minister-carney-129232756",
      "published": "Thu, 15 Jan 2026 06:57:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Voting begins in Uganda’s presidential election during internet shutdown and delays",
      "description": "Voting begins in Uganda’s presidential election during internet shutdown and delays",
      "url": "https://abcnews.go.com/International/wireStory/voting-begins-ugandas-presidential-election-internet-shutdown-delays-129230986",
      "published": "Thu, 15 Jan 2026 01:49:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan and the Philippines sign a new defense pact as they face Chinese aggression",
      "description": "Japan and the Philippines have signed a defense pact that will allow the tax-free provision of ammunition, fuel, food and other necessities when their forces stage joint training to boost deterrence against China’s growing aggression in the region and ...",
      "url": "https://abcnews.go.com/International/wireStory/japan-philippines-sign-new-defense-pact-face-growing-129228533",
      "published": "Thu, 15 Jan 2026 02:43:20 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alleged Charlie Kirk assassin Tyler Robinson’s lover Lance Twiggs no longer under FBI protection, source says",
      "description": "FBI protection ends for transgender roommate of Charlie Kirk's alleged assassin Tyler Robinson, law enforcement source confirms to Fox News Digital.",
      "url": "https://www.foxnews.com/us/alleged-charlie-kirk-assassin-tyler-robinson-lover-lance-twiggs-no-longer-under-fbi-protection-source-says",
      "published": "Thu, 15 Jan 2026 15:10:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tesla dealership arsonist learns prison sentence after pleading guilty in Cybertruck torching",
      "description": "Ian William Moses was given a five-year prison sentence in connection to an arson case at the Arizona Tesla dealership in 2025, the Justice Department said.",
      "url": "https://www.foxnews.com/us/tesla-dealership-arsonist-learns-prison-sentence-pleading-guilty-cybertruck-torching",
      "published": "Thu, 15 Jan 2026 14:38:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Latin America rebel groups urged to form 'super guerrilla' alliance against Trump",
      "description": "Nestor Gregorio Vera urges rival factions to unite against US intervention after Venezuela strongman's capture",
      "url": "https://www.foxnews.com/world/latin-america-rebel-groups-urged-form-super-guerrilla-alliance-against-trump",
      "published": "Thu, 15 Jan 2026 21:25:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Ukrainian PM accused of bribing politicians with US dollars to weaken Zelenskyy's government",
      "description": "Ukrainian authorities seized stacks of U.S. dollars during raids targeting former Prime Minister Yulia Tymoshenko, who allegedly planned to bribe lawmakers",
      "url": "https://www.foxnews.com/world/former-ukrainian-pm-accused-bribing-politicians-us-dollars-weaken-zelenskyys-government",
      "published": "Thu, 15 Jan 2026 18:37:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Troops from Europe deploy to Greenland in rapid 2-day mission as Trump eyes US takeover",
      "description": "European countries are deploying military personnel to Greenland for a quick mission as the Trump administration is pushing to acquire the Danish territory.",
      "url": "https://www.foxnews.com/world/troops-from-europe-deploy-greenland-rapid-2-day-mission-trump-eyes-us-takeover",
      "published": "Thu, 15 Jan 2026 10:52:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Some US military personnel told to leave Middle East bases, US official confirms",
      "description": "The U.S. has ordered some of its military personnel to depart from bases in the Middle East on Tuesday as tensions with Iran escalate.",
      "url": "https://www.foxnews.com/world/some-us-military-personnel-told-leave-middle-east-bases-us-official-confirms",
      "published": "Wed, 14 Jan 2026 09:31:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}