{
  "last_updated": "2026-01-25T13:33:39.834031Z",
  "event_count": 225,
  "events": [
    {
      "title": "Indonesia takes action against mining firms after floods devastate population of world’s rarest ape",
      "description": "Conservationists hail the ‘desperately needed’ measures and urge greater protection after up to 11% of endangered Tapanuli orangutans wiped out The floods and landslides that tore through Indonesia’s fragile Batang Toru ecosystem in November 2024 – killing up to 11% of the world’s Tapanuli orangutan population – prompted widespread scrutiny of the extractive companies operating in the area at the time of the ecological catastrophe. For weeks, investigators searched for evidence that the companies may have damaged the Batang Toru and Garoga watersheds before the disaster, which washed torrents of mud and logs into villages, claiming the lives of more than 1,100 people . Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/23/tapanuli-orangutans-floods-indonesia-government-mining-extraction-companies-aoe",
      "published": "Fri, 23 Jan 2026 05:00:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 46,
      "severity_level": "Critical"
    },
    {
      "title": "Iran will retaliate 'with everything we have' if US attacks, senior diplomat warns",
      "description": "More than 4,500 protesters killed in Iran as foreign minister threatens forceful response to potential U.S. military strikes in escalating regional crisis.",
      "url": "https://www.foxnews.com/world/iran-retaliate-with-everything-we-have-us-attacks-senior-diplomat-warns",
      "published": "Wed, 21 Jan 2026 07:44:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Russian strikes kill one, leave millions without power",
      "description": "Russia carried out another large-scale overnight assault on Ukraine’s energy infrastructure early Saturday, triggering explosions across Kyiv and cutting power to around 1.2 million properties nationwide. In the capital, nearly 6,000 buildings were left without heating as temperatures hovered near −10°C (14°F), with many apartments already freezing due to earlier damage to the city’s centralised heating system. France24 International Affairs commentator Douglas Herbert shares his insights.",
      "url": "https://www.france24.com/en/russian-strikes-kill-one-leave-millions-without-power",
      "published": "Sat, 24 Jan 2026 17:27:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "US forces strike vessel allegedly tied to narco-terror group killing 2 as crews search for lone survivor",
      "description": "U.S. forces killed two suspected narco-terrorists in an Eastern Pacific strike on an alleged terrorist vessel. One survivor prompted a search and rescue operation.",
      "url": "https://www.foxnews.com/us/us-forces-strike-vessel-allegedly-tied-narco-terror-group-killing-2-crews-search-lone-survivor",
      "published": "Fri, 23 Jan 2026 17:43:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Severe storm hits half of the United States: 400,000 without power",
      "description": "Thousands of U.S. flights scheduled for the weekend were canceled as a massive storm began battering large swaths of the country on Saturday, cutting power and turning major highways treacherous with ice, while heavy snow, sleet, and freezing rain threatened nearly 180 million people - more than half the population - along a corridor from the southern Rocky Mountains to New England, prompting the National Weather Service to warn of several days of bitter cold and caution that the slow-melting snow and ice would significantly hamper recovery efforts. Public Policy Expert specialising in Urban Affairs and Crisis Management based in Montreal, Guillaume Lavoie, shares his insights on the issue.",
      "url": "https://www.france24.com/en/severe-storm-hits-half-of-the-united-states-400-000-without-power",
      "published": "Sun, 25 Jan 2026 12:48:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "‘Singing for Stolen Children’  Escaping Russian Abduction. A Ukrainian teeenager’s account.",
      "description": "France 24's Gavin Lee is joined by Liza, a teenager who escaped Russia after being forcibly displaced from Ukraine. Around 20,000 children have been taken from their homes and sent to Russia or occupied territories. The International Criminal Court has issued an arrest warrant for President Putin over charges of unlawful deportation. While the Kremlin calls it a \"humanitarian evacuation,\" independent investigators continue to uncover the truth. Nearly 1,900 children have been returned, but many remain missing. Liza, part of the Ukrainian music group Daughters of Donbass, shares her remarkable story.",
      "url": "https://www.france24.com/en/singing-for-stolen-children-escaping-russian-abduction-a-ukrainian-teeenager-s-account",
      "published": "Sun, 25 Jan 2026 10:38:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Minneapolis: Federal agents shoot and kill a man as protests erupt",
      "description": "For the second time this month, a U.S. citizen was shot and killed by a federal agent in Minneapolis when 37-year-old Alex Pretti was killed during a federal immigration operation — sparking a candlelight vigil and renewed shock in the city still reeling from the death of Renee Good less than three weeks earlier — and in both cases state and federal officials have offered conflicting accounts of what happened, with Minnesota’s governor vehemently rejecting the federal narrative. Nicholas Rushworth reports.",
      "url": "https://www.france24.com/en/minneapolis-federal-agents-shoot-and-kill-a-man-as-protests-erupt",
      "published": "Sun, 25 Jan 2026 09:48:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Trump stirs talk of \"New World Order\" as leaders signal shifting global alliances",
      "description": "After taking offense at Canadian Prime Minister Mark Carney’s more assertive stance toward Washington, Trump withdrew an invitation for him to join his Board of Peace, an organization chaired by Trump that some Western allies distrust as a potential rival to the United Nations. He has also used economic pressure against allies, threatening tariffs on Switzerland after a tense phone call and warning Denmark that rejecting U.S. control over Greenland would have consequences, raising concerns about strain on NATO. Camille Knight reports.",
      "url": "https://www.france24.com/en/trump-stirs-talk-of-new-world-order-as-leaders-signal-shifting-global-alliances",
      "published": "Sun, 25 Jan 2026 09:51:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "What we know about Alex Pretti, the man shot dead by federal agents in Minneapolis",
      "description": "The parents of Alex Jeffrey Pretti, who was shot dead by a US Border Patrol officer in Minneapolis on Saturday, issued a written statement decrying top Trump administration officials who suggested their son was a “domestic terrorist”. They remembered their son, an ICU nurse, as a man dedicated to caring for others and a compassionate advocate for social justice.",
      "url": "https://www.france24.com/en/americas/20260125-what-we-know-about-alex-pretti-the-man-shot-dead-by-federal-agents-in-minneapolis",
      "published": "Sun, 25 Jan 2026 09:59:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Minneapolis: 37-year old Alex Pretti killed by ICE agents",
      "description": "For the second time this month, a U.S. citizen was shot and killed by a federal agent in Minneapolis when 37-year-old Alex Pretti was killed during a federal immigration operation — sparking a candlelight vigil and renewed shock in the city still reeling from the death of Renee Good less than three weeks earlier — and in both cases state and federal officials have offered conflicting accounts of what happened, with Minnesota’s governor vehemently rejecting the federal narrative. France24 correspondent Jessica Le Masurier reports from Minneapolis.",
      "url": "https://www.france24.com/en/minneapolis-37-year-old-alex-pretti-killed-by-ice-agents",
      "published": "Sun, 25 Jan 2026 09:49:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Anti-ICE agitator allegedly bites off federal officer's finger during Minneapolis attack",
      "description": "A federal officer allegedly lost a finger after a protester bit it off during Minneapolis riots. The Minnesota National Guard was mobilized as violence escalates.",
      "url": "https://www.foxnews.com/us/anti-ice-agitator-allegedly-bites-off-federal-officers-finger-during-minneapolis-attack",
      "published": "Sat, 24 Jan 2026 17:11:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Ceasefire extended with Kurdish force",
      "description": "The Iranian regime’s recent crackdown on protests in Tehran and the country’s central region featured the use of military weapons, such as automatic or semi-automatic machine guns, that were previously only deployed in the remote northwestern Kurdish areas, according to Amnesty International. For Iran’s overlooked Kurdish minority, it could mean there’s worse to come. Charlotte Hughes reports.",
      "url": "https://www.france24.com/en/ceasefire-extended-with-kurdish-force",
      "published": "Sun, 25 Jan 2026 10:06:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of rising internet shutdowns as digital blackouts spread worldwide",
      "description": "A rising trend towards government-enforced internet shutdowns – with at least 300 incidents in more than 54 countries over the last two years – is prompting renewed warnings from the UN about the threat these digital blackouts pose to freedom of expression, access to information and human rights.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166813",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Heavy snow and rainfall kill 61, injure 110 over 3 days in Afghanistan",
      "description": "Dozens were killed and hundreds homes destroyed, according to the country's disaster management authority, in storms impacting 15 of Afghanistan's 34 provinces.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5687209/deadly-snow-rainfall-afghanistan",
      "published": "Sat, 24 Jan 2026 10:00:05 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Heavy snow and rain kill 61, injure 110 over 3 days in Afghanistan, authorities say",
      "description": "Heavy snow and rainfall over the past three days have killed more than 60 people and injured over 100 across Afghanistan, the country’s disaster management authority says, as authorities in the impoverished country struggle to open roads and gain acces...",
      "url": "https://abcnews.go.com/International/wireStory/heavy-snow-rainfall-kill-61-injure-110-3-129516125",
      "published": "Sat, 24 Jan 2026 07:47:08 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Iran in the Human Rights Council, Myanmar election ‘fraud’, migration chief in Cyprus, Mozambique flood update",
      "description": "Disturbing details continued to emerge on Friday about Iran’s State-led crackdown against mass protests, while UN rights chief Volker Türk expressed deep concern that demonstrators could be executed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166819",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Indonesian rescuers struggle amid search for dozens missing after deadly landslide",
      "description": "Indonesian rescuers are struggling with mounds of mud and water‑soaked ground as they search for dozens still missing after a landslide triggered by torrential rains on the country's main island of Java killed at least 11 people the previous day",
      "url": "https://abcnews.go.com/International/wireStory/indonesian-rescuers-struggle-mud-debris-search-dozens-missing-129536220",
      "published": "Sun, 25 Jan 2026 03:00:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Another Christian community at risk in Africa as extremists and war take their toll",
      "description": "Sudan's civil war has reportedly killed 150,000 people and displaced 13 million as Christians face daily terror. Government forces allegedly killed 11 Christians on Christmas Day.",
      "url": "https://www.foxnews.com/world/another-christian-community-risk-africa-extremists-war-take-toll",
      "published": "Sat, 24 Jan 2026 12:55:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian soldier sentenced to death for refusing to fire on protesters during nationwide unrest",
      "description": "Iranian soldier Javid Khales was reportedly sentenced to death for refusing orders to shoot protesters during nationwide unrest, a human rights group says.",
      "url": "https://www.foxnews.com/world/iranian-soldier-sentenced-death-refusing-fire-protesters-nationwide-unrest",
      "published": "Tue, 20 Jan 2026 21:56:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Russian attacks on Ukraine kill 1, wound dozens ahead of second day of peace talks",
      "description": "Russian attacks on Ukraine have killed one person and wounded 31 overnight, as negotiators from Ukraine, Russia and the United States were set to met in Abu Dhabi for a second day of talks aimed at ending Moscow’s nearly four-year invasion",
      "url": "https://abcnews.go.com/International/wireStory/russian-attacks-ukraine-kill-1-wound-18-ahead-129514398",
      "published": "Sat, 24 Jan 2026 06:20:11 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns any attack will mean 'all-out war' after Trump says US 'armada' on its way",
      "description": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region.",
      "url": "https://news.sky.com/story/iran-warns-any-attack-will-mean-all-out-war-after-trump-says-us-armada-on-its-way-13498251",
      "published": "Sat, 24 Jan 2026 01:13:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Hotel fire in Pakistan's eastern city of Lahore leaves 3 dead, 8 others injured",
      "description": "A fire in the basement of a hotel in Pakistan’s eastern city of Lahore has killed three people and injured eight others, officials said",
      "url": "https://abcnews.go.com/International/wireStory/hotel-fire-pakistans-eastern-city-lahore-leaves-3-129520752",
      "published": "Sat, 24 Jan 2026 11:29:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "New Zealand landslide: rescue efforts called off for six people buried in disaster",
      "description": "Rescue efforts at Mount Maunganui site switch to recovery operation that police say could take several days Efforts to rescue six people buried by a landslide at a New Zealand holiday park ended on Saturday, with police shifting into a recovery operation. Police Supt Tim Anderson said human remains had been uncovered on Friday night beneath the mountains of dirt and debris that crashed into a campsite in Mount Maunganui on Thursday, adding that it could take several days to locate all of the victims due to the unstable ground. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/24/new-zealand-landslide-rescue-efforts-called-off-for-at-least-six-people-buried-in-disaster",
      "published": "Sat, 24 Jan 2026 02:23:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Two dead and six missing after landslides hit house and campground in New Zealand",
      "description": "Search-and-rescue teams worked through the night at the campground, but there had been no progress in finding missing people, officials say New Zealand is ‘full of grief”, the prime minister has said, after landslides tore through a house and busy campground, leaving two dead and at least six victims still missing. Police said emergency crews were still searching for at least six people, including two teenagers, believed missing beneath the debris of a landslide which struck a Mount Maunganui campsite on Thursday morning. Police were attempting to contact another three people. Families enjoying the summer school holiday were among the campers. Recreational vehicles and at least one structure were crushed, images showed. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/two-confirmed-dead-and-more-presumed-buried-after-landslides-hit-house-and-campground-in-new-zealand",
      "published": "Fri, 23 Jan 2026 01:44:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "At Davos, U.S. allies question a fraying world order",
      "description": "It was a volatile week for trans-Atlantic relations, marked by President Trump statements that unsettled global markets and strained ties with U.S. allies — on topics ranging from Greenland to Gaza.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5686526/trump-davos-world-order",
      "published": "Fri, 23 Jan 2026 14:27:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US storm leaves 160.000 without power",
      "description": "Around 160 million people across the United States, from Texas to New York, are bracing for arctic temperatures as a massive winter storm pushes toward the country’s northeast, forcing thousands of flight cancellations and prompting authorities to urge residents to stock up on food and medicine, as Charlotte Hughes and colleagues at France 2 report.",
      "url": "https://www.france24.com/en/us-storm-leaves-160-000-without-power",
      "published": "Sun, 25 Jan 2026 09:51:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN rights chief decries US treatment of migrants, as deaths in ICE custody rise",
      "description": "The UN’s top human rights official has raised alarm over what he described as the growing dehumanisation of migrants in the United States, warning that current immigration enforcement practices are undermining due process, family unity and basic human dignity.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166816",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN Assembly president defends multilateralism, UN Charter in Davos",
      "description": "From Davos, the President of the UN General Assembly on Wednesday warned that the world has entered a “make‑or‑break” moment for multilateralism, saying the rules‑based order can survive only if states speak the truth and act when it’s hard. She called for a cross‑regional alliance to push back against growing lawlessness, disinformation, and power‑based politics.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166803",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Lindsey Graham says there's 'strong consensus' to protect Kurds as Syrian forces advance on territory",
      "description": "Sen. Lindsey Graham and former Secretary of State Mike Pompeo warn of dire threats to Syrian Kurds as Syrian forces attack Kurdish-controlled territory in northern Syria.",
      "url": "https://www.foxnews.com/world/lindsey-graham-says-strong-consensus-protect-kurds-syrian-forces-advance-territory",
      "published": "Sat, 24 Jan 2026 17:45:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Indonesia resumes search for about 80 missing after landslide kills 10",
      "description": "The death toll from Saturday’s landslide in a residential area of West Java province has risen to 10.",
      "url": "https://www.aljazeera.com/news/2026/1/25/indonesia-resumes-search-for-about-80-missing-after-landslide-kills-10?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 07:49:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Unconfirmed sighting of triple murder suspect Julian Ingram reported in NSW central west",
      "description": "Police deploy air support to search properties at Mount Hope, about 70km north of Lake Cargelligo, where shootings took place on Thursday Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Warning: This article contains references to Indigenous Australians who have died Police say a sighting of Julian Ingram, who is suspected of murdering multiple people in remote NSW, has been reported about 70km north of where the shootings occurred. The unconfirmed sighting was made early on Sunday morning at Mount Hope in the NSW central west. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/25/unconfirmed-sighting-lake-cargelligo-shooting-suspect-julian-ingram-nsw-central-west-ntwnfb",
      "published": "Sun, 25 Jan 2026 01:59:24 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Protests in Iran: Official casualty figures in doubt",
      "description": "The number of people killed in the brutal suppression of protests in Iran remains unclear, with reports that the injured are avoiding medical assistance out of fear.",
      "url": "https://www.dw.com/en/protests-in-iran-official-casualty-figures-in-doubt/a-75642949?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 20:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Winter attacks in Ukraine, looming food aid cuts in Nigeria, drought in Kenya",
      "description": "Russian forces launched a fresh wave of strikes across Ukraine this week which have left hundreds of thousands of families without electricity and heating amid freezing temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166810",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: War crimes probe pledges to continue work for justice and accountability",
      "description": "As President Trump launched the international Board of Peace plan for Gaza on Thursday, top independent rights experts tasked by the UN Human Rights Council with investigating grave abuses linked to the Hamas-Israel war pledged to continue their work seeking justice and accountability for all.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166807",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti explained: why the crisis is deepening — and what comes next",
      "description": "Haiti is entering 2026 facing one of the most complex crises in its recent history. On Wednesday, the Caribbean island nation will be high on the international agenda as the UN Security Council holds its first meeting of the year to update ambassadors.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166801",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At the edge of war: the Central African Republic's uneasy border with Sudan",
      "description": "The land flattens on the approach to Birao, a cut-off town ringed by savannah in the far north of the Central African Republic, where roads dissolve into dust and motorcycles vastly outnumber cars. Less than two hours’ drive from the Sudanese border, this is the edge of a fractured country still piecing itself back together, while absorbing the shockwaves of a neighbouring conflict.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166794",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "What we know about fatal shooting of Alex Pretti by federal agents in Minneapolis",
      "description": "Trump officials says federal agents shot in self-defence, as Pretti's parents accuse them of \"sickening lies\".",
      "url": "https://www.bbc.com/news/articles/c20zjyxep99o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 04:19:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Advantage China: Trump’s tantrums push US allies closer to Beijing",
      "description": "In the search for stability, some western nations are turning to a country that many in Washington see as an existential threat If geopolitics relies at least in part on bonhomie between global leaders, China made an unexpected play for Ireland’s good graces when the taoiseach visited Beijing this month. Meeting Ireland’s leader, Micheál Martin, in the Great Hall of the People in Beijing, China’s president, Xi Jinping, said a favourite book of his as a teenager was The Gadfly, by the Irish author Ethel Voynich, a novel set in the revolutionary fervour of Italy in the 1840s. “It was unusual that we ended up discussing The Gadfly and its impact on both of us but there you are,” Martin told reporters in Beijing. Continue reading...",
      "url": "https://www.theguardian.com/news/ng-interactive/2026/jan/25/china-europe-canada-charm-offensive-trump",
      "published": "Sun, 25 Jan 2026 11:06:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "UK plans to create 'British FBI' to bring national probes under single police force",
      "description": "The British government plans to unveil a new national police force, dubbed the \"British FBI,\" to handle complex investigations like counterterrorism and fraud",
      "url": "https://abcnews.go.com/International/wireStory/uk-plans-create-british-fbi-bring-national-investigations-129537155",
      "published": "Sun, 25 Jan 2026 06:23:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti crisis at breaking point as gangs tighten grip ahead of transition deadline",
      "description": "Haiti’s deepening crisis has reached a critical phase, senior UN officials warned the Security Council on Wednesday, as powerful gangs continue to expand their control across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166806",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "‘It’s the sovereignty of the country’: Guinea-Bissau says US vaccine study suspended",
      "description": "Despite US pushback, officials in west Africa say controversial hepatitis B study on pause amid ethics concerns US health officials insisted it was still on. African health leaders said it was cancelled . At the heart of the controversy is the west African nation of Guinea-Bissau – one of the poorest countries in the world and the proposed site of a hotly debated US-funded study on vaccines. The study on hepatitis B vaccination, to be led by Danish researchers, became a flashpoint after major changes to the US vaccination schedule and prompted questions about how research is conducted ethically in other countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/guinea-bissau-hepatitis-b-vaccine-study",
      "published": "Fri, 23 Jan 2026 17:09:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "New wave of protests in Minneapolis after man is killed by federal agents",
      "description": "The killing of 37-year-old ICU nurse Alex Pretti by federal immigration agents on Saturday sparked new protests and demands for ICE to end its operations in the city. The Trump administration quickly claimed that Pretti had intended to harm the federal agents, but videos of the incident appeared to contradict their account.",
      "url": "https://www.france24.com/en/americas/20260125-protesters-in-minneapolis-demand-ice-leave-after-man-is-killed-by-federal-agents",
      "published": "Sun, 25 Jan 2026 06:39:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "62 Nigerian hostages rescued, 2 militants killed, army says",
      "description": "Nigeria's military rescued 62 hostages and killed two militants in operations across Zamfara, Kebbi and Sokoto states after weekend church kidnappings.",
      "url": "https://www.foxnews.com/world/62-nigerian-hostages-rescued-2-militants-killed-army-says",
      "published": "Wed, 21 Jan 2026 14:08:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran's Revolutionary Guard commander warns the US, says his force has its 'finger on the trigger'",
      "description": "The commander of Iran’s paramilitary Revolutionary Guard, a force which was key in putting down recent nationwide protests in a crackdown that left thousands dead, says the force is “more ready than ever, finger on the trigger.”",
      "url": "https://abcnews.go.com/International/wireStory/irans-revolutionary-guard-commander-warns-us-force-finger-129515790",
      "published": "Sat, 24 Jan 2026 06:49:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "College soccer star, girlfriend dead as illegal immigrant’s record ignites lawmaker fury statewide",
      "description": "Fatal North Carolina crash allegedly caused by repeat DUI offender sparks heated debate over sanctuary policies and immigration enforcement failures.",
      "url": "https://www.foxnews.com/us/college-soccer-star-girlfriend-dead-illegal-immigrants-record-ignites-lawmaker-fury-statewide",
      "published": "Sun, 25 Jan 2026 08:00:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Fox News Campus Radicals Newsletter: Union tell-all, Virginia Dems peddle DEI, far-left death threat on campus",
      "description": "Stay up to date with the Fox News Campus Radicals newsletter, which brings you the in-depth investigative stories from college campuses nationwide.",
      "url": "https://www.foxnews.com/us/fox-news-campus-radicals-newsletter-union-tell-all-virginia-dems-peddle-dei-far-left-death-threat-campus",
      "published": "Fri, 23 Jan 2026 18:21:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of sex assaults on teenage prisoners, while families charged to recover remains of loved ones",
      "description": "Iran's prosecutor general Mohammad Movahedi claims government crushed nationwide protests as death toll reaches 544 with over 10,681 arrested.",
      "url": "https://www.foxnews.com/world/iran-accused-sex-assaults-teenage-prisoners-families-charged-recover-remains-loved-ones",
      "published": "Wed, 21 Jan 2026 21:38:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Indonesia landslide kills seven, dozens missing",
      "description": "Rescue teams are searching the West Java village for 83 people who are still unaccounted for.",
      "url": "https://www.bbc.com/news/articles/c87r53y4dx0o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 06:02:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Danish PM in Greenland for 'show of support' after Trump threats",
      "description": "Mette Frederiksen visits the territory after weeks of tension over the US president's warnings that he could take control of it.",
      "url": "https://www.bbc.com/news/articles/c78ejd0xmp0o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 03:52:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump withdraws invitation for Canada to join his global ‘board of peace’",
      "description": "While leaders of many liberal democracies declined to sign on, Mark Carney had, before Davos, accepted in principle Donald Trump withdrew on Thursday an invitation for Canada to join his “board of peace” initiative aimed at resolving global conflicts. “Please let this Letter serve to represent that the Board of Peace is withdrawing its invitation to you regarding Canada’s joining, what will be, the most prestigious Board of Leaders ever assembled, at any time,” Trump wrote in a Truth Social post directed at the Canadian prime minister, Mark Carney . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/22/trump-withdraws-invitation-canada",
      "published": "Fri, 23 Jan 2026 02:28:24 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "National cabinet to meet on Friday on health and disability funding – as it happened",
      "description": "This blog is now closed. Get our breaking news email , free app or daily news podcast Just rounding out the rest of the prime minister’s jam-packed Insiders interview, Anthony Albanese reiterated that Australia would give “further consideration” to Donald Trump ’s invitation to join the his “board of peace” but said it was unclear what the objectives of the board are. (If you want to read more about the project first, you can turn to Ben Doherty’s from earlier this week:) It’s unclear what the objectives of this [the ‘board of peace’ are, which is why we will give it further consideration. My government is one that always has an orderly considered approach to all of our policy, including our international engagement. So we’ve had the 5% housing deposit rolling out, being taken advantage of. Three days of guaranteed childcare subsidy began on 6 January. Cheaper medicines, $25, came in on 1 January. 1800 Medicare has been accessed by tens of thousands of Australians. The bulk-billing incentive has led to a massive spike in the number of free doctor visits … What we have been focused on is dealing with the immediate, but dealing with all of those issues that are so important for Australians as well. And as we go back, school goes back this fortnight, and what that will mean is that the increased fair funding for every school, that begins to kick in as well. So you can walk and chew gum at the same time, as the saying goes, and we’ve been determined to do just that. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/25/victoria-otways-bushfires-nsw-lake-cargelligo-manhunt-federal-politics-anthony-albanese-labor-sussan-ley-coalition-ntwnfb",
      "published": "Sun, 25 Jan 2026 05:06:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "DW correspondent arrested in Niger",
      "description": "A correspondent for German international broadcaster Deutsche Welle (DW) was arrested on January 23. It comes after a report published on DW Hausa last year.",
      "url": "https://www.dw.com/en/dw-correspondent-arrested-in-niger/a-75640860?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 16:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Africa’s role in Trump’s uncertain vision of a New World Order",
      "description": "No sub-Saharan African country was invited to join Donald Trump’s newly created “Board of Peace,” a decision that has prompted some analysts to argue the US president is once again showing disregard for the African continent, raising questions about Africa’s role in Trump’s uncertain vision of a new world order, an issue we explore with Alex Vines, director of the Africa Programme at the European Council on Foreign Relations.",
      "url": "https://www.france24.com/en/africa-s-role-in-trump-s-uncertain-vision-of-a-new-world-order",
      "published": "Sun, 25 Jan 2026 09:54:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump says UK soldiers in Afghanistan 'among greatest of all warriors'",
      "description": "The US president's praise follows his claim that allied forces avoided the front lines during the Afghanistan conflict.",
      "url": "https://www.bbc.com/news/articles/c3edwx37pd9o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 20:48:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "New Zealand calls off rescue efforts for six missing after landslide",
      "description": "Police say they are not expecting to find any more survivors from the landslide, with six people still unaccounted for.",
      "url": "https://www.bbc.com/news/articles/c050vnl7p10o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 06:34:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens 100% tariffs on Canadian goods over pending China trade deal",
      "description": "US President Donald Trump warned on Saturday that Canada would face 100% tariffs on all its exports to the United States if Ottawa pursued a trade agreement with China, deepening already strained relations between the two neighbours.",
      "url": "https://www.france24.com/en/americas/20260124-trump-threatens-100-tariffs-on-canadian-goods-over-pending-china-trade-deal",
      "published": "Sat, 24 Jan 2026 21:39:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Eight dead and more than 80 missing after Indonesia landslide",
      "description": "At least eight people have been killed and more than 80 others are missing following a landslide on Indonesia's Java island.",
      "url": "https://news.sky.com/story/eight-dead-and-dozens-missing-after-landslide-on-indonesias-java-island-13498297",
      "published": "Sat, 24 Jan 2026 10:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Landslide on Indonesia's Java island kills at least 8, leaves dozens missing",
      "description": "A predawn landslide triggered by torrential rains on Indonesia’s main island of Java has killed at least eight people and left more than 80 missing",
      "url": "https://abcnews.go.com/International/wireStory/landslide-indonesias-java-island-kills-8-people-leaves-129514688",
      "published": "Sat, 24 Jan 2026 04:17:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Scale of Iran's nationwide protests and bloody crackdown comes into focus",
      "description": "The scale of nationwide protests in Iran and the bloody crackdown that has followed is slowly coming into focus, even though authorities have cut off the country from the internet",
      "url": "https://abcnews.go.com/International/wireStory/scale-irans-nationwide-protests-bloody-crackdown-focus-internet-129514306",
      "published": "Sat, 24 Jan 2026 02:30:16 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UN envoy highlights ‘window to advance peace’ in Colombia",
      "description": "The new year provides an opportunity for Colombia to keep advancing towards lasting peace, a decade after a landmark accord that ended more than 50 years of conflict, the UN Special Representative told the Security Council on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166818",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Alex Pretti identified as Minneapolis man fatally shot by federal immigration agent",
      "description": "A person in Minneapolis was reportedly shot during an interaction with Border Patrol agents. DHS tells Fox News that the suspect was armed.",
      "url": "https://www.foxnews.com/us/border-patrol-involved-shooting-reported-minneapolis",
      "published": "Sat, 24 Jan 2026 11:10:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Thousands march through Minneapolis, swarm Target Center demanding ICE removal from Minnesota",
      "description": "Anti-ICE agitators swarmed the Target Center in Minneapolis Friday, and thousands marched downtown demanding a stop to federal immigration enforcement operations in the city.",
      "url": "https://www.foxnews.com/us/thousands-march-through-minneapolis-swarm-target-center-demanding-ice-removal-minnesota",
      "published": "Fri, 23 Jan 2026 20:08:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump pressures UK over Hamas-linked figure as US intel flags potential terror threat",
      "description": "U.S. Treasury sanctioned Zaher Birawi, 64, alleging the Britain-based activist serves as a Hamas senior official through a Popular Conference for Palestinians Abroad leadership role.",
      "url": "https://www.foxnews.com/world/trump-pressures-uk-hamas-linked-figure-us-intel-flags-potential-terror-threat",
      "published": "Thu, 22 Jan 2026 16:46:05 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Cathy Freeman leads Australia Day honours alongside enforcer of world-first social media ban",
      "description": "High-profile Australians celebrated alongside more than 600 civilians who have changed lives and the country Astronaut Katherine Bennell-Pegg named Australian of the Year for 2026 Get our breaking news email , free app or daily news podcast Australia’s beloved Olympic sprinter Cathy Freeman has been recognised in this year’s Australia Day Honours list alongside a driving force of one of the Games’ youngest sports, skateboarding, a world-leading quantum scientist, a children’s book illustrator, rock royalty and the enforcer of Australia’s world-first social media ban. Freeman was appointed a Companion of the Order of Australia, the country’s highest civilian honour. Her sensational athletic achievements were applauded by the honours committee, which also acknowledged her social impact across the community, her work on the reconciliation movement in the spirit of unity and inclusion, and as a role model to young people. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/25/australia-day-honours-2026-cathy-freeman-social-media-ban-rob-hirst-midnight-oil",
      "published": "Sun, 25 Jan 2026 11:00:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘Cycle of attacks must end’: Lead UN official in Ukraine",
      "description": "The senior UN official in Ukraine, Matthias Schmale, has issued a condemnation of the massive overnight Russian drone and missile strike on several major Ukrainian cities, killing and injuring civilians, and knocking out energy infrastructure amid sub-zero temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166825",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Final round of voting closes in 'sham' Myanmar election",
      "description": "The party backed by the ruling generals is expected to win a landslide in a country gripped by fear and civil war.",
      "url": "https://www.bbc.com/news/articles/cx2l6wg0p8eo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 13:05:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Bulgarians quit Germany, choose remote work",
      "description": "Many highly skilled Bulgarians are moving back to their home country, swayed by the major income boost for remote work.",
      "url": "https://www.dw.com/en/bulgarians-quit-germany-choose-remote-work/a-75613408?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 10:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria: Renewed clashes risk derailing fragile transition",
      "description": "A tense standoff between the Syrian Government and Kurdish-led forces in the country’s northeast risks igniting wider instability just as Syria struggles to emerge from years of conflict and authoritarian rule, senior UN officials told the Security Council on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166811",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syrians greet extended army-SDF ceasefire with guarded optimism",
      "description": "Extension offers a welcome respite as Syrian forces advance towards the last SDF strongholds in the northeast.",
      "url": "https://www.aljazeera.com/news/2026/1/25/syrians-greet-extended-army-sdf-ceasefire-with-guarded-optimism?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 10:19:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Protesters demand immigration agents leave Minneapolis",
      "description": "Killing of ICU nurse by US border agent sparks protests in Minneapolis, already tense after earlier shootings.",
      "url": "https://www.aljazeera.com/gallery/2026/1/25/protesters-demand-immigration-agents-leave-minneapolis?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 08:50:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russian strikes knock out heat in freezing Kyiv as peace talks continue",
      "description": "Russian strikes left much of Kyiv without heat, water and power during freezing temperature, even as Ukraine, Russia and the U.S. held talks on ending the nearly four-year war.",
      "url": "https://www.npr.org/2026/01/24/g-s1-107248/russia-strikes-kyiv-cold",
      "published": "Sat, 24 Jan 2026 19:42:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis: ICE agents shoot dead nurse Alex Pretti",
      "description": "Democrats are threatening a government shutdown after ICE agents killed Alex Pretti in Minneapolis. Pretti was a 37-year-old US citizen and intensive care nurse. DW has the latest.",
      "url": "https://www.dw.com/en/minneapolis-ice-agents-shoot-dead-nurse-alex-pretti/live-75641710?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 08:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US winter storm: 13,000 flights canceled as temperatures dip",
      "description": "Millions of people hunkered down as a major winter storm pummeled much of central and eastern half of the country. Thousands of flights were canceled, and thousands reported power outages in dangerously cold conditions.",
      "url": "https://www.dw.com/en/us-winter-storm-13-000-flights-canceled-as-temperatures-dip/a-75645912?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 03:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Paris: Homeless living in outdoor camps continues to rise",
      "description": "With France’s local elections set for March, attention is turning to homelessness in the race for Paris city hall, as more than 3,500 people were living on the streets of the French capital last year, an issue we discuss with Paul Alauzy, a member of a collective pushing to make homelessness a central concern for the next mayor of Paris.",
      "url": "https://www.france24.com/en/paris-homeless-living-in-outdoor-camps-continues-to-rise",
      "published": "Sun, 25 Jan 2026 10:04:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Campus Radicals: Union member tell-all, Dems back to DEI ways, more violent leftist threats on campus",
      "description": "Teachers union headlines, anti-Republican death threats and Virginia Democrats' new push for DEI in the classroom rounded out Campus Radicals coverage for the week.",
      "url": "https://www.foxnews.com/us/campus-radicals-teachers-union-tell-all-dems-back-dei-ways-more-violent-leftist-threats-campus",
      "published": "Sat, 24 Jan 2026 09:00:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran Revolutionary Guard commander says regime has 'finger on the trigger' as US warships head to Middle East",
      "description": "Iran's Revolutionary Guard chief warns the U.S. it has a \"finger on the trigger\" as American warships head to the Middle East amid anti-regime protests.",
      "url": "https://www.foxnews.com/world/iran-revolutionary-guard-commander-says-regime-has-finger-trigger-us-warships-head-middle-east",
      "published": "Sat, 24 Jan 2026 16:09:04 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump slams UK island handoff deal that could put key US military base at risk",
      "description": "President Donald Trump calls the United Kingdom's Chagos Islands transfer plan \"an act of great stupidity,\" warning China could exploit the deal.",
      "url": "https://www.foxnews.com/world/trump-slams-uk-island-handoff-deal-put-key-us-military-base-risk",
      "published": "Wed, 21 Jan 2026 18:25:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Gaza reconstruction talks must not distract from massive needs, say UN aid agencies",
      "description": "Amid reconstruction talks on Gaza linked to President Trump's just-launched Board of Peace, UN aid agencies insisted on Friday that what Gazans need most is immediate relief from the ongoing humanitarian catastrophe there.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166815",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Peace talks on Russia-Ukraine war end as fighting rages",
      "description": "No breakthrough is reported at the first three-way talks but reports suggest they will resume next month.",
      "url": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 23:37:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Clashes erupt at antigovernment protest in Albanian capital Tirana",
      "description": "Protests turn violent, arrests are made, as opposition accuses Prime Minister Edi Rama and allies of corruption.",
      "url": "https://www.aljazeera.com/gallery/2026/1/25/clashes-erupt-at-antigovernment-protest-in-albanian-capital-tirana?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 13:03:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis live news: US federal agents shoot dead nurse Alex Pretti",
      "description": "Videos show the victim holding a phone in his hand, not a handgun, as he ⁠tried to help other protesters.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/25/minneapolis-live-us-federal-agents-shoot-dead-nurse-alex-pretti?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 07:40:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens Canada with 100% tariff over possible deal with China",
      "description": "President also claims US refineries will process seized Venezuelan oil, saying ‘we take the oil’ Donald Trump on Saturday said he would impose a 100% tariff on all Canadian imports if the North American country makes a trade deal with China . Beside that tariff threat, another Trump foreign policy maneuver to make news on Saturday involved the president announcing the US had taken the oil that was on recently seized Venezuelan tankers. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/24/trump-canada-tariff-threat-venezuela-oil",
      "published": "Sat, 24 Jan 2026 15:04:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Canadian Olympic snowboarder turned alleged cocaine kingpin in US custody",
      "description": "Ryan Wedding turned himself in at US consulate in Mexico City and is due to appear in court in California on Monday Ryan Wedding, the Canadian Olympic snowboarder turned alleged drug kingpin , has been arrested after turning himself in at the US embassy in Mexico, law enforcement officials announced on Friday. Wedding, 44, had been sought by the FBI and the Royal Canadian Mounted Police (RCMP) for his role in overseeing what the US attorney general, Pam Bondi , called the “one of the most prolific and violent drug-trafficking organizations” in the world. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/ryan-wedding-arrested",
      "published": "Fri, 23 Jan 2026 18:11:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Virginia Democrats frustrate law enforcement with bill axing prison time for violent crime, expert warns",
      "description": "Virginia Democrats propose eliminating minimum prison sentences for violent crimes including rape and manslaughter, sparking widespread controversy and debate.",
      "url": "https://www.foxnews.com/us/virginia-democrats-frustrate-law-enforcement-bill-axing-prison-time-violent-crime-expert-warns",
      "published": "Sat, 24 Jan 2026 06:00:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Man who allegedly threatened to shoot ICE agents had rifles, body armor and ammo cache, feds say",
      "description": "An Ohio man who allegedly threatened ICE agents on social media is facing federal charges after authorities found guns and tactical gear at his home.",
      "url": "https://www.foxnews.com/us/man-allegedly-threatened-shoot-ice-agents-rifles-body-armor-ammo-cache-feds",
      "published": "Fri, 23 Jan 2026 21:03:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators, including clergy, arrested at Minneapolis airport during protest in frigid weather",
      "description": "Faith leaders and clergy arrested at Minneapolis airport during anti-ICE protest demanding airlines refuse federal immigration enforcement cooperation.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-clergy-arrested-minneapolis-airport-protest-frigid-weather",
      "published": "Fri, 23 Jan 2026 18:39:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "As the world inches back to a pre-WW2 order, the 'middle powers' face a grave new challenge",
      "description": "With economic stagnation and extremes of inequality comes corrosion of trust in democratic institutions. So Trump may be a symptom, not a cause, of what Carney called a \"rupture\" with the post-WW2 order.",
      "url": "https://www.bbc.com/news/articles/c99kkerr93ko?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 00:25:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "What India's Republic Day red carpet means for its foreign policy",
      "description": "Who sits beside India’s president on Republic Day signals Delhi’s diplomatic priorities to the world.",
      "url": "https://www.bbc.com/news/articles/c9wxx29yknpo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 02:03:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Dozens arrested in support of Palestine hunger strikers at London prison",
      "description": "Videos show police officers shoving protesters to the ground and herding them outside Prison Wormwood Scrubs.",
      "url": "https://www.aljazeera.com/news/2026/1/25/dozens-arrested-in-support-of-palestine-hunger-strikers-at-london-prison?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 12:49:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Babar returns as Pakistan name T20 World Cup squad despite tournament doubt",
      "description": "Uncertainty shrouds Pakistan's participation after ICC expels Bangladesh from the tournament.",
      "url": "https://www.aljazeera.com/sports/2026/1/25/babar-returns-as-pakistan-name-t20-world-cup-squad-despite-tournament-doubt?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 10:32:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cricket players, officials slam ICC for Bangladesh’s T20 World Cup ouster",
      "description": "Ex-players and cricket administrators question the ICC's decision, saying it reeks of double standards and injustice.",
      "url": "https://www.aljazeera.com/sports/2026/1/25/cricket-players-officials-slam-icc-for-bangladeshs-t20-world-cup-ouster?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 07:30:43 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UNESCO has officially added yodeling to its list of 'Intangible Cultural Heritage'",
      "description": "Yodeling has been officially recognized by the UN as part of the world's intangible cultural heritage.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5684328/unesco-has-officially-added-yodeling-to-its-list-of-intangible-cultural-heritage",
      "published": "Sat, 24 Jan 2026 07:27:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Where is the US-China AI 'race' heading in 2026?",
      "description": "With American tech continuing to dominate developing the frontier of artificial intelligence, China is holding its own with globally popular cheaper models and plans for building an AI-powered economy in the near future.",
      "url": "https://www.dw.com/en/where-is-the-us-china-ai-race-heading-in-2026/a-75608670?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 12:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "How Israeli settler violence empties Palestinian villages",
      "description": "Settler violence has forced over 100 people out of a Palestinian Bedouin village in the occupied West Bank in recent weeks, rights groups say. The pattern of harassment is also being repeated elsewhere.",
      "url": "https://www.dw.com/en/how-israeli-settler-violence-empties-palestinian-villages/a-75595251?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 12:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Alcaraz, Djokovic and Sabalenka reach Australian Open quarter-finals",
      "description": "Carlos Alcaraz and Novak Djokovic, hoping for a record 25th Grand Slam crown, both made it through to the Australian Open quarter-finals on Sunday, along with women's world number one Aryna Sabalenka who continued her title charge with a second-set tiebreak – the 20th Grand Slam tiebreak she has won in a row.",
      "url": "https://www.france24.com/en/sport/20260125-alcaraz-djokovic-power-into-melbourne-quarter-finals-as-next-gen-roars",
      "published": "Sun, 25 Jan 2026 10:09:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Climber Alex Honnold scales Taipei 101 skyscraper without ropes",
      "description": "American climber Alex Honnold ascended one of the world's tallest buildings on Sunday without a rope or protective equipment.",
      "url": "https://news.sky.com/story/climber-alex-honnold-scales-taipei-101-skyscraper-without-ropes-13498734",
      "published": "Sun, 25 Jan 2026 08:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Young people must be ‘truly involved’ in transforming education",
      "description": "With young people under 30 making up more than half of the global population and over 272 million children and youth still out of school, their participation in shaping education is becoming increasingly vital.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166820",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Eighty years at the heart of global development",
      "description": "From humanitarian crises and youth unemployment, to climate resilience and development financing, many of today’s global challenges pass through a single United Nations body that is quietly turning 80 this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166814",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "For every $1 spent protecting nature, $30 goes to destroying it",
      "description": "The world spends billions to protect nature, but trillions are being invested in business activities that harm the environment.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166809",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Germany arrests suspected Hamas member over alleged attack plot",
      "description": "The Lebanese man helped plan attacks on Jewish and Israeli institutions in Europe, prosecutors say.",
      "url": "https://www.bbc.com/news/articles/c8rm14lkkvzo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 18:57:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boy, 12, dies from injuries after Sydney shark attack",
      "description": "Nico Antic was swimming in Sydney Harbour when he was attacked last Sunday.",
      "url": "https://www.bbc.com/news/articles/c2k98ql703no?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 05:10:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'A natural partner': US treasury secretary weighs in on Alberta separatism",
      "description": "Scott Bessent's comments come amid a war of words between Ottawa and Washington.",
      "url": "https://www.bbc.com/news/articles/cy8ylqx0zw4o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 03:20:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘Invoking Insurrection Act would escalate conflict with private citizens’",
      "description": "‘Invoking US Insurrection Act would escalate conflict with private citizens’",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/25/invoking-insurrection-act-would-escalate-conflict-with-private-citizens?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 13:05:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Myanmar holds final stage of disputed election as rebels continue fighting",
      "description": "Myanmar’s final stage of its disputed general election is under way despite the ongoing civil war.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/25/myanmar-holds-final-stage-of-disputed-election-as-rebels-continue-fighting?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 11:50:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli forces kill Palestinian man in occupied West Bank",
      "description": "Israeli army intensifies its deadly West Bank attacks as settlers rampage across Palestinian lands with impunity.",
      "url": "https://www.aljazeera.com/news/2026/1/25/israeli-forces-kill-palestinian-man-in-occupied-west-bank-10?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 10:49:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘Not optimistic’: Ukrainians doubt Russia ready to end war amid talks",
      "description": "Ukrainians have little hope after a US-brokered meeting as they endure bombardments and blackouts.",
      "url": "https://www.aljazeera.com/news/2026/1/25/not-optimistic-in-ukraine-scepticism-surrounds-russia-war-peace-talks?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 09:35:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Astronaut Katherine Bennell-Pegg named Australian of the Year for 2026",
      "description": "Bennell-Pegg tells ceremony in Canberra she hopes to use award to inspire young people to chase their dreams Cathy Freeman leads Australia Day 2026 honours list Get our breaking news email , free app or daily news podcast As a girl, Katherine Bennell-Pegg would lie on the dry grass in her backyard, gazing up at the stars and dreaming about one day reaching them. While she’s yet to enter space, the now-41-year-old is closer than most could ever hope for. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/25/astronaut-katherine-bennell-pegg-named-australian-of-the-year-for-2026",
      "published": "Sun, 25 Jan 2026 11:21:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Dingoes on Australia’s K’gari island to be euthanised after tragic death of Canadian tourist Piper James",
      "description": "Queensland government says pack linked to 19-year-old’s death pose ‘unacceptable public safety risk’ as Indigenous traditional owners say they were not consulted The dingo pack linked to the death of Canadian tourist Piper James on Australian island K’gari will be destroyed, the Queensland government has announced. Environment minister Andrew Powell said on Sunday that an entire pack of 10 animals would be euthanised. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/25/dingoes-on-australias-kgari-island-to-be-euthanised-after-tragic-death-of-canadian-tourist-piper-james",
      "published": "Sun, 25 Jan 2026 06:04:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A Canadian Olympic snowboarder turned alleged drug kingpin is arrested in Mexico",
      "description": "Ryan Wedding was among the FBI's top fugitives and faces charges related to drug trafficking and the killing of a federal witness. He reportedly turned himself in at the U.S. embassy in Mexico",
      "url": "https://www.npr.org/2026/01/23/g-s1-107051/ryan-wedding-arrest-canada-olympic-snowboarder-alleged-drug-kingpin",
      "published": "Fri, 23 Jan 2026 13:35:25 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Myanmar opens final round of controversial election",
      "description": "Myanmar began the final phase of its month-long election on Sunday, just a week short of the fifth anniversary of the military coup, with the dominant pro-military party heading toward what appears to be a landslide victory in a junta-run vote, one that critics argue will only serve to entrench the army’s hold on power. Liza Kaminov tells us more.",
      "url": "https://www.france24.com/en/myanmar-opens-final-round-of-controversial-election",
      "published": "Sun, 25 Jan 2026 12:43:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Aftermath challenges daily life in Syria",
      "description": "The withdrawal of the Kurdish-led SDF from northeastern Syria represents the most significant shift in control in the country since the fall of longtime ruler Bashar al-Assad, according to reports from D. Alboz, H. Hammoud and Liza Kaminov.",
      "url": "https://www.france24.com/en/aftermath-challenges-daily-life-in-syria",
      "published": "Sun, 25 Jan 2026 10:22:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Barbaric' attack during Ukraine peace talks - but 'unexpected chemistry' raises hopes",
      "description": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said.",
      "url": "https://news.sky.com/story/barbaric-attack-on-ukraines-largest-cities-during-peace-talks-further-negotiations-expected-as-early-as-next-week-13498413",
      "published": "Sat, 24 Jan 2026 14:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boy, 12, dies after shark attack in Sydney Harbour",
      "description": "An Australian boy attacked by a shark in Sydney Harbour has died in hospital, his family has announced.",
      "url": "https://news.sky.com/story/boy-12-dies-after-shark-attack-in-sydney-harbour-13498258",
      "published": "Sat, 24 Jan 2026 07:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Wife of Uganda's opposition leader recounts how armed men attacked her at her home",
      "description": "Armed men have attacked the home of Ugandan opposition leader Bobi Wine, targeting his wife, Barbara Kyagulanyi",
      "url": "https://abcnews.go.com/International/wireStory/wife-ugandas-opposition-leader-recounts-armed-men-attacked-129518396",
      "published": "Sat, 24 Jan 2026 10:09:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Keeping people warm amid hostilities and harsh winter weather in Ukraine",
      "description": "As people in war-torn Ukraine face the coldest winter in more than a decade, authorities and humanitarians are working to help them stay warm, particularly the most vulnerable residents.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166822",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Deputy saves mail driver from burning truck in Washington: bodycam",
      "description": "Washington deputy saves mail truck driver from burning wreckage after collision. Bystander helps extinguish flames in dramatic rescue caught on camera.",
      "url": "https://www.foxnews.com/us/deputy-saves-mail-driver-from-burning-truck-washington-bodycam",
      "published": "Sun, 25 Jan 2026 08:01:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Alex Pretti, 37, identified as man fatally shot by Border Patrol agent in Minneapolis",
      "description": "A Border Patrol agent fatally shot Minneapolis ICU nurse Alex Jeffrey Pretti during an immigration operation in Minneapolis on Saturday.",
      "url": "https://www.foxnews.com/us/alex-pretti-37-identified-man-fatally-shot-border-patrol-agent-minneapolis",
      "published": "Sat, 24 Jan 2026 17:24:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Parents’ relentless hunt for missing daughter heats up as new technology breathes life into case",
      "description": "Jennifer Kesse's parents refuse to give up searching for their daughter 20 years after she disappeared in Orlando. New AI technology brings hope.",
      "url": "https://www.foxnews.com/us/parents-relentless-hunt-missing-daughter-heats-up-new-tech-breathes-life-case",
      "published": "Sat, 24 Jan 2026 10:00:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy touts ‘constructive’ trilateral talks between the US, Russia and Ukraine in Abu Dhabi",
      "description": "Ukraine's Zelenskyy calls recent US-Russia-Ukraine talks in Abu Dhabi \"constructive,\" marking potential breakthrough in diplomatic efforts to end the war.",
      "url": "https://www.foxnews.com/world/zelenskyy-touts-constructive-trilateral-talks-between-us-russia-ukraine-abu-dhabi",
      "published": "Sun, 25 Jan 2026 08:00:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boy, 12, dies after shark attack while swimming at popular cliff-jumping spot: 'We are heartbroken'",
      "description": "Nico Antic, 12, died from injuries after a shark attack at Sydney Harbour's Jump Rock. Friends heroically pulled him to safety after the attack.",
      "url": "https://www.foxnews.com/world/boy-12-dies-following-shark-attack-popular-cliff-jumping-spot-heartbroken",
      "published": "Sat, 24 Jan 2026 20:45:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia, Ukraine to discuss territory as Trump says both sides 'want to make a deal'",
      "description": "Abu Dhabi hosts trilateral meeting with the U.S., Ukraine and Russia in a possible sign that the nearly four-year war could be coming to an end.",
      "url": "https://www.foxnews.com/world/russia-ukraine-discuss-territory-trump-says-both-sides-want-make-deal",
      "published": "Fri, 23 Jan 2026 15:25:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Canadian PM Carney fires back at Trump over claim that 'Canada lives because of the United States'",
      "description": "Prime Minister Mark Carney rejected President Donald Trump's claim that \"Canada lives because of the United States,\" declaring Canada \"thrives because we are Canadian.\"",
      "url": "https://www.foxnews.com/world/canadian-pm-carney-fires-back-trump-over-claim-canada-lives-because-united-states",
      "published": "Fri, 23 Jan 2026 10:19:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pentagon to reduce its role in deterrence of North Korea",
      "description": "US policy document suggests South Korea take primary responsibility, as Pentagon prioritises defending US homeland The Pentagon foresees a “more limited” role in deterring North Korea, with South Korea taking primary responsibility for the task, a Pentagon policy document released on Friday said, in a move likely to raise concern in Seoul. South Korea hosts about 28,500 US troops in combined defence against North Korea’s military threat and Seoul has raised its defence budget by 7.5% for this year. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/24/north-korea-pentagon-to-reduce-role-deterrence",
      "published": "Sat, 24 Jan 2026 06:18:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens Canada with 100% tariffs over its new trade deal with China",
      "description": "The announcement is a reversal for Trump, who initially initially praised the agreement with China as something Canadian Prime Minister Mark Carney \"should be doing.\"",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5687236/canada-china-tariffs-trump",
      "published": "Sat, 24 Jan 2026 11:53:17 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Virginia Democrats blasted for threatening historic military college VMI with funding threat over DEI concerns",
      "description": "Virginia Democrats introduce resolution to investigate VMI funding as Governor Spanberger faces criticism for DEI push at historic military college.",
      "url": "https://www.foxnews.com/us/virginia-democrats-blasted-threatening-historic-military-college-vmi-funding-threat-over-dei-concerns",
      "published": "Sat, 24 Jan 2026 08:00:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Pentagon to offer 'more limited' support to US allies in defence strategy shift",
      "description": "The US will also offer “more limited” support to US allies, according to a new national defence strategy document.",
      "url": "https://www.bbc.com/news/articles/cj9r8ezym3ro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 07:57:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Who was Alex Pretti, the nurse shot dead by federal agents in Minneapolis?",
      "description": "Two witnesses said in court filings that the victim did not brandish a gun, refuting claims by the Trump administration.",
      "url": "https://www.aljazeera.com/news/2026/1/25/who-was-alex-pretti-the-nurse-shot-dead-by-federal-agents-in-minneapolis?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 09:21:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Spanish prosecutors drop sexual assault complaint against Julio Iglesias",
      "description": "Court says alleged abuse and trafficking offences occurred outside Spain, leaving it without jurisdiction Spanish prosecutors have shelved a complaint brought by two women who have accused the singer Julio Iglesias of sexual assault and human trafficking , arguing the country’s courts have no jurisdiction as the alleged offences took place outside Spain. Two female former employees who worked at Iglesias’s Caribbean mansions 10 days ago accused the veteran entertainer of sexual assault, saying they had been subjected “to inappropriate touching, insults and humiliation … in an atmosphere of control and constant harassment”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/spanish-prosecutors-drop-julio-iglesias-complaint",
      "published": "Fri, 23 Jan 2026 18:20:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Junta-backed party poised to win Myanmar elections",
      "description": "Myanmar's junta chief Min Aung Hlaing is widely expected to take on the country's presidency after the highly controversial elections.",
      "url": "https://www.dw.com/en/junta-backed-party-poised-to-win-myanmar-elections/a-75646268?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 06:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Man shot by US federal agents in Minneapolis immigration crackdown dies",
      "description": "No description available.",
      "url": "https://www.france24.com/en/americas/20260124-us-federal-agents-carry-out-another-horrific-shooting-minneapolis-governor",
      "published": "Sat, 24 Jan 2026 17:05:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "DHS says illegal immigrant accused of throwing rock at New Jersey school bus, injuring young girl",
      "description": "A New Jersey man accused of throwing a rock at a school bus and seriously injuring an 8-year-old girl is in the country illegally, according to the Department of Homeland Security.",
      "url": "https://www.foxnews.com/us/dhs-says-illegal-immigrant-accused-throwing-rock-new-jersey-school-bus-injuring-young-girl",
      "published": "Sun, 25 Jan 2026 00:55:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens Canada with 100% tariffs if it 'makes a deal with China'",
      "description": "It comes as tensions appear to have escalated between Trump and Canadian Prime Minister Mark Carney.",
      "url": "https://www.bbc.com/news/articles/cy4qww3w72lo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 22:10:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China places highest-ranking general under investigation",
      "description": "President Xi has been accused of using investigations to purge political rivals.",
      "url": "https://www.bbc.com/news/articles/c701kr5zqdqo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 14:14:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Mass arrests at UK protest in support of hunger-striking detainee",
      "description": "Police carried out mass arrests after a peaceful protest outside a London prison in support of hunger-striking detainee.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/25/mass-arrests-at-uk-protest-in-support-of-hunger-striking-detainee?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 07:42:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syria agrees to extend ceasefire with SDF for 15 more days",
      "description": "A fragile ceasefire between Syria’s government and the Kurdish-led SDF has been extended by 15 days.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/25/syria-agrees-to-extend-ceasefire-with-sdf-for-15-more-days?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 07:31:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Leaked video shows Venezuela regime’s desperate struggle to control message",
      "description": "Interim leader Delcy Rodríguez told influencers of US threat to kill leaders if they did not cooperate after capture of Maduro The communications minister holds a phone up to a microphone before a gathering of regime-friendly influencers. On speakerphone is Venezuela’s acting president, Delcy Rodríguez , who claims that when US forces captured the dictator Nicolás Maduro , she and other members of his cabinet were given 15 minutes to decide whether to comply with Washington’s demands – “or they would kill us”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/venezuela-leaked-video-delcy-rodriguez-maduro",
      "published": "Fri, 23 Jan 2026 12:00:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China's top general under investigation in latest military purge",
      "description": "Analysts believe these purges aim to reform the military and ensure loyalty to Chinese leader Xi Jinping. Another commission member, Liu Zhenli, is also under investigation.",
      "url": "https://www.npr.org/2026/01/24/g-s1-107210/chinas-top-general-under-investigation-in-latest-military-purge",
      "published": "Sat, 24 Jan 2026 08:38:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany news: Majority see Trump as threat to nation",
      "description": "A new poll finds more than 60% of Germans see the US president as a major threat. It comes as the president's actions and rhetoric have alienated US allies. Follow DW here for the latest.",
      "url": "https://www.dw.com/en/germany-news-majority-see-trump-as-threat-to-nation/live-75639462?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 09:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US defense plan focuses on homeland, limits help to allies",
      "description": "A new Pentagon strategy paper breaks with much past US defense policy, while ignoring climate change as a growing threat. It also foresees allies receiving less military support from Washington.",
      "url": "https://www.dw.com/en/us-defense-plan-focuses-on-homeland-limits-help-to-allies/a-75638387?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 11:10:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Live: France takes Indian captain of suspected Russian shadow tanker into custody",
      "description": "France has put the Indian captain of an oil tanker suspected of being part of Russia's sanction-busting \"shadow fleet\" in custody, prosecutors said Sunday. Meanwhile, Ukrainian President Volodymyr Zelensky sought more air defence support from allies on Sunday as hundreds of buildings in Kyiv were without heating in subfreezing temperatures for a second day after overnight Russian strikes. Follow our liveblog for updates.",
      "url": "https://www.france24.com/en/europe/20260125-live-ukraine-zelensky-russian-strikes",
      "published": "Sun, 25 Jan 2026 12:21:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "The most striking photos of the week",
      "description": "From the Northern Lights to the aftermath of protests in Iran, here are the images of the week chosen by the Sky News picture editors.",
      "url": "https://news.sky.com/story/the-most-striking-photos-of-the-week-13498292",
      "published": "Sat, 24 Jan 2026 09:39:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ceasefire with Kurdish-led force extended for another 15 days, Syrian army says",
      "description": "Hours after the expiration of a four-day truce between the Syrian government and Kurdish-led fighters Saturday, Syria’s defense ministry announced the ceasefire had been extended by another 15 days",
      "url": "https://abcnews.go.com/International/wireStory/ceasefire-kurdish-led-force-extended-15-days-syrian-129525411",
      "published": "Sat, 24 Jan 2026 21:19:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China's top general under investigation in latest military purge",
      "description": "China's Defense Ministry says the military's top general is under investigation for serious violations of discipline and law",
      "url": "https://abcnews.go.com/International/wireStory/chinas-top-general-investigation-latest-military-purge-129514693",
      "published": "Sun, 25 Jan 2026 07:34:20 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Dangerous nostalgia’ is a threat to multilateralism, UN deputy chief tells Danish MPs",
      "description": "United Nations Deputy Secretary-General Amina Mohammed urged countries to protect the UN Charter in a powerful speech to the Danish Parliament on Thursday, urging countries to “stand up for a rules-based order” – or pay the price.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166812",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "More than 15,000 US flights have now been disrupted by America’s massive winter storm",
      "description": "Massive winter storm triggers over 15,000 flight disruptions as U.S. braces for historic winter weather with more than 190 million Americans in the storm's path.",
      "url": "https://www.foxnews.com/us/more-than-15000-us-flights-have-now-been-disrupted-americas-massive-winter-storm",
      "published": "Sat, 24 Jan 2026 08:07:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza is not a real estate fantasy",
      "description": "Trump and Kushner’s plans for Gaza are bound to fail. Here is why.",
      "url": "https://www.aljazeera.com/opinions/2026/1/25/gaza-is-not-a-real-estate-fantasy?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 08:54:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Baghdad says it will prosecute Islamic State militants being moved from Syria to Iraq",
      "description": "Baghdad says it will prosecute and try militants from the Islamic State group who are being transferred from prisons and detention camps in neighboring Syria to Iraq under a U.S.-brokered deal",
      "url": "https://abcnews.go.com/International/wireStory/baghdad-prosecute-islamic-state-militants-moved-syria-iraq-129537760",
      "published": "Sun, 25 Jan 2026 07:24:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Pakistani human rights lawyers jailed for 17 years over social media posts",
      "description": "A Pakistani court has sentenced a lawyer couple to 17 years in prison each over social media posts authorities said were hostile to the state and its security institutions",
      "url": "https://abcnews.go.com/International/wireStory/pakistani-human-rights-lawyers-jailed-17-years-social-129516505",
      "published": "Sat, 24 Jan 2026 10:42:08 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2026-01-25T13:33:15.123091Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Blood supplies running low in Germany",
      "description": "A shortage of blood donations in Germany could have dramatic consequences. The situation was critical in mid-January. DW's Marcel Fürstenau answered a call to donate blood and reported on his experience.",
      "url": "https://www.dw.com/en/blood-supplies-running-low-in-germany/a-75633112?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 05:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Limited access restored to Syria’s Al Hol camp amid security concerns",
      "description": "United Nations agencies have regained limited access to Syria’s Al Hol camp and resumed the delivery of essential supplies after days of disruption caused by a volatile security situation, the UN Deputy Spokesperson said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166824",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Iran's top prosecutor criticizes Trump's announcement that 800+ executions were halted: 'Completely false'",
      "description": "Iran’s top prosecutor Mohammad Movahedi is criticizing an announcement from President Donald Trump that Iran recently canceled more than 800 executions.",
      "url": "https://www.foxnews.com/world/irans-top-prosecutor-criticizes-trumps-announcement-800-executions-were-halted-completely-false",
      "published": "Fri, 23 Jan 2026 14:18:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Climber Alex Honnold scales 101-floor skyscraper without safety gear",
      "description": "Alex Honnold has become the first person to climb the Taiwanese building alone without safety equipment.",
      "url": "https://www.bbc.com/news/articles/c4gl0njzxjdo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 09:46:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sir Mark Tully, the BBC's 'voice of India', dies aged 90",
      "description": "Sir Mark covered some of the defining moments in India's history in a career that spanned decades.",
      "url": "https://www.bbc.com/news/articles/c4nnp4d064do?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 12:12:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cosmetic doctor sorry for picking apart singer Troye Sivan's looks on TikTok",
      "description": "The singer hit out at Dr Zayn Khalid Majeed - who says he will try to have a positive impact with his content.",
      "url": "https://www.bbc.com/news/articles/czx11kw42jeo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 11:48:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "TikTok US venture to collect precise user location data",
      "description": "Details on the expanded access to location information was published in a new privacy policy for the popular social media app.",
      "url": "https://www.bbc.com/news/articles/cvgnj7v2rr5o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 03:06:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How Soviet urban planning is helping Russia freeze Ukraine",
      "description": "Thousands of people are affected when heating plants are targeted by Russian forces.",
      "url": "https://www.bbc.com/news/articles/c338jpk8r1vo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 13:56:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Encountering ICE? Here’s what to know about your legal rights",
      "description": "Experts clarify ICE limits, detailing when agents can stop, detain or enter homes and what rights residents have.",
      "url": "https://www.aljazeera.com/news/2026/1/25/heres-what-to-know-about-your-legal-rights-when-encountered-with-ice?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 10:28:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sabalenka, Alcaraz and Gauff book Australian Open quarterfinals",
      "description": "Sabalenka beats Mboko to advance to quarterfinal against teen sensation Jovic as Gauff drops set but overcomes Muchova.",
      "url": "https://www.aljazeera.com/sports/2026/1/25/sabalenka-alcaraz-and-gauff-book-australian-open-quarterfinals?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 10:15:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cuban official accuses US of ‘piracy’ against sanctioned Caribbean island",
      "description": "Ambassador Carlos de Cespedes says US pressure 'will not subjugate' Cuba as Venezuelan oil exports to island dry out.",
      "url": "https://www.aljazeera.com/news/2026/1/25/cuban-official-accuses-us-of-piracy-against-sanctioned-caribbean-island?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 09:41:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaethje batters Pimblett to win interim lightweight title at UFC 324",
      "description": "Rising MMA star Paddy Pimblett's nine-fight winning streak ends in a bloody bout against the UFC's American icon.",
      "url": "https://www.aljazeera.com/sports/2026/1/25/gaethje-batters-pimblett-to-win-interim-lightweight-title-at-ufc-324?traffic_source=rss",
      "published": "Sun, 25 Jan 2026 08:19:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-25T05:51:34.324Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-25T08:09:13.060Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-23T21:11:10.851Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-25T02:06:19.111Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "U.S. rock climber Alex Honnold reaches top of Taipei 101 skyscraper without ropes",
      "description": "Cheers erupted from a street-level crowd as Alex Honnold reached the top of the spire of the 508-meter (1,667-foot) tower, about 90 minutes after he started.",
      "url": "https://www.npr.org/2026/01/25/nx-s1-5687809/american-rock-climber-alex-honnold-reaches-top-of-taipei-skyscraper",
      "published": "Sun, 25 Jan 2026 07:33:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland, tariffs and NATO: a rollercoaster week in transatlantic relations",
      "description": "After President Trump's upheaval at Davos, U.S. allies are openly questioning whether Washington can still anchor the rules-based order.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5685215/greenland-tariffs-and-nato-a-rollercoaster-week-in-transatlantic-relations",
      "published": "Sat, 24 Jan 2026 17:39:59 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Danish community reacts to Trump's rhetoric around Greenland",
      "description": "Danish citizens say President Trump's latest push to control Greenland is changing their view on Denmark's relationship with America.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5685036/danish-community-reacts-to-trumps-rhetoric-around-greenland",
      "published": "Sat, 24 Jan 2026 07:27:55 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alex Honnold: US man free climbs Taiwan's 101-story tower",
      "description": "Spiderman called in sick, so Alex Hannold scaled the Taipei 101 — all without ropes, safety nets or spidey webs. Taiwan's president congratulated Honnold on completing the challenge.",
      "url": "https://www.dw.com/en/alex-honnold-us-man-free-climbs-taiwan-s-101-story-tower/a-75647548?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 10:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU, India set for historic trade deal amid US tariffs",
      "description": "In what's been called a victory for free trade, the EU and India are set to agree on \"the mother of all deals\" and a defense pact that aims to lure India away from its close political and military ties to Russia.",
      "url": "https://www.dw.com/en/eu-india-set-for-historic-trade-deal-amid-us-tariffs/a-75638454?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 10:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan returns last 2 pandas to China amid strained ties",
      "description": "Large crowds have visited Ueno Zoo in Tokyo to say farewell to two pandas that are about to go back to China. Their departure means Japan will be panda-less for the first time in half a century.",
      "url": "https://www.dw.com/en/japan-returns-last-2-pandas-to-china-amid-strained-ties/a-75647554?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 09:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US–EU economic ties show why neither side can decouple",
      "description": "Despite a pause in tariff escalation, US–EU trade remains volatile under Donald Trump. From deficits and energy to services and the dollar, the trans-Atlantic relationship reveals deep ties — and clear vulnerabilities.",
      "url": "https://www.dw.com/en/us-eu-economic-ties-show-why-neither-side-can-decouple/a-75610955?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 06:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tanzania's Maasai, wildlife corridor face growing pressure",
      "description": "Trophy hunting interests are turning the screw on northern Tanzania's Maasai communities and wildlife paradise. Meanwhile, well-funded conservation efforts are attracting scrutiny amid rising Maasai eviction cases.",
      "url": "https://www.dw.com/en/tanzania-s-maasai-wildlife-corridor-face-growing-pressure/a-75447264?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 25 Jan 2026 06:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "In Greenland, US-NATO deal met with relief, mistrust",
      "description": "A \"framework\" agreement between the US and NATO has defused the dispute over Greenland. There is cautious relief among residents, but also fear of once again becoming a geopolitical pawn.",
      "url": "https://www.dw.com/en/in-greenland-us-nato-deal-met-with-relief-mistrust/a-75641044?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 17:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine: Zelenskyy calls Abu Dhabi talks 'constructive'",
      "description": "The Ukrainian president said the talks with Russia and the US could resume \"as early as next week.\" Meanwhile, Russian missiles have hit Kyiv and Kharkiv, killing one person. DW has more.",
      "url": "https://www.dw.com/en/ukraine-zelenskyy-calls-abu-dhabi-talks-constructive/live-75614291?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 14:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US wants extra Winter Olympics spot for skeleton's Uhlaender",
      "description": "IOC President Kirsty Coventry has been asked to intervene after Katie Uhlaender was the victim of alleged competition manipulation, causing her to miss out on February's Winter Olympics.",
      "url": "https://www.dw.com/en/us-wants-extra-winter-olympics-spot-for-skeleton-s-uhlaender/a-75639366?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 11:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany weighs boon and bane of China's industrial expansion",
      "description": "From cheap exports to cutting-edge tech: A Chinese battery giant's secretive factory in Germany shows how \"Made in China\" and \"Made in Germany\" are colliding — and where they can benefit from each other.",
      "url": "https://www.dw.com/en/germany-weighs-boon-and-bane-of-china-s-industrial-expansion/a-75583089?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 09:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Polls close in Myanmar's junta-run elections with army set for victory",
      "description": "Voting finished in Myanmar's three-stage general election on Sunday with the dominant pro-military party on course for a landslide victory in a junta-run vote that critics say was neither free nor democratic, and designed to legitimize the military's rule.",
      "url": "https://www.france24.com/en/asia-pacific/20260125-polls-close-in-myanmar-s-junta-run-elections-with-army-set-for-victory",
      "published": "Sun, 25 Jan 2026 10:36:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian PM says Trump's comments on NATO troops 'completely unacceptable'",
      "description": "Australian Prime Minister Anthony Albanese said on Sunday said families of fallen soldiers would be \"hurting\" as a result of US President Donald Trump's \"completely unacceptable\" comments downplaying the efforts of non-US troops in Afghanistan. Trump appeared to be partially walking back his remarks amid growing outrage from European and now Australian allies.",
      "url": "https://www.france24.com/en/americas/20260125-australian-pm-says-trump-s-comments-nato-troops-completely-unacceptable",
      "published": "Sun, 25 Jan 2026 07:14:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump praises 'very brave' UK troops after fury over Afghanistan remarks",
      "description": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline.",
      "url": "https://news.sky.com/story/trump-pays-tribute-to-very-brave-british-soldiers-who-served-in-afghanistan-13498256",
      "published": "Sat, 24 Jan 2026 06:46:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China no longer America's top defence priority, Pentagon says",
      "description": "China is no longer the US Pentagon's top priority, shifting its focus to the homeland and Western Hemisphere, an influential new strategy document says.",
      "url": "https://news.sky.com/story/china-no-longer-americas-top-defence-priority-pentagon-says-13498252",
      "published": "Sat, 24 Jan 2026 02:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Novak Djokovic apologises after ball nearly hits ball girl at Australian Open",
      "description": "Novak Djokovic has apologised after almost hitting a ball girl with the ball during his history-making Australian Open third-round match on Saturday.",
      "url": "https://news.sky.com/story/djokovic-apologises-after-ball-nearly-hits-ball-girl-during-history-making-win-at-australian-open-13498431",
      "published": "Sat, 24 Jan 2026 15:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan opposition leader claims wife held 'at gunpoint' after 'hundreds of soldiers' raided his home",
      "description": "Uganda's opposition leader claims \"hundreds of soldiers\" raided his home overnight and held his wife at gunpoint, leaving destruction everywhere.",
      "url": "https://news.sky.com/story/ugandan-opposition-leader-bobi-wine-claims-wife-held-at-gunpoint-after-hundreds-of-soldiers-raided-his-home-13498321",
      "published": "Sat, 24 Jan 2026 11:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Getting to 'no': Europe's leaders find a way to speak with one voice against Trump",
      "description": "European leaders are finding a way to speak with one voice against President Donald Trump and they're increasingly willing to say “no” to his demands",
      "url": "https://abcnews.go.com/International/wireStory/europes-leaders-find-speak-voice-trump-129537885",
      "published": "Sun, 25 Jan 2026 07:43:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's Macron pushes for fast-track ban on social media for children under 15",
      "description": "French President Emmanuel Macron says he wants to fast-track a ban on social media for teenagers under 15",
      "url": "https://abcnews.go.com/International/wireStory/macron-pushes-fast-track-ban-social-media-children-129536618",
      "published": "Sun, 25 Jan 2026 06:24:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's Greenland ambitions strain MAGA ties with Europe's far-right",
      "description": "Tensions over U.S. President Donald Trump's plans to control Greenland have caused a rift between MAGA and Europe's far-right",
      "url": "https://abcnews.go.com/International/wireStory/trumps-greenland-ambitions-strain-maga-ties-europes-129536123",
      "published": "Sun, 25 Jan 2026 02:10:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar holds its last election round with the army already certain to keep control over government",
      "description": "Voting has begun in the final round of Myanmar’s general election, concluding a monthlong process",
      "url": "https://abcnews.go.com/International/wireStory/myanmar-holds-election-round-army-control-government-129533034",
      "published": "Sat, 24 Jan 2026 19:21:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hermès menswear designer Nichanian takes final bow after 37 years",
      "description": "With Paris Fashion Week menswear heading into its final weekend, Hermès marked a transition as Véronique Nichanian presented her final men’s collection after 37 years leading the house’s menswear",
      "url": "https://abcnews.go.com/International/wireStory/herms-menswear-designer-nichanian-takes-final-bow-after-129531747",
      "published": "Sat, 24 Jan 2026 17:53:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The last two pandas in Japan are leaving for China as ties are strained",
      "description": "Japanese panda fans have seen their beloved pandas return to China over the past decades, but bidding farewell to beloved twins Xiao Xiao and Lei Lei at Sunday’s final public viewing at Tokyo’s Ueno zoo is especially emotional",
      "url": "https://abcnews.go.com/International/wireStory/pandas-japan-leaving-china-ties-strained-129531037",
      "published": "Sat, 24 Jan 2026 21:13:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraq’s dominant political bloc nominates former prime minister al-Maliki as its candidate",
      "description": "Iraq’s dominant political bloc has nominated former prime minister Nouri al-Maliki as its candidate for prime minister",
      "url": "https://abcnews.go.com/International/wireStory/iraqs-dominant-political-bloc-nominates-former-prime-minister-129527146",
      "published": "Sat, 24 Jan 2026 14:49:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cold kills another infant in Gaza as West Bank displacement intensifies",
      "description": "Another child in the Gaza Strip has died from hypothermia as winter weather continues to whip the enclave, the UN said on Wednesday, citing information from the health authorities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166804",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Baltimore bloodshed drops as law-and-order push targets repeat criminals",
      "description": "Baltimore homicides plummet to 134 in 2025, down from 334 in 2022, as prosecutors target repeat violent offenders with aggressive sentencing strategies.",
      "url": "https://www.foxnews.com/us/baltimore-bloodshed-drops-law-order-push-targets-repeat-criminals",
      "published": "Sun, 25 Jan 2026 06:00:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Elizabeth Smart reveals her kidnapper tried to abduct her teen cousin as his ‘next wife’",
      "description": "Elizabeth Smart reveals her captor Brian David Mitchell planned to kidnap her cousin Olivia Wright as his second \"wife\" during her nine-month captivity.",
      "url": "https://www.foxnews.com/us/elizabeth-smart-reveals-her-kidnapper-tried-abduct-her-teen-cousin-his-next-wife",
      "published": "Sat, 24 Jan 2026 14:00:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "FBI Director Kash Patel hails transfer of Most Wanted fugitive Alejandro Rosales Castillo after Mexico arrest",
      "description": "Alejandro Castillo, accused of murdering coworker \"Sandy\" Ly Le in 2016, was transferred to Charlotte after his arrest in Mexico after a yearslong manhunt.",
      "url": "https://www.foxnews.com/us/fbi-director-kash-patel-hails-transfer-most-wanted-fugitive-alejandro-rosales-castillo-after-mexico-arrest",
      "published": "Fri, 23 Jan 2026 19:36:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "DHS releases image of illegal immigrant accused of abandoning his 5-year-old son while fleeing ICE",
      "description": "DHS released an image of a father who authorities said abandoned 5-year-old son while fleeing ICE agents in Minneapolis. Officials say family refused child.",
      "url": "https://www.foxnews.com/us/dhs-released-image-illegal-immigrant-accused-abandoning-his-5-year-old-son-while-fleeing-ice",
      "published": "Fri, 23 Jan 2026 17:25:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian oil tanker, the Grinch, intercepted as US, allies escalate sanctions crackdown",
      "description": "A Russian oil tanker was intercepted between Spain and Morocco as western powers intensify efforts to disrupt Moscow's sanctions-evading shadow fleet operations.",
      "url": "https://www.foxnews.com/world/navy-boards-russian-oil-tanker-grinch-suspected-evading-western-sanctions",
      "published": "Thu, 22 Jan 2026 21:25:07 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "American OnlyFans star with Mexican cartel ties kidnapped at gunpoint outside mall",
      "description": "An Arizona OnlyFans star was allegedly kidnapped at gunpoint in Mexico, according to video. Nicole Pardo Molina's abduction may be linked to a cartel rivalry in Sinaloa.",
      "url": "https://www.foxnews.com/world/american-onlyfans-star-mexican-cartel-ties-kidnapped-gunpoint-mall",
      "published": "Thu, 22 Jan 2026 21:13:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters still at large after Syrian prison break, contributing to volatile security situation",
      "description": "ISIS prisoners escaped from a northeastern Syria prison, and some remain unaccounted for after chaos made tracking impossible, according to Syria analyst Nanar Hawach.",
      "url": "https://www.foxnews.com/world/isis-fighters-still-large-syrian-prison-break-contributing-volatile-security-situation",
      "published": "Thu, 22 Jan 2026 19:12:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark's prime minister insists sovereignty is non-negotiable as Trump announces Greenland deal 'framework'",
      "description": "Denmark's prime minister said she won't negotiate her nation's sovereignty after President Donald Trump said a \"framework\" on a Greenland deal was reached.",
      "url": "https://www.foxnews.com/world/denmarks-prime-minister-insists-sovereignty-non-negotiable-trump-announces-greenland-deal-framework",
      "published": "Thu, 22 Jan 2026 08:19:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US begins transferring ISIS detainees from Syria to Iraq amid security transition",
      "description": "U.S. forces moved 150 ISIS detainees from Syria to Iraq as CENTCOM began a transfer operation involving up to 7,000 radical prisoners.",
      "url": "https://www.foxnews.com/world/us-begins-transferring-isis-detainees-from-syria-iraq-amid-security-transition",
      "published": "Wed, 21 Jan 2026 14:20:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu agrees to join Trump’s Gaza Board of Peace after initial pushback",
      "description": "Israeli Prime Minister Benjamin Netanyahu said he will join President Donald Trump’s newly formed Gaza Board of Peace after initially criticizing its structure.",
      "url": "https://www.foxnews.com/world/netanyahu-agrees-join-trumps-gaza-board-peace-after-initial-pushback",
      "published": "Wed, 21 Jan 2026 03:35:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}