{
  "last_updated": "2025-12-26T21:40:15.809339Z",
  "event_count": 226,
  "events": [
    {
      "title": "Trump supporters hail US strikes in Nigeria as ‘amazing Christmas present’",
      "description": "Some even celebrated ‘mass killing’ and the president’s ‘resolve’ in attacking Islamic State targets The US’s Christmas Day strikes against Islamic State targets in Nigeria have been met with praise by Donald Trump supporters who for months had been agitating for the president to respond forcefully to the killings of Christians in the country. “I can’t think of a better way to celebrate Christmas than by avenging the death of Christians through the justified mass killing of Islamic terrorists,” the far-right political activist Laura Loomer posted on X. “You’ve got to love it! Death to all Islamic terrorists! Thank you.” Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/26/trump-supporters-nigeria-airstrikes",
      "published": "Fri, 26 Dec 2025 17:50:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Israel FM accuses Palestinian Authority of aiding terror with ‘Pay-for-Slay’ after deadly attack",
      "description": "Two Israelis were killed in terrorist attacks in Israel on Friday, as officials accused the Palestinian Authority of misleading the world about its active terror payment policy.",
      "url": "https://www.foxnews.com/world/israel-fm-accuses-palestinian-authority-aiding-terror-pay-for-slay-after-deadly-attack",
      "published": "Fri, 26 Dec 2025 12:16:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 43,
      "severity_level": "Critical"
    },
    {
      "title": "Islamist militant group claims deadly bombing of Alawite mosque in Syria's Homs",
      "description": "At least eight people were killed and 18 wounded in a blast that struck a mosque in an Alawite neighbourhood of Homs province in Syria on Friday, state media reported. Islamist militant group Saraya Ansar al-Sunna claimed responsibility for the attack. Formed after former president Bashar al-Assad’s ouster, the group in June claimed an attack on a Damascus church.",
      "url": "https://www.france24.com/en/middle-east/20251226-blast-alawite-mosque-in-syria-homs-province-kills-least-five",
      "published": "Fri, 26 Dec 2025 11:32:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Nigeria signals more strikes likely in \"join\" US operations",
      "description": "Nigeria has indicated that further strikes against jihadist groups may follow a joint operation with the United States that targeted Islamic State militants in the country’s northwest on Thursday. The foreign minister said Nigeria provided the intelligence for the attack and described cooperation with Washington as ongoing. The U.S. military reported multiple deaths in the Christmas Day bombing, as President Donald Trump reiterated claims that militant groups in Nigeria are targeting “innocent Christians.” For analysis, we hear from Oluwole Ojewale, Coordinator for West and Central Africa at the Institute for Security Studies.",
      "url": "https://www.france24.com/en/video/20251226-nigeria-signals-more-strikes-likely-in-join-us-operations",
      "published": "Fri, 26 Dec 2025 18:31:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "US cooperation with Nigerian government targets Islamic State group",
      "description": "President Donald Trump said Thursday that the US had launched \"precision hits on terrorist targets in Nigeria by air strikes\". The claim came in a Christmas night social media post that offered few details, though US Africa Command later confirmed the strikes were conducted at the request of Nigerian authorities who said multiple Islamic State group militants were killed. Gabriel Nadler reports.",
      "url": "https://www.france24.com/en/video/20251226-us-cooperation-with-nigerian-government-targets-islamic-state-group",
      "published": "Fri, 26 Dec 2025 14:02:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Australian prime minister announces national bravery honors after antisemitic terror attack",
      "description": "Australia announced a national bravery award for heroes who confronted ISIS-inspired gunmen during a deadly Hanukkah attack that killed 15 people in Sydney.",
      "url": "https://www.foxnews.com/world/australian-pm-announces-national-bravery-honors-after-antisemitic-terror-attack",
      "published": "Thu, 25 Dec 2025 21:02:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Turkey detains more than 100 suspected IS members over alleged attack plot",
      "description": "Turkish special police detained more than 100 suspected members of the \"Islamic State\" terrorist group that they said were planning on carrying out attacks during Christmas and New Year celebrations in the country.",
      "url": "https://www.dw.com/en/turkey-detains-more-than-100-suspected-is-members-over-alleged-attack-plot/a-75304150?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 15:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Homes threatened as bushfire rages south-east of Perth and storms hit Queensland and Northern Territory",
      "description": "Bushfire that is believed to have started at Boddington goldmine still uncontained, while monsoon trough soaks north-eastern Australia Get our breaking news email , free app or daily news podcast Australians on both sides of the country have been warned to remain vigilant as floods and fires threatened their homes on Boxing Day. A bushfire continued to rage about 200km south-east of Perth on Friday morning, although nearby residents were no longer being urged to leave their homes. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/homes-threatened-as-bushfire-rages-south-east-of-perth-and-storms-hit-queensland-and-northern-territory",
      "published": "Fri, 26 Dec 2025 01:42:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Trump launches Christmas night airstrikes on ISIS 'Terrorist Scum' in Nigeria after killings of Christians",
      "description": "Trump said the United States launched Christmas night airstrikes in Nigeria targeting ISIS militants he accused of killing Christians in recent attacks.",
      "url": "https://www.foxnews.com/world/trump-launches-christmas-night-airstrikes-isis-terrorist-scum-nigeria-after-killings-christians",
      "published": "Thu, 25 Dec 2025 18:16:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan civil war: Health system ‘on the verge of collapse’",
      "description": "The war in Sudan has been tearing the country apart for almost 1,000 days, putting the country’s health system under intolerable pressure. The World Health Organization (WHO) is reporting widespread disease outbreaks, severe shortages, malnutrition and rising deaths.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166673",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "US strikes 'terrorist targets' in Nigeria",
      "description": "The US said the strike against 'Islamic State' targets came at the request of the Nigeria. Trump had previously threatened military action to protect Christians in Nigeria from what he described as a \"genocide.\"",
      "url": "https://www.dw.com/en/us-strikes-terrorist-targets-in-nigeria/a-75307055?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 01:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Looking back at Israel and Iran's ‘12-day war’: Direct conflict breaks out between arch-enemies",
      "description": "When Israel launched a lightening attack on Iran’s military and nuclear sites on June 13, it kickstarted a conflict dubbed the “12-day war” by US President Donald Trump. Although the whirlwind clash lasted less than two weeks, it caused unprecedented destruction in Israel and considerably weakened the Iranian Republic. FRANCE 24 looks back on how it unfolded.",
      "url": "https://www.france24.com/en/middle-east/20251226-looking-back-israel-iran-12-day-war-direct-conflict-breaks-out-between-arch-enemies",
      "published": "Fri, 26 Dec 2025 17:33:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Albanese announces bravery award for heroes of Bondi antisemitic attack",
      "description": "Australian Prime Minister Anthony Albanese has announced a national bravery award to honor those who confronted an antisemitic terror attack",
      "url": "https://abcnews.go.com/International/wireStory/albanese-announces-bravery-award-heroes-bondi-antisemitic-attack-128689526",
      "published": "Wed, 24 Dec 2025 23:53:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Guilty verdicts in ISIS plot police say could have been 'the deadliest terrorist attack in UK history'",
      "description": "Three men convicted of planning alleged gun attacks on Jewish targets in Manchester as British Jews report feeling increasingly unsafe across the U.K.",
      "url": "https://www.foxnews.com/world/guilty-verdicts-isis-plot-police-say-could-have-been-the-deadliest-terrorist-attack-uk-history",
      "published": "Tue, 23 Dec 2025 13:17:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns Sudan war entering deadlier phase as fighting spreads in Kordofan",
      "description": "The war in Sudan is entering a deadlier phase, the United Nations has warned, as intensified fighting in the Kordofan region, mounting civilian casualties from drone strikes and growing risks of regional spillover push the conflict toward the 1,000-day mark.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166655",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Western Australia faces bushfire threat as cold, wet and bumpy Sydney to Hobart yacht race forecast",
      "description": "WA facing several fire warnings as Perth temperatures exceed 40C while Melbourne on track for coldest Christmas since 2006 Get our breaking news email , free app or daily news podcast Perth exceeded its Christmas Day forecast of 40C as a heatwave created extreme fire danger for much of south-west Western Australia. Residents at Boddington goldmine were being warned it was too late to leave on Thursday afternoon as fire affected evacuation routes. Residents of Cowalla were also warned to leave immediately as fires posed a threat to homes at Bidaminna Place and Millbank Road. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/25/sydney-to-hobart-yacht-race-forecast-to-be-cold-wet-and-bumpy-as-australias-west-faces-cyclone-and-bushfire-threat",
      "published": "Thu, 25 Dec 2025 20:06:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Sri Lanka cyclone: More than a million still need aid weeks after Ditwah floods",
      "description": "Nearly a month after Cyclone Ditwah tore across Sri Lanka, more than a million people – including over half a million children – remain in urgent need of humanitarian assistance, as floods, landslides and renewed rainfall continue to compound one of the country’s worst disasters in decades.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166671",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "How C-drama streams from China hooked millions worldwide",
      "description": "The popularity of Chinese dramas is exploding, creating a multibillion-dollar industry. Global viewers find themselves attracted to these \"universal\" stories and appreciate their glimpse at Chinese culture.",
      "url": "https://www.dw.com/en/how-c-drama-streams-from-china-hooked-millions-worldwide/a-75308757?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 12:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "California hit by powerful storm on Christmas Day",
      "description": "Authorities have warned of heavy rainfall, especially in Los Angeles, and issued evacuation warnings.",
      "url": "https://www.dw.com/en/california-hit-by-powerful-storm-on-christmas-day/a-75307479?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 04:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "New charges against DC National Guard shooting suspect open death penalty door",
      "description": "An Afghan national accused of killing a National Guard member faces new federal charges that could lead to the death penalty in a Washington, D.C., shooting case.",
      "url": "https://www.foxnews.com/us/new-charges-against-dc-national-guard-shooting-suspect-open-death-penalty-door",
      "published": "Wed, 24 Dec 2025 14:20:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Cambodia accuses Thailand of launching strikes during border peace talks",
      "description": "Thai reports claim Cambodia carried out overnight attacks ahead of officials from both countries meeting for a third day of negotiations on Friday Cambodia has accused Thailand of intensifying its bombardment of disputed border areas, even as officials from the two countries attend a multi-day meeting aimed at negotiating an end to deadly clashes. The neighbours’ longstanding border conflict reignited this month , shattering an earlier truce and killing more than 40 people, according to official counts. About a million people have also been displaced. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/cambodia-accuses-thailand-of-launching-strikes-during-border-peace-talks",
      "published": "Fri, 26 Dec 2025 06:56:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Victoria police name man they want to interview in relation to ‘Happy Chanukah’ car fire in St Kilda",
      "description": "Police say there is no indication John Argento, 47, poses specific risk to the Jewish community, but believe he may be able to help with investigation Get our breaking news email , free app or daily news podcast Victoria police have named a man they want to interview in relation to a suspected arson attack on a car sporting a “Happy Chanukah” sign in Melbourne on Christmas Day. Police said emergency services were called to a vehicle displaying a mobile billboard that had been set alight in the driveway of a property in St Kilda East about 2.50am on Thursday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/victoria-police-happy-chanukah-car-fire-st-kilda-melbourne-ntwnfb",
      "published": "Fri, 26 Dec 2025 02:49:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Two killed in northern Israel by Palestinian stabbing, car ramming attack",
      "description": "At least two people died in a stabbing and car ramming attack in northern Israel on Friday, Israeli police said. Both victims died from their injuries and the alleged attacker, a resident of the occupied West Bank, was injured and hospitalised. Israeli Defense Minister Israel Katz quickly ordered military retaliation on the suspect's hometown.",
      "url": "https://www.france24.com/en/middle-east/20251226-two-killed-northern-israel-palestinian-stabbing-car-ramming-attack",
      "published": "Fri, 26 Dec 2025 13:00:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "This 56-year conflict still pauses for Christmas",
      "description": "At Christmas, the world can seem a little more humane than usual - even in wartime.",
      "url": "https://news.sky.com/story/this-56-year-conflict-still-pauses-for-christmas-13486554",
      "published": "Thu, 25 Dec 2025 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Pope Leo XIV delivers first Christmas message calling for end to violence in Middle East, Russia-Ukraine war",
      "description": "Pope Leo XIV delivers Christmas message calling for peace in Middle East and Ukraine, urging world leaders to reject violence and embrace dialogue.",
      "url": "https://www.foxnews.com/world/pope-leo-xiv-delivers-first-christmas-message-calling-end-violence-middle-east-russia-ukraine-war",
      "published": "Thu, 25 Dec 2025 08:44:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Israel becomes first country to recognise Somaliland as sovereign state",
      "description": "Diplomatic breakthrough comes more than three decades after declaration of independence from Somalia Israel has become the first country to recognise Somaliland as a sovereign state, a breakthrough in its quest for international recognition since it declared independence from Somalia 34 years ago. The Israeli foreign minister, Gideon Sa’ar, announced on Friday that Israel and Somaliland had signed an agreement establishing full diplomatic relations, which would include the opening of embassies and the appointment of ambassadors. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/israel-first-country-to-recognise-somaliland-sovereign-state",
      "published": "Fri, 26 Dec 2025 17:34:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘They’re scared of us now’: how co-investment in a tropical forest saw off loggers",
      "description": "Low-cost tech and joined-up funding have reduced illegal logging, mining and poaching in the Darién Gap – it’s a success story that could stop deforestation worldwide There are no roads through the Darién Gap. This vast impenetrable forest spans the width of the land bridge between South and Central America, but there is almost no way through it: hundreds have lost their lives trying to cross it on foot. Its size and hostility have shielded it from development for millennia, protecting hundreds of species – from harpy eagles and giant anteaters to jaguars and red-crested tamarins – in one of the most biodiverse places on Earth. But it has also made it incredibly difficult to protect. Looking after 575,000 hectares (1,420,856 acres) of beach, mangrove and rainforest with just 20 rangers often felt impossible, says Segundo Sugasti, the director of Darién national park. Like tropical forests all over the world, it has been steadily shrinking, with at least 15% lost to logging, mining and cattle ranching in two decades. Continue reading...",
      "url": "https://www.theguardian.com/environment/2025/dec/25/they-are-scared-of-us-now-how-one-tropical-forest-turned-the-tide-on-loggers",
      "published": "Thu, 25 Dec 2025 15:00:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "New York plans patriotic NYE ball drop to mark USA's 250th birthday",
      "description": "New York’s Times Square will sparkle in red, white and blue on New Year's Eve as a patriotic ball drop rings in 2026, marking the start of celebrations for the United States’ 250th anniversary. Organisers have planned hundreds of events nationwide, including fireworks, parades and volunteer initiatives, in a year-long tribute to the country’s semiquincentennial milestone.",
      "url": "https://www.france24.com/en/americas/20251226-new-york-plans-patriotic-nye-ball-drop-mark-usa-250th-year",
      "published": "Fri, 26 Dec 2025 16:31:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Historic vote looms in Central African Republic as UN urges peaceful participation",
      "description": "With Central Africans set to vote in presidential, legislative, regional and long-delayed municipal elections this weekend, the United Nations has appealed for calm and restraint, warning that the credibility of the process will be critical to consolidating peace after years of conflict and instability.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166665",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Blast at Syrian mosque during Friday prayers leaves at least eight dead",
      "description": "The explosion in Homs targeted a predominantly Alawite area, a sect that has faced crackdowns and violence since the fall of former-President Bashar al-Assad.",
      "url": "https://www.bbc.com/news/articles/cx25387dj8no?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 15:01:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "California downpours ease but flood and mudslide risks linger",
      "description": "Even modest additional rainfall could trigger floods and mudslides in saturated areas, forecasters warn.",
      "url": "https://www.bbc.com/news/articles/c1lr3p7n87yo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 19:18:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Sky News correspondents look back at 2025",
      "description": "It has been a turbulent year. Wars have erupted or dragged on, international crises have deepened - but there have been bright spots too.",
      "url": "https://news.sky.com/story/sky-news-correspondents-look-back-at-2025-13484844",
      "published": "Wed, 17 Dec 2025 14:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "US warns of more Nigeria strikes as Abuja talks of ‘joint ongoing operations’",
      "description": "Pete Hegseth says ‘more to come’ as Nigerian minister confirms his country provided intelligence for first wave US politics live: latest news updates The US defence secretary, Pete Hegseth, has warned of new strikes against Islamic State targets in north-western Nigeria, hours after the US military took action against militant camps in what Donald Trump has characterised as efforts to stop the killing of Christians. Hegseth wrote on X : “The president was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end. The [Pentagon] is always ready, so ISIS found out tonight – on Christmas. More to come … Grateful for Nigerian government support & cooperation. Merry Christmas!” Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/us-warns-of-more-nigeria-strikes-as-abuja-talks-of-joint-ongoing-operations",
      "published": "Fri, 26 Dec 2025 14:41:45 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How climate change is threatening human rights",
      "description": "With rising effects of climate change across the globe, the world has started recognising that climate change is not just an ecological collapse, but also a human rights crisis.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166649",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Industrialisation without destruction: A UN blueprint for the future",
      "description": "Since the 19th century, industrialisation has had a transformative effect on the world, both positive and negative. It has created jobs and lifted millions out of poverty. But it has also had devastating consequences; destroying ecosystems, polluting the air, and driving the climate crisis that threatens to make large parts of the planet uninhabitable.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166635",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Repeat offender freed after SWAT standoff tied to three shootings in one month: report",
      "description": "Texas repeat offender allegedly linked to three separate shootings in one month, including random drive-by attacks and SWAT standoff in Hays County area.",
      "url": "https://www.foxnews.com/us/repeat-offender-freed-after-swat-standoff-tied-three-shootings-one-month-report",
      "published": "Fri, 26 Dec 2025 10:10:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Israel becomes first country to recognise Somaliland",
      "description": "Breakaway region of Somalia achieves diplomatic breakthrough after more than 30 years without international recognition.",
      "url": "https://www.aljazeera.com/news/2025/12/26/israel-becomes-first-country-to-recognise-somaliland?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 14:20:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Syria: At least 8 killed in first major mosque attack since Assad",
      "description": "A deadly blast tore through an Alawite mosque during Friday prayers in the western city of Homs. A little-known militant group has claimed responsibility as Syria's sectarian tensions erupt again.",
      "url": "https://www.dw.com/en/syria-at-least-8-killed-in-first-major-mosque-attack-since-assad/a-75311519?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 16:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Football: Afghan women make statement on international stage",
      "description": "Afghanistan's female footballers have been fighting in exile to get back to playing internationally for years. Earlier this year, their moment arrived, but their mission is far from complete.",
      "url": "https://www.dw.com/en/football-afghan-women-make-statement-on-international-stage/a-74505213?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 10:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Kyiv hits Russian refinery with UK missiles",
      "description": "Ukraine said it used British Storm Shadow missiles to attack the Novoshakhtinsk oil refinery. Zelenskyy said he spoke with Trump's envoys on how to end the war.",
      "url": "https://www.dw.com/en/ukraine-updates-kyiv-hits-russian-refinery-with-uk-missiles/live-75302997?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Overnight strikes leave death, destruction and power outages in Ukraine",
      "description": "A new wave of overnight strikes and front-line hostilities in Ukraine have caused further civilian casualties and damage to critical energy infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166664",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Myanmar elections marked by fear as UN warns civilians are coerced from all sides",
      "description": "As Myanmar approaches elections scheduled for 28 December, the UN’s top human rights official has said that civilians are being coerced from all sides – forced by the military to vote and threatened by armed opposition groups to boycott – in a climate of fear, violence and mass repression.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166662",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "UPS plane crash in Louisville claims 15th victim weeks after fiery takeoff failure",
      "description": "The death toll from a UPS cargo plane crash in Louisville, Kentucky, has risen to 15 after a man injured in the incident died weeks later on Christmas Day, officials said.",
      "url": "https://www.foxnews.com/us/ups-plane-crash-louisville-claims-15th-victim-weeks-after-fiery-takeoff-failure",
      "published": "Fri, 26 Dec 2025 05:12:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "ICE agents open fire on van driver who allegedly tried to run them over on Christmas Eve",
      "description": "ICE agents opened fire on a van in Maryland Christmas Eve, shooting after the driver allegedly tried to run them over. Two were injured in the Glen Burnie incident.",
      "url": "https://www.foxnews.com/us/ice-agents-open-fire-van-driver-who-allegedly-tried-run-them-over-christmas-eve",
      "published": "Wed, 24 Dec 2025 17:11:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the wildest place I have walked’: new national park will join up Chile’s 2,800km wildlife corridor",
      "description": "Government poised to officially protect 200,000 hectares of remote Patagonian coastline and forest Chile’s government is poised to create the country’s 47th national park, protecting nearly 200,000 hectares (500,000 acres) of pristine wilderness and completing a wildlife corridor stretching 1,700 miles (2,800km) to the southernmost tip of the Americas. The Cape Froward national park is a wild expanse of wind-torn coastline and forested valleys that harbours unrivalled biodiversity and has played host to millennia of human history. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/25/cape-froward-new-national-park-patagonia-chile",
      "published": "Thu, 25 Dec 2025 12:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Russian court sentences pro-war activist and Putin critic to 6 years in prison",
      "description": "A Russian court has sentenced pro-war activist Sergei Udaltsov to six years in prison for justifying terrorism",
      "url": "https://abcnews.go.com/International/wireStory/russian-court-sentences-pro-war-activist-putin-critic-128696064",
      "published": "Fri, 26 Dec 2025 02:00:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Security Council remains divided over Iran nuclear programme, sanctions stay in place",
      "description": "At a meeting to discuss nuclear non-proliferation on Tuesday, the Security Council’s stance on Iran’s nuclear activities remained divided on the issue, split between those who support the reinstatement of sanctions, and the members who believe the sanctions should be permanently lifted, whilst questioning the legality of the meeting itself.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166660",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Security Council meets on Venezuela, Iran, Somalia",
      "description": "The Security Council convened earlier today for a packed agenda, adopting a resolution extending the authorisation of the African Union support mission in Somalia (AUSSOM) and hearing a briefing on Iran and the implementation of resolution 2231, which endorsed the 2015 nuclear deal known as the Joint Comprehensive Plan of Action (JCPOA). Members are set to reconvene at 3 pm for an emergency meeting requested by Venezuela, amid heightened tensions between Caracas and Washington. Assistant Secretary-General for Political Affairs Khaled Khiari is expected to brief ambassadors. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166656",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "UFO secret files, drone swarms and nuclear-linked sightings stun experts in 2025",
      "description": "Discover compelling UFO headlines from 2025, featuring new scientific evidence, mysterious underwater objects and government disclosure revelations.",
      "url": "https://www.foxnews.com/us/ufo-secret-files-drone-swarms-nuclear-linked-sightings-stun-experts-2025",
      "published": "Thu, 25 Dec 2025 06:00:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "UN Security Council hears warnings over escalating US-Venezuela standoff",
      "description": "Tensions between the United States and Venezuela have sharply escalated amid increased US military operations in the Southern Caribbean, prompting accusations of sovereignty violations, concerns over civilian harm and growing calls at the UN Security Council for restraint and de-escalation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166668",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Japan Cabinet approves record defense budget to deter China",
      "description": "Japan is seeking to bolster its defense capabilities in the face of \"the most severe\" security environment since the end of World War II.",
      "url": "https://www.dw.com/en/japan-cabinet-approves-record-defense-budget-to-deter-china/a-75307361?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 04:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Two killed in suspected Palestinian ramming and knife attack in Israel",
      "description": "Police say the attacker, from the occupied West Bank, ran over at least one person before stabbing another victim several miles away.",
      "url": "https://www.bbc.com/news/articles/c9d9znp22pyo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 16:00:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Thailand bombs Cambodian border area as ceasefire talks continue",
      "description": "Cambodia accuses Thailand of \"indiscriminate attacks\", as negotiators meet for a third day to try to end weeks of renewed fighting.",
      "url": "https://www.bbc.com/news/articles/c4gk15x85jlo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 12:18:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "New York to require social media platforms to display mental health labels",
      "description": "A new state law mandates warnings for young users on platforms with features that 'encourage excessive use'.",
      "url": "https://www.aljazeera.com/news/2025/12/26/new-york-to-require-social-media-platforms-to-display-mental-health-labels?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 20:17:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US bombs target ISIL in Nigeria: What’s really going on?",
      "description": "Trump says strikes are related to 'Christian genocide' but attacks on Christian farmers happened in different area.",
      "url": "https://www.aljazeera.com/news/2025/12/26/us-bombs-target-isil-in-nigeria-whats-really-going-on?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 13:16:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Nigeria provided US with intelligence for strikes on Islamist militants, says foreign minister – as it happened",
      "description": "This blog is now closed. US warns of more Nigeria strikes Explained: Why has Trump ordered strikes in Nigeria? Here are some images of the aftermath of US strikes in Nigeria that have come via the news wires today: Nigerians across Sokoto state told of their shock at Christmas Day strikes by the United States. Continue reading...",
      "url": "https://www.theguardian.com/us-news/live/2025/dec/26/us-nigeria-strikes-militants-donald-trump-zelenskyy-ukraine-epstein-us-politics-latest-news-updates",
      "published": "Fri, 26 Dec 2025 17:16:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "French police arrest suspect after three women stabbed on Paris metro",
      "description": "French police on Friday arrested a 25-year-old man suspected of stabbing three women at different stations on a central Paris metro line during the busy end-of-year period. The attacks, which left the victims injured but not in critical condition, triggered a rapid manhunt and heightened security on public transport.",
      "url": "https://www.france24.com/en/france/20251226-man-arrested-after-three-women-stabbed-on-paris-metro",
      "published": "Fri, 26 Dec 2025 18:43:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "At least 15 injured in a knife and chemical attack at a factory in Japan",
      "description": "A man has been arrested after stabbing eight people and injuring seven others with a chemical believed to be bleach at a rubber factory in central Japan",
      "url": "https://abcnews.go.com/International/wireStory/japanese-media-people-injured-after-stabbed-factory-central-128699763",
      "published": "Fri, 26 Dec 2025 06:02:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Late-night joyride ends in disaster as driver smashes into towering Christmas tree on camera",
      "description": "Wild CCTV footage captures driver's joyride gone wrong as car crashes into Christmas tree in Kazakhstan square, toppling holiday display before fleeing.",
      "url": "https://www.foxnews.com/world/late-night-joyride-ends-disaster-driver-smashes-towering-christmas-tree-camera",
      "published": "Wed, 24 Dec 2025 18:49:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela says it released 99 people detained for 2024 election protests",
      "description": "Government said the move was due to its ‘unrestricted respect for human rights’ in the face of US aggression Venezuela has said it has carried out its largest release of political prisoners this year, claiming to have freed 99 people detained for taking part in protests after the 2024 election, widely believed to have been stolen by the dictator Nicolás Maduro , as it comes under increasing military pressure from the US. Civil society organisations have treated the news with caution and stressed that the releases were insufficient, noting that at least 900 political prisoners remain in the country. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/venezuela-political-prisoner-release",
      "published": "Fri, 26 Dec 2025 14:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Nuclear submarine arms race heats up between North and South Korea",
      "description": "North Korea's state media released photos Thursday of what it said was the hull of a nuclear submarine. Its leader denounced South Korea's plans to build its own subs as \"an offensive act.\"",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5658145/nuclear-submarine-north-and-south-korea",
      "published": "Fri, 26 Dec 2025 03:32:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Israel becomes first nation to recognize Somaliland",
      "description": "Israel has become the world's first country to recognize Somaliland, which proclaimed independence from Somalia in 1991, as a sovereign nation.",
      "url": "https://www.dw.com/en/israel-becomes-first-nation-to-recognize-somaliland/a-75311342?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 14:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Ukraine and US agree new peace plan after Moscow hit by another deadly bombing",
      "description": "The latest US-Ukraine peace plan suggests eastern areas seized by Russia could become free economic zones.",
      "url": "https://news.sky.com/story/ukraine-and-us-agree-updated-20-point-peace-plan-after-moscow-hit-by-another-deadly-bombing-13487290",
      "published": "Wed, 24 Dec 2025 17:47:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "RSF says Sudan’s army launches air strikes on paramilitary stronghold Nyala",
      "description": "Drone attacks hit fuel market in city that serves as headquarters for RSF's alternative government.",
      "url": "https://www.aljazeera.com/news/2025/12/26/rsf-says-sudans-army-launches-air-strikes-on-paramilitary-stronghold-nyala?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 12:34:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "‘Not for the people’: Myanmar junta prepares for elections designed to legitimise grip on power",
      "description": "Elections will be first since military seized power in 2021, but analysts say vote is far from a step toward democracy Myanmar is preparing to go to the polls for the first time since its military seized power in a coup in 2021, but with its former leader behind bars, its most successful political party disbanded and roughly a third of the country either disputed or in rebel hands, few believe claims by its military rulers that its 28 December election will be “free and fair”. “This is not for the people, this is for themselves,” says Pai, 25, who fled Myanmar after the military seized power. “They [the ruling junta] are looking for a way out of the trap they are [in].” Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/myanmar-junta-prepares-elections-legitimise-power",
      "published": "Fri, 26 Dec 2025 00:01:53 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Israel says operative of Iran's Quds Force killed in Lebanon",
      "description": "At a moment of regional tension and uncertainty, Israel reported the targeted killing of an Iranian agent in Lebanon.",
      "url": "https://www.dw.com/en/israel-says-operative-of-iran-s-quds-force-killed-in-lebanon/a-75305394?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 17:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Denmark: An open economy, but a closed immigration system (part 2)",
      "description": "FRANCE 24 heads north to the kingdom of Denmark. The Scandinavian country has been in the spotlight this year, holding the rotating presidency of the European Council from July to December and pushing forward its priorities such as migration and the energy transition – topics that we dive into in this show. In this second part of the programme, our focus is on Denmark's economy.",
      "url": "https://www.france24.com/en/tv-shows/europe-rendezvous/20251226-denmark-an-open-economy-but-a-closed-immigration-system-part-2",
      "published": "Fri, 26 Dec 2025 18:05:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Denmark: An open economy, but a closed immigration system (part 1)",
      "description": "FRANCE 24 heads north to the kingdom of Denmark. The Scandinavian country has been in the spotlight this year, holding the rotating presidency of the European Council from July to December and pushing forward its priorities such as migration and the energy transition – topics that we dive into in this show. In this first part of the programme, our focus is on defence and migration.",
      "url": "https://www.france24.com/en/tv-shows/europe-rendezvous/20251226-denmark-an-open-economy-but-a-closed-immigration-system-part-1",
      "published": "Fri, 26 Dec 2025 18:00:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Southern Yemeni separatists accuse Saudi Arabia of air strikes in eastern provinces",
      "description": "Yemen's Southern Transitional Council (STC) separatists on Friday accused Saudi Arabia of carrying out air strikes on their positions in the east of the country, a claim Riyadh has not acknowledged. While vowing they will not be deterred, the STC said it remains open to coordination with the kingdom, underscoring strains within the Saudi-led coalition.",
      "url": "https://www.france24.com/en/middle-east/20251226-yemen-separatists-accuse-saudi-arabia-air-strikes-but-leave-door-open-to-coordination",
      "published": "Fri, 26 Dec 2025 14:44:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Pakistan summons UK diplomat over a threat to army chief during a rally",
      "description": "Pakistan has summoned Britain’s deputy high commissioner after a viral video showed a woman at a rally in the city of Bradford saying the Pakistani army chief would die in a possible attack",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-summons-uk-diplomat-threat-army-chief-rally-128706850",
      "published": "Fri, 26 Dec 2025 11:45:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza aid restrictions, Syria humanitarian needs, lawyer reprisals in Burundi",
      "description": "The UN and partners continue to provide assistance to people in Gaza, where recent winter storms have worsened conditions for thousands across the enclave.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166663",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains 115 IS suspects 'planning New Year's attacks'",
      "description": "Turkish authorities say firearms were seized and efforts to trace further suspected members are continuing.",
      "url": "https://www.bbc.com/news/articles/cn98w93l8plo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 10:19:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Former Malaysian PM Najib Razak jailed for 15 more years in 1MDB graft scandal",
      "description": "New conviction over plunder of state fund substantially increases six-year term in separate case The jailed former Malaysian prime minister Najib Razak has been sentenced to an additional 15 years after he was found guilty of abuse of power, in the biggest trial yet in the multibillion-dollar fraud scandal related to the state fund 1MDB. Najib’s conviction substantially increases the six-year prison term he is already serving for a separate case related to the 1MDB graft scandal, one of the world’s biggest financial frauds in which billions were plundered from the now defunct sovereign wealth fund. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/former-malaysian-pm-najib-razak-found-guilty-of-abuse-of-power-in-latest-1mdb-trial",
      "published": "Fri, 26 Dec 2025 16:35:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Rescue mission helicopter crashes on Mount Kilimanjaro, killing all 5 on board",
      "description": "Five people have died after a helicopter crashed on Africa’s highest mountain, Mount Kilimanjaro, in Tanzania",
      "url": "https://abcnews.go.com/International/wireStory/helicopter-rescue-mission-crashes-tanzanias-mount-kilimanjaro-killing-128690702",
      "published": "Thu, 25 Dec 2025 06:17:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Nebraska grandfather killed in 'freak accident' at McDonald’s drive-thru",
      "description": "A grandfather died days before Christmas in a \"freak accident\" at a Nebraska drive-thru after being pinned between his car and the payment window.",
      "url": "https://www.foxnews.com/us/nebraska-grandfather-killed-freak-accident-mcdonalds-drive-thru",
      "published": "Fri, 26 Dec 2025 02:07:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Christmas spirit returns to Jesus' birthplace after more than two years of war",
      "description": "Thousands celebrate Christmas in Bethlehem for the first time since the implementation of the U.S.-brokered Israel-Hamas ceasefire agreement.",
      "url": "https://www.foxnews.com/world/christmas-spirit-returns-jesus-birthplace-after-more-than-two-years-war",
      "published": "Wed, 24 Dec 2025 10:51:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "They survived deadly floods. Now they're raising white flags - but not in surrender",
      "description": "Weeks after floods ravaged the island of Sumatra, many still do not have access to clean water and food.",
      "url": "https://www.bbc.com/news/articles/ckgzwqjpzp4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 23:09:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "M 6.0 - 2025 Taitung, Taiwan Earthquake",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VI Time 2025-12-24 09:47:06 UTC 2025-12-24 09:47:06 UTC at epicenter Location 22.851°N 121.207°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rkjm",
      "published": "2025-12-26T06:25:49.672Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Turkish authorities say arrested suspected IS member was planning New Year's attacks",
      "description": "Turkish authorities have apprehended a suspected member of the extremist Islamic State group planning attacks on New Year's celebrations",
      "url": "https://abcnews.go.com/International/wireStory/turkish-authorities-arrested-suspected-member-planning-new-years-128699759",
      "published": "Fri, 26 Dec 2025 04:51:18 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Brazilian ex-President Jair Bolsonaro undergoes double hernia surgery",
      "description": "Former Brazilian President Jair Bolsonaro's family says he's undergoing double hernia surgery at a hospital in the country's capital",
      "url": "https://abcnews.go.com/International/wireStory/brazilian-president-jair-bolsonaro-undergoes-double-hernia-surgery-128693872",
      "published": "Thu, 25 Dec 2025 09:33:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains dozens of IS suspects planning attacks on Christmas and New Year celebrations",
      "description": "Istanbul police have launched simultaneous raids at 124 locations, detaining over a hundred suspected members of the Islamic State group",
      "url": "https://abcnews.go.com/International/wireStory/turkey-detains-dozens-suspects-planning-attacks-christmas-new-128693497",
      "published": "Thu, 25 Dec 2025 09:31:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Winter aid delivery continues in Gaza",
      "description": "Despite the ceasefire in the Gaza Strip, humanitarians continue to receive reports of airstrikes, shelling and gunfire in all five governorates, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166653",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Grand jury declines to indict man in deadly Kentucky State University shooting",
      "description": "A grand jury refused to indict a father of two Kentucky State University students who shot two people who were beating his son's head against the pavement.",
      "url": "https://www.foxnews.com/us/grand-jury-declines-indict-man-deadly-kentucky-state-university-shooting",
      "published": "Fri, 26 Dec 2025 10:25:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "North Korea releases images of development of nuclear-powered submarine",
      "description": "New photos show North Korea's apparent progress in the development of a nuclear-powered submarine as Kim Jong Un condemns South Korea's efforts.",
      "url": "https://www.foxnews.com/world/north-korea-releases-images-development-nuclear-powered-submarine",
      "published": "Thu, 25 Dec 2025 07:46:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "President Trump announces strike on ISIS targets in Nigeria",
      "description": "President Trump made the announcement late Thursday on social media, saying the strike was in response to the Islamic State targeting Christians in Nigeria.",
      "url": "https://www.npr.org/2025/12/25/g-s1-103704/nigeria-isis-islamic-state",
      "published": "Thu, 25 Dec 2025 21:39:28 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Donald Trump to meet Zelensky on Sunday",
      "description": "Ukrainian President Volodymyr Zelensky said Friday that he would meet US President Donald Trump in Florida over the weekend to discuss territory and security guarantees, a day after meeting White House negotiators to discuss ways to end the war in Ukraine. Laurent Berstecher reports.",
      "url": "https://www.france24.com/en/video/20251226-donald-trump-to-meet-zelensky-on-sunday",
      "published": "Fri, 26 Dec 2025 16:08:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Times Square ball goes red, white and blue for America's 250th birthday",
      "description": "Times Square's 2025 ball drop will sparkle in red, white and blue patriotic colors to kick off America's 250th birthday celebrations nationwide this year.",
      "url": "https://www.foxnews.com/us/times-square-ball-goes-red-white-blue-americas-250th-birthday",
      "published": "Fri, 26 Dec 2025 13:22:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Brown, MIT shootings may have stemmed from suspect’s failures, fixation on scientist’s success: report",
      "description": "Portuguese official reveals suspected shooter allegedly fixated on MIT scientist as symbol of success he never achieved in tragic academic obsession case.",
      "url": "https://www.foxnews.com/us/brown-mit-shootings-may-have-stemmed-from-suspects-failures-fixation-scientists-success-report",
      "published": "Fri, 26 Dec 2025 11:24:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Fox News ‘Antisemitism Exposed’ Newsletter: UN bigot out at Georgetown",
      "description": "Fox News' \"Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.",
      "url": "https://www.foxnews.com/us/fox-news-antisemitism-exposed-newsletter-un-bigot-out-georgetown",
      "published": "Thu, 25 Dec 2025 18:39:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Jet crash carrying Libya’s top general triggers airspace shutdown over NATO capital",
      "description": "Turkey shuts down Ankara airspace after business jet carrying Libya's top military commander crashes. Ali Ahmed Al-Haddad is feared dead.",
      "url": "https://www.foxnews.com/world/jet-crash-carrying-libyas-top-general-triggers-airspace-shutdown-over-nato-capital",
      "published": "Tue, 23 Dec 2025 16:31:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Ex-Malaysia PM Najib Razak given 15-year jail term over state funds scandal",
      "description": "Najib was convicted for his role in the billion-dollar scandal involving the country's sovereign wealth fund 1MDB.",
      "url": "https://www.bbc.com/news/articles/crk7y27vp1eo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 14:15:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Waterskiing Santas and giant cuts of meat: Christmas around the world",
      "description": "From London to Bethlehem, services and festivities to mark the holiday cheer are in full swing.",
      "url": "https://www.bbc.com/news/articles/ce8nep787pyo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 15:01:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "What’s next for the global economy in 2026?",
      "description": "2025 was the year of tariffs and a global shift in economic power.",
      "url": "https://www.aljazeera.com/video/counting-the-cost/2025/12/26/whats-next-for-the-global-economy-in-2026?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 18:00:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Israel: Palestinian held over deadly car‑ramming, stabbing",
      "description": "Israel has launched a milltary operation in the alleged attacker’s West Bank hometown following a deadly series of assaults in northern Israel.",
      "url": "https://www.dw.com/en/israel-palestinian-held-over-deadly-car‑ramming-stabbing/a-75312084?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 18:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "How Africa is asserting itself globally — despite Trump",
      "description": "2025 was a year heavily dominated by US President Donald Trump's disruptive policies. While some of his actions caused harm, African governments also managed to improve their geo-political position.",
      "url": "https://www.dw.com/en/how-africa-is-asserting-itself-globally-despite-trump/a-75116234?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 12:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Blast at mosque in Nigeria kills 5 and injures more than 30 in apparent suicide attack",
      "description": "A bomb has exploded during prayers at a mosque in Nigeria's northeastern city of Maiduguri, killing five people",
      "url": "https://abcnews.go.com/International/wireStory/blast-mosque-nigeria-kills-5-injures-30-apparent-128689527",
      "published": "Thu, 25 Dec 2025 06:57:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Nigerian villagers are rattled by US airstrikes that made their homes shake and the sky glow red",
      "description": "A U.S. airstrike that targeted an alleged Islamic State camp in Nigeria has caused panic in the village of Jabo",
      "url": "https://abcnews.go.com/International/wireStory/nigerian-villagers-rattled-us-airstrikes-made-homes-shake-128705163",
      "published": "Fri, 26 Dec 2025 11:37:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "First Person: Felipe Paullier, the youngest ever senior UN official, charged with giving a voice to young people around the world",
      "description": "A paediatrician by training, Felipe Paullier has long been an advocate for youth. Formerly Director of the Uruguayan Government's Youth Institute, a role which involved several joint actions with various UN agencies, he was appointed to run the UN Youth Office in 2023, the youngest senior appointment in United Nations history.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166651",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Paper and wood: Forest products show signs of recovery, UN agency says",
      "description": "From wood-based panels used in construction, to charcoal for cooking food, forest products are valued and traded all around the world.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166666",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Greta Thunberg arrested supporting Palestinian prisoners on hunger strike during London protest",
      "description": "Greta Thunberg was arrested and later released on bail after supporting pro-Palestinian activists protesting detentions and a hunger strike in London.",
      "url": "https://www.foxnews.com/world/greta-thunberg-arrested-supporting-palestinian-prisoners-hunger-strike-london-protest",
      "published": "Tue, 23 Dec 2025 15:35:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky plans to meet Trump on Sunday for talks on ending Russian war",
      "description": "The Ukrainian leader says he will see the US president in Florida and believes \"a lot can be decided before the new year\".",
      "url": "https://www.bbc.com/news/articles/cp8zg25p26zo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 17:30:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US launches strikes against Islamic State in Nigeria",
      "description": "President Trump has previously accused the Nigerian government of failing to protect Christians from jihadists.",
      "url": "https://www.bbc.com/news/articles/cj69j8l918do?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 17:39:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
      "description": "The pope also laments the condition of Palestinians during his address to worshippers at the Vatican.",
      "url": "https://www.bbc.com/news/articles/cm21728nwxlo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 16:21:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Netanyahu pushes for Iran conflict, clashing with Trump’s priorities",
      "description": "US president's base opposes intervention in Iran while pro-Israel donors and hawks push for heightened US involvement.",
      "url": "https://www.aljazeera.com/news/2025/12/26/netanyahu-pushes-for-iran-conflict-clashing-with-trumps-priorities?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 21:06:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy to meet Trump in Florida amid diplomatic push to end war",
      "description": "Ukrainian president highlights 'significant progress' in talks, but Moscow says Kyiv is working to 'torpedo' deal.",
      "url": "https://www.aljazeera.com/news/2025/12/26/zelenskyy-to-meet-trump-in-florida-amid-diplomatic-push-to-end-war?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 17:56:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Tajikistan-Taliban border clashes: What’s behind them, why it affects China",
      "description": "Attacks by unknown assailants entering Tajik territory appear to target Chinese businesses and workers.",
      "url": "https://www.aljazeera.com/news/2025/12/26/tajikistan-taliban-border-clashes-whats-behind-them-why-it-affects-china?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 15:00:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Stabbing, chemical spray attack injures 15 at Japanese factory",
      "description": "Suspect is in police custody; no information about potential motive.",
      "url": "https://www.aljazeera.com/news/2025/12/26/stabbing-chemical-spray-attack-injures-15-at-japanese-factory?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 14:01:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Two people dead in stabbing, car-ramming attack in Israel",
      "description": "Attack comes a day after Israeli army reservist in civilian clothes rammed into Palestinian man praying on roadside.",
      "url": "https://www.aljazeera.com/news/2025/12/26/two-people-dead-in-stabbing-car-ramming-attack-in-israel?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 13:49:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Weather tracker: Deep freeze grips Canada as US records warmest Christmas",
      "description": "Temperatures plunge below -50C in the Yukon, while swaths of US experience springlike weather Northern Canada has been gripped by an intense and prolonged cold spell, with temperatures hovering between -20C and -40C for weeks. On Tuesday, Braeburn in the Yukon recorded -55.7C, its coldest December temperature since 1975. Meanwhile, Mayo and Dawson endured 16 consecutive nights below -40C, with Mayo plunging to -50.4C on Monday. Whitehorse also recorded 10 nights when temperatures dropped below -30C. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/weather-tracker-deep-freeze-canada-us-records-warmest-christmas",
      "published": "Fri, 26 Dec 2025 11:52:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Paddle boarders rescued after being swept more than 10km across Port Phillip Bay in three-hour ordeal",
      "description": "Pair say they were ‘exhausted, very shaken and feel so lucky’ after being spotted by air wing officers late on Christmas Day Get our breaking news email , free app or daily news podcast Two paddle boarders who were rescued after being swept more than 10km across Victoria’s Port Phillip Bay on Christmas Day say they are exhausted and shaken but grateful to have survived. Victoria police said the pair set out from Portarlington on the Bellarine peninsula about 3pm on Thursday but drifted out into the bay when conditions deteriorated and were swept all the way to Wyndham harbour in Melbourne’s outer west. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/paddle-boarders-rescued-port-phillip-bay-melbourne",
      "published": "Fri, 26 Dec 2025 06:56:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. strikes ISIS in Nigeria. And, holiday shopping was higher than expected",
      "description": "The U.S. has launched a \"deadly strike\" against Islamic State fighters in northwest Nigeria, according to Trump. And, holiday spending was higher than expected this year.",
      "url": "https://www.npr.org/2025/12/26/g-s1-103724/up-first-newsletter-nigeria-isis-congress-holiday-spending",
      "published": "Fri, 26 Dec 2025 06:48:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine marks third Christmas at war with Russia",
      "description": "Peace talks between Russia and Ukraine continue as Ukraine spent its third Christmas under Russian onslaught.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5654445/ukraine-marks-third-christmas-at-war-with-russia",
      "published": "Fri, 26 Dec 2025 04:41:09 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian parliament member talks about what it's like to spend Christmas at war",
      "description": "Ukraine spent its third Christmas at war with Russia. NPR's Leila Fadel speaks with a Ukrainian member of parliament about celebrating in wartime and soliciting U.S. support for Ukraine.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5648846/ukrainian-parliament-member-talks-about-what-its-like-to-spend-christmas-at-war",
      "published": "Fri, 26 Dec 2025 04:41:03 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US carries out airstrikes on Islamic State 'scum' in Nigeria who targeted Christians, Trump says",
      "description": "The US has launched airstrikes against what Donald Trump has called Islamic State militant \"scum\" in Nigeria.",
      "url": "https://news.sky.com/story/us-launches-airstrikes-on-islamic-state-targets-in-nigeria-13487369",
      "published": "Thu, 25 Dec 2025 23:32:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo XIV delivers his first Christmas Day message",
      "description": "Pope Leo XIV, during his first Christmas Day message, has urged the faithful to shed indifference toward those who are suffering",
      "url": "https://abcnews.go.com/International/wireStory/pope-leo-xiv-urges-faithful-christmas-shed-indifference-128691376",
      "published": "Thu, 25 Dec 2025 15:25:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about the militants targeted by US airstrikes in northwest Nigeria",
      "description": "The United States airstrikes targeting militants affiliated with the Islamic State in northwestern Nigeria are a major escalation of an offensive that Nigeria’s overstretched military has struggled with for years",
      "url": "https://abcnews.go.com/International/wireStory/militants-targeted-us-airstrikes-northwest-nigeria-128699169",
      "published": "Fri, 26 Dec 2025 06:55:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Florida man kills wife, shoots stepdaughter over NFL game argument before taking own life",
      "description": "A Florida man allegedly killed his wife and shot his stepdaughter over an NFL game argument before taking own life, authorities said. The girl is recovering in a hospital.",
      "url": "https://www.foxnews.com/us/florida-man-kills-wife-shoots-stepdaughter-over-nfl-game-argument-before-taking-own-life",
      "published": "Thu, 25 Dec 2025 16:53:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump could unveil Gaza ‘peace council’, ‘government’ soon: Israeli media",
      "description": "US wants to move to phase 2 of ceasefire in January, is frustrated by Israeli 'delays', reports Israel's Channel 12.",
      "url": "https://www.aljazeera.com/news/2025/12/26/trump-could-unveil-gaza-peace-council-government-soon-israeli-media?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 12:04:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Man reveals what it's like celebrating Christmas in country where it's banned",
      "description": "When Il-yong Ju was a child, something strange would happen in his tiny village in rural North Korea every 25 December.",
      "url": "https://news.sky.com/story/north-korea-defector-tells-of-escape-and-how-he-celebrated-christmas-in-country-where-its-banned-13484143",
      "published": "Tue, 16 Dec 2025 10:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine, US near 20-point peace deal as Putin spurns Zelenskyy Christmas ceasefire offer",
      "description": "Ukraine and U.S. near finalizing 20-point security framework as Zelenskyy reports 90% agreement on guarantees while Russia pushback signals changes needed.",
      "url": "https://www.foxnews.com/world/ukraine-us-near-20-point-peace-deal-putin-spurns-zelenskyy-christmas-ceasefire-offer",
      "published": "Wed, 24 Dec 2025 10:05:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Should a top Russian archaeologist face trial for digging in occupied Crimea?",
      "description": "The case of a scholar wanted in Ukraine sparked a debate on the relationship between museums and the Russian state.",
      "url": "https://www.bbc.com/news/articles/c623rvzjjd2o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 01:44:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump-backed candidate Asfura declared new president of Honduras",
      "description": "Winning margin of 28,000 votes announced a month late but before review of all ‘inconsistent’ ballots was completed Donald Trump-backed candidate Nasry “Tito” Asfura has been declared the winner of Honduras’s presidential election after a vote count that dragged on for almost a month and was marred by fraud allegations and criticism of interference by the US president . The rightwing Asfura, 67, a construction magnate and former mayor of the capital, Tegucigalpa, secured 40.27% of the vote, against 39.53% for the centre-right Salvador Nasralla, a margin of just 28,000 votes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/24/honduras-nasry-tito-asfura-declared-president-donald-trump-backed",
      "published": "Wed, 24 Dec 2025 23:42:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Germany news: Germany job-finding chances hit record low",
      "description": "Germany's labor market is losing momentum with diminishing opportunities, according to the national labor agency. Germany needs a fund to tackle loneliness, which is now hitting under-30s. DW has more.",
      "url": "https://www.dw.com/en/germany-news-germany-job-finding-chances-hit-record-low/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 11:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Three women stabbed in Paris metro stations",
      "description": "Three women have been stabbed in Paris, according to the capital's prosecutor's office.",
      "url": "https://news.sky.com/story/three-women-stabbed-in-paris-metro-stations-13487619",
      "published": "Fri, 26 Dec 2025 18:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Son of former Bangladesh PM returns after 17 years in exile with a chance to lead",
      "description": "The son of a former Bangladesh prime minister has returned to the country after more than 17 years in exile",
      "url": "https://abcnews.go.com/International/wireStory/son-former-bangladesh-prime-minister-returns-after-17-128690701",
      "published": "Thu, 25 Dec 2025 06:57:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Japan’s cabinet approves record defence budget amid escalating China tensions",
      "description": "Japanese strike-back capabilities and coastal defences to be boosted while Beijing accuses Tokyo of fuelling a ‘space arms race’ Japan’s cabinet has approved a record high defence budget as tensions with China continue to spiral, with Beijing this week accusing Tokyo of “fuelling a space arms race”. The draft defence budget for the next fiscal year – approved on Friday – is more than ¥9tn ($58bn) and 9.4% bigger than the previous budget, which will end in April. The increase comes in the fourth year of Japan’s five-year program to double its annual arms spending to 2% of GDP. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/japan-defence-budget-china",
      "published": "Fri, 26 Dec 2025 06:16:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. strikes ISIS targets in Nigeria",
      "description": "President Trump announced Thursday that the U.S. launched military strikes against ISIS forces in Nigeria, alleging the group has been targeting Christians.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5657440/u-s-strikes-isis-targets-in-nigeria",
      "published": "Fri, 26 Dec 2025 04:40:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Russia 'downs seven Storm Shadow missiles' - as Zelenskyy set for Trump meeting",
      "description": "Russia said it has downed seven British-supplied Storm Shadow missiles over the past week, as Volodymyr Zelenskyy said he plans to hold a meeting with Donald Trump on Sunday.",
      "url": "https://news.sky.com/story/russia-downs-seven-storm-shadow-missiles-as-zelenskyy-set-for-trump-meeting-on-sunday-13487427",
      "published": "Fri, 26 Dec 2025 13:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Yemen separatists accuse Saudi Arabia of launching airstrikes against their forces",
      "description": "Separatists in southern Yemen are accusing Saudi Arabia of targeting their forces with airstrikes",
      "url": "https://abcnews.go.com/International/wireStory/yemen-separatists-accuse-saudi-arabia-launching-airstrikes-forces-128699563",
      "published": "Fri, 26 Dec 2025 05:29:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump launches Christmas night airstrikes in Nigeria and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/trump-launches-christmas-night-airstrikes-nigeria-more-top-headlines",
      "published": "Fri, 26 Dec 2025 07:23:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Nigeria says it shared intelligence to support US strikes on ISIS",
      "description": "Nigeria confirmed it shared intelligence with the U.S. ahead of Christmas night airstrikes against ISIS targets accused of killing Christians.",
      "url": "https://www.foxnews.com/world/nigeria-says-shared-intelligence-support-us-strikes-isis",
      "published": "Fri, 26 Dec 2025 07:34:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel recognises Somaliland as independent state, Netanyahu says",
      "description": "The decision has been condemned by Somalia, Egypt, Turkey and Djibouti, who call it a dangerous precedent.",
      "url": "https://www.bbc.com/news/articles/c4g417md05go?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 17:58:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Ex-State Dept. official on likelihood Kurdish forces join Syrian army before deadline",
      "description": "NPR's Leila Fadel asks former State Department official Wa'el Alzayat about the prospects of Kurdish forces reaching an agreement to join the Syrian army ahead of an end-of-year deadline.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5657316/ex-state-dept-official-on-likelihood-kurdish-forces-join-syrian-army-before-deadline",
      "published": "Fri, 26 Dec 2025 04:42:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Jimmy Kimmel jokes about fascism in an 'alternative Christmas message' for Britain",
      "description": "In an \"alternative\" message to the king's annual Christmas speech, Kimmel told British viewers that \"from a fascism perspective, this has been a really great year,\" for the United States.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5658144/jimmy-kimmel-alternative-christmas-message-britain",
      "published": "Fri, 26 Dec 2025 02:21:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US 'Powerball' lottery winner scoops $1.8 billion jackpot",
      "description": "One very lucky lottery player from the US state of Arkansas hit the ultimate jackpot on Christmas Eve. Christmas will never be the same again!",
      "url": "https://www.dw.com/en/us-powerball-lottery-winner-scoops-1-8-billion-jackpot/a-75306554?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 19:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Development cooperation agreement marks new phase in UN-Iraq partnership",
      "description": "Better access to education, the protection of the environment and good governance are some of the areas in which the United Nations helps countries improve.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166670",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "DR Congo: Displaced people in South Kivu close to ‘utter desperation’, WFP says",
      "description": "An estimated 500,000 people have been forced from their homes since fighting erupted in South Kivu province, Democratic Republic of Congo (DRC), at the beginning of December.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166657",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Russian forces near collapse in Kupyansk as Moscow allies concede city lost: report",
      "description": "Russian forces were reportedly cut off and surrendering in Ukraine's Kupyansk as supply lines fail. Only dozens of isolated troops remain in the strategic city.",
      "url": "https://www.foxnews.com/world/russian-forces-near-collapse-kupyansk-moscow-allies-concede-city-lost-report",
      "published": "Thu, 25 Dec 2025 21:04:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "India's solar boom faces a hidden waste problem",
      "description": "A recent study has found that India will generate over 11 million tonnes of solar waste by 2047 if it does not scale up recycling.",
      "url": "https://www.bbc.com/news/articles/cd6x75x4j02o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 23:11:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2025-12-26T21:39:54.485113Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine updates: Zelenskyy plans to meet Trump on Sunday",
      "description": "Volodymyr Zelenskyy said he plans to meet with President Donald Trump this Sunday in Florida. Kyiv and Washington recently reached an agreement on key issues for achieving peace in Ukraine. DW has more.",
      "url": "https://www.dw.com/en/ukraine-updates-zelenskyy-plans-to-meet-trump-on-sunday/live-75308039?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 14:10:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "South Korea to end overseas adoptions amid UN concern over human rights abuses",
      "description": "South Korea on Friday announced plans to end foreign adoptions over a five-year period, aiming for zero by 2029, as UN investigators raise “serious concern” over decades of abuses. Many adoptees were sent abroad with falsified records or suffered mistreatment, and critics say Seoul has failed to provide truth-finding, reparations, or full accountability for past violations.",
      "url": "https://www.france24.com/en/asia-pacific/20251226-south-korea-end-overseas-adoptions-amid-un-concern-human-rights-abuses",
      "published": "Fri, 26 Dec 2025 16:03:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Ozempic craze: Approved for diabetes, growing use in obesity",
      "description": "For anyone who overindulged during the holidays, the hype around weight-loss drugs like Ozempic can be tempting. Originally developed to treat diabetes, the medication suppresses appetite, and in the U.S., where oversized portions and fast food reign, its effects are even noticeable in New York restaurants. Matthew-Mary Caruchet reports.",
      "url": "https://www.france24.com/en/video/20251226-ozempic-craze-approved-for-diabetes-growing-use-in-obesity",
      "published": "Fri, 26 Dec 2025 13:59:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Bangladesh's PM front-runner Tarique Rahman returns after 17 years",
      "description": "Hundreds of thousands of BNP supporters gathered in Dhaka to welcome the party's acting chief Tarique Rahman, who returned to Bangladesh after 17 years in exile. In his first remarks after returning, Rahman called for communal harmony and promised to unveil a plan for Bangladesh. Charlotte Lam reports.",
      "url": "https://www.france24.com/en/video/20251226-bangladesh-s-pm-front-runner-tarique-rahman-returns-after-17-years",
      "published": "Fri, 26 Dec 2025 10:33:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Christmas returns to Holy Land cities as Bethlehem’s Christian population dwindles, Nazareth remains strong",
      "description": "Christmas returns to Bethlehem amid ongoing concerns over Christian population decline from 86% in 1950 to just 10% today, while Nazareth enjoys growth.",
      "url": "https://www.foxnews.com/world/christmas-returns-holy-land-cities-bethlehems-christian-population-dwindles-nazareth-remains-strong",
      "published": "Thu, 25 Dec 2025 15:24:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "California farming tycoon arrested in wife's killing",
      "description": "California farming tycoon Michael Abatti is accused of murdering his wife in an Arizona mountain town as the two were in the midst of a divorce.",
      "url": "https://www.foxnews.com/us/california-farming-tycoon-arrested-wifes-killing",
      "published": "Wed, 24 Dec 2025 14:29:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "US judge blocks detention of British social media campaigner",
      "description": "Imran Ahmed was among five people accused of seeking to \"coerce\" US firms into censoring free speech.",
      "url": "https://www.bbc.com/news/articles/c33mx6j5jrvo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 18:43:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil ex-President Jair Bolsonaro's surgery for hernia 'successful'",
      "description": "The former leader is serving a 27-year sentence for plotting a coup after losing the 2022 presidential election.",
      "url": "https://www.bbc.com/news/articles/c898zxyznxpo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 18:24:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Front-runner to be Bangladesh PM returns after 17 years in exile",
      "description": "Tarique Rahman, who has lived in London since 2008, arrives weeks before pivotal elections are held.",
      "url": "https://www.bbc.com/news/articles/crk733k1k1eo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 06:44:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump trips, a fake video and 10 possible co-conspirators: Takeaways from new Epstein files",
      "description": "The largest release of Epstein-related documents yet from the justice department included some notable messages and several mentions of Trump.",
      "url": "https://www.bbc.com/news/articles/c5yj4yvx80do?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:08:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rivalries and rumours: How the new order of the Murdoch dynasty is playing out",
      "description": "Family feuds and strategic change are redefining who holds power inside the Murdoch empire.",
      "url": "https://www.bbc.com/news/articles/clyd12d38jgo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:25:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Have the American Pope and the American administration fallen out?",
      "description": "Why the Catholic Church and Donald Trump’s government are at odds over immigration policy.",
      "url": "https://www.bbc.com/news/articles/cvg1361d32ro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 00:03:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Keir Starmer says Egyptian-British activist Alaa Abd El-Fattah back in UK",
      "description": "UK PM calls arrival of blogger and Egyptian government critic, who spent nearly 12 years in prison, 'profound relief'.",
      "url": "https://www.aljazeera.com/news/2025/12/26/keir-starmer-says-egyptian-british-activist-alaa-abd-el-fattah-back-in-uk?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 21:07:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marco Rubio congratulates Honduran President-elect Nasry Asfura",
      "description": "Washington's top diplomat says he thanked Asfura, who was backed by Trump, for 'advocacy of US strategic objectives'.",
      "url": "https://www.aljazeera.com/news/2025/12/26/marco-rubio-congratulates-honduran-president-elect-nasry-asfura?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 18:48:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Salah seals Egypt qualification with win against South Africa at AFCON 2025",
      "description": "Egypt reach the knockout stages with a 1-0 win against South Africa while Angola and Zimbabwe draw.",
      "url": "https://www.aljazeera.com/sports/2025/12/26/salah-seals-egypt-qualification-with-win-against-south-africa-at-afcon-2025?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 18:03:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sabalenka vs Kyrgios: Battle of the Sexes – start time, rules, how to watch",
      "description": "In a revamp of the 1973 mixed singles match, Aryna Sabalenka will play Nick Kyrgios on Sunday in Dubai.",
      "url": "https://www.aljazeera.com/sports/2025/12/26/sabalenka-vs-kyrgios-battle-of-the-sexes-start-time-rules-how-to-watch?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 14:12:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China sanctions 30 US firms, individuals over Taiwan weapons sales",
      "description": "Beijing urged the US to cease 'dangerous' efforts to arm the island, which it claims as its own.",
      "url": "https://www.aljazeera.com/news/2025/12/26/china-sanctions-30-us-firms-individuals-over-taiwan-weapons-sales?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 13:09:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran’s government budget reveals tough road ahead as currency hits new low",
      "description": "Prices of basic items like food are only expected to grow over the coming months as Iranians get poorer.",
      "url": "https://www.aljazeera.com/news/2025/12/26/irans-government-budget-reveals-tough-road-ahead-as-currency-hits-new-low?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 12:59:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syria’s Christians mark Christmas under heavy security",
      "description": "Christians in Syria spent Christmas surrounded by armed soldiers, with security deployed outside churches in Aleppo.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/26/syrias-christians-mark-christmas-under-heavy-security?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 12:31:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Al Jazeera witnesses fighting at Thai-Cambodia border despite talks",
      "description": "Al Jazeera’s Assed Baig witnessed fighting at the Thai-Cambodia border despite talks taking place.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/26/al-jazeera-witnesses-fighting-at-thai-cambodia-border-despite-talks?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 12:25:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea elections: Who’s running and what’s at stake?",
      "description": "Military ruler Mamady Doumbouya is set to legitimise his rule after barring key opposition challengers.",
      "url": "https://www.aljazeera.com/news/2025/12/26/guinea-elections-whos-running-and-whats-at-stake?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 12:12:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "British-Egyptian activist Alaa Abd el-Fattah arrives in UK after travel ban lifted",
      "description": "Family say campaigner, who has a son in Brighton, will be able to travel freely between UK and Cairo months after his release from Egyptian jail The British-Egyptian dissident Alaa Abd el-Fattah has arrived in London after the Egyptian government lifted a travel ban that it had imposed on him despite releasing him from jail in September . Abd el-Fattah had been held in jail nearly continuously for 10 years, mainly due to expressing his opposition to the treatment of dissidents by the Egyptian government. He had been detained in jail two years beyond his five-year sentence as the Cairo authorities refused to recognise the period he held in pre-trial detention as part of his time served. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/british-egyptian-activist-alaa-abd-el-fattah-arrives-in-uk-after-travel-ban-lifted",
      "published": "Fri, 26 Dec 2025 17:57:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China imposes sanctions on US defence firms over Taiwan arms deal",
      "description": "$10bn Trump-approved sale to Taipei triggers Beijing sanctions against firms such as Boeing and Northrop Grumman China’s foreign ministry has hit US defence companies including Boeing with sanctions after Donald Trump approved a large package of arms sales to Taiwan. The ministry said on Friday that the measures – against 10 individuals and 20 US firms including Boeing’s production hub at St Louis in Missouri – would freeze any assets the companies and individuals hold in China and bar domestic organisations and individuals from doing business with them. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/china-imposes-sanctions-on-us-defence-firms-over-taiwan-arms-deal",
      "published": "Fri, 26 Dec 2025 16:01:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Man charged after allegedly performing Nazi salutes at Canberra shopping centres",
      "description": "Police allege the man also trespassed at ANU and ‘stuck propaganda-style stickers’ on buildings and other property Get our breaking news email , free app or daily news podcast An 18-year-old has been charged with allegedly performing two separate Nazi salutes at Canberra shopping centres and putting up “propaganda-style stickers” in recent months. The man is expected to appear before ACT magistrates court on Friday, where police will allege in October a member of the public confronted him as he stuck stickers up at a shopping centre and then performed a Nazi salute before leaving the centre. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/man-charged-after-allegedly-performing-nazi-salutes-at-canberra-shopping-centres-ntwnfb",
      "published": "Thu, 25 Dec 2025 22:32:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 42 km NNE of Goroka, Papua New Guinea",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-22 10:31:28 UTC 2025-12-22 10:31:28 UTC at epicenter Location 5.720°S 145.496°E Depth 110.18 km (68.46 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000rwgh",
      "published": "2025-12-23T10:56:00.234Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.9 - 5 km SE of San Ramon, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - V Time 2025-12-21 02:31:54 UTC 2025-12-21 02:31:54 UTC at epicenter Location 37.747°N 121.946°W Depth 10.03 km (6.23 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283691",
      "published": "2025-12-24T23:59:13.379Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.0 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:56:09 UTC 2025-12-20 03:56:09 UTC at epicenter Location 37.744°N 121.953°W Depth 9.63 km (5.98 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283031",
      "published": "2025-12-24T19:42:49.197Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:49:28 UTC 2025-12-20 03:49:28 UTC at epicenter Location 37.743°N 121.954°W Depth 9.56 km (5.94 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283016",
      "published": "2025-12-22T17:36:16.470Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Louvre installs bars over gallery windows in latest security measure post-heist",
      "description": "France's Louvre museum has installed large metal bars over the windows of the gallery thieves broke into in October.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5655843/louvre-installs-bars-over-gallery-windows-in-latest-security-measure-post-heist",
      "published": "Fri, 26 Dec 2025 07:25:55 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Turkey is in the crosshairs over Russian's ghost fleet",
      "description": "Russia's ghost fleet of sanctions-busting oil tankers are using the Turkish-controlled Bosphorus to reach the Black Sea, causing headaches for Turkey.",
      "url": "https://www.npr.org/2025/12/25/nx-s1-5645803/turkey-is-in-the-crosshairs-over-russians-ghost-fleet",
      "published": "Thu, 25 Dec 2025 17:18:25 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysia: Ex-PM Najib sentenced to 15 years on new charges",
      "description": "Former prime minister Najib Razak had already been convicted for graft and money laundering linked to the 1MDB investment fund. The latest verdict, however, is likely to rock Malaysia's ruling coalition to the core.",
      "url": "https://www.dw.com/en/malaysia-ex-pm-najib-sentenced-to-15-years-on-new-charges/a-75307547?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 13:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German minister sees 'merit' to social media ban for teens",
      "description": "Looking into age restrictions on social media is \"more than justified,\" Germany's Digital Minister Karsten Wildberger told the dpa news agency, commenting on Australia banning the platforms for children under 16.",
      "url": "https://www.dw.com/en/german-minister-sees-merit-to-social-media-ban-for-teens/a-75308862?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 10:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Polish jets intercept Russian spy plane",
      "description": "Poland said it scrambled jets on Christmas morning after detecting a Russian reconnaissance aircraft flying close to Polish airspace.",
      "url": "https://www.dw.com/en/polish-jets-intercept-russian-spy-plane/a-75307011?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 22:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's Bolsonaro backs son in presidential race",
      "description": "Jailed former Brazilian President Jair Bolsonaro used a hospital stay for surgery to formally endorse his son Flavio's 2026 presidential bid.",
      "url": "https://www.dw.com/en/brazil-s-bolsonaro-backs-son-in-presidential-race/a-75306541?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 20:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany's empty churches repurposed as congregations shrink",
      "description": "The number of practicing Christians in Germany is falling. The result is surplus churches. What happens to these empty houses of worship?",
      "url": "https://www.dw.com/en/germany-s-empty-churches-repurposed-as-congregations-shrink/a-75227388?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 17:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mali to face host team at 2025 Africa Cup of Nations today",
      "description": "After starting their Africa Cup of Nations campaign with a 2–0 victory over Comoros, hosts Morocco could become the first team to reach the round of 16 if they beat Mali this Friday. It will be their first major test of the tournament, with the hosts balancing ambition and caution despite being among the favourites. Earlier, Zimbabwe fought back to earn a 1–1 draw with Angola in Marrakesh.",
      "url": "https://www.france24.com/en/video/20251226-mali-to-face-host-team-at-2025-africa-cup-of-nations-today",
      "published": "Fri, 26 Dec 2025 18:29:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Salah’s penalty sends Egypt into AFCON knockout stage",
      "description": "Mohamed Salah converted a penalty to give Egypt a 1-0 win over South Africa in Agadir on Friday, securing their place in the 2025 Africa Cup of Nations knockout stage. Despite being reduced to 10 men after a red card, the Pharaohs held on as South Africa were denied a late penalty of their own.",
      "url": "https://www.france24.com/en/sport/20251226-salah-s-penalty-sends-egypt-into-afcon-knockout-stage",
      "published": "Fri, 26 Dec 2025 18:05:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "2025 Afcon: Record winners Egypt face South Africa",
      "description": "It’s a blockbuster clash at the Africa Cup of Nations this Friday, with football heavyweights Egypt facing South Africa. Both sides come into the match with confidence after opening 2–1 wins—Egypt edging past Zimbabwe and South Africa defeating Angola. For more on all the AFCON action, we cross to our sports editor Selina Sykes in Rabat.",
      "url": "https://www.france24.com/en/video/20251226-2025-afcon-record-winners-egypt-face-south-africa",
      "published": "Fri, 26 Dec 2025 16:05:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ozempic for type 2 dibates: Weight loss observed in many patients but not approved for all",
      "description": "For anyone who overindulged during the holidays, the hype around weight-loss drugs like Ozempic can be tempting. Originally developed to treat diabetes, the medication suppresses appetite—and in the U.S., where oversized portions and fast food reign, its effects are even noticeable in New York restaurants. Doctor Emmanuelle Lecornet-Sokol, endrocrinologist and President of Fenarediam in Paris, explains.",
      "url": "https://www.france24.com/en/video/20251226-ozempic-for-type-2-dibates-weight-loss-observed-in-many-patients-but-not-approved-for-all",
      "published": "Fri, 26 Dec 2025 14:00:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Morocco eye early qualification against Mali",
      "description": "After opening their tournament with a 2-0 win over Comoros, the Atlas Lions could become the first team to book a place in the AFCON round of 16 if they beat Mali this Friday. It's a first major test for the host nation – ambitious, yet keeping a cautious approach despite their status as favourites.",
      "url": "https://www.france24.com/en/tv-shows/sports/20251226-afcon-2025-morocco-eye-early-qualification-against-mali",
      "published": "Fri, 26 Dec 2025 12:26:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-child soldiers rehabilitated in the Democratic Republic of Congo",
      "description": "Fierce fighting rages in the east of the Democratic Republic of the Congo, targeting civilianpopulations. We bring you these testimonies from former child soldiers who have been freed from the armed group that held them captive. As child soldiers, they have both seen and been forced to participate in countless horrors. Matthew-Mary Caruchet has the details.",
      "url": "https://www.france24.com/en/video/20251226-ex-child-soldiers-rehabilitated-in-the-democratic-republic-of-congo",
      "published": "Fri, 26 Dec 2025 11:56:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US judge blocks detention of British free speech campaigner",
      "description": "A US judge has temporarily blocked the Donald Trump administration from detaining British anti-disinformation campaigner Imran Ahmed.",
      "url": "https://news.sky.com/story/us-judge-blocks-detention-of-british-free-speech-campaigner-amid-censorship-row-13487386",
      "published": "Fri, 26 Dec 2025 10:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine hits major Russian oil refinery with British missiles, officials say",
      "description": "Ukraine has hit a major Russian oil refinery with British missiles, Ukrainian military and security officials said on Thursday.",
      "url": "https://news.sky.com/story/ukraine-hits-major-russian-oil-refinery-with-british-missiles-officials-say-13487355",
      "published": "Thu, 25 Dec 2025 16:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "White House orders US military to 'quarantine' Venezuela oil",
      "description": "The White House has ordered the US military to focus on enforcing a \"quarantine\" of Venezuelan oil for the next two months, according to a US official.",
      "url": "https://news.sky.com/story/white-house-orders-us-military-to-quarantine-venezuela-oil-official-says-13487300",
      "published": "Wed, 24 Dec 2025 21:29:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Algeria votes to declare French colonization a crime and demands restitution",
      "description": "Algerian legislators have declared France's colonization a crime, demanding restitution for property taken during its 130-year rule",
      "url": "https://abcnews.go.com/International/wireStory/algeria-votes-declare-french-colonization-crime-demands-restitution-128691093",
      "published": "Thu, 25 Dec 2025 06:57:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea vows to end foreign adoptions as UN presses Seoul to address past abuses",
      "description": "South Korea’s government says it plans to end the waning foreign adoptions of Korean children",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-vows-end-foreign-adoptions-presses-seoul-128699370",
      "published": "Fri, 26 Dec 2025 02:57:17 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Saudi Arabia calls on Yemen separatists to leave 2 governorates as coalition strains",
      "description": "Saudi Arabia has called on separatists in Yemen to withdraw from two governorates they now hold",
      "url": "https://abcnews.go.com/International/wireStory/saudi-arabia-calls-yemen-separatists-leave-2-governorates-128690170",
      "published": "Thu, 25 Dec 2025 06:57:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar will hold its first general election in 5 years as criticism of the military rule mounts",
      "description": "Myanmar will hold the first phase of a general election on Sunday, its first vote in five years and an election framed by the ruling military as a return to multi-party democracy",
      "url": "https://abcnews.go.com/International/wireStory/myanmar-hold-general-election-5-years-criticism-military-128698252",
      "published": "Thu, 25 Dec 2025 23:15:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's Cabinet OKs record defense budget that aims to deter China",
      "description": "Japan’s Cabinet has approved a record defense budget plan exceeding 9 trillion yen for the coming year",
      "url": "https://abcnews.go.com/International/wireStory/japans-cabinet-oks-record-defense-budget-aims-deter-128697811",
      "published": "Fri, 26 Dec 2025 03:45:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Korean prosecutors seek 10-year sentence for ousted President Yoon in first martial law trial",
      "description": "An independent counsel has demanded a 10-year prison term for South Korea’s ousted President Yoon Suk Yeol",
      "url": "https://abcnews.go.com/International/wireStory/korean-prosecutors-seek-10-year-sentence-ousted-president-128699562",
      "published": "Fri, 26 Dec 2025 05:29:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza: Humanitarian response ongoing despite restrictions",
      "description": "Although “significant restrictions and impediments” continue to hamper humanitarian operations in Gaza, teams are still responding to the population’s needs, the UN aid coordination office OCHA said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166669",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN celebrates 10 years of progress in youth, peace and security agenda",
      "description": "The UN has long been at the forefront of efforts to involve young people in decision-making, and the last decade has seen significant progress, thanks to the adoption of a Security Council resolution on youth, peace and security which led to widespread changes in the ways that the voices of young people are not just heard, but also incorporated in peace plans and policies.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166637",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somalia: Funding cuts impact assistance to millions affected by drought",
      "description": "Brutal slashes to aid budgets are hampering efforts to assist millions of people in Somalia affected by drought, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166654",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fox News True Crime Newsletter: JonBenet Ramsey case, Scott Peterson's bid, Kimberlee Singler returns",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-jonbenet-ramsey-case-break-scott-peterson-bid-kimberlee-singler-returns",
      "published": "Fri, 26 Dec 2025 16:00:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "JonBenet Ramsey case could benefit from new DNA technology as police renew commitment",
      "description": "Boulder police renew efforts in JonBenet Ramsey murder case with new chief praising advanced DNA testing, nearly 30 years after the Christmas tragedy that shocked America.",
      "url": "https://www.foxnews.com/us/jonbenet-ramsey-case-could-benefit-from-new-dna-technology-police-renew-commitment",
      "published": "Fri, 26 Dec 2025 08:00:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "President of TPUSA chapter twice denied by university's student government vows to fight: 'not backing down'",
      "description": "Loyola University student fights for conservative club after being denied twice. Anistin Murray vows to keep battling for Turning Point USA chapter.",
      "url": "https://www.foxnews.com/us/president-tpusa-chapter-twice-denied-by-universitys-student-government-vows-fight-not-backing-down",
      "published": "Fri, 26 Dec 2025 06:00:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Santa with CCW gets pulled over, tells Ohio deputy 'you got to protect yourself' during festive traffic stop",
      "description": "Santa was pulled over for speeding in Ohio and told a deputy he had a concealed carry permit. Hilarious bodycam footage shows Christmas magic meeting reality.",
      "url": "https://www.foxnews.com/us/santa-ccw-gets-pulled-over-tells-ohio-deputy-you-got-protect-yourself-during-festive-traffic-stop",
      "published": "Thu, 25 Dec 2025 19:23:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Migrant truckers sue California DMV over canceled commercial drivers' licenses",
      "description": "Nearly 20,000 immigrant truckers at risk of having their commercial driver's licenses revoked by California spark a class-action lawsuit.",
      "url": "https://www.foxnews.com/us/migrant-truckers-sue-california-dmv-over-canceled-commercial-drivers-licenses",
      "published": "Thu, 25 Dec 2025 14:12:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Watch: Thieves drag ATM through Texas convenience store in Christmas Eve theft attempt",
      "description": "Thieves attempted to drag an ATM through a Texas 7-Eleven's doors using a stolen black SUV and cable on Christmas Eve, but the machine broke free.",
      "url": "https://www.foxnews.com/us/watch-thieves-drag-atm-through-texas-convenience-store-christmas-eve-theft-attempt",
      "published": "Wed, 24 Dec 2025 20:50:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Virginia family alleges bed bugs bit them during transatlantic flight, suing Delta and KLM airlines",
      "description": "The Romulo Albuquerque family from Virginia claims in a lawsuit that bed bugs infested their cabin during March trip from Roanoke to Serbia.",
      "url": "https://www.foxnews.com/us/virginia-family-alleges-bed-bugs-bit-them-during-transatlantic-flight-suing-delta-klm-airlines",
      "published": "Wed, 24 Dec 2025 16:58:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trio of Palestinians arrested for allegedly torching Christmas tree at Catholic church in West Bank",
      "description": "Three Palestinians accused of torching a Christmas tree and damaging part of a Nativity scene at a West Bank Catholic church were arrested.",
      "url": "https://www.foxnews.com/world/trio-palestinians-arrested-allegedly-torching-christmas-tree-catholic-church-west-bank",
      "published": "Thu, 25 Dec 2025 21:31:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy encouraged by 'very good' Christmas talks with US",
      "description": "Ukrainian President Volodymyr Zelenskyy expresses optimism about Ukraine peace talks after Christmas conversation with U.S. envoys, as negotiations show progress.",
      "url": "https://www.foxnews.com/world/zelenskyy-encouraged-very-good-christmas-talks-us",
      "published": "Thu, 25 Dec 2025 13:53:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Poland scrambles jets on Christmas after detecting Russian reconnaissance aircraft near its airspace",
      "description": "Poland scrambled fighter jets on Christmas morning after detecting a Russian reconnaissance aircraft near its airspace over the Baltic Sea.",
      "url": "https://www.foxnews.com/world/poland-scrambles-jets-christmas-after-detecting-russian-reconnaissance-aircraft-near-its-airspace",
      "published": "Thu, 25 Dec 2025 11:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump-backed candidate Asfura wins Honduras presidential election",
      "description": "Tito Asfura secured Honduras' presidency, defeating Salvador Nasralla and Rixi Ramona Moncada Godoy in a polarized campaign that shifts Central America's political landscape.",
      "url": "https://www.foxnews.com/world/trump-backed-candidate-asfura-wins-honduras-presidential-election",
      "published": "Wed, 24 Dec 2025 19:21:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope Leo XIV says he’s ‘very disappointed’ after Illinois approves assisted suicide law",
      "description": "Pope Leo XIV and Chicago Cardinal Cupich unsuccessfully urged Illinois Gov. Pritzker not to sign controversial medical aid in dying legislation into law.",
      "url": "https://www.foxnews.com/world/pope-leo-xiv-says-hes-very-disappointed-after-illinois-approves-assisted-suicide-law",
      "published": "Tue, 23 Dec 2025 20:41:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bukele challenges Hillary Clinton to take El Salvador's entire prison population after criticism",
      "description": "Bukele challenged Hillary Clinton’s allegations of torture at El Salvador’s CECOT prison, offering to release inmates if other countries accept them.",
      "url": "https://www.foxnews.com/world/bukele-challenges-hillary-clinton-take-el-salvadors-entire-prison-population-criticism",
      "published": "Tue, 23 Dec 2025 19:07:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}