{
  "last_updated": "2025-12-26T09:24:38.530957Z",
  "event_count": 225,
  "events": [
    {
      "title": "US carries out strikes on Nigeria targeting Islamic State militants, Trump says",
      "description": "President claims strikes targeted militants in country’s north-west, accusing group of attacking Christian communities Donald Trump has said the US carried out airstrikes against Islamic State militants in north-west Nigeria on Thursday, after spending weeks decrying the group for targeting Christians. The president said in a post on his Truth Social platform: “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries! Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/25/us-carries-out-airstrikes-against-islamic-state-terrorist-scum-in-nigeria-trump-says",
      "published": "Thu, 25 Dec 2025 23:41:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Australian prime minister announces national bravery honors after antisemitic terror attack",
      "description": "Australia announced a national bravery award for heroes who confronted ISIS-inspired gunmen during a deadly Hanukkah attack that killed 15 people in Sydney.",
      "url": "https://www.foxnews.com/world/australian-pm-announces-national-bravery-honors-after-antisemitic-terror-attack",
      "published": "Thu, 25 Dec 2025 21:02:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Turkey detains more than 100 suspected IS members over alleged attack plot",
      "description": "Turkish special police detained more than 100 suspected members of the \"Islamic State\" terrorist group that they said were planning on carrying out attacks during Christmas and New Year celebrations in the country.",
      "url": "https://www.dw.com/en/turkey-detains-more-than-100-suspected-is-members-over-alleged-attack-plot/a-75304150?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 15:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Homes threatened as bushfire rages south-east of Perth and storms hit Queensland and Northern Territory",
      "description": "Bushfire that is believed to have started at Boddington goldmine still uncontained, while monsoon trough soaks north-eastern Australia Get our breaking news email , free app or daily news podcast Australians on both sides of the country have been warned to remain vigilant as floods and fires threatened their homes on Boxing Day. A bushfire continued to rage about 200km south-east of Perth on Friday morning, although nearby residents were no longer being urged to leave their homes. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/homes-threatened-as-bushfire-rages-south-east-of-perth-and-storms-hit-queensland-and-northern-territory",
      "published": "Fri, 26 Dec 2025 01:42:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "US launches air strikes against Islamic State militants in Nigeria",
      "description": "President Donald Trump said Thursday that the US had launched \"precision hits on terrorist targets in Nigeria by air strikes\". The claim came in a Christmas night social media post that offered few details, though US Africa Command later confirmed the strikes were conducted at the request of Nigerian authorities that said it killed multiple Islamic State militants.",
      "url": "https://www.france24.com/en/live-news/20251226-us-launches-strike-against-islamic-state-militants-in-nigeria",
      "published": "Fri, 26 Dec 2025 01:21:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Trump launches Christmas night airstrikes on ISIS 'Terrorist Scum' in Nigeria after killings of Christians",
      "description": "Trump said the United States launched Christmas night airstrikes in Nigeria targeting ISIS militants he accused of killing Christians in recent attacks.",
      "url": "https://www.foxnews.com/world/trump-launches-christmas-night-airstrikes-isis-terrorist-scum-nigeria-after-killings-christians",
      "published": "Thu, 25 Dec 2025 18:16:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "4 indicted in foiled New Year's Eve terror bombing plot targeting Southern California businesses",
      "description": "Four people face federal terror charges for allegedly plotting New Year's Eve 2025 bombings targeting businesses. The holiday attack was foiled by FBI agents.",
      "url": "https://www.foxnews.com/us/four-indicted-foiled-new-years-eve-terror-bombing-plot-targeting-southern-california-businesses",
      "published": "Tue, 23 Dec 2025 19:52:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Libya’s army chief dies in plane crash in Turkey",
      "description": "Libyan PM says Mohammed Ali Ahmed al-Haddad died after aircraft lost radio contact above Ankara The Libyan army’s chief of staff, Mohammed Ali Ahmed al-Haddad, has been killed in a plane crash after leaving Turkey’s capital, Ankara. The prime minister of Libya’s internationally recognised government confirmed on Tuesday evening that Mohammed Ali Ahmed al-Haddad had died and that four others were on the jet with him. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/libyas-army-chief-dies-in-plane-crash-in-turkey",
      "published": "Tue, 23 Dec 2025 23:46:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "In post-Assad Syria, wary Christians celebrate Christmas under tight security",
      "description": "One year after the fall of the Assad regime in Syria, Christmas festivities are taking place under a cloud of pain and worry. In the capital Damascus and the nearby town of Maaloula, Christian communities are determined to celebrate, despite the wounds of recent violence and widespread concern about insecurity in the country scarred by more than a decade of war. FRANCE 24's Syria correspondent Dana Alboz has this report.",
      "url": "https://www.france24.com/en/video/20251225-syria-s-christians-celebrate-christmas-amid-pain-and-insecurity",
      "published": "Thu, 25 Dec 2025 10:36:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Albanese announces bravery award for heroes of Bondi antisemitic attack",
      "description": "Australian Prime Minister Anthony Albanese has announced a national bravery award to honor those who confronted an antisemitic terror attack",
      "url": "https://abcnews.go.com/International/wireStory/albanese-announces-bravery-award-heroes-bondi-antisemitic-attack-128689526",
      "published": "Wed, 24 Dec 2025 23:53:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Guilty verdicts in ISIS plot police say could have been 'the deadliest terrorist attack in UK history'",
      "description": "Three men convicted of planning alleged gun attacks on Jewish targets in Manchester as British Jews report feeling increasingly unsafe across the U.K.",
      "url": "https://www.foxnews.com/world/guilty-verdicts-isis-plot-police-say-could-have-been-the-deadliest-terrorist-attack-uk-history",
      "published": "Tue, 23 Dec 2025 13:17:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "US strikes 'terrorist targets' in Nigeria",
      "description": "The US said the strike came at the request of the Nigerian authorities. Trump had previously threatened military action to protect Christians in Nigeria from what he described as a \"genocide.\"",
      "url": "https://www.dw.com/en/us-strikes-terrorist-targets-in-nigeria/a-75307055?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 01:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "California declares state of emergency as Christmas storms threaten flash floods",
      "description": "California declared a state of emergency in Los Angeles and several other locations in the southern part of the state on Wednesday as one of the worst Christmas storms in recent memory brought heavy rain and fears of flashing flooding.",
      "url": "https://www.france24.com/en/americas/20251225-california-declares-state-of-emergency-christmas-storms-threaten-flash-floods",
      "published": "Thu, 25 Dec 2025 10:32:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns Sudan war entering deadlier phase as fighting spreads in Kordofan",
      "description": "The war in Sudan is entering a deadlier phase, the United Nations has warned, as intensified fighting in the Kordofan region, mounting civilian casualties from drone strikes and growing risks of regional spillover push the conflict toward the 1,000-day mark.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166655",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Western Australia faces bushfire threat as cold, wet and bumpy Sydney to Hobart yacht race forecast",
      "description": "WA facing several fire warnings as Perth temperatures exceed 40C while Melbourne on track for coldest Christmas since 2006 Get our breaking news email , free app or daily news podcast Perth exceeded its Christmas Day forecast of 40C as a heatwave created extreme fire danger for much of south-west Western Australia. Residents at Boddington goldmine were being warned it was too late to leave on Thursday afternoon as fire affected evacuation routes. Residents of Cowalla were also warned to leave immediately as fires posed a threat to homes at Bidaminna Place and Millbank Road. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/25/sydney-to-hobart-yacht-race-forecast-to-be-cold-wet-and-bumpy-as-australias-west-faces-cyclone-and-bushfire-threat",
      "published": "Thu, 25 Dec 2025 20:06:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Heavy rain storms in California leave three dead",
      "description": "A state of emergency is declared in Los Angeles and other southern counties after flash floods and mudslides.",
      "url": "https://www.bbc.com/news/articles/c1lr3p7n87yo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 22:39:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Hundreds of thousands newly displaced as Islamic State insurgency expands in Mozambique",
      "description": "Rising numbers of people flee jihadists, as violence against civilians increases and foreign aid dwindles More than 300,000 people have been displaced by an Islamic State insurgency in Mozambique since July, amid growing fears that authorities lack a workable plan to end the fighting. With wars in Ukraine, Gaza and Sudan attracting more attention and foreign aid falling, the grinding conflict in Mozambique has been largely ignored or forgotten. More than 1 million people have been displaced, many of them two, three or even four times. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/25/displaced-islamic-state-insurgency-mozambique",
      "published": "Thu, 25 Dec 2025 08:00:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "California hit by powerful storm on Christmas Day",
      "description": "Authorities have warned of heavy rainfall, especially in Los Angeles, and issued evacuation warnings.",
      "url": "https://www.dw.com/en/california-hit-by-powerful-storm-on-christmas-day/a-75307479?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 04:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "New charges against DC National Guard shooting suspect open death penalty door",
      "description": "An Afghan national accused of killing a National Guard member faces new federal charges that could lead to the death penalty in a Washington, D.C., shooting case.",
      "url": "https://www.foxnews.com/us/new-charges-against-dc-national-guard-shooting-suspect-open-death-penalty-door",
      "published": "Wed, 24 Dec 2025 14:20:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Cambodia accuses Thailand of launching strikes during border peace talks",
      "description": "Thai reports claim Cambodia carried out overnight attacks ahead of officials from both countries meeting for a third day of negotiations on Friday Cambodia has accused Thailand of intensifying its bombardment of disputed border areas, even as officials from the two countries attend a multi-day meeting aimed at negotiating an end to deadly clashes. The neighbours’ longstanding border conflict reignited this month , shattering an earlier truce and killing more than 40 people, according to official counts. About a million people have also been displaced. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/cambodia-accuses-thailand-of-launching-strikes-during-border-peace-talks",
      "published": "Fri, 26 Dec 2025 06:56:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Victoria police name man they want to interview in relation to ‘Happy Chanukah’ car fire in St Kilda",
      "description": "Police say there is no indication John Argento, 47, poses specific risk to the Jewish community, but believe he may be able to help with investigation Get our breaking news email , free app or daily news podcast Victoria police have named a man they want to interview in relation to a suspected arson attack on a car sporting a “Happy Chanukah” sign in Melbourne on Christmas Day. Police said emergency services were called to a vehicle displaying a mobile billboard that had been set alight in the driveway of a property in St Kilda East about 2.50am on Thursday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/victoria-police-happy-chanukah-car-fire-st-kilda-melbourne-ntwnfb",
      "published": "Fri, 26 Dec 2025 02:49:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Bethlehem celebrates first festive Christmas since Gaza war",
      "description": "Hundreds of worshippers gathered for mass at the Church of the Nativity in Bethlehem Wednesday night as the Palestinian city ushered in its first festive Christmas in more than two years, emerging from the shadow of the war in Gaza. Throughout the conflict that began with Hamas's attack on Israel in October 2023, a sombre tone had marked Christmases in the biblical birthplace of Jesus Christ.",
      "url": "https://www.france24.com/en/video/20251225-bethlehem-celebrates-first-festive-christmas-since-gaza-war",
      "published": "Thu, 25 Dec 2025 09:58:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "This 56-year conflict still pauses for Christmas",
      "description": "At Christmas, the world can seem a little more humane than usual - even in wartime.",
      "url": "https://news.sky.com/story/this-56-year-conflict-still-pauses-for-christmas-13486554",
      "published": "Thu, 25 Dec 2025 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Pope Leo XIV delivers first Christmas message calling for end to violence in Middle East, Russia-Ukraine war",
      "description": "Pope Leo XIV delivers Christmas message calling for peace in Middle East and Ukraine, urging world leaders to reject violence and embrace dialogue.",
      "url": "https://www.foxnews.com/world/pope-leo-xiv-delivers-first-christmas-message-calling-end-violence-middle-east-russia-ukraine-war",
      "published": "Thu, 25 Dec 2025 08:44:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘They’re scared of us now’: how co-investment in a tropical forest saw off loggers",
      "description": "Low-cost tech and joined-up funding have reduced illegal logging, mining and poaching in the Darién Gap – it’s a success story that could stop deforestation worldwide There are no roads through the Darién Gap. This vast impenetrable forest spans the width of the land bridge between South and Central America, but there is almost no way through it: hundreds have lost their lives trying to cross it on foot. Its size and hostility have shielded it from development for millennia, protecting hundreds of species – from harpy eagles and giant anteaters to jaguars and red-crested tamarins – in one of the most biodiverse places on Earth. But it has also made it incredibly difficult to protect. Looking after 575,000 hectares (1,420,856 acres) of beach, mangrove and rainforest with just 20 rangers often felt impossible, says Segundo Sugasti, the director of Darién national park. Like tropical forests all over the world, it has been steadily shrinking, with at least 15% lost to logging, mining and cattle ranching in two decades. Continue reading...",
      "url": "https://www.theguardian.com/environment/2025/dec/25/they-are-scared-of-us-now-how-one-tropical-forest-turned-the-tide-on-loggers",
      "published": "Thu, 25 Dec 2025 15:00:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Historic vote looms in Central African Republic as UN urges peaceful participation",
      "description": "With Central Africans set to vote in presidential, legislative, regional and long-delayed municipal elections this weekend, the United Nations has appealed for calm and restraint, warning that the credibility of the process will be critical to consolidating peace after years of conflict and instability.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166665",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "LIVE: Security Council meets on escalating violence in Sudan",
      "description": "Senior UN political and humanitarian officials are set brief the Security Council this afternoon as members meet to discuss the rapidly deteriorating situation in Sudan, where intensified fighting – including in the Kordofan region – has driven widespread civilian harm and displacement. The region has seen a sharp escalation, including a deadly drone attack on a UN peacekeeping base that killed six Bangladeshi peacekeepers. The meeting was requested by Sudan and Transitional Prime Minister, Kamil Eltayeb Idris, is expected to attend. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166650",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Sky News correspondents look back at 2025",
      "description": "It has been a turbulent year. Wars have erupted or dragged on, international crises have deepened - but there have been bright spots too.",
      "url": "https://news.sky.com/story/sky-news-correspondents-look-back-at-2025-13484844",
      "published": "Wed, 17 Dec 2025 14:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Industrialisation without destruction: A UN blueprint for the future",
      "description": "Since the 19th century, industrialisation has had a transformative effect on the world, both positive and negative. It has created jobs and lifted millions out of poverty. But it has also had devastating consequences; destroying ecosystems, polluting the air, and driving the climate crisis that threatens to make large parts of the planet uninhabitable.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166635",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Eleven arrested over mass shooting in South Africa tavern",
      "description": "Preliminary investigations revealed the motive could be linked to illegal mining turf wars, police said.",
      "url": "https://www.bbc.com/news/articles/c75v0kwy017o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 21:31:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Freed Nigerian schoolchildren to be reunited with families",
      "description": "Month-long ordeal ends but no details released on how they regained their freedom or who was behind abduction A final group of 130 kidnapped Nigerian schoolchildren freed by the government on Sunday are expected to be reunited with their families in the central Niger state on Monday, ending a month-long ordeal that drew global concern. Last month, unknown gunmen took hundreds of schoolchildren and 12 teachers from St Mary’s Catholic school, Papiri community in Niger state, which runs west from the capital, Abuja, to neighbouring Benin. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/freed-nigerian-schoolchildren-set-to-be-reunited-with-families",
      "published": "Mon, 22 Dec 2025 12:00:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Kyiv hits Russian refinery with UK missiles",
      "description": "Ukraine said it used British Storm Shadow missiles to attack the Novoshakhtinsk oil refinery. Zelenskyy said he spoke with Trump's envoys on how to end the war.",
      "url": "https://www.dw.com/en/ukraine-updates-kyiv-hits-russian-refinery-with-uk-missiles/live-75302997?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Overnight strikes leave death, destruction and power outages in Ukraine",
      "description": "A new wave of overnight strikes and front-line hostilities in Ukraine have caused further civilian casualties and damage to critical energy infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166664",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Myanmar elections marked by fear as UN warns civilians are coerced from all sides",
      "description": "As Myanmar approaches elections scheduled for 28 December, the UN’s top human rights official has said that civilians are being coerced from all sides – forced by the military to vote and threatened by armed opposition groups to boycott – in a climate of fear, violence and mass repression.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166662",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "ICE agents open fire on van driver who allegedly tried to run them over on Christmas Eve",
      "description": "ICE agents opened fire on a van in Maryland Christmas Eve, shooting after the driver allegedly tried to run them over. Two were injured in the Glen Burnie incident.",
      "url": "https://www.foxnews.com/us/ice-agents-open-fire-van-driver-who-allegedly-tried-run-them-over-christmas-eve",
      "published": "Wed, 24 Dec 2025 17:11:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the wildest place I have walked’: new national park will join up Chile’s 2,800km wildlife corridor",
      "description": "Government poised to officially protect 200,000 hectares of remote Patagonian coastline and forest Chile’s government is poised to create the country’s 47th national park, protecting nearly 200,000 hectares (500,000 acres) of pristine wilderness and completing a wildlife corridor stretching 1,700 miles (2,800km) to the southernmost tip of the Americas. The Cape Froward national park is a wild expanse of wind-torn coastline and forested valleys that harbours unrivalled biodiversity and has played host to millennia of human history. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/25/cape-froward-new-national-park-patagonia-chile",
      "published": "Thu, 25 Dec 2025 12:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "'A huge relief': Joy returns to Jerusalem amid Christmas festivities",
      "description": "Joy is returning to Jerusalem as Christians mark Christmas in one of the world’s oldest cities. FRANCE 24’s Noga Tarnopolsky reports a festive atmosphere in the air, describing it as \"a huge relief” after more than two years of war in Gaza.",
      "url": "https://www.france24.com/en/video/20251225-a-huge-relief-joy-returns-to-jerusalem-amid-christmas-festivities",
      "published": "Thu, 25 Dec 2025 11:34:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Russian court sentences pro-war activist and Putin critic to 6 years in prison",
      "description": "A Russian court has sentenced pro-war activist Sergei Udaltsov to six years in prison for justifying terrorism",
      "url": "https://abcnews.go.com/International/wireStory/russian-court-sentences-pro-war-activist-putin-critic-128696064",
      "published": "Fri, 26 Dec 2025 02:00:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Security Council remains divided over Iran nuclear programme, sanctions stay in place",
      "description": "At a meeting to discuss nuclear non-proliferation on Tuesday, the Security Council’s stance on Iran’s nuclear activities remained divided on the issue, split between those who support the reinstatement of sanctions, and the members who believe the sanctions should be permanently lifted, whilst questioning the legality of the meeting itself.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166660",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Security Council meets on Venezuela, Iran, Somalia",
      "description": "The Security Council convened earlier today for a packed agenda, adopting a resolution extending the authorisation of the African Union support mission in Somalia (AUSSOM) and hearing a briefing on Iran and the implementation of resolution 2231, which endorsed the 2015 nuclear deal known as the Joint Comprehensive Plan of Action (JCPOA). Members are set to reconvene at 3 pm for an emergency meeting requested by Venezuela, amid heightened tensions between Caracas and Washington. Assistant Secretary-General for Political Affairs Khaled Khiari is expected to brief ambassadors. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166656",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "UFO secret files, drone swarms and nuclear-linked sightings stun experts in 2025",
      "description": "Discover compelling UFO headlines from 2025, featuring new scientific evidence, mysterious underwater objects and government disclosure revelations.",
      "url": "https://www.foxnews.com/us/ufo-secret-files-drone-swarms-nuclear-linked-sightings-stun-experts-2025",
      "published": "Thu, 25 Dec 2025 06:00:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Israel says Iran's Quds Force operative killed in Lebanon strike",
      "description": "Amid regional tension and diplomatic uncertainty, Israel reported the targeted killing of an Iranian operative in Lebanon.",
      "url": "https://www.dw.com/en/israel-says-iran-s-quds-force-operative-killed-in-lebanon-strike/a-75305394?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 17:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "In pictures: Christmas festivities from across the world",
      "description": "Many people celebrated Christmas Day with a traditional mass on Thursday, while others enjoyed the holiday with tiramisu at Sydney's Bondi Beach or watching a parade of Ukrainian soldiers in Lviv. In Bethlehem, Christians celebrated their first festive Christmas in over two years as the occupied West Bank city emerged from the shadow of the war in Gaza.",
      "url": "https://www.france24.com/en/culture/20251225-in-pictures-christmas-festivities-from-across-world",
      "published": "Thu, 25 Dec 2025 12:25:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UN Security Council hears warnings over escalating US-Venezuela standoff",
      "description": "Tensions between the United States and Venezuela have sharply escalated amid increased US military operations in the Southern Caribbean, prompting accusations of sovereignty violations, concerns over civilian harm and growing calls at the UN Security Council for restraint and de-escalation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166668",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Weekend attacks in Ukraine bring more casualties, damage infrastructure",
      "description": "Hostilities in Ukraine this weekend resulted in more civilian casualties and widespread damage to critical infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166652",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Colorado mom accused of killing 2 children and fleeing to UK returns stateside to face murder charges",
      "description": "Colorado mother accused of killing two of her children, injuring another during custody battle extradited from U.K. to face murder charges after lengthy international legal fight.",
      "url": "https://www.foxnews.com/us/colorado-mom-accused-killing-2-children-fleeing-uk-returns-stateside-face-murder-charges",
      "published": "Wed, 24 Dec 2025 05:38:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "US releases missile launch video after northwest Nigeria strike",
      "description": "The US Department of War published footage of a missile being fired on Nigeria.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/26/us-releases-missile-launch-video-after-northwest-nigeria-strike?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 06:10:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Japan Cabinet approves record defense budget to deter China",
      "description": "Japan is seeking to bolster its defense capabilities in the face of \"the most severe\" security environment since the end of World War II.",
      "url": "https://www.dw.com/en/japan-cabinet-approves-record-defense-budget-to-deter-china/a-75307361?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 04:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Woman in Florida Barnes & Noble stabbed to death, police seek motive",
      "description": "A woman died from stab wounds after allegedly being attacked inside a Barnes & Noble bookstore in Palm Beach Gardens, leaving police searching for a motive.",
      "url": "https://www.foxnews.com/us/woman-florida-barnes-noble-stabbed-death-police-seek-motive",
      "published": "Wed, 24 Dec 2025 07:29:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Family warned nonprofit not to free repeat offender who allegedly killed man days later",
      "description": "Family warned bail nonprofit not to release repeat offender who allegedly killed man days later, saying he needed help and treatment, not freedom.",
      "url": "https://www.foxnews.com/us/family-warned-nonprofit-not-free-repeat-offender-who-allegedly-killed-man-days-later",
      "published": "Wed, 24 Dec 2025 06:00:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "PA man charged with attempting to make weapons of mass destruction after neighbor tip",
      "description": "Counterterrorism investigation leads to arrest of Pennsylvania man accused of weapons of mass destruction charges. Neighbor's tip sparked FBI probe.",
      "url": "https://www.foxnews.com/us/pa-man-charged-attempting-make-weapons-mass-destruction-after-neighbor-tip",
      "published": "Tue, 23 Dec 2025 20:49:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Late-night joyride ends in disaster as driver smashes into towering Christmas tree on camera",
      "description": "Wild CCTV footage captures driver's joyride gone wrong as car crashes into Christmas tree in Kazakhstan square, toppling holiday display before fleeing.",
      "url": "https://www.foxnews.com/world/late-night-joyride-ends-disaster-driver-smashes-towering-christmas-tree-camera",
      "published": "Wed, 24 Dec 2025 18:49:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Algeria passes law declaring French colonisation a crime",
      "description": "France’s rule over Algeria from 1830 to 1962 is marked by mass killings and large-scale deportation Algeria’s parliament has unanimously approved a law declaring France’s colonisation of the country a crime and demanded an apology and reparations. Lawmakers, standing in the chamber wearing scarves in the colours of the national flag, chanted “long live Algeria” on Wednesday as they applauded the passage of the bill, which states that France holds “legal responsibility for its colonial past in Algeria and the tragedies it caused”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/24/algeria-passes-law-declaring-french-colonisation-crime",
      "published": "Wed, 24 Dec 2025 15:02:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Bolsonaro supporters ‘cancel’ Havaianas flip-flop brand over television ad",
      "description": "Son of jailed former Brazilian president says spokesperson for ‘national symbol’ sandals is ‘openly left wing’ Leaderless since its figurehead was jailed for attempting a coup , Brazil’s far right has found a new nemesis: the flip-flop brand Havaianas, which has been “cancelled” by Jair Bolsonaro ’s supporters over a television advert. The controversy stems from the actor Fernanda Torres – the star of I’m Still Here , the Brazilian film that won an Oscar for best international feature – saying in the ad that she hoped audiences would not start 2026 “on the right foot”, but “with both feet”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/brazil-jair-bolsonaro-eduardo-havaianas-television-ad-fernanda-torres",
      "published": "Tue, 23 Dec 2025 14:02:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Nuclear submarine arms race heats up between North and South Korea",
      "description": "North Korea's state media released photos Thursday of what it said was the hull of a nuclear submarine. Its leader denounced South Korea's plans to build its own subs as \"an offensive act.\"",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5658145/nuclear-submarine-north-and-south-korea",
      "published": "Fri, 26 Dec 2025 03:32:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Ukraine and US agree new peace plan after Moscow hit by another deadly bombing",
      "description": "The latest US-Ukraine peace plan suggests eastern areas seized by Russia could become free economic zones.",
      "url": "https://news.sky.com/story/ukraine-and-us-agree-updated-20-point-peace-plan-after-moscow-hit-by-another-deadly-bombing-13487290",
      "published": "Wed, 24 Dec 2025 17:47:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "North Korea touts progress on nuclear-powered submarine",
      "description": "North Korea is showcasing what appears to be progress on a nuclear-powered submarine, with state media images revealing a largely completed hull.",
      "url": "https://news.sky.com/story/north-korea-touts-progress-on-nuclear-powered-submarine-13487313",
      "published": "Thu, 25 Dec 2025 09:30:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "North Korea displays apparent progress in construction of nuclear-powered submarine",
      "description": "North Korea displayed apparent progress in the construction of a nuclear-powered submarine, with state media photos showing a largely completed hull as leader Kim Jong Un condemned rival South Korea’s push to acquire the technology",
      "url": "https://abcnews.go.com/International/wireStory/north-korea-displays-apparent-progress-construction-nuclear-powered-128689172",
      "published": "Thu, 25 Dec 2025 00:33:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘No negotiation, no truce’ with RSF, says senior Sudan official",
      "description": "Comments come days after PM Kamil Idris presented a plan to end the country’s nearly three-year war.",
      "url": "https://www.aljazeera.com/news/2025/12/25/no-negotiation-no-truce-with-rsf-says-senior-sudan-official?traffic_source=rss",
      "published": "Thu, 25 Dec 2025 20:35:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "‘Not for the people’: Myanmar junta prepares for elections designed to legitimise grip on power",
      "description": "Elections will be first since military seized power in 2021, but analysts say vote is far from a step toward democracy Myanmar is preparing to go to the polls for the first time since its military seized power in a coup in 2021, but with its former leader behind bars, its most successful political party disbanded and roughly a third of the country either disputed or in rebel hands, few believe claims by its military rulers that its 28 December election will be “free and fair”. “This is not for the people, this is for themselves,” says Pai, 25, who fled Myanmar after the military seized power. “They [the ruling junta] are looking for a way out of the trap they are [in].” Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/myanmar-junta-prepares-elections-legitimise-power",
      "published": "Fri, 26 Dec 2025 00:01:53 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Zelenskyy says he plans to meet Trump",
      "description": "The Ukrainian leader says he could meet the US president in days as part of efforts to end Russia’s war in his country. Follow DW for more.",
      "url": "https://www.dw.com/en/ukraine-updates-zelenskyy-says-he-plans-to-meet-trump/live-75308039?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 08:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Jews in Morocco: A small community, often overlooked",
      "description": "Judaism in Morocco has a long history. Most Jews left the country for Israel after 1948. Today the small Jewish community and the Muslim population live side by side, despite the emotional fallout from the war in Gaza.",
      "url": "https://www.dw.com/en/jews-in-morocco-a-small-community-often-overlooked/a-75115308?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 11:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza aid restrictions, Syria humanitarian needs, lawyer reprisals in Burundi",
      "description": "The UN and partners continue to provide assistance to people in Gaza, where recent winter storms have worsened conditions for thousands across the enclave.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166663",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains 115 IS suspects 'planning New Year's attacks'",
      "description": "Turkish authorities say firearms were seized and efforts to trace further suspected members are continuing.",
      "url": "https://www.bbc.com/news/articles/cn98w93l8plo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 10:19:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump says US launched strike against ISIL in northwest Nigeria",
      "description": "US president says 'deadly strike' in Nigeria targeted ISIL fighters who killed 'primarily, innocent Christians'.",
      "url": "https://www.aljazeera.com/news/2025/12/25/trump-says-us-launched-strikes-against-isil-in-northwest-nigeria?traffic_source=rss",
      "published": "Thu, 25 Dec 2025 23:30:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand and Cambodia hold talks on resuming ceasefire",
      "description": "Military officials from Thailand and Cambodia began talks on Wednesday, both countries said, days after the neighbours agreed to discuss resumption of a ceasefire after 16 days of fierce border clashes that have killed at least 86 people. The talks come two days after ​a special meeting in Kuala Lumpur of Southeast Asian foreign ministers convened to try to salvage a truce first ‍brokered by ASEAN chair Malaysia and US President Donald Trump after a previous round of clashes in July.",
      "url": "https://www.france24.com/en/video/20251225-thailand-and-cambodia-hold-talks-on-resuming-ceasefire",
      "published": "Thu, 25 Dec 2025 10:33:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Somalis vote under tight security in first local elections in decades",
      "description": "Somalis queued in the capital Mogadishu on Thursday to vote in local elections by universal suffrage for the first time in nearly 60 years, a historic test for democracy in a country grappling with insecurity and political tensions.",
      "url": "https://www.france24.com/en/live-news/20251225-mogadishu-votes-in-first-local-elections-in-decades-under-tight-security",
      "published": "Thu, 25 Dec 2025 10:25:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Rescue mission helicopter crashes on Mount Kilimanjaro, killing all 5 on board",
      "description": "Five people have died after a helicopter crashed on Africa’s highest mountain, Mount Kilimanjaro, in Tanzania",
      "url": "https://abcnews.go.com/International/wireStory/helicopter-rescue-mission-crashes-tanzanias-mount-kilimanjaro-killing-128690702",
      "published": "Thu, 25 Dec 2025 06:17:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Somalis vote in the first one-person, one-vote local election in decades",
      "description": "Residents of Somalia’s capital are set to vote in a controversial local election that marks the country’s first-ever one-person, one-vote poll since 1969",
      "url": "https://abcnews.go.com/International/wireStory/somalis-vote-person-vote-local-election-decades-128690490",
      "published": "Thu, 25 Dec 2025 04:35:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Turkey begins black box analysis of jet crash that killed Libyan military chief",
      "description": "The Turkish Ministry of Defense says the technical analysis of black boxes from a jet crash that killed eight people, including Libya’s military chief, has begun",
      "url": "https://abcnews.go.com/International/wireStory/turkey-begins-black-box-analysis-jet-crash-killed-128691183",
      "published": "Thu, 25 Dec 2025 06:57:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Nebraska grandfather killed in 'freak accident' at McDonald’s drive-thru",
      "description": "A grandfather died days before Christmas in a \"freak accident\" at a Nebraska drive-thru after being pinned between his car and the payment window.",
      "url": "https://www.foxnews.com/us/nebraska-grandfather-killed-freak-accident-mcdonalds-drive-thru",
      "published": "Fri, 26 Dec 2025 02:07:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Texts after Anna Kepner’s mysterious cruise ship death show family scrambling to clamp down on info",
      "description": "Court records expose family's 'damage control' texts following teen's death aboard Carnival cruise ship. 16-year-old stepbrother under investigation.",
      "url": "https://www.foxnews.com/us/texts-after-anna-kepners-mysterious-cruise-ship-death-show-family-scrambling-clamp-down-info",
      "published": "Tue, 23 Dec 2025 19:14:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Christmas spirit returns to Jesus' birthplace after more than two years of war",
      "description": "Thousands celebrate Christmas in Bethlehem for the first time since the implementation of the U.S.-brokered Israel-Hamas ceasefire agreement.",
      "url": "https://www.foxnews.com/world/christmas-spirit-returns-jesus-birthplace-after-more-than-two-years-war",
      "published": "Wed, 24 Dec 2025 10:51:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Indonesians raise white flags as anger grows over slow flood aid",
      "description": "Weeks after floods ravaged the island of Sumatra, many still do not have access to clean water and food.",
      "url": "https://www.bbc.com/news/articles/ckgzwqjpzp4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 23:09:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "‘A comedy show’: Myanmar youth in exile slam military-run ‘sham’ election",
      "description": "Myanmar tattooist Ng La cares little for the national election organised by his country's despised military leaders.",
      "url": "https://www.aljazeera.com/features/2025/12/26/a-comedy-show-myanmar-youth-in-exile-slam-military-run-sham-election?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 02:38:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "60 Minutes episode on brutal El Salvador prison, pulled from air by CBS, appears online",
      "description": "Segment that Bari Weiss had removed provides in-depth look at the Centro de Confinamiento del Terrorismo prison A 60 Minutes episode investigating a brutal prison in El Salvador , which CBS News’s editor-in-chief, Bari Weiss, pulled from the air on Sunday, appeared online on Monday after appearing on a Canadian TV app. The segment, which runs for nearly 14 minutes and was viewed by the Guardian, provides an in-depth look at the Centro de Confinamiento del Terrorismo (Cecot) prison in El Salvador. It opens with footage of the mega-prison and shows detainees being shackled upon arrival in El Salvador. Continue reading...",
      "url": "https://www.theguardian.com/media/2025/dec/23/60-minutes-cecot-appears-online",
      "published": "Tue, 23 Dec 2025 20:53:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "M 6.0 - 2025 Taitung, Taiwan Earthquake",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VI Time 2025-12-24 09:47:06 UTC 2025-12-24 09:47:06 UTC at epicenter Location 22.851°N 121.207°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rkjm",
      "published": "2025-12-26T06:25:49.672Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Brazilian ex-President Jair Bolsonaro undergoes double hernia surgery",
      "description": "Former Brazilian President Jair Bolsonaro's family says he's undergoing double hernia surgery at a hospital in the country's capital",
      "url": "https://abcnews.go.com/International/wireStory/brazilian-president-jair-bolsonaro-undergoes-double-hernia-surgery-128693872",
      "published": "Thu, 25 Dec 2025 09:33:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains dozens of IS suspects planning attacks on Christmas and New Year celebrations",
      "description": "Istanbul police have launched simultaneous raids at 124 locations, detaining over a hundred suspected members of the Islamic State group",
      "url": "https://abcnews.go.com/International/wireStory/turkey-detains-dozens-suspects-planning-attacks-christmas-new-128693497",
      "published": "Thu, 25 Dec 2025 09:31:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Winter aid delivery continues in Gaza",
      "description": "Despite the ceasefire in the Gaza Strip, humanitarians continue to receive reports of airstrikes, shelling and gunfire in all five governorates, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166653",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "North Korea releases images of development of nuclear-powered submarine",
      "description": "New photos show North Korea's apparent progress in the development of a nuclear-powered submarine as Kim Jong Un condemns South Korea's efforts.",
      "url": "https://www.foxnews.com/world/north-korea-releases-images-development-nuclear-powered-submarine",
      "published": "Thu, 25 Dec 2025 07:46:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "President Trump announces strike on ISIS targets in Nigeria",
      "description": "President Trump made the announcement late Thursday on social media, saying the strike was in response to the Islamic State targeting Christians in Nigeria.",
      "url": "https://www.npr.org/2025/12/25/g-s1-103704/nigeria-isis-islamic-state",
      "published": "Thu, 25 Dec 2025 21:39:28 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Somalians vote in first local elections in decades under tight security",
      "description": "Somalians turned out in droves on Thursday to vote in local elections in the capital Mogadishu – the first by universal suffrage in nearly 60 years – with the city locked down amid security concerns.",
      "url": "https://www.france24.com/en/video/20251225-somalians-vote-in-first-local-elections-in-decades-under-tight-security",
      "published": "Thu, 25 Dec 2025 13:46:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Fox News ‘Antisemitism Exposed’ Newsletter: UN bigot out at Georgetown",
      "description": "Fox News' \"Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.",
      "url": "https://www.foxnews.com/us/fox-news-antisemitism-exposed-newsletter-un-bigot-out-georgetown",
      "published": "Thu, 25 Dec 2025 18:39:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Jet crash carrying Libya’s top general triggers airspace shutdown over NATO capital",
      "description": "Turkey shuts down Ankara airspace after business jet carrying Libya's top military commander crashes. Ali Ahmed Al-Haddad is feared dead.",
      "url": "https://www.foxnews.com/world/jet-crash-carrying-libyas-top-general-triggers-airspace-shutdown-over-nato-capital",
      "published": "Tue, 23 Dec 2025 16:31:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Waterskiing Santas and giant cuts of meat: Christmas around the world",
      "description": "From London to Bethlehem, services and festivities to mark the holiday cheer are in full swing.",
      "url": "https://www.bbc.com/news/articles/ce8nep787pyo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 15:01:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "French farmers mark Christmas on motorway as protests over cattle cull continue",
      "description": "French farmers marked Christmas on the A64 motorway on Wednesday evening as they continued protests against the government’s cattle-culling policy aimed at containing the spread of lumpy skin disease. President Emmanuel Macron met with farmers’ union leaders on Tuesday in their first talks since the protest movement began, amid broader tensions over a controversial free trade deal and the government’s handling of the outbreak, also known as nodular dermatitis, to discuss a controversial free trade deal and the government's handling of a cow disease",
      "url": "https://www.france24.com/en/video/20251225-french-farmers-mark-christmas-on-motorway-as-protests-over-cattle-cull-continue",
      "published": "Thu, 25 Dec 2025 11:38:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "North American air defense tracks Santa's sleigh around the world for a 70th year",
      "description": "The joint US-Canadian North American Aerospace Defense Command headquartered in Colorado tracked Santa's Yuletide sleigh ride overnight for a 70th year.",
      "url": "https://www.france24.com/en/americas/20251225-norad-tracks-santa-sleigh-ride-around-the-world-for-70th-year",
      "published": "Thu, 25 Dec 2025 09:51:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Blast at mosque in Nigeria kills 5 and injures more than 30 in apparent suicide attack",
      "description": "A bomb has exploded during prayers at a mosque in Nigeria's northeastern city of Maiduguri, killing five people",
      "url": "https://abcnews.go.com/International/wireStory/blast-mosque-nigeria-kills-5-injures-30-apparent-128689527",
      "published": "Thu, 25 Dec 2025 06:57:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Afghanistan's historic Ariana Cinema torn down to make way for shopping center",
      "description": "Through the decades, downtown Kabul’s Ariana Cinema had weathered revolution and war, emerging battered and bruised but still standing to entertain Afghans with Bollywood movies and American action flicks",
      "url": "https://abcnews.go.com/International/wireStory/afghanistans-historic-ariana-cinema-torn-make-shopping-center-128698897",
      "published": "Fri, 26 Dec 2025 02:07:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "First Person: Felipe Paullier, the youngest ever senior UN official, charged with giving a voice to young people around the world",
      "description": "A paediatrician by training, Felipe Paullier has long been an advocate for youth. Formerly Director of the Uruguayan Government's Youth Institute, a role which involved several joint actions with various UN agencies, he was appointed to run the UN Youth Office in 2023, the youngest senior appointment in United Nations history.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166651",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Paper and wood: Forest products show signs of recovery, UN agency says",
      "description": "From wood-based panels used in construction, to charcoal for cooking food, forest products are valued and traded all around the world.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166666",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Greta Thunberg arrested supporting Palestinian prisoners on hunger strike during London protest",
      "description": "Greta Thunberg was arrested and later released on bail after supporting pro-Palestinian activists protesting detentions and a hunger strike in London.",
      "url": "https://www.foxnews.com/world/greta-thunberg-arrested-supporting-palestinian-prisoners-hunger-strike-london-protest",
      "published": "Tue, 23 Dec 2025 15:35:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US launches deadly strikes against Islamic State in Nigeria, says Trump",
      "description": "The US president accuses the group of killing Christians, as Nigeria’s foreign minister tells the BBC the strikes were a \"joint operation\" and \"nothing to do\" with religion.",
      "url": "https://www.bbc.com/news/articles/cj69j8l918do?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 06:04:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
      "description": "The pope also laments the condition of Palestinians during his address to worshippers at the Vatican.",
      "url": "https://www.bbc.com/news/articles/cm21728nwxlo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 16:21:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Will the Russia-Ukraine war end in 2026?",
      "description": "A Ukrainian serviceman, ex-military chief and analysts predict what lies ahead.",
      "url": "https://www.aljazeera.com/news/2025/12/26/will-the-russia-ukraine-war-end-in-2026?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 08:40:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel killed our dreams, but its genocide could not defeat us",
      "description": "I dreamed of becoming a teaching assistant; now I am charging phones for a living. But I refuse to give up.",
      "url": "https://www.aljazeera.com/opinions/2025/12/26/israel-killed-our-dreams-but-its-genocide-could-not-defeat-us?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 08:33:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Bangladesh election: Why BNP leader Tarique Rahman’s return matters",
      "description": "Rahman's return will bolster the BNP, and could stabilise Bangladesh politics amid chaos and violence, say experts.",
      "url": "https://www.aljazeera.com/news/2025/12/26/why-bnp-leader-tarique-rahmans-return-to-bangladesh-matters-ahead-of-vote?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 08:21:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Palestinian economy faces critical downturn amid escalating fiscal crisis",
      "description": "Public debt reaches $14.6bn, exceeding GDP, while unemployment in Gaza hits a staggering 77 percent by late 2025.",
      "url": "https://www.aljazeera.com/economy/2025/12/26/palestinian-economy-faces-critical-downturn-amid-escalating-fiscal-crisis?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 07:34:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Cambodia blames Thailand for ‘ruthless’ bombardment amid border talks",
      "description": "US offers to mediate more talks to end the latest flare-up of violence, which has upended an October peace accord.",
      "url": "https://www.aljazeera.com/news/2025/12/26/cambodia-blames-thailand-for-ruthless-bombardment-amid-border-talks?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 07:33:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea’s Kim Jong Un pushes more missile production as ‘war deterrent’",
      "description": "North Korean leader calls for increased production of missiles, shells and more factories to produce them.",
      "url": "https://www.aljazeera.com/news/2025/12/26/north-koreas-kim-jong-un-pushes-more-missile-production-as-war-deterrent?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 06:28:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Polish jets intercept Russian reconnaissance plane spotted near airspace",
      "description": "Poland's defence minister said Russian aircraft was 'escorted' from area and did not pose immediate security threat.",
      "url": "https://www.aljazeera.com/news/2025/12/26/polish-jets-intercept-russian-reconnaissance-plane-spotted-near-airspace?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 03:41:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,401",
      "description": "These are the key developments from day 1,401 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2025/12/26/russia-ukraine-war-list-of-key-events-day-1401?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 02:47:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Paddle boarders rescued after being swept more than 10km across Port Phillip Bay in three-hour ordeal",
      "description": "Pair say they were ‘exhausted, very shaken and feel so lucky’ after being spotted by air wing officers late on Christmas Day Get our breaking news email , free app or daily news podcast Two paddle boarders who were rescued after being swept more than 10km across Victoria’s Port Phillip Bay on Christmas Day say they are exhausted and shaken but grateful to have survived. Victoria police said the pair set out from Portarlington on the Bellarine peninsula about 3pm on Thursday but drifted out into the bay when conditions deteriorated and were swept all the way to Wyndham harbour in Melbourne’s outer west. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/paddle-boarders-rescued-port-phillip-bay-melbourne",
      "published": "Fri, 26 Dec 2025 06:56:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "In Belgium, a group of volunteers makes drones for Ukraine in special workshops",
      "description": "A group of hobbyists in Belgium make drones that help on the frontline of a war.",
      "url": "https://www.npr.org/2025/12/25/nx-s1-5649486/a-group-of-belgians-make-drones-in-a-secret-volunteer-workshop-to-send-to-ukraine",
      "published": "Thu, 25 Dec 2025 04:58:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Live: Zelensky says he plans to meet Trump in 'near future'",
      "description": "Volodymyr Zelensky announced on Friday that he would be meeting with US President Donald ​Trump in the \"near future\", the day after his meeting with White House negotiators, with whom he discussed ways to end the war in Ukraine. Follow our liveblog for the latest updates.",
      "url": "https://www.france24.com/en/europe/20251226-live-kyiv-awaits-moscow-s-response-to-the-latest-us-led-plan",
      "published": "Fri, 26 Dec 2025 06:18:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky holds talks with US envoys as Russia sees 'slow but steady' peace progress",
      "description": "Ukraine’s President Volodymyr Zelensky said Thursday he held \"very good\" talks with US President Donald Trump’s envoys on ending the war, as Russia also assured negotiations with Washington were making progress.",
      "url": "https://www.france24.com/en/europe/20251225-zelensky-holds-talks-us-envoys-russia-sees-slow-steady-peace-progress",
      "published": "Thu, 25 Dec 2025 21:06:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo addresses Gaza crisis in Christmas ⁠sermon",
      "description": "Pope Leo decried conditions for Palestinians in Gaza in his Christmas ⁠sermon on Thursday, in an unusually direct appeal during what is normally a solemn, spiritual service on the day Christians across the globe celebrate the birth of Jesus. FRANCE 24 speaks to Missimo d’Angelo, research associate at Loughborough University London.",
      "url": "https://www.france24.com/en/video/20251225-pope-leo-addresses-gaza-crisis-in-christmas-sermon",
      "published": "Thu, 25 Dec 2025 13:30:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pope and new Archbishop of Canterbury make pleas over Gaza and immigration in Christmas sermons",
      "description": "The incoming Archbishop of Canterbury has warned in her Christmas Day sermon that \"conversations about immigration continue to divide us, when our common humanity should unite us\".",
      "url": "https://news.sky.com/story/pope-and-new-archbishop-of-canterbury-make-pleas-over-gaza-and-immigration-in-christmas-sermons-13487332",
      "published": "Thu, 25 Dec 2025 12:30:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US carries out airstrikes on Islamic State 'scum' in Nigeria who targeted Christians, Trump says",
      "description": "The US has launched airstrikes against Islamic State militant \"scum\" in Nigeria, Donald Trump has said.",
      "url": "https://news.sky.com/story/us-launches-airstrikes-on-islamic-state-targets-in-nigeria-13487369",
      "published": "Thu, 25 Dec 2025 23:32:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo XIV delivers his first Christmas Day message",
      "description": "Pope Leo XIV, during his first Christmas Day message, has urged the faithful to shed indifference toward those who are suffering",
      "url": "https://abcnews.go.com/International/wireStory/pope-leo-xiv-urges-faithful-christmas-shed-indifference-128691376",
      "published": "Thu, 25 Dec 2025 15:25:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about the militants targeted by US airstrikes in northwest Nigeria",
      "description": "The United States airstrikes targeting militants affiliated with the Islamic State in northwestern Nigeria are a major escalation of an offensive that Nigeria’s overstretched military has struggled with for years",
      "url": "https://abcnews.go.com/International/wireStory/militants-targeted-us-airstrikes-northwest-nigeria-128699169",
      "published": "Fri, 26 Dec 2025 02:13:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Florida man kills wife, shoots stepdaughter over NFL game argument before taking own life",
      "description": "A Florida man allegedly killed his wife and shot his stepdaughter over an NFL game argument before taking own life, authorities said. The girl is recovering in a hospital.",
      "url": "https://www.foxnews.com/us/florida-man-kills-wife-shoots-stepdaughter-over-nfl-game-argument-before-taking-own-life",
      "published": "Thu, 25 Dec 2025 16:53:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A new take on Christmas cooking in Senegal",
      "description": "In Senegal, a country with a large Muslim majority, Christmas Eve is not tied to any specific culinary tradition. That freedom is inspiring some chefs to reinvent festive cuisine. One of them is Franco-Senegalese chef Aïda Gaye, who puts local flavours centre stage in a fusion-style approach.",
      "url": "https://www.france24.com/en/video/20251225-a-new-take-on-christmas-cooking-in-senegal",
      "published": "Thu, 25 Dec 2025 16:41:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Man reveals what it's like celebrating Christmas in country where it's banned",
      "description": "When Il-yong Ju was a child, something strange would happen in his tiny village in rural North Korea every 25 December.",
      "url": "https://news.sky.com/story/north-korea-defector-tells-of-escape-and-how-he-celebrated-christmas-in-country-where-its-banned-13484143",
      "published": "Tue, 16 Dec 2025 10:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine, US near 20-point peace deal as Putin spurns Zelenskyy Christmas ceasefire offer",
      "description": "Ukraine and U.S. near finalizing 20-point security framework as Zelenskyy reports 90% agreement on guarantees while Russia pushback signals changes needed.",
      "url": "https://www.foxnews.com/world/ukraine-us-near-20-point-peace-deal-putin-spurns-zelenskyy-christmas-ceasefire-offer",
      "published": "Wed, 24 Dec 2025 10:05:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "UK social media campaigners among five denied US visas",
      "description": "The Trump administration bans five people who have called for tech regulation from entering the country.",
      "url": "https://www.bbc.com/news/articles/cp39kngz008o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 15:09:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Should a top Russian archaeologist face trial for digging in occupied Crimea?",
      "description": "The case of a scholar wanted in Ukraine sparked a debate on the relationship between museums and the Russian state.",
      "url": "https://www.bbc.com/news/articles/c623rvzjjd2o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 01:44:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump-backed candidate Asfura declared new president of Honduras",
      "description": "Winning margin of 28,000 votes announced a month late but before review of all ‘inconsistent’ ballots was completed Donald Trump-backed candidate Nasry “Tito” Asfura has been declared the winner of Honduras’s presidential election after a vote count that dragged on for almost a month and was marred by fraud allegations and criticism of interference by the US president . The rightwing Asfura, 67, a construction magnate and former mayor of the capital, Tegucigalpa, secured 40.27% of the vote, against 39.53% for the centre-right Salvador Nasralla, a margin of just 28,000 votes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/24/honduras-nasry-tito-asfura-declared-president-donald-trump-backed",
      "published": "Wed, 24 Dec 2025 23:42:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Bangladesh election frontrunner returns home after 17 years",
      "description": "Tarique Rahman, in pole position to become the next prime minister of Bangladesh, is back in the capital, Dhaka. Bangladesh goes to the polls on February 12.",
      "url": "https://www.dw.com/en/bangladesh-election-frontrunner-returns-home-after-17-years/a-75300454?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 11:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Son of former Bangladesh PM returns after 17 years in exile with a chance to lead",
      "description": "The son of a former Bangladesh prime minister has returned to the country after more than 17 years in exile",
      "url": "https://abcnews.go.com/International/wireStory/son-former-bangladesh-prime-minister-returns-after-17-128690701",
      "published": "Thu, 25 Dec 2025 06:57:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council hears of fading election prospects in Libya",
      "description": "The path to long-awaited elections in Libya is paved with complications but they can be overcome, the UN Special Representative for the country said on Friday in a briefing to the Security Council.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166646",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US air strikes in Nigeria “very much welcome” although late",
      "description": "US air strikes in Nigeria against ISIL are late but needed, says analyst Ebenezer Obadare",
      "url": "https://www.aljazeera.com/video/quotable/2025/12/26/us-air-strikes-in-nigeria-very-much-welcome-although-late?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 08:52:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "LIVE: Nigeria confirms US strikes on ISIL targets in its northwest",
      "description": "Nigeria says US claims that Christians face persecution ‌do not represent a complex security situation.",
      "url": "https://www.aljazeera.com/news/liveblog/2025/12/26/live-nigeria-confirms-joint-us-strikes-on-isil-targets-in-its-north-west?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 07:54:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela frees dozens detained during protests against Maduro",
      "description": "Families celebrate Christmas releases while calling for full freedom of detainees.",
      "url": "https://www.aljazeera.com/news/2025/12/25/venezuela-frees-dozens-detained-during-protests-against-maduro?traffic_source=rss",
      "published": "Thu, 25 Dec 2025 22:19:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Japan’s cabinet approves record defence budget amid escalating China tensions",
      "description": "Japanese strike-back capabilities and coastal defences to be boosted while Beijing accuses Tokyo of fuelling a ‘space arms race’ Japan’s cabinet has approved a record high defence budget as tensions with China continue to spiral, with Beijing this week accusing Tokyo of “fuelling a space arms race”. The draft defence budget for the next fiscal year – approved on Friday – is more than ¥9tn ($58bn) and 9.4% bigger than the previous budget, which will end in April. The increase comes in the fourth year of Japan’s five-year program to double its annual arms spending to 2% of GDP. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/japan-defence-budget-china",
      "published": "Fri, 26 Dec 2025 06:16:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "After two years, Bethlehem brings back it Christmas celebrations",
      "description": "With a ceasefire in place in Gaza, Bethlehem in the West Bank is resuming its festive Christmas celebrations.",
      "url": "https://www.npr.org/2025/12/25/nx-s1-5648600/after-two-years-bethlehem-brings-back-it-christmas-celebrations",
      "published": "Thu, 25 Dec 2025 04:58:46 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Tanzania: Five dead in helicopter crash on Mt. Kilimanjaro",
      "description": "The helicopter crashed on one of the most popular tourist climbing routes on Mount Kilimanjaro.",
      "url": "https://www.dw.com/en/tanzania-five-dead-in-helicopter-crash-on-mt-kilimanjaro/a-75300312?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 08:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "South Korean prosecutors seek ten years in prison for ousted president Yoon",
      "description": "South Korean prosecutors on Friday sought a ten-year prison sentence for former President Yoon Suk Yeol, accusing him of obstruction of justice after his attempt to impose martial law last winter. The suspension of civil rule led to massive protests and weeks of political chaos in South Korea.",
      "url": "https://www.france24.com/en/asia-pacific/20251226-south-korea-prosecutors-request-10-year-term-for-ex-president-yoon-suk-yeol",
      "published": "Fri, 26 Dec 2025 08:46:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Five dead in a helicopter crash on Africa's highest mountain",
      "description": "Five people have died after a helicopter crashed on Mount Kilimanjaro, Africa’s highest peak, in northern Tanzania.",
      "url": "https://news.sky.com/story/five-dead-in-a-helicopter-crash-on-mount-kilimanjaro160-africas-highest-mountain-13487336",
      "published": "Thu, 25 Dec 2025 11:50:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli hostages freed, Iran hit, ceasefire held — 2025 shattered idea that US was exiting the Middle East",
      "description": "Analysis reveals how American force, not retreat, reshaped the Middle East in 2025, from Gaza ceasefire to Iran's weakened position across the region.",
      "url": "https://www.foxnews.com/world/israeli-hostages-freed-iran-hit-ceasefire-held-2025-shattered-idea-us-exiting-middle-east",
      "published": "Tue, 23 Dec 2025 12:00:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Japan gov’t greenlights record $58bn defence budget amid regional tension",
      "description": "Japan’s cabinet has backed a record defence spending plan amid mounting tensions with China.",
      "url": "https://www.aljazeera.com/news/2025/12/26/japan-govt-greenlights-record-58bn-defence-budget-amid-regional-tension?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 07:41:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Former Malaysian PM Najib Razak found guilty of abuse of power in latest 1MDB trial",
      "description": "Najib has been in prison since August 2022, when Malaysia’s top court upheld a corruption conviction. He denies wrongdoing Jailed former Malaysian prime minister Najib Razak has been found guilty of abuse of power, in the biggest trial yet in the multibillion-dollar fraud scandal related to state fund 1MDB. Najib had been charged with four counts of corruption and 21 counts of money laundering for receiving illegal transfers of about 2.2bn ringgit ($544.15m) from 1MDB. He has consistently denied wrongdoing. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/former-malaysian-pm-najib-razak-found-guilty-of-abuse-of-power-in-latest-1mdb-trial",
      "published": "Fri, 26 Dec 2025 07:54:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Thailand and Cambodia begin talks to end deadly clashes after venue row",
      "description": "Negotiations expected to last four days as each side calls on the other to show sincerity in words and actions Cambodian and Thai officials began four days of talks at a border checkpoint on Wednesday intended to negotiate an end to the deadly clashes between the two countries, Phnom Penh said. The meeting in Thailand’s Chanthaburi province had been at risk after Phnom Penh demanded a switch to a neutral venue. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/24/thailand-and-cambodia-begin-talks-to-end-deadly-clashes-after-venue-row",
      "published": "Wed, 24 Dec 2025 12:53:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Jimmy Kimmel jokes about fascism in an 'alternative Christmas message' for Britain",
      "description": "In an \"alternative\" message to the king's annual Christmas speech, Kimmel told British viewers that \"from a fascism perspective, this has been a really great year,\" for the United States.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5658144/jimmy-kimmel-alternative-christmas-message-britain",
      "published": "Fri, 26 Dec 2025 02:21:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US 'Powerball' lottery winner scoops $1.8 billion jackpot",
      "description": "One very lucky lottery player from the US state of Arkansas hit the ultimate jackpot on Christmas Eve. Christmas will never be the same again!",
      "url": "https://www.dw.com/en/us-powerball-lottery-winner-scoops-1-8-billion-jackpot/a-75306554?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 19:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Former Malaysian Prime Minister Najib Razak convicted in trial",
      "description": "Former Malaysian Prime Minister Najib Razak has been convicted in a corruption trial tied to a multibillion-dollar looting of the 1MDB state investment fund",
      "url": "https://abcnews.go.com/International/wireStory/former-malaysian-prime-minister-najib-razak-convicted-trial-128699465",
      "published": "Fri, 26 Dec 2025 03:12:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "DR Congo: Displaced people in South Kivu close to ‘utter desperation’, WFP says",
      "description": "An estimated 500,000 people have been forced from their homes since fighting erupted in South Kivu province, Democratic Republic of Congo (DRC), at the beginning of December.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166657",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Russian forces near collapse in Kupyansk as Moscow allies concede city lost: report",
      "description": "Russian forces were reportedly cut off and surrendering in Ukraine's Kupyansk as supply lines fail. Only dozens of isolated troops remain in the strategic city.",
      "url": "https://www.foxnews.com/world/russian-forces-near-collapse-kupyansk-moscow-allies-concede-city-lost-report",
      "published": "Thu, 25 Dec 2025 21:04:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "India's solar boom faces a hidden waste problem",
      "description": "A recent study has found that India will generate over 11 million tonnes of solar waste by 2047 if it does not scale up recycling.",
      "url": "https://www.bbc.com/news/articles/cd6x75x4j02o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 23:11:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Russia made a 'proposal' regarding jailed French researcher Laurent Vinatier",
      "description": "Moscow has made a \"proposal\" to France concerning the case of researcher Laurent Vinatier, who has been imprisoned in Russia since June 2024, the Kremlin said Thursday. Vinatier was sentenced by a Russian court to three years in prison for allegedly failing to register as a \"foreign agent\" but faces fresh allegations of spying.",
      "url": "https://www.france24.com/en/france/20251225-russia-made-proposal-paris-over-french-researcher-imprisoned-russia-charged-with-espionage",
      "published": "Thu, 25 Dec 2025 11:41:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "FBI violent crime arrests double in Trump's first year in 17 key cities compared to Biden record",
      "description": "FBI reports violent crime arrests roughly doubled under Trump administration, jumping from 6,000-7,000 annually to nearly 14,000 in first year.",
      "url": "https://www.foxnews.com/us/fbi-violent-crime-arrests-double-trumps-first-year-compared-biden-record-massive-strides",
      "published": "Tue, 23 Dec 2025 21:50:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Christmas returns to Holy Land cities as Bethlehem’s Christian population dwindles, Nazareth remains strong",
      "description": "Christmas returns to Bethlehem amid ongoing concerns over Christian population decline from 86% in 1950 to just 10% today, while Nazareth enjoys growth.",
      "url": "https://www.foxnews.com/world/christmas-returns-holy-land-cities-bethlehems-christian-population-dwindles-nazareth-remains-strong",
      "published": "Thu, 25 Dec 2025 15:24:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Cities across Europe revise Christmas traditions, triggering public backlash",
      "description": "Brussels faces backlash over modern nativity scene as European cities rethink Christmas traditions amid cultural debates. U.K. museum suggests Santa is \"too white.\"",
      "url": "https://www.foxnews.com/world/cities-across-europe-revise-christmas-traditions-triggering-public-backlash",
      "published": "Tue, 23 Dec 2025 10:35:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Town body seeks €500m to curb loneliness",
      "description": "Germany needs a fund to tackle loneliness, which is now hitting under-30s as well as older people, a body representing 10,000 towns and municipalities said. DW has the latest.",
      "url": "https://www.dw.com/en/germany-news-town-body-seeks-€500m-to-curb-loneliness/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 16:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Somalia: Mogadishu vote marks return of universal suffrage",
      "description": "For the first time in decades, Somalia is abandoning its clan-based political system and allowing residents of Mogadishu to choose local representatives directly under the \"one-person, one-vote\" principle.",
      "url": "https://www.dw.com/en/somalia-mogadishu-vote-marks-return-of-universal-suffrage/a-75300474?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 09:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "California farming tycoon arrested in wife's killing",
      "description": "California farming tycoon Michael Abatti is accused of murdering his wife in an Arizona mountain town as the two were in the midst of a divorce.",
      "url": "https://www.foxnews.com/us/california-farming-tycoon-arrested-wifes-killing",
      "published": "Wed, 24 Dec 2025 14:29:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Zelensky hails 'new ideas' on peace after talks with US envoys",
      "description": "Ukraine's leader gives an upbeat assessment after discussing the plan with Steve Witkoff and Jared Kushner.",
      "url": "https://www.bbc.com/news/articles/c4g413yz9g5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 22:20:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil ex-President Jair Bolsonaro's surgery for hernia 'successful'",
      "description": "The former leader is serving a 27-year sentence for plotting a coup after losing the 2022 presidential election.",
      "url": "https://www.bbc.com/news/articles/c898zxyznxpo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 18:24:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US judge blocks detention of British social media campaigner",
      "description": "Imran Ahmed was among five people accused of seeking to \"coerce\" US firms into censoring free speech.",
      "url": "https://www.bbc.com/news/articles/c33mx6j5jrvo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 06:45:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Front-runner to be Bangladesh PM returns after 17 years in exile",
      "description": "Tarique Rahman, who has lived in London since 2008, arrives weeks before pivotal elections are held.",
      "url": "https://www.bbc.com/news/articles/crk733k1k1eo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 06:44:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Algerian law declares France's colonisation a crime",
      "description": "Lawmakers unanimously approve a law, which demands an apology and reparations from the former colonial power.",
      "url": "https://www.bbc.com/news/articles/c14vdpyj1vjo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 17:37:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sean 'Diddy' Combs files appeal asking for immediate prison release",
      "description": "Combs argues his sentence was improperly decided and asked that his conviction also be thrown out.",
      "url": "https://www.bbc.com/news/articles/c5yqe4j15lzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 23:30:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Officials discover a million more documents potentially related to Epstein case",
      "description": "The US Department of Justice says reviewing the material could delay the full release of Epstein documents by a \"few more weeks\".",
      "url": "https://www.bbc.com/news/articles/czdgz84dn35o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 22:55:25 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump-backed candidate wins in knife-edge Honduran election",
      "description": "His rival Salvador Nasralla says he will not accept the result, but urges his supporters to remain calm.",
      "url": "https://www.bbc.com/news/articles/cyvgz1jn368o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 25 Dec 2025 03:32:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump trips, a fake video and 10 possible co-conspirators: Takeaways from new Epstein files",
      "description": "The largest release of Epstein-related documents yet from the justice department included some notable messages and several mentions of Trump.",
      "url": "https://www.bbc.com/news/articles/c5yj4yvx80do?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:08:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rivalries and rumours: How the new order of the Murdoch dynasty is playing out",
      "description": "Family feuds and strategic change are redefining who holds power inside the Murdoch empire.",
      "url": "https://www.bbc.com/news/articles/clyd12d38jgo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 24 Dec 2025 01:25:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australia lead England after 20 wickets fall at Boxing Day Ashes Test",
      "description": "Australia slightly ahead of England after frenetic opening day in which both teams were bowled out cheaply at the MCG.",
      "url": "https://www.aljazeera.com/sports/2025/12/26/australia-lead-england-after-20-wickets-fall-at-boxing-day-ashes-test?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 08:18:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Court finds Malaysia’s former PM Najib Razak guilty of abuse of power",
      "description": "Malaysian high court finds former PM Najib guilty in trial related to the 1MDB sovereign wealth fund scandal.",
      "url": "https://www.aljazeera.com/news/2025/12/26/court-finds-malaysias-former-pm-najib-razak-guilty-of-abuse-of-power?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 07:48:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israeli settler runs over Palestinian man praying near Ramallah",
      "description": "An Israeli settler ran over a Palestinian man while he was praying by the roadside near Ramallah.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/26/israeli-settler-runs-over-palestinian-man-praying-near-ramallah?traffic_source=rss",
      "published": "Fri, 26 Dec 2025 07:43:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What are the consequences of Israel’s expanding illegal settlements?",
      "description": "Israel is escalating the confiscation of Palestinian land in the occupied West Bank.",
      "url": "https://www.aljazeera.com/video/inside-story/2025/12/25/what-are-the-consequences-of-israels-expanding-illegal-settlements?traffic_source=rss",
      "published": "Thu, 25 Dec 2025 20:30:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Man charged after allegedly performing Nazi salutes at Canberra shopping centres",
      "description": "Police allege the man also trespassed at ANU and ‘stuck propaganda-style stickers’ on buildings and other property Get our breaking news email , free app or daily news podcast An 18-year-old has been charged with allegedly performing two separate Nazi salutes at Canberra shopping centres and putting up “propaganda-style stickers” in recent months. The man is expected to appear before ACT magistrates court on Friday, where police will allege in October a member of the public confronted him as he stuck stickers up at a shopping centre and then performed a Nazi salute before leaving the centre. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/26/man-charged-after-allegedly-performing-nazi-salutes-at-canberra-shopping-centres-ntwnfb",
      "published": "Thu, 25 Dec 2025 22:32:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 42 km NNE of Goroka, Papua New Guinea",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-22 10:31:28 UTC 2025-12-22 10:31:28 UTC at epicenter Location 5.720°S 145.496°E Depth 110.18 km (68.46 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000rwgh",
      "published": "2025-12-23T10:56:00.234Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.9 - 5 km SE of San Ramon, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - V Time 2025-12-21 02:31:54 UTC 2025-12-21 02:31:54 UTC at epicenter Location 37.747°N 121.946°W Depth 10.03 km (6.23 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283691",
      "published": "2025-12-24T23:59:13.379Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.0 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:56:09 UTC 2025-12-20 03:56:09 UTC at epicenter Location 37.744°N 121.953°W Depth 9.63 km (5.98 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283031",
      "published": "2025-12-24T19:42:49.197Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:49:28 UTC 2025-12-20 03:49:28 UTC at epicenter Location 37.743°N 121.954°W Depth 9.56 km (5.94 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283016",
      "published": "2025-12-22T17:36:16.470Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Turkey is in the crosshairs over Russian's ghost fleet",
      "description": "Russia's ghost fleet of sanctions-busting oil tankers are using the Turkish-controlled Bosphorus to reach the Black Sea, causing headaches for Turkey.",
      "url": "https://www.npr.org/2025/12/25/nx-s1-5645803/turkey-is-in-the-crosshairs-over-russians-ghost-fleet",
      "published": "Thu, 25 Dec 2025 17:18:25 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The pope urges the faithful on Christmas to shed indifference in the face of suffering",
      "description": "During his first Christmas Day message, Pope Leo XIV highlighted the suffering in Gaza, Yemen and among migrants, and called for peace in troubled regions like Lebanon, Ukraine and Syria.",
      "url": "https://www.npr.org/2025/12/25/g-s1-103696/pope-leo-xiv-christmas-address-indifference-suffering-gaza-yemen-migrants",
      "published": "Thu, 25 Dec 2025 12:07:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump-backed conservative candidate wins Honduras' presidential election",
      "description": "A conservative candidate backed by President Trump won Honduras' contested presidential election.",
      "url": "https://www.npr.org/2025/12/25/nx-s1-5656238/trump-backed-conservative-candidate-wins-honduras-presidential-election",
      "published": "Thu, 25 Dec 2025 04:57:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump-backed candidate Nasry Asfura declared winner of Honduras' presidential vote",
      "description": "Asfura won Honduras' presidential election, electoral authorities said Wednesday afternoon, ending a weeks-long count that has whittled away at the credibility of the nation's electoral system.",
      "url": "https://www.npr.org/2025/12/25/g-s1-103680/nasry-asfura-winner-honduras-presidential-vote",
      "published": "Thu, 25 Dec 2025 01:30:46 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy says he's open to pull back troops if Russia does too",
      "description": "Ukraine's president says he open to pulling troops back from parts of the east if Russia also pulls back its forces.",
      "url": "https://www.npr.org/2025/12/24/nx-s1-5655853/zelenskyy-says-hes-open-to-pull-back-troops-if-russia-does-too",
      "published": "Wed, 24 Dec 2025 17:27:25 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysia: Ex-PM Najib found guilty on new 1MDB charges",
      "description": "Former prime minister Najib Razak had already been convicted for graft and money laundering linked to the 1MDB investment fund. The latest verdict, however, is likely to rock Malaysia's ruling coalition to the core.",
      "url": "https://www.dw.com/en/malaysia-ex-pm-najib-found-guilty-on-new-1mdb-charges/a-75307547?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 26 Dec 2025 07:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Polish jets intercept Russian spy plane",
      "description": "Poland said it scrambled jets on Christmas morning after detecting a Russian reconnaissance aircraft flying close to Polish airspace.",
      "url": "https://www.dw.com/en/polish-jets-intercept-russian-spy-plane/a-75307011?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 22:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's Bolsonaro backs son in presidential race",
      "description": "Jailed former Brazilian President Jair Bolsonaro used a hospital stay for surgery to formally endorse his son Flavio's 2026 presidential bid.",
      "url": "https://www.dw.com/en/brazil-s-bolsonaro-backs-son-in-presidential-race/a-75306541?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 20:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany's empty churches repurposed as congregations shrink",
      "description": "The number of practicing Christians in Germany is falling. The result is surplus churches. What happens to these empty houses of worship?",
      "url": "https://www.dw.com/en/germany-s-empty-churches-repurposed-as-congregations-shrink/a-75227388?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 17:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Can dogs really sense danger?",
      "description": "Research shows what canines really can sense — and how social media and human projection fuel belief in their supernatural abilities.",
      "url": "https://www.dw.com/en/can-dogs-really-sense-danger/a-75147970?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 12:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Testing times for India-Bangladesh ties amid deepening rifts",
      "description": "Disputes over minority safety and diplomatic security have triggered retaliatory visa freezes between India and Bangladesh, disrupting medical travel and signaling a sharp deterioration in relations.",
      "url": "https://www.dw.com/en/testing-times-for-india-bangladesh-ties-amid-deepening-rifts/a-75301893?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 12:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope Leo decries suffering in Gaza in Christmas message",
      "description": "The head of the Catholic Church, in his Christmas sermon, lamented the conditions for Palestinians in Gaza. Follow for more Christmas news.",
      "url": "https://www.dw.com/en/pope-leo-decries-suffering-in-gaza-in-christmas-message/live-75292667?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 25 Dec 2025 10:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Ivory Coast, Cameroon and Algeria deliver as heavyweights hold firm",
      "description": "Defending champions Ivory Coast made a winning start to their Africa Cup of Nations campaign on Wednesday, edging past Mozambique with a 1-0 victory. Set to face the Elephants on Sunday, Cameroon also got off to a strong start with a 1-0 victory over Gabon. Algeria, meanwhile, cruised to a convincing 3-0 win over Sudan, inspired by a standout performance from Riyad Mahrez.",
      "url": "https://www.france24.com/en/tv-shows/sports/20251225-afcon-2025-ivory-coast-cameroon-and-algeria-deliver-as-heavyweights-hold-firm",
      "published": "Thu, 25 Dec 2025 23:25:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil’s jailed ex-president Bolsonaro undergoes 'successful' hernia surgery",
      "description": "Former Brazilian president Jair Bolsonaro, who was serving a 27-year prison sentence for an attempted coup, underwent successful hernia surgery in Brasília after being temporarily released from jail. Doctors said he was expected to remain hospitalised for several days.",
      "url": "https://www.france24.com/en/live-news/20251225-brazil-s-jailed-ex-president-bolsonaro-undergoes-successful-surgery",
      "published": "Thu, 25 Dec 2025 16:43:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French Christmas traditions: festivities that continue well into the New Year",
      "description": "Christmas in France would not be complete without free-flowing champagne, oysters or a bûche de Noël. And the French holiday season is longer than most – stretching into the New Year with Epiphany (January 6) and its traditional galettes des rois (king cake) into February with Chandeleur (Candlemas).",
      "url": "https://www.france24.com/en/europe/20251225-french-christmas-traditions-festivities-continue-well-into-new-year",
      "published": "Thu, 25 Dec 2025 11:16:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine hits major Russian oil refinery with British missiles, officials say",
      "description": "Ukraine has hit a major Russian oil refinery with British missiles, Ukrainian military and security officials said on Thursday.",
      "url": "https://news.sky.com/story/ukraine-hits-major-russian-oil-refinery-with-british-missiles-officials-say-13487355",
      "published": "Thu, 25 Dec 2025 16:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "White House orders US military to 'quarantine' Venezuela oil",
      "description": "The White House has ordered the US military to focus on enforcing a \"quarantine\" of Venezuelan oil for the next two months, according to a US official.",
      "url": "https://news.sky.com/story/white-house-orders-us-military-to-quarantine-venezuela-oil-official-says-13487300",
      "published": "Wed, 24 Dec 2025 21:29:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Algeria votes to declare French colonization a crime and demands restitution",
      "description": "Algerian legislators have declared France's colonization a crime, demanding restitution for property taken during its 130-year rule",
      "url": "https://abcnews.go.com/International/wireStory/algeria-votes-declare-french-colonization-crime-demands-restitution-128691093",
      "published": "Thu, 25 Dec 2025 06:57:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea vows to end foreign adoptions as UN presses Seoul to address past abuses",
      "description": "South Korea’s government says it plans to end the waning foreign adoptions of Korean children",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-vows-end-foreign-adoptions-presses-seoul-128699370",
      "published": "Fri, 26 Dec 2025 02:57:17 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Saudi Arabia calls on Yemen separatists to leave 2 governorates as coalition strains",
      "description": "Saudi Arabia has called on separatists in Yemen to withdraw from two governorates they now hold",
      "url": "https://abcnews.go.com/International/wireStory/saudi-arabia-calls-yemen-separatists-leave-2-governorates-128690170",
      "published": "Thu, 25 Dec 2025 06:57:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar will hold its first general election in 5 years as criticism of the military rule mounts",
      "description": "Myanmar will hold the first phase of a general election on Sunday, its first vote in five years and an election framed by the ruling military as a return to multi-party democracy",
      "url": "https://abcnews.go.com/International/wireStory/myanmar-hold-general-election-5-years-criticism-military-128698252",
      "published": "Thu, 25 Dec 2025 23:15:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's Cabinet OKs record defense budget that aims to deter China",
      "description": "Japan’s Cabinet has approved a record defense budget plan exceeding 9 trillion yen for the coming year",
      "url": "https://abcnews.go.com/International/wireStory/japans-cabinet-oks-record-defense-budget-aims-deter-128697811",
      "published": "Fri, 26 Dec 2025 03:45:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A Venezuelan family's Christmas: From the American dream to poverty",
      "description": "Mariela Gómez and thousands of Venezuelan immigrants have faced a challenging Christmas after Donald Trump returned to the White House in January",
      "url": "https://abcnews.go.com/International/wireStory/venezuelan-familys-christmas-american-dream-poverty-128695851",
      "published": "Fri, 26 Dec 2025 01:59:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza: Humanitarian response ongoing despite restrictions",
      "description": "Although “significant restrictions and impediments” continue to hamper humanitarian operations in Gaza, teams are still responding to the population’s needs, the UN aid coordination office OCHA said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166669",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN celebrates 10 years of progress in youth, peace and security agenda",
      "description": "The UN has long been at the forefront of efforts to involve young people in decision-making, and the last decade has seen significant progress, thanks to the adoption of a Security Council resolution on youth, peace and security which led to widespread changes in the ways that the voices of young people are not just heard, but also incorporated in peace plans and policies.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166637",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somalia: Funding cuts impact assistance to millions affected by drought",
      "description": "Brutal slashes to aid budgets are hampering efforts to assist millions of people in Somalia affected by drought, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166654",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Synthetic drug market disrupted in Syria after regime change",
      "description": "Past geopolitical tensions related to the synthetic drug “captagon” are now being mitigated with the Syrian authorities’ commitment to dismantle illicit manufacturing, says the United Nations Office on Drugs and Crime (UNODC).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166647",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Santa with CCW gets pulled over, tells Ohio deputy 'you got to protect yourself' during festive traffic stop",
      "description": "Santa was pulled over for speeding in Ohio and told a deputy he had a concealed carry permit. Hilarious bodycam footage shows Christmas magic meeting reality.",
      "url": "https://www.foxnews.com/us/santa-ccw-gets-pulled-over-tells-ohio-deputy-you-got-protect-yourself-during-festive-traffic-stop",
      "published": "Thu, 25 Dec 2025 19:23:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Migrant truckers sue California DMV over canceled commercial drivers' licenses",
      "description": "Nearly 20,000 immigrant truckers at risk of having their commercial driver's licenses revoked by California spark a class-action lawsuit.",
      "url": "https://www.foxnews.com/us/migrant-truckers-sue-california-dmv-over-canceled-commercial-drivers-licenses",
      "published": "Thu, 25 Dec 2025 14:12:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Watch: Thieves drag ATM through Texas convenience store in Christmas Eve theft attempt",
      "description": "Thieves attempted to drag an ATM through a Texas 7-Eleven's doors using a stolen black SUV and cable on Christmas Eve, but the machine broke free.",
      "url": "https://www.foxnews.com/us/watch-thieves-drag-atm-through-texas-convenience-store-christmas-eve-theft-attempt",
      "published": "Wed, 24 Dec 2025 20:50:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Virginia family alleges bed bugs bit them during transatlantic flight, suing Delta and KLM airlines",
      "description": "The Romulo Albuquerque family from Virginia claims in a lawsuit that bed bugs infested their cabin during March trip from Roanoke to Serbia.",
      "url": "https://www.foxnews.com/us/virginia-family-alleges-bed-bugs-bit-them-during-transatlantic-flight-suing-delta-klm-airlines",
      "published": "Wed, 24 Dec 2025 16:58:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Convicted killer Scott Peterson keeps swinging in court — but expert says he’s not going anywhere but his cell",
      "description": "Scott Peterson remains in prison as 2025 ends, serving life without parole for murdering pregnant wife Laci Peterson over 20 years ago in shocking case.",
      "url": "https://www.foxnews.com/us/convicted-killer-scott-peterson-keeps-swinging-court-but-expert-says-hes-not-going-anywhere-but-his-cell",
      "published": "Wed, 24 Dec 2025 08:00:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Judge gives 'green light' to controversial New York law and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/judge-gives-green-light-controversial-new-york-law-more-top-headlines",
      "published": "Wed, 24 Dec 2025 06:53:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trio of Palestinians arrested for allegedly torching Christmas tree at Catholic church in West Bank",
      "description": "Three Palestinians accused of torching a Christmas tree and damaging part of a Nativity scene at a West Bank Catholic church were arrested.",
      "url": "https://www.foxnews.com/world/trio-palestinians-arrested-allegedly-torching-christmas-tree-catholic-church-west-bank",
      "published": "Thu, 25 Dec 2025 21:31:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy encouraged by 'very good' Christmas talks with US",
      "description": "Ukrainian President Volodymyr Zelenskyy expresses optimism about Ukraine peace talks after Christmas conversation with U.S. envoys, as negotiations show progress.",
      "url": "https://www.foxnews.com/world/zelenskyy-encouraged-very-good-christmas-talks-us",
      "published": "Thu, 25 Dec 2025 13:53:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Poland scrambles jets on Christmas after detecting Russian reconnaissance aircraft near its airspace",
      "description": "Poland scrambled fighter jets on Christmas morning after detecting a Russian reconnaissance aircraft near its airspace over the Baltic Sea.",
      "url": "https://www.foxnews.com/world/poland-scrambles-jets-christmas-after-detecting-russian-reconnaissance-aircraft-near-its-airspace",
      "published": "Thu, 25 Dec 2025 11:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump-backed candidate Asfura wins Honduras presidential election",
      "description": "Tito Asfura secured Honduras' presidency, defeating Salvador Nasralla and Rixi Ramona Moncada Godoy in a polarized campaign that shifts Central America's political landscape.",
      "url": "https://www.foxnews.com/world/trump-backed-candidate-asfura-wins-honduras-presidential-election",
      "published": "Wed, 24 Dec 2025 19:21:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope Leo XIV says he’s ‘very disappointed’ after Illinois approves assisted suicide law",
      "description": "Pope Leo XIV and Chicago Cardinal Cupich unsuccessfully urged Illinois Gov. Pritzker not to sign controversial medical aid in dying legislation into law.",
      "url": "https://www.foxnews.com/world/pope-leo-xiv-says-hes-very-disappointed-after-illinois-approves-assisted-suicide-law",
      "published": "Tue, 23 Dec 2025 20:41:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bukele challenges Hillary Clinton to take El Salvador's entire prison population after criticism",
      "description": "Bukele challenged Hillary Clinton’s allegations of torture at El Salvador’s CECOT prison, offering to release inmates if other countries accept them.",
      "url": "https://www.foxnews.com/world/bukele-challenges-hillary-clinton-take-el-salvadors-entire-prison-population-criticism",
      "published": "Tue, 23 Dec 2025 19:07:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}