{
  "last_updated": "2026-01-31T07:51:40.118272Z",
  "event_count": 222,
  "events": [
    {
      "title": "Islamic State claims attack on international airport and airbase in Niger",
      "description": "Motorcycle-riding militants launch strikes using heavy weaponry and drones, damaging planes belonging to Ivorian carrier and Togolese airline Islamic State in the Sahel has claimed responsibility for an audacious assault at the international airport and adjacent air force base in Niamey, the capital of Niger, according to the SITE Intelligence Group, which tracks jihadist activity and communications worldwide. The attack, which began shortly after midnight on Thursday, reportedly involved motorcycle-riding militants who launched a “surprise and coordinated” strike using heavy weaponry and drones, according to statements released via IS in the Sahel’s propaganda arm, Amaq news agency. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/niger-airport-airbase-attack-islamic-state",
      "published": "Fri, 30 Jan 2026 15:57:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 53,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: IOM warning for Sudan returnees, Nipah virus alert for India, food security in Afghanistan",
      "description": "In Sudan, where the devastating conflict between the Sudanese army and rival paramilitary Rapid Support Forces is nearing the end of its third year, more than three million people have returned to their areas of origin, the International Organization for Migration (IOM) announced on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166855",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Niger’s military ruler vows retaliation after gunfire and explosions heard in capital",
      "description": "General Tchiani accuses France, Benin and the Ivory Coast of links to attack near Niamey’s airport and thanks Russian troops for defence efforts Heavy security has been deployed around the main airport in Niger’s capital, Niamey, after overnight gunfire and explosions that the country’s military ruler blamed without evidence on France, Benin and Côte d’Ivoire. The shooting and detonations began shortly after midnight on Wednesday, according to residents of a neighbourhood near the airport, which is next to Base Aérienne 101, a military base previously used by US and then Russian troops . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/29/gunfire-blasts-heard-airport-niamey-niger-planes-hit-reports",
      "published": "Fri, 30 Jan 2026 00:34:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Convicted terrorist who plotted consulate, church bombings to run in UK election",
      "description": "A Muslim activist with terror conviction runs for Birmingham City Council, sparking controversy as local elections approach in Britain's second largest city.",
      "url": "https://www.foxnews.com/world/convicted-terrorist-who-plotted-consulate-church-bombings-run-uk-election",
      "published": "Thu, 29 Jan 2026 12:19:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Mexico president says Trump tariffs on Cuba’s oil suppliers could trigger humanitarian crisis",
      "description": "Island country only has oil enough to last 15-20 days, and 12-hour blackouts have become commonplace Mexico ’s president, Claudia Sheinbaum , has warned that Donald Trump ’s move to slap new tariffs on countries sending oil to Cuba could trigger a humanitarian crisis on the island, which is already suffering from chronic fuel shortages and regular blackouts. The US president signed an executive order on Thursday declaring a national emergency and laying the groundwork for such tariffs, ratcheting up the pressure to topple the communist government in Havana. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/mexico-sheinbaum-trump-tariffs-cuba-oil-crisis",
      "published": "Fri, 30 Jan 2026 18:08:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "EU to list Iran's Revolutionary Guard as terrorists; Germany warns of rapid action",
      "description": "The European Union approved new sanctions targeting Iranian officials and designated the Islamic Revolutionary Guard Corps a terrorist group over protest suppression and Russia support.",
      "url": "https://www.foxnews.com/world/eu-list-irans-revolutionary-guard-terrorists-germany-warns-rapid-action",
      "published": "Thu, 29 Jan 2026 17:41:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "South Africa expels top Israeli diplomat over ‘insulting attacks’ on president",
      "description": "Ariel Seidman declared persona non grata and given 72 hours to leave country after remarks on social media South Africa and Israel have engaged in a tit-for-tat expulsion of senior diplomats, after South Africa ordered Israel’s chargé d’affaires to leave within 72 hours, citing “insulting attacks” on South Africa’s president, Cyril Ramaphosa, on social media. Ariel Seidman, the chargé d’affaires at Israel’s embassy in Pretoria, was declared persona non grata by South Africa’s department for international relations and cooperation (DIRCO) in a statement on its website on Friday afternoon. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/south-africa-expels-israel-diplomat-insults-president",
      "published": "Fri, 30 Jan 2026 14:11:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Weather tracker: Winter storms cause death and outages across eastern north America",
      "description": "Millions told to stay home in US and more than a million are left without power, while Australia faces record heatwave Cold weather across a vast swathe of the eastern US has been the likely cause of at least 49 deaths in the past week. At one point, about 213 million people were under some sort of winter weather warnings, affecting areas from New Mexico to New England – a spread of about 2,000 miles (3,200km). Millions were told to stay at home, and at one point there were more than a million people without power. As of Wednesday night, there were still 312,000 outages, mostly across Tennessee, Mississippi, Louisiana and Texas. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/30/weather-tracker-winter-storms-cause-death-and-outages-across-eastern-north-america",
      "published": "Fri, 30 Jan 2026 10:45:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "More than 200 killed in mine collapse in eastern DR Congo: Report",
      "description": "Rights groups have raised concerns over conditions at the mine, which supplies about 15 percent of the world's coltan.",
      "url": "https://www.aljazeera.com/news/2026/1/31/more-than-200-killed-in-mine-collapse-in-eastern-dr-congo-report?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 01:24:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "More than 200 killed in coltan mine collapse in eastern DRC, officials say",
      "description": "Rubaya mine produces about 15% of the world’s coltan, which is processed into tantalum, used in mobile phones More than 200 people were killed this week in a collapse at the Rubaya coltan mine in eastern Democratic Republic of Congo, Lumumba Kambere Muyisa, a spokesperson for the rebel-appointed governor of the province where the mine is located, told Reuters on Friday. Rubaya produces about 15% of the world’s coltan, which is processed into tantalum – a heat-resistant metal that is in high demand by makers of mobile phones, computers, aerospace components and gas turbines. The site, where local people dig manually for a few dollars a day, has been under the control of the M23 rebel group since 2024. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/more-than-200-killed-in-coltan-mine-collapse-in-eastern-drc-officials-say",
      "published": "Fri, 30 Jan 2026 22:11:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Islamic State group claims responsibilty for a deadly attack on Niger's airport in the capital",
      "description": "In tonight's edition: the Islamic State group claims responsibilty for a deadly attack on Niger's airport in the capital. The ruling military accuses Benin, France and Ivory Coast of sponsoring the assailants. Also, to Ethiopia, where there are fears of renewed conflict in the Tigray region. Clashes this week raise questions about the future of a fragile peace deal. And for the second year in a row, the Grammy Award for Best African Music Performance is up for grab with many nigerian artists in the race. In Lagos, a new project has brought together French artists from different musical genre, and Nigerian Afrobeats talents.",
      "url": "https://www.france24.com/en/tv-shows/eye-on-africa/20260130-islamic-state-group-claims-responsibilty-for-a-deadly-attack-on-niger-s-airport-in-the-capital",
      "published": "Fri, 30 Jan 2026 21:43:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "UN watchdog warns Ukraine war remains world’s biggest threat to nuclear safety",
      "description": "The war in Ukraine remains the world’s biggest threat to nuclear safety as a fifth year of combat looms, the head of the UN nuclear watchdog warned on Friday, citing continued risks to power supplies at nuclear sites vulnerable to fighting nearby.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166863",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "UN nuclear watchdog discusses Ukraine nuclear safety risks",
      "description": "Russian attacks on Ukraine's electrical substations could cut power to nuclear plants, increasing risks of meltdown.",
      "url": "https://www.aljazeera.com/news/2026/1/30/un-nuclear-watchdog-discusses-ukraine-nuclear-safety-risks?traffic_source=rss",
      "published": "Fri, 30 Jan 2026 23:02:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "What do we know about the number of people killed in Iran protests?",
      "description": "Thousands of people have been killed in Iran's deadly protests, but deaths are still being verified, with conflicting reports. Here's what we know.",
      "url": "https://news.sky.com/story/what-do-we-know-about-the-number-of-people-killed-in-iran-protests-13501129",
      "published": "Fri, 30 Jan 2026 15:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘deeply concerned’ by escalation of violence in South Sudan",
      "description": "The world's youngest country, South Sudan, is facing continued instability and violence as military escalation looms, following reports earlier this week that a senior army commander had called on troops to inflict indiscriminate violence against civilians in Jonglei state.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166859",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Remembering the Holocaust: ‘You are here because you choose hope over hate’",
      "description": "The Holocaust is a warning, that hatred “can consume everything” – a message that feels more urgent than ever, the UN chief said on Tuesday, as antisemitism rages worldwide.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166840",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Cause of plane crash in Colombia that killed 15, including Congress member, under investigation",
      "description": "Colombian airline Satena says it received no prior warning of adverse weather before a plane crash killed 15 people",
      "url": "https://abcnews.go.com/International/wireStory/cause-plane-crash-colombia-killed-15-including-congress-129685219",
      "published": "Thu, 29 Jan 2026 19:29:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Violence roiling Nigeria extends beyond religious lines, amid a deepening humanitarian crisis",
      "description": "When the United States ordered airstrikes on Christmas Day against Islamist militants in northern Nigeria, officials in Washington said the action was aimed at protecting Christians facing threats of violence.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166857",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iran responds to Trump pressure with warning of retaliation: 'Fingers on the trigger'",
      "description": "President Donald Trump warned Iran \"time is running out\" on a nuclear deal, and Iran's foreign minister threatened retaliation against \"aggression.\"",
      "url": "https://www.foxnews.com/world/iran-responds-trump-pressure-warning-retaliation-fingers-trigger",
      "published": "Thu, 29 Jan 2026 10:50:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "UN faces severe cash crisis as Trump admin ramps up pressure on world body",
      "description": "U.N. faces potential cash crisis by July as unpaid dues hit record $1.568 billion. Secretary-General António Guterres warns of liquidity problems amid funding cuts.",
      "url": "https://www.foxnews.com/world/un-faces-severe-cash-crisis-trump-admin-ramps-up-pressure-world-body",
      "published": "Fri, 30 Jan 2026 12:53:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "At least 170 killed in air strikes during Myanmar's widely criticised election, UN says",
      "description": "The UN said \"credible sources\" had counted more than 400 strikes in the same period.",
      "url": "https://www.bbc.com/news/articles/cg5gl8grv66o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 13:12:25 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Greetings from Mumbai, where residents take breathing space where they can find it",
      "description": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "url": "https://www.npr.org/2026/01/28/g-s1-107108/mumbai-india-arabian-sea-promenade",
      "published": "Wed, 28 Jan 2026 09:53:20 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘We must stand up for our shared humanity - each and every day’: UN human rights chief",
      "description": "On the eve of International Holocaust Remembrance Day, UN High Commissioner for Human Rights Volker Türk called on the global community to “not only to look at our past, but to reflect on our present, and to safeguard our future.”",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166836",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN risks 'imminent financial collapse', secretary general warns",
      "description": "António Guterres says the international body could run out of money by July due to members' unpaid fees.",
      "url": "https://www.bbc.com/news/articles/cr579mdv4m7o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 16:24:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar election delivers walkover win for military-backed political party",
      "description": "Myanmar's military rulers say polls were free and fair as UN reports 170 killed during election period.",
      "url": "https://www.aljazeera.com/news/2026/1/31/myanmar-election-delivers-walkover-win-for-military-backed-political-party?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 04:31:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump threatens tariffs on goods from countries that sell oil to Cuba",
      "description": "White House cites Cuba’s ties to hostile powers as order ratchets up Trump’s pressure to topple its government Donald Trump signed an executive order on Thursday laying the groundwork to slap tariffs on goods from countries that provide oil to Cuba, the White House said. The order, which ratchets up Trump’s pressure to topple the communist government, declares a national emergency and establishes a process for the US secretaries of state and commerce to assess tariffs against countries that sell or otherwise provide oil to the island nation. The White House has yet to specify tariff rates for violating its new policy of blocking Cuba from buying oil. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/29/trump-tariffs-cuba-oil",
      "published": "Fri, 30 Jan 2026 01:06:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Philippines: Are terror laws being used to silence critics?",
      "description": "Journalist Frenchie Mae Cumpio's conviction on terror-financing charges has raised concerns over press freedoms in the Philippines, where activists warn that anti-terror laws are being wielded to clamp down on dissent.",
      "url": "https://www.dw.com/en/philippines-are-terror-laws-being-used-to-silence-critics/a-75729580?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 14:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "University of Minnesota student groups teaming with far-left radicals to lead anti-ICE 'national shutdown'",
      "description": "University of Minnesota student groups lead nationwide protest against federal immigration enforcement, calling for a \"National Shutdown\" on Friday.",
      "url": "https://www.foxnews.com/us/university-minnesota-student-groups-teaming-far-left-radicals-lead-anti-ice-national-shutdown",
      "published": "Fri, 30 Jan 2026 11:40:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Civil rights investigation opened into Alex Pretti shooting",
      "description": "The deputy attorney general said it was a “standard investigation” after Pretti's fatal shooting in Minneapolis.",
      "url": "https://www.bbc.com/news/articles/c5yvw89p3p1o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 19:23:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Fact check: Are ICE fakes trying to drown out real videos?",
      "description": "Deadly ICE raids and a surge of deepfake videos are making it harder than ever to tell real violence from AI‑generated fiction. Our investigation reveals how false clips drown out evidence of fatal encounters.",
      "url": "https://www.dw.com/en/fact-check-are-ice-fakes-trying-to-drown-out-real-videos/a-75727971?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 20:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "At least 200 killed in coltan mine collapse in eastern Congo, rebel authorities say",
      "description": "Rebel authorities say at least 200 people were killed in a landslide at coltan mines in eastern Congo",
      "url": "https://abcnews.go.com/International/wireStory/200-killed-coltan-mine-collapse-eastern-congo-rebel-129728737",
      "published": "Sat, 31 Jan 2026 02:14:14 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Syria ceasefire welcomed, ‘Olympic truce’, Ukraine’s freezing children",
      "description": "The UN Commission of Inquiry on Syria has welcomed a ceasefire agreement between the Syrian Government and the mainly-Kurdish Syrian Democratic Forces (SDF), urging all parties to seize the moment to protect civilians and prevent further violations in the country’s northeast.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166864",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Starmer hopes his China trip will begin the thaw after recent ice age",
      "description": "PM flies out after courting world’s second biggest economy aware of difficult balance of risks and potential rewards The last British prime minister to visit China was Theresa May in 2018 . Before the visit, she and her team were advised to get dressed under the covers because of the risk of hidden cameras having been placed in their hotel rooms to record compromising material. Keir Starmer, in Beijing this week, was more sanguine about his privacy, even though the security risks have, if anything, increased since the former Tory prime minister was in town. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/31/starmer-hopes-his-china-trip-will-begin-the-thaw-after-recent-ice-age",
      "published": "Sat, 31 Jan 2026 06:00:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Two men in their 20s found dead at Sydney property",
      "description": "Men – both aged 28 – found at a home in Glenorie on Saturday, New South Wales police say Get our breaking news email , free app or daily news podcast Two 28-year-old men have been found dead at a property in Sydney’s north-west in an incident police are treating as not suspicious. In a statement, New South Wales police said emergency services were called at about 8.40am on Saturday to a home on Harrisons Lane, Glenorie, 40km north-west of the Sydney CBD, following reports of a concern for welfare. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/31/two-men-in-their-20s-found-dead-at-sydney-property",
      "published": "Sat, 31 Jan 2026 03:45:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Queensland police scrap specialist unit providing support for domestic and family violence cases",
      "description": "Change comes after 100-day review that found domestic violence case management was not ‘core’ police business Get our breaking news email , free app or daily news podcast The Queensland police service plans to disband a specialist unit that provided statewide support for domestic and family violence cases, prompting concern from frontline workers that the loss of an “important resource” would place women at greater risk. The QPS confirmed to Guardian Australia on Friday it would scrap the DFV and vulnerable persons command “operational support unit” and redeploy its officers to local districts. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/31/queensland-police-scrap-domestic-violence-unit",
      "published": "Fri, 30 Jan 2026 14:00:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Israel broadly accepts Gaza ministry death toll — reports",
      "description": "Israeli officials appeared to accept that some 70,000 Palestinians have died in the war in Gaza. Israel had long disputed the figures from Gaza's health ministry, saying the agency was run by Hamas.",
      "url": "https://www.dw.com/en/israel-broadly-accepts-gaza-ministry-death-toll-reports/a-75735374?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 19:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "‘We children saw things that no one should ever have to see’ Holocaust survivor tells the UN",
      "description": "Holocaust survivor Marion Blumenthal Lazan, gave a harrowing and heart-rendering account of her childhood under Nazi persecution during Tuesday’s Holocaust Memorial event in New York, urging citizens worldwide to push back against ‘negativity’ by choosing “love, respect and compassion” in how they treat one another.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166851",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "From lunch tray to lifelong health: WHO sets global standards for school meals",
      "description": "For the first time ever, the World Health Organization (WHO) is providing recommendations for healthy and nutritious food in schools around the world.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166843",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump declares national emergency over Cuba, threatens tariffs on nations that supply oil to communist regime",
      "description": "Trump declared a national emergency over Cuba, accusing the communist regime of aligning with hostile powers and ordering new tariffs on oil suppliers to the island nation.",
      "url": "https://www.foxnews.com/world/trump-declares-national-emergency-cuba-threatens-tariffs-nations-supply-oil-communist-regime",
      "published": "Thu, 29 Jan 2026 22:04:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Luigi Mangione will not face death penalty if convicted, judge rules",
      "description": "A judge dismisses two federal counts against the 27-year-old, but he still faces state murder charges.",
      "url": "https://www.bbc.com/news/articles/c78egdg3r0po?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 23:30:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "‘Minneapolis Now’, Iran & the ‘Armada’, A Gaza milestone",
      "description": "This Friday in The World this Week, we talk about: The implications of a fatal week in Minneapolis, Iran & the ‘Armada’ ultimatum, What’s Trump’s goal for Gaza ?",
      "url": "https://www.france24.com/en/tv-shows/the-world-this-week/20260130-minneapolis-now-iran-the-armada-a-gaza-milestone",
      "published": "Fri, 30 Jan 2026 19:56:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "‘Essential’ to ICE: French IT giant Capgemini under fire over migrant tracking role",
      "description": "French IT group Capgemini is facing growing scrutiny over a controversial contract between its US subsidiary and ICE. While the company says the deal is “not currently being executed” and that it became aware of the contract “through public sources”, investigations by several French media outlets reveal a relationship stretching back nearly two decades.",
      "url": "https://www.france24.com/en/france/20260130-essential-to-ice-french-it-giant-capgemini-under-fire-over-migrant-tracking-role",
      "published": "Fri, 30 Jan 2026 17:39:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Ukraine city of Kherson protects itself from drones with French fishing nets",
      "description": "With an ever-increasing range, lightweight drones are a danger to soldiers and civilians alike anywhere near the frontlines in Ukraine. They can either act as kamikaze weapons in themselves, or drop small bombs and mines. In the southern city of Kherson alone at least 200 civilians have been killed in such attacks. To help defend against them, authorities in several Ukrainian regions have started putting up nets to protect roads and buildings. It turns out ordinary fishing nets do the job just fine – and French fishermen have been leading the effort to provide them.",
      "url": "https://www.france24.com/en/ukraine-city-of-kherson-protects-itself-from-drones-with-french-fishing-nets",
      "published": "Fri, 30 Jan 2026 16:26:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "'A vaccine against murder'? Israel split over return of death penalty",
      "description": "In a highly controversial move, some Israeli MPs are trying to introduce the death penalty for Palestinian attackers.",
      "url": "https://www.bbc.com/news/articles/clymp8v7ye2o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 06:09:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Heatwave across Australia’s south-east continues for eighth day ahead of a welcome cool change",
      "description": "The BoM forecasts parts of inland NSW will exceed 45C on Saturday, with Thargomindah in Queensland to reach 46C, Mildura 45C and Canberra 41C Get our breaking news email , free app or daily news podcast A cool change this weekend is expected to bring an end to eight consecutive days of blistering temperatures above 40C in Australia’s south-east. But before it does, the heat continued on Saturday. Heatwave warnings remained in place for parts of every state and territory excluding Tasmania, with Canberra forecast to reach a top of 41C and parts of inland New South Wales, including Broken Hill, expected to climb higher than 45C. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/31/australia-heatwave-bom-weather-forecast-hot-temperature-eighth-day-cool-change",
      "published": "Sat, 31 Jan 2026 01:17:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump's military interventions concern China despite there being no direct risk",
      "description": "China is troubled by President Trump's military interventions and threats of regime change around the world, even if they don't necessarily pose a direct threat to China.",
      "url": "https://www.npr.org/2026/01/30/nx-s1-5668231/trumps-military-interventions-concern-china-despite-there-being-no-direct-risk",
      "published": "Fri, 30 Jan 2026 04:51:06 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iran: A mosaic state rife with internal conflicts",
      "description": "Iran is a multi-ethnic state — yet its leadership has failed to find an answer to recurring protests, minority grievances and deepening environmental crises.",
      "url": "https://www.dw.com/en/iran-a-mosaic-state-rife-with-internal-conflicts/a-75729983?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 15:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Thousands march in cities across US in 'national shutdown' against immigration crackdown",
      "description": "Thousands of protesters took to the streets of Minneapolis and other US cities on Friday in a show of anger over the immigration crackdown carried out by the Trump administration. The turnout came in response to a call for a day of action, dubbed a \"national shutdown\", following the killings of Alex Pretti and Renée Good by federal agents in Minneapolis.",
      "url": "https://www.france24.com/en/americas/20260130-pictures-thousands-march-cities-across-usanational-shutdown-immigration-crackdown-ice",
      "published": "Fri, 30 Jan 2026 21:58:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump on \"thin ice\" with Iran: \"US intervention in the Middle East often doesn't go as planned\"",
      "description": "Iran is ready for dialogue to resolve tensions with the United States but that there are no concrete plans for talks with Washington even as Tehran faces the threat of U.S. military action. This comes as Donald Trump announced that another \"large armada\" is heading towards Iran. But what is Trump's goal? \"It's unclear\", says General Richard Shirreff, former NATO Deputy Supreme Allied Commander Europe, on FRANCE 24. \"But what is certain is that Trump is on very thin ice\" as history has shown that U.S. intervention in the Middle East often doesn't go as planned.",
      "url": "https://www.france24.com/en/trump-on-thin-ice-with-iran-us-intervention-in-the-middle-east-often-doesn-t-go-as-planned",
      "published": "Fri, 30 Jan 2026 17:34:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Solar desert power: Inside China's mega farm",
      "description": "China may be the world's number one polluter in real time, but Beijing is also driving the world's most ambitious renewables rollout, at breakneck speed. China is now home to nearly a third of the world's total installed solar and wind capacity, although it's yet to kick the coal habit. Our colleagues at France 2 visited some of the country’s flagship projects.",
      "url": "https://www.france24.com/en/tv-shows/down-to-earth/20260130-solar-desert-power-inside-china-s-mega-farm",
      "published": "Fri, 30 Jan 2026 17:03:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Satellite photos show activity at Iran nuclear sites as tensions rise over protest crackdown",
      "description": "Satellite images reveal activity at two Iranian nuclear sites, suggesting that Tehran may be obscuring its efforts to salvage any materials remaining there",
      "url": "https://abcnews.go.com/International/wireStory/satellite-photos-show-activity-iran-nuclear-sites-tensions-129714845",
      "published": "Fri, 30 Jan 2026 14:09:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Woman demands justice after masked gunmen ambushed vehicle in Puerto Rico, killing her fiancé",
      "description": "A tourist couple was allegedly ambushed by a dozen masked gunmen in Puerto Rico. The shooting left a DuPont chemist dead and a fiancée wounded and demanding justice.",
      "url": "https://www.foxnews.com/us/woman-demands-justice-masked-gunmen-ambushed-vehicle-puerto-rico-killing-fiance",
      "published": "Fri, 30 Jan 2026 16:54:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Israeli forces kill 12 Palestinians across Gaza, attacks reported in Rafah",
      "description": "Multiple strikes across the besieged enclave a day before Israel is expected to reopen the Rafah border crossing.",
      "url": "https://www.aljazeera.com/news/2026/1/31/israeli-forces-kill-12-palestinians-across-gaza-attacks-reported-in-rafah?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 07:35:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "US protesters begin nationwide strike as DOJ launches Pretti killing probe",
      "description": "Protesters call for 'no work, no school, no shopping' in response to Trump's deadly immigration enforcement crackdown.",
      "url": "https://www.aljazeera.com/news/2026/1/30/us-protesters-begin-nationwide-strike-as-doj-launches-pretti-killing-probe?traffic_source=rss",
      "published": "Fri, 30 Jan 2026 19:56:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "US-Iran tensions: Arab States and Israel navigate strategic tightrope",
      "description": "Amid ongoing diplomatic efforts to avert a wider conflict in the Middle East, Saudi Arabia, the Gulf states and Israel are prioritizing their own interests as regional tensions between the US and Iran continue to rise.",
      "url": "https://www.dw.com/en/us-iran-tensions-arab-states-and-israel-navigate-strategic-tightrope/a-75732540?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 19:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Sudan: ‘All the conditions for a human catastrophe are present’",
      "description": "Military tensions in South Sudan are “rapidly expanding” between Government forces and opposition militia as fighting continues in restive Jonglei state.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166865",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Nevada judge frees convicted MS-13 killer despite government warnings about public safety",
      "description": "A Nevada judge released a convicted MS-13 murderer despite Justice Department warnings, sparking public safety concerns and legal controversy.",
      "url": "https://www.foxnews.com/us/nevada-judge-frees-convicted-ms-13-killer-despite-government-warnings-about-public-safety",
      "published": "Fri, 30 Jan 2026 17:27:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "California woman arrested after allegedly beheading boyfriend, fleeing to Mexico",
      "description": "A California woman allegedly decapitated her boyfriend and fled to Mexico in a shocking murder case. Alyssa Lira was arrested after a months-long international search.",
      "url": "https://www.foxnews.com/us/california-woman-arrested-allegedly-beheading-boyfriend-fleeing-mexico",
      "published": "Fri, 30 Jan 2026 15:12:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump picks Kevin Warsh to lead the US Federal Reserve",
      "description": "The 55-year-old economist had been considered for Fed chair during Trump's first term.",
      "url": "https://www.bbc.com/news/articles/c2d7yddrl2xo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 16:22:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Palau lawmakers vote to block controversial Trump deal to resettle migrants from US",
      "description": "A plan to resettle third-country nationals from the US to the Pacific nation faces an uncertain future amid unease over the deal A controversial Trump administration deal to relocate deportees from the US to the small Pacific nation of Palau faces an uncertain future, after the senate voted to block the deal as concern about the agreement grows. The deal, which allows up to 75 third-country migrants facing removal from the US to live and work in Palau, was signed by president Surangel Whipps Jr in December . Palau’s lower house now has to consider the deal, and the final decision rests with Whipps Jr. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/palau-pacific-country-blocks-trump-migrant-deal",
      "published": "Fri, 30 Jan 2026 04:27:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Federal judge drops murder rap in UnitedHealthcare CEO case",
      "description": "A US judge has dismissed key federal charges against a man accused of killing a health insurance executive in New York. The ruling removes the possibility of a death sentence.",
      "url": "https://www.dw.com/en/federal-judge-drops-murder-rap-in-unitedhealthcare-ceo-case/a-75733368?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 16:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "41 militants killed in Pakistan military raids in the country's southwest",
      "description": "Pakistan's military says 41 insurgents have been killed by security forces during two separate raids in the country's southwest",
      "url": "https://abcnews.go.com/International/wireStory/41-militants-killed-pakistan-military-raids-countrys-southwest-129695568",
      "published": "Fri, 30 Jan 2026 04:59:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ukraine sees quieter night as Trump says Putin will not attack its cities",
      "description": "Russia said the US president requested a pause in strikes on Kyiv until 1 February, a move Trump said was prompted by the cold weather.",
      "url": "https://www.bbc.com/news/articles/c4g4yj92kwro?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 13:46:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Wave of Israeli air strikes hit southern Lebanon despite ceasefire",
      "description": "Israeli air strikes pound areas in southern Lebanon in violation of the November 2024 ceasefire with Hezbollah.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/31/wave-of-israeli-air-strikes-hit-southern-lebanon-despite-ceasefire?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 06:42:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Iran announces live-fire naval drills near US warships amid tensions",
      "description": "US army warns Iran that it will not tolerate 'unsafe' manoeuvres such as flights over US warships.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/31/live-iran-announces-live-fire-naval-drills-near-us-warships-amid-tensions?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 06:07:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Italy: Deep fissures appear in Sicilian town hit by landslide",
      "description": "The Sicilian town of Niscemi has been left teetering on the edge of a cliff after days of heavy rains from a cyclone triggered a huge landslide that brought down properties and forced the evacuation of over 1,500 people. Deep fissures are appearing in the ground throughout the area, prompting close surveillance by authorities.",
      "url": "https://www.france24.com/en/video/20260130-italy-deep-fissures-appear-in-sicilian-town-hit-by-landslide",
      "published": "Fri, 30 Jan 2026 17:06:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Through the eyes of Iranian protesters, glimpses of disorder, disarray and death",
      "description": "Six Iranians spoke to The Associated Press about the protests in Iran, describing a renewed sense of hope even with a bloody crackdown on demonstrators",
      "url": "https://abcnews.go.com/International/wireStory/eyes-iranian-protesters-glimpses-disorder-disarray-death-129693125",
      "published": "Fri, 30 Jan 2026 03:52:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukraine races to bolster air defenses as Putin’s strike pause nears end",
      "description": "Ukraine is rushing to boost air defenses as a brief Russian airstrike pause on Kyiv nears an end. Experts warn the temporary halt may strengthen Moscow's position.",
      "url": "https://www.foxnews.com/world/ukraine-races-bolster-air-defenses-putins-strike-pause-nears-end",
      "published": "Fri, 30 Jan 2026 14:20:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Rubio revokes Iranian officials' US travel privileges over deadly protest crackdown killing thousands",
      "description": "Rubio revoked travel privileges for Iranian officials after organizations accused the regime of killing more than 6,200 protesters. President Trump also warned of a \"massive armada.\"",
      "url": "https://www.foxnews.com/world/rubio-revokes-iranian-officials-us-travel-privileges-over-deadly-protest-crackdown-killing-thousands",
      "published": "Thu, 29 Jan 2026 20:22:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "'They told us to let them die': Iranian doctor speaks on regime crackdown",
      "description": "In Iran, the climate of fear has been restored after the clerics who run this country successfully crushed a nationwide revolt.",
      "url": "https://news.sky.com/story/the-doctors-who-want-you-to-know-what-happened-inside-iran-13500411",
      "published": "Wed, 28 Jan 2026 22:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Deadly shipwrecks in the Mediterranean, Duterte trial update, final hostage remains recovered in Gaza, FAO boosts farming in Haiti",
      "description": "The UN migration agency, IOM, expressed deep concern on Monday over multiple deadly shipwrecks that are believed to have taken place over the past ten days across the Central Mediterranean.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166834",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Hikers stiff hotel on unpaid bill after treacherous 7-hour mountain rescue operation, nonprofit says",
      "description": "Rescued hikers allegedly stiffed a hotel after a Scafell Pike rescue operation in England's Lake District, leaving volunteers to pay the $178 bill.",
      "url": "https://www.foxnews.com/world/hikers-stiff-hotel-unpaid-bill-treacherous-7-hour-mountain-rescue-operation-nonprofit-says",
      "published": "Fri, 30 Jan 2026 19:11:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Hamas emerges as ‘ultimate spoiler’ in Gaza plan as Trump insists terror group will disarm",
      "description": "Hamas leader Mousa Abu Marzouk says the group \"never agreed to disarm\" after President Donald Trump claimed the militant organization would throw down weapons.",
      "url": "https://www.foxnews.com/world/hamas-emerges-ultimate-spoiler-gaza-plan-trump-insists-terror-group-disarm",
      "published": "Thu, 29 Jan 2026 21:35:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Bulgaria's entry into the EU single currency: A historic shift",
      "description": "On January 1, Bulgaria officially joined the eurozone, becoming the 21st country to join the European single currency. Sofia's adoption of the euro brings hope of major economic benefits, but it also comes at a moment of deep political polarisation and mass anti-corruption protests, which culminated in the resignation of both the country's government and president.",
      "url": "https://www.france24.com/en/tv-shows/talking-europe/20260130-bulgaria-s-entry-into-the-eu-single-currency-a-historic-shift",
      "published": "Fri, 30 Jan 2026 16:39:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Security Council LIVE: Ambassadors debate as Middle East crises mount",
      "description": "The UN Security Council held a high-level open debate on the Middle East on Wednesday focusing on the Gaza peace plan – including the role of President Donald Trump’s Board of Peace – the continuing humanitarian crisis in the enclave and turmoil in the West Bank and East Jerusalem, following the demolition of UNRWA’s headquarters there. Follow live coverage below, and UN News app users can click here. For full and comprehensive UN meetings coverage, go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166845",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "LAPD arrests violent agitators after protests erupt outside federal detention center in Los Angeles",
      "description": "Los Angeles police arrested multiple protesters after violent clashes erupted outside a federal detention center during Friday demonstrations.",
      "url": "https://www.foxnews.com/us/lapd-arrests-violent-agitators-protests-erupt-outside-federal-detention-center-los-angeles",
      "published": "Sat, 31 Jan 2026 01:37:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens to end Iraq support over al-Maliki comeback bid tied to Iran influence",
      "description": "U.S. opposes Iran-backed al-Maliki's bid for Iraqi PM role as Secretary of State Marco Rubio expresses concerns about pro-Tehran government seizing control of Iraq.",
      "url": "https://www.foxnews.com/world/trump-threatens-end-iraq-support-over-al-maliki-comeback-bid-tied-iran-influence",
      "published": "Thu, 29 Jan 2026 06:37:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "T20 World Cup 2026 stadiums: Where’s India vs Pakistan and the final?",
      "description": "Al Jazeera’s guide to the eight venues that will host the T20 World Cup 2026 matches in India and Sri Lanka.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/icc-t20-world-cup-2026-cricket-stadiums-india-vs-pakistan-final-venue?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 02:35:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "After Trump call, Russia agrees to pause attacks on Kyiv amid cold spell",
      "description": "The Kremlin says it’s agreed to halt attacks on Kyiv and nearby towns until February 1, after a request from the US.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/30/after-trump-call-russia-agrees-to-pause-attacks-on-kyiv-amid-cold-spell?traffic_source=rss",
      "published": "Fri, 30 Jan 2026 20:22:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela approves bill to open oil sector to foreign investment after US pressure",
      "description": "Law will give private companies more control but experts unsure whether changes go far enough for US Venezuela’s acting president has signed into law a bill making significant changes to the country’s oil sector after pressure from the US to open it up to foreign private investment. The new hydrocarbons law promises to give private companies control over oil production and sales, ease taxes and allow for independent arbitration of disputes, while largely maintaining state control over oil production. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/venezuela-approves-bill-to-open-oil-sector-to-foreign-investment-after-us-pressure",
      "published": "Fri, 30 Jan 2026 11:54:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UK politics: Starmer shrugs off Trump’s criticism of ‘very dangerous’ deal with China – as it happened",
      "description": "Prime minister suggests US president was ‘talking more about Canada’ when asked for reaction to Beijing visit Prominent Hong Kong and Uyghur activists living in exile in the UK have accused Starmer of seeking China’s desperate approval, after the prime minister visited Beijing for the first time in eight years this week. Pro-democracy campaigner and prominent critic of the Communist Party, Finn Lau said the Hong Kong community is disappointed by Starmer’s visit, but unsurprised by the government’s “short sightedness”. “While British citizen Jimmy Lai remains imprisoned and Uyghurs continue to suffer atrocity crimes, we take no comfort in this decision and will not be silenced. We look forward to receiving urgent assurances from the government regarding those who were placed under sanction together with us, and take this opportunity to express our ongoing solidarity with the Uyghur people, whose cause we will not drop. Continue reading...",
      "url": "https://www.theguardian.com/politics/live/2026/jan/30/donald-trump-keir-starmer-china-uk-us-trade-deals-tariffs-latest-news",
      "published": "Fri, 30 Jan 2026 17:10:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Unmentioned but present, Trump is a common denominator in Asia-Europe ties",
      "description": "Trump was not the only factor behind the agreements, but his shaking up of the global order is worrying friends and foes and driving them closer.",
      "url": "https://www.npr.org/2026/01/30/g-s1-108011/unmentioned-but-present-trump-is-a-common-denominator-in-asia-europe-ties",
      "published": "Fri, 30 Jan 2026 14:55:36 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Kari Lake promotes Trump on Voice of America. Does that break the law?",
      "description": "Critics say U.S. Agency for Global Media's Kari Lake risks making Voice of America sound like a propaganda outlet in her remarks on the air praising President Trump.",
      "url": "https://www.npr.org/2026/01/30/nx-s1-5683246/kari-lake-trump-voa-pnn-iran-firewall-propaganda",
      "published": "Fri, 30 Jan 2026 05:01:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Starmer and Xi call for deeper U.K.-China ties as Trump shakes up global relations",
      "description": "British Prime Minister Keir Starmer and Chinese leader Xi Jinping in Beijing called for a \"comprehensive strategic partnership\" to deepen ties amid global uncertainty.",
      "url": "https://www.npr.org/2026/01/29/g-s1-107743/starmer-and-xi-call-for-deeper-uk-china-ties",
      "published": "Thu, 29 Jan 2026 04:38:31 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Germany news: Hamburg police investigating subway deaths",
      "description": "Police in the city of Hamburg are probing a suspected homicide after two people were hit by an underground train. Meanwhile, a survey has found that many Germans who work part-time do so voluntarily. DW has more.",
      "url": "https://www.dw.com/en/germany-news-hamburg-police-investigating-subway-deaths/live-75724858?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 20:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "A cultural stroll through Paris with singers Faudel and Sam Sauvage",
      "description": "This week on Paris des Arts, singer Faudel makes his long-awaited comeback. Once crowned the \"little prince of Raï\", the Algerian folk icon returns to the spotlight with his nostalgic 2000s tour \"I Gotta Feeling\". He also takes us inside \"Tenter l’art pour soigner\" at the Arab World Institute – an exhibition exploring art as healing through archives and ceramics from an Algerian hospital that broke with colonial psychiatry in the late 1960s.",
      "url": "https://www.france24.com/en/tv-shows/paris-des-arts/20260130-a-cultural-stroll-through-paris-with-singers-faudel-and-sam-sauvage",
      "published": "Fri, 30 Jan 2026 17:12:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "China’s gold boom tempts Shanghai residents to cash in",
      "description": "At automated machines assessing gold on the spot, Shanghai residents queue to sell old jewellery, lured by prices nearing $5,600 per ounce. Others continue to buy, betting the rally will last amid global uncertainty and a weaker US dollar.",
      "url": "https://www.france24.com/en/china-s-gold-boom-tempts-shanghai-residents-to-cash-in",
      "published": "Fri, 30 Jan 2026 17:07:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "A Sudanese doctor recounts his harrowing escape from a Darfur city under rebel bombardment",
      "description": "Three months after paramilitary fighters overran the Sudanese city of el-Fasher, a doctor is providing a rare first-person account of the attack",
      "url": "https://abcnews.go.com/International/wireStory/sudanese-doctor-recounts-harrowing-escape-darfur-city-rebel-129728158",
      "published": "Sat, 31 Jan 2026 00:18:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran's top diplomat says there are no plans for talks with the US",
      "description": "Iran's foreign minister says his country is ready for dialogue to resolve tensions but that there are no concrete plans for talks with the United States",
      "url": "https://abcnews.go.com/International/wireStory/irans-top-diplomat-plans-talks-us-129701337",
      "published": "Fri, 30 Jan 2026 08:58:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Choose peace over chaos, Guterres urges as he sets out final-year priorities",
      "description": "With global tensions rising and “reckless actions” triggering dangerous consequences, UN Secretary-General António Guterres on Thursday called for renewed efforts on peace, justice and sustainable development as he outlined his priorities for 2026 – the final year of his tenure.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166853",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World News in Brief: UN Support Office in Haiti, Goodwill Ambassador Theo James in Syria, urgent appeal for millions in DR Congo",
      "description": "The Security Council-endorsed UN Support Office in Haiti is on track to deliver on behalf of the Haitian people, UN Spokesperson Stéphane Dujarric said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166850",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "One wrong move and it could all go wrong - the men clearing deadly undersea Russian mines",
      "description": "Clearing mines from the sea is a perilous operation and doing so in an active conflict is even more dangerous.",
      "url": "https://www.bbc.com/news/articles/c70lgwprw7ko?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 00:19:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "An ingredient for this curry is missing - and in eight minutes it's at the door",
      "description": "India's quick-commerce boom means groceries in minutes - but it can be dangerous for riders.",
      "url": "https://www.bbc.com/news/articles/cvgx7ykl12go?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 00:01:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US approves $6.6bn sale of attack helicopters, assault vehicles to Israel",
      "description": "The approved sale includes 30 Apache helicopters, which Israeli forces have used to attack Palestinians in Gaza.",
      "url": "https://www.aljazeera.com/news/2026/1/31/us-approves-6-6bn-sale-of-attack-helicopters-assault-vehicles-to-israel?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 03:36:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Missing statue of golf legend Ballesteros found chopped in pieces in Spain",
      "description": "A man has been arrested by police in Spain after they recovered a stolen statue of the late golfer Seve Ballesteros.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/missing-statue-of-golf-legend-ballesteros-found-chopped-in-pieces-in-spain?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 01:07:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,437",
      "description": "These are the key developments from day 1,437 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/31/russia-ukraine-war-list-of-key-events-day-1437?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 00:32:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Is Trump’s choice for US Fed chair a ‘chameleon’ or a ‘solid’ pick?",
      "description": "Experts vary in their views on Kevin Warsh, Trump's nominee to replace Jerome Powell as head of the US central bank.",
      "url": "https://www.aljazeera.com/economy/2026/1/31/is-trumps-choice-for-us-fed-chair-a-chameleon-or-a-solid-pick?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 00:20:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "What do China and the UK want from each other?",
      "description": "UK Prime Minister Keir Starmer's warm welcome on a visit to China this week marks a thaw in icy relations with Beijing.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/30/what-do-china-and-the-uk-want-from-each-other?traffic_source=rss",
      "published": "Fri, 30 Jan 2026 22:06:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds feared dead in attempt to cross Mediterranean during cyclone",
      "description": "Fifty killed in one incident as Italian authorities estimate 380 people may have drowned last week Up to 380 people may have drowned attempting to cross the Mediterranean last week as Cyclone Harry battered southern Italy and Malta, the Italian coastguard has said, as a shipwreck with the loss of 50 lives was confirmed by Maltese authorities. Just one person, who was hospitalised in Malta, survived the shipwreck, which happened on Friday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/hundreds-feared-dead-after-attempting-to-cross-mediterranean-amid-cyclone-harry",
      "published": "Mon, 26 Jan 2026 14:54:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "China has lifted sanctions from six serving British MPs and peers, Starmer says",
      "description": "Starmer confirms immediate removal, but it is unclear if sanctions remain on former MP, academic and barrister China has lifted the sanctions it imposed on serving British MPs and peers in a significant sign of warming relations after Keir Starmer travelled to Beijing for landmark talks with Xi Jinping. Nine UK citizens were banned from China in 2021 , including five Conservative MPs and two members of the House of Lords, targeted for highlighting human rights violations against the Muslim Uyghur community. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/china-lifts-sanctions-british-mps-peers",
      "published": "Fri, 30 Jan 2026 14:37:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says ‘very dangerous’ for UK to do business with China, after Starmer hails progress in Beijing",
      "description": "US president warns against closer ties with China during British PM’s trip to secure lower tariffs and better market access Donald Trump has warned the UK against doing business with China, just hours after Keir Starmer lauded the economic relationship during a landmark visit to Beijing . The US president said it was “very dangerous” for the UK to pursue closer ties with the rival superpower as the prime minister’s three-hour talks with Xi Jinping underlined a thaw in previously strained relations. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/trump-dangerous-uk-china-starmer-xi-jinping-beijing",
      "published": "Fri, 30 Jan 2026 12:39:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Two friends, an Israeli and a Palestinian, believe peace is possible after war",
      "description": "A Palestinian man and his Israeli friend are dedicating themselves to a peaceful coexistence in the aftermath of the devastating war in Gaza.",
      "url": "https://www.npr.org/2026/01/29/nx-s1-5668086/two-friends-an-israeli-and-a-palestinian-believe-peace-is-possible-after-war",
      "published": "Thu, 29 Jan 2026 04:57:23 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "German economy grew in latest quarter, but challenges remain",
      "description": "Germany's struggling economy grew toward the end of 2025, but the good news was tempered by simultaneous rises in inflation and unemployment.",
      "url": "https://www.dw.com/en/german-economy-grew-in-latest-quarter-but-challenges-remain/a-75731942?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 17:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US judge bars prosecutors from seeking death penalty against Luigi Mangione",
      "description": "Luigi Mangione will not face the death penalty over the killing of UnitedHealthcare CEO Brian Thompson after a US judge on Friday dismissed murder and weapons charges against the suspect, foiling the Trump administration’s bid to see him executed.",
      "url": "https://www.france24.com/en/americas/20260130-us-judge-bars-prosecutors-from-seeking-death-penalty-against-luigi-mangione",
      "published": "Fri, 30 Jan 2026 17:47:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'It's important to finalise the EU-US trade agreement': EU Economy Commissioner Dombrovskis",
      "description": "As Europe faces unprecedented geopolitical headwinds, from the Ukraine war to Donald Trump’s designs on Greenland, we speak to the EU Commissioner in charge of the economy, productivity, and simplification: Valdis Dombrovskis. A former prime minister of Latvia, Dombrovskis is very much a Brussels insider, serving in various high-profile roles in the EU Commission since 2016, and as a member of the European Parliament in 2004-2009.",
      "url": "https://www.france24.com/en/tv-shows/talking-europe/20260130-it-s-important-to-finalise-the-eu-us-trade-agreement-eu-economy-commissioner-dombrovskis",
      "published": "Fri, 30 Jan 2026 16:56:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "British girl, 7, missing after being hit by wave in Morocco",
      "description": "A seven-year-old girl is missing after she was \"swept away by a wave\" in Morocco, an MP has said.",
      "url": "https://news.sky.com/story/british-girl-7-missing-after-being-hit-by-wave-in-morocco-13500826",
      "published": "Thu, 29 Jan 2026 21:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Canadian company says Virginia warehouse sale to ICE won't proceed",
      "description": "A Canadian company has decided not to sell a Virginia warehouse to the U.S. Department of Homeland Security",
      "url": "https://abcnews.go.com/International/wireStory/canadian-company-virginia-warehouse-sale-ice-proceed-129721245",
      "published": "Fri, 30 Jan 2026 18:09:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Reaching a child in Darfur is ‘hard-won and fragile’, says UNICEF",
      "description": "Reaching a single child in Sudan’s Darfur region can take days of negotiations, security clearances and travel across sandy roads that cut through shifting frontlines, UNICEF warned Friday – as children live “on the brink” of survival.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166861",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Potential turning point for Gaza as peace plan enters second phase: UN envoy",
      "description": "The start of a second phase of a stabilisation plan for Gaza offers a potential turning point for the war-ravaged enclave, a senior UN official told the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166852",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN says Gaza crisis remains dire, children hardest hit",
      "description": "Despite a modest increase in humanitarian assistance, the situation in Gaza remains “dire”, with children among the hardest hit by shortages of shelter, basic services and education, the United Nations said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166842",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "LAPD chief defies Newsom's mask ban for federal immigration agents citing safety concerns",
      "description": "The LAPD won't enforce California's ban on masked federal immigration agents, citing public safety concerns during ongoing ICE operations in Los Angeles.",
      "url": "https://www.foxnews.com/us/lapd-chief-defies-newsoms-mask-ban-federal-immigration-agents-citing-safety-concerns",
      "published": "Fri, 30 Jan 2026 17:50:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Seattle mayor pushes local police to track, investigate ICE agents' enforcement activities",
      "description": "Seattle mayor Katie Wilson is banning federal immigration agents from city property, requires police documentation of interactions following Minneapolis events.",
      "url": "https://www.foxnews.com/us/seattle-mayor-pushes-local-police-track-investigate-ice-agents-enforcement-activities",
      "published": "Fri, 30 Jan 2026 14:46:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump admin labels Israel 'model US ally' ahead of major military aid talks",
      "description": "Trump's new National Defense strategy positions Israel as a \"model ally\" in Middle East doctrine, fundamentally reshaping U.S. military aid discussions.",
      "url": "https://www.foxnews.com/world/trump-admin-labels-israel-model-us-ally-ahead-major-military-aid-talks",
      "published": "Fri, 30 Jan 2026 06:30:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Former CNN host Don Lemon charged in anti-ICE protest at Minnesota church",
      "description": "Lemon says he was just doing his job as a journalist reporting on the protests at the church.",
      "url": "https://www.bbc.com/news/articles/c24gm3dz36po?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 01:25:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Australia’s grid now relies on renewable energy as much as coal. Those who doubted it look foolish",
      "description": "Solar met the majority of electricity demand between 9am and 6pm in the past week as much of the country cranked air conditioners Get our breaking news email , free app or daily news podcast Australia’s power grid is changing rapidly – so rapidly that it can feel difficult to keep up. This week, as an oppressive heatwave in the country’s south-east rewrote temperature records, there was also plenty of evidence demonstrating just how fast long-held assumptions about the electricity system are being overturned. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/31/australias-grid-now-relies-on-renewable-energy-as-much-as-coal-those-who-doubted-it-look-foolish",
      "published": "Fri, 30 Jan 2026 14:00:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Day and night, there’s no relief: five ways this heatwave is one of Australia’s worst on record",
      "description": "Soaring temperatures, heat at altitude and hot summer nights combine to create one of south-eastern Australia’s ‘most significant’ heatwaves Get our breaking news email , free app or daily news podcast Heatwaves and hot days during an Australian summer may seem unremarkable. Days spent at the beach, sunburn and mosquitoes are part of the national psyche, along with outback pubs serving crisp lager as relief from searing afternoon heat. But when the opal mining town of Andamooka (population 262) in the far north of South Australia reached 50 degrees on Thursday, it was only the eighth time in recorded history anywhere in Australia. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/31/day-and-night-theres-no-relief-five-ways-this-heatwave-is-one-of-australias-worst-on-record",
      "published": "Fri, 30 Jan 2026 14:00:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine updates: Kremlin says Trump asked Putin not to hit Kyiv until Feb. 1",
      "description": "The Kremlin announced that US President Donald Trump had asked Vladimir Putin to halt strikes on Kyiv until February 1. However, Ukraine reported that Russia launched one missile and over 100 drones overnight. Follow DW.",
      "url": "https://www.dw.com/en/ukraine-updates-kremlin-says-trump-asked-putin-not-to-hit-kyiv-until-feb-1/live-75726689?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 20:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Driverless Waymo vehicle strikes child in California",
      "description": "An autonomous vehicle in California struck a student near a school, but there were no injuries reported, the Santa Monica Police Department noted.",
      "url": "https://www.foxnews.com/us/driverless-waymo-vehicle-strikes-child-california",
      "published": "Fri, 30 Jan 2026 12:28:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Brief US government shutdown begins after funding deadline lapses",
      "description": "US gov't funding impasse driven by Democratic anger over federal agents killing two people during immigration crackdown.",
      "url": "https://www.aljazeera.com/news/2026/1/31/us-senate-approves-spending-package-but-short-government-shutdown-likely?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 03:09:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Panama supreme court cancels Hong Kong company’s canal contracts",
      "description": "Panama’s president says strategic waterway will operate as normal after ruling that advances US policy aims Panama’s president said ports at each end of the Panama canal would operate as usual after the country’s supreme court ruled the concession held by a subsidiary of a Chinese company was unconstitutional. The court’s decision on Thursday, which helps US attempts to block any Chinese influence over the strategic waterway, immediately drew a sharp rebuke from Beijing. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/court-ends-hong-kong-china-panama-canal-contracts",
      "published": "Fri, 30 Jan 2026 13:47:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US government enters partial shutdown",
      "description": "Funding for around three-quarters of federal operations has been affected after Congress failed to approve a 2026 budget. But the disruption is expected to be of short duration.",
      "url": "https://www.dw.com/en/us-government-enters-partial-shutdown/a-75737528?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 07:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "South Africa tells Israel's ambassador to leave",
      "description": "Ariel Seidman has been declared persona non grata by South Africa's foreign ministry. He has been given 72 hours to leave the country.",
      "url": "https://www.dw.com/en/south-africa-tells-israel-s-ambassador-to-leave/a-75729826?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 14:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Benin's 18-year-old cycling prodigy hopes to lead the way for more female cyclists",
      "description": "It is a first in the history of Beninese cycling. At just 18, Georgette Vignonfodo is heading off the roads of Benin to take her journey up a gear with training in Switzerland. She is hoping to lead the way for more of the continent's female cyclists. She is the first since 1960 to go to national competitions and join a continental team. FRANCE 24's team on the ground met her.",
      "url": "https://www.france24.com/en/benin-s-18-year-old-cycling-prodigy-hopes-to-lead-the-way-for-more-female-cyclists",
      "published": "Fri, 30 Jan 2026 16:37:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "China lifts sanctions on MPs and peers, Starmer says",
      "description": "China has lifted restrictions on some British MPs and peers and will now allow all parliamentarians to visit the country, Sir Keir Starmer has said.",
      "url": "https://news.sky.com/story/china-lifts-sanctions-on-mps-and-peers-starmer-says-13500981",
      "published": "Fri, 30 Jan 2026 10:05:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela approves bill to open up oil sector to private firms",
      "description": "Venezuela's interim president Delcy Rodriguez has signed a law opening the country's oil sector to privatisation.",
      "url": "https://news.sky.com/story/venezuela-approves-bill-to-open-up-oil-sector-to-private-firms-as-us-eases-sanctions-13500974",
      "published": "Fri, 30 Jan 2026 09:53:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Independent experts alarmed by child rights violations in US immigration procedures",
      "description": "UN-appointed independent human rights experts have raised alarm over violations of children’s rights during US immigration procedures, nearly a year after federal funding for legal representation for unaccompanied minors was terminated.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166837",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "ICE lodges detainer for illegal immigrant accused of sexually assaulting teen",
      "description": "ICE lodged an arrest detainer against an illegal immigrant from Egypt accused of sexually assaulting a 16-year-old girl while she slept in her bed, according to federal authorities.",
      "url": "https://www.foxnews.com/us/ice-lodges-detainer-illegal-immigrant-accused-sexually-assaulting-teen",
      "published": "Fri, 30 Jan 2026 21:49:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Los Angeles hospice fraud reaches billions as Medicare providers scam federal system with fake companies",
      "description": "Hospice fraud explodes in Los Angeles with providers allegedly scamming $3.5 billion from Medicare through ghost patients and fraudulent sham companies.",
      "url": "https://www.foxnews.com/us/los-angeles-hospice-fraud-reaches-billions-medicare-providers-scam-federal-system-fake-companies",
      "published": "Fri, 30 Jan 2026 17:17:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Palestinian immigrant convicted of second murder-for-hire plot hatched from North Carolina cell",
      "description": "Convicted man plotted three murders from jail after pleading guilty to murder-for-hire scheme in shocking North Carolina federal criminal case.",
      "url": "https://www.foxnews.com/us/palestinian-immigrant-convicted-second-murder-for-hire-plot-hatched-north-carolina-cell",
      "published": "Fri, 30 Jan 2026 16:11:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Fox News Campus Radicals Newsletter: Dems target military college, anti-ICE nurse fury, more union follies",
      "description": "Stay up to date with the Fox News Campus Radicals newsletter, which brings you the in-depth investigative stories from college campuses nationwide.",
      "url": "https://www.foxnews.com/us/fox-news-campus-radicals-newsletter-anti-ice-nurse-fury-tpusa-snubbed-chicago-teachers-union-spotlight",
      "published": "Fri, 30 Jan 2026 15:23:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela releases all known American detainees after Maduro's capture and government takeover",
      "description": "All known American citizens detained in Venezuela have been released by interim authorities after the recent political upheaval in the country.",
      "url": "https://www.foxnews.com/world/venezuela-releases-all-known-american-detainees-following-maduro-capture-government-takeover",
      "published": "Fri, 30 Jan 2026 19:48:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump scores strategic win as Panama court ousts Hong Kong firm from canal ports",
      "description": "Panama's Supreme Court struck down a Hong Kong company's port operations near Panama Canal amid constitutional concerns. U.S. Secretary of State Rubio calls the decision encouraging.",
      "url": "https://www.foxnews.com/world/trump-scores-strategic-win-panama-court-ousts-hong-kong-firm-canal-ports",
      "published": "Fri, 30 Jan 2026 19:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
      "description": "The president’s son, notorious for explosive remarks on X, has ambitions to succeed his father.",
      "url": "https://www.bbc.com/news/articles/cdjnp9m8wvgo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 00:05:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran says ready for ‘fair’ talks with US but not ‘under shadow of threats’",
      "description": "Iran's foreign minister says missile programme not up for negotiation as Trump says sending more ships to the region.",
      "url": "https://www.aljazeera.com/news/2026/1/30/iran-says-ready-for-fair-talks-with-us-but-not-under-shadow-of-threats?traffic_source=rss",
      "published": "Fri, 30 Jan 2026 21:45:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. allies looking to China for deals as Trump threatens them with tariffs",
      "description": "President Trump's tariffs and rhetoric have spurred some longtime U.S. allies to diversify their trade ties away from the U.S. Some are going cap-in-hand to Asian superpowers China and India.",
      "url": "https://www.npr.org/2026/01/28/nx-s1-5688905/longtime-u-s-allies-are-shifting-trade-to-asia-due-to-trumps-tariffs-and-rhetoric",
      "published": "Wed, 28 Jan 2026 17:46:23 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Live: US approves major arms sales to Israel, Saudi Arabia as tensions mount with Iran",
      "description": "The US on Friday said it had approved billion-dollar arms sales to both Israel and Saudi Arabia, bolstering the defences of Washinton's Middle East allies amid fears US President Donald Trump is planning a military strike on Iran. Follow our live blog for the latest updates.",
      "url": "https://www.france24.com/en/asia-pacific/20260131-live-us-approves-major-arms-sales-to-israel-saudi-arabia-as-tensions-mount-with-iran",
      "published": "Sat, 31 Jan 2026 06:29:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza ceasefire improves aid access, but children still face deadly conditions",
      "description": "The fragile ceasefire in the Gaza Strip is making a difference to the lives of over a million children, and improving overall access to food - but more aid still needs to enter.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166835",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran to hold live-fire drills in Strait of Hormuz with US armada in Middle East",
      "description": "Iran announces live-fire military drills in Strait of Hormuz as Trump sends USS Abraham Lincoln carrier group to region amid escalating tensions.",
      "url": "https://www.foxnews.com/world/iran-hold-live-fire-drills-strait-hormuz-us-armada-middle-east",
      "published": "Thu, 29 Jan 2026 14:44:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "UK reopens Chagos Islands talks with US following Trump criticism of deal: reports",
      "description": "Chagos Islands talks between U.K. and U.S. reopened after President Donald Trump called the Mauritius deal an \"act of great stupidity\" as British Prime Minister Keir Starmer says discussions have resumed.",
      "url": "https://www.foxnews.com/world/uk-reopens-chagos-islands-talks-us-following-trump-criticism-deal-reports",
      "published": "Wed, 28 Jan 2026 22:16:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US eyes the Red Sea as Landau visits Africa",
      "description": "Washington says a visit by Deputy Secretary of State Christopher Landau to Africa aims to strengthen bilateral ties, but the timing raises questions about America's interests in the Red Sea corridor.",
      "url": "https://www.dw.com/en/us-eyes-the-red-sea-as-landau-visits-africa/a-75731780?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 16:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Gazans face question of returning to devastated homeland as Rafah crossing reopens",
      "description": "The reopening of the Rafah crossing feels like it should be an important moment. Symbolically, it is. From Sunday, people will be able to cross from Gaza to Egypt, and back again. Sort of.",
      "url": "https://news.sky.com/story/gazans-face-question-of-returning-to-devastated-homeland-as-rafah-crossing-reopens-13501090",
      "published": "Fri, 30 Jan 2026 14:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting president signs oil industry overhaul, easing state control to lure investors",
      "description": "Venezuela’s acting President Delcy Rodríguez has signed a law that will open the nation’s oil sector to privatization",
      "url": "https://abcnews.go.com/International/wireStory/venezuelas-acting-president-signs-oil-industry-overhaul-easing-129682040",
      "published": "Fri, 30 Jan 2026 00:57:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Murder suspects among 8 inmates who escaped Louisiana jail; manhunt launched",
      "description": "A manhunt is underway for five of eight inmates who escaped a Louisiana prison Friday. Louisiana State Police has taken the lead in the search.",
      "url": "https://www.foxnews.com/us/murder-suspects-among-8-inmates-escaped-louisiana-jail-manhunt-launched",
      "published": "Fri, 30 Jan 2026 19:10:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Married real estate mogul allegedly offered contractor millions to leave husband, lawsuit claims",
      "description": "Real Brokerage CEO accused of offering contractor $500K cash and $3M home to leave husband in shocking lawsuit that allegedly destroyed her marriage.",
      "url": "https://www.foxnews.com/us/married-real-estate-mogul-allegedly-offered-aide-millions-leave-husband-lawsuit-claims",
      "published": "Fri, 30 Jan 2026 17:52:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela's acting president overhauls oil industry amid pressure from Trump administration",
      "description": "Venezuela's acting president signs law ending state oil monopoly, reversing decades of socialist policy to allow private companies control of the industry.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-president-overhauls-oil-industry-amid-pressure-from-trump-administration",
      "published": "Fri, 30 Jan 2026 13:43:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "This tiny Australian town is up for sale - but the locals don't want to leave",
      "description": "Residents say the sale of Licola - population, five - jeopardises its future.",
      "url": "https://www.bbc.com/news/articles/c3wz49z6gyyo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 19:02:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Senegal and Morocco fined and players banned after African Cup final chaos",
      "description": "Africa's soccer body issued fines worth more than $1 million and banned Senegal's coach and Senegalese and Morocco players Wednesday following a shambolic African Cup soccer final this month.",
      "url": "https://www.npr.org/2026/01/29/g-s1-107750/senegal-morocco-fined-african-cup-final-chaos",
      "published": "Thu, 29 Jan 2026 05:27:40 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Minneapolis: Thousands rally against Trump immigration blitz",
      "description": "Rallies against the Trump administration's hardline immigration tactics were also reported in other cities, such as Los Angeles. It comes as the US Justice Department opened a probe into the killing of Alex Pretti.",
      "url": "https://www.dw.com/en/minneapolis-thousands-rally-against-trump-immigration-blitz/a-75736782?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 03:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Berlin hospital raises alarm over serious winter injuries",
      "description": "Berlin's Charité hospital wrote out a social media post to raise concerns about the high number of injuries linked to icy conditions.",
      "url": "https://www.dw.com/en/berlin-hospital-raises-alarm-over-serious-winter-injuries/a-75736287?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 20:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Are the West's tightening oil sanctions finally taking their toll on Russia’s economy?",
      "description": "Russian oil and gas revenue fell by a fifth in 2025 to their lowest point in five years. But while Western sanctions have no doubt played a role, experts remain unconvinced that Moscow's growing budget problems will change its determination to continue its grinding advance across Ukraine.",
      "url": "https://www.france24.com/en/europe/20260131-are-the-west-tightening-oil-sanctions-finally-taking-toll-russia-economy",
      "published": "Sat, 31 Jan 2026 06:56:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Coast Guard searching for survivors after commercial fishing boat sinks off Massachusetts; 1 body recovered",
      "description": "The Coast Guard is searching Massachusetts waters after fishing vessel Lily Jean reportedly sank off Cape Ann with seven aboard, including an NOAA observer.",
      "url": "https://www.foxnews.com/us/coast-guard-searching-survivors-after-commercial-fishing-boat-sinks-off-massachusetts-1-body-recovered",
      "published": "Fri, 30 Jan 2026 20:09:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Canadian actress Catherine O'Hara dies at 71",
      "description": "Catherine O'Hara was famous for starring roles in the series \"Schitt's Creek\" and the \"Home Alone\" movies. She got her start with the Second City Toronto comedy troupe in the 1970s before her career in Hollywood.",
      "url": "https://www.dw.com/en/canadian-actress-catherine-o-hara-dies-at-71/a-75736335?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 21:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Man City boss gives passionate speech in support of Palestinian children",
      "description": "​​​​​​​Pep Guardiola has given a passionate speech in support of Palestinian children and called for action.",
      "url": "https://news.sky.com/story/pep-guardiola-gives-passionate-speech-in-support-of-palestinian-children-13501005",
      "published": "Fri, 30 Jan 2026 10:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Yemen: Security Council votes on final extension of Hudaydah Mission",
      "description": "The Security Council adopted a resolution on Tuesday that renews the mandate of the UN Mission in the Yemeni port city of Hudaydah for a final two-month period through 31 March of this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166844",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Takeaways from the millions of newly released Epstein files",
      "description": "Three million new documents include hundreds of mentions of Trump and emails between Epstein and a person called \"The Duke\".",
      "url": "https://www.bbc.com/news/articles/cevnmxyy4wjo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 03:26:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Schitt's Creek and Home Alone star Catherine O'Hara dies aged 71",
      "description": "The Emmy-winning actress died at her home in Los Angeles on Friday after a brief illness, her agent said.",
      "url": "https://www.bbc.com/news/articles/czr4jn4621lo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 01:30:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What we learned - and didn't - from the Melania documentary",
      "description": "Melania, directed by Brett Ratner, provides a fleeting glimpse into the life of the enigmatic first lady.",
      "url": "https://www.bbc.com/news/articles/cwy1ed1vgxro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 03:03:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US government partially shuts down despite last minute funding deal",
      "description": "The soonest the US House of Representatives can vote on the funding deal and end the shutdown is Monday.",
      "url": "https://www.bbc.com/news/articles/ce8rk33dpvmo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 05:10:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran wants to make deal rather than face military action, Trump says",
      "description": "Tehran has said it will never negotiate on its missile and defence systems, but that it is open to talks.",
      "url": "https://www.bbc.com/news/articles/cd9ew2kwj0lo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 21:43:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada's Poilievre re-elected Conservative party leader",
      "description": "The opposition leader secured 87.4% of delegates' vote, despite recent electoral losses against the Liberals.",
      "url": "https://www.bbc.com/news/articles/c14r1023yy6o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 07:06:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mali lawmaker jailed in Ivory Coast for insulting president",
      "description": "Prosecutors say Mamadou Hawa Gassama described Alassane Ouattara as a \"tyrant\" and \"an enemy of Mali\".",
      "url": "https://www.bbc.com/news/articles/c74vgxp0zr4o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 18:09:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Stay or go - what's next for coyote that escaped to Alcatraz?",
      "description": "The canine is surviving on a diet of birds after swimming to the isolated prison island.",
      "url": "https://www.bbc.com/news/articles/c0q4y95yv4jo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 02:49:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza’s collapsing economy drives youth to create unconventional solutions",
      "description": "Innovation becomes a go-to strategy for Gaza's youth as they battle unemployment in a hostile economic environment.",
      "url": "https://www.aljazeera.com/features/2026/1/31/gazas-collapsing-economy-drives-youth-to-create-unconventional-solutions?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 07:38:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Shipping giant Maersk to take over Panama Canal ports after court ruling",
      "description": "Danish company will replace Hong Kong-based firm after Trump claimed strategic waterway was controlled by China.",
      "url": "https://www.aljazeera.com/news/2026/1/31/shipping-giant-maersk-to-take-over-panama-canal-ports-after-court-ruling?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 06:44:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting President Delcy Rodriguez announces prisoner amnesty",
      "description": "Rodriguez calls for healing 'wounds left by political confrontation' and says notorious El Helicoide prison to shut.",
      "url": "https://www.aljazeera.com/news/2026/1/31/venezuelas-acting-president-delcy-rodriguez-announces-prisoner-amnesty?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 06:17:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How does ICE spend its budget? And who profits?",
      "description": "ICE now has a larger budget than the FBI, bigger even than the militaries of 170 countries. So where does that money go?",
      "url": "https://www.aljazeera.com/video/by-the-numbers-3/2026/1/31/how-does-ice-spend-its-budget-and-who-profits?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 05:49:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.2 - 8 km NE of Black Eagle, Montana",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - V Time 2026-01-29 19:41:09 UTC 2026-01-29 19:41:09 UTC at epicenter Location 47.585°N 111.202°W Depth 22.47 km (13.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000s5ba",
      "published": "2026-01-31T02:21:29.482Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 5.5 - 9 km ESE of Dianga, China",
      "description": "PAGER - YELLOW ShakeMap - VII DYFI? - IV Time 2026-01-26 06:56:02 UTC 2026-01-26 06:56:02 UTC at epicenter Location 34.028°N 103.305°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rs2q",
      "published": "2026-01-27T07:23:20.332Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela announces amnesty bill that could lead to release of political prisoners",
      "description": "Venezuela's acting President Delcy Rodríguez on Friday announced an amnesty bill that could lead to the release of hundreds of prisoners detained for political reasons.",
      "url": "https://www.npr.org/2026/01/31/g-s1-108127/venezuela-amnesty-bill",
      "published": "Sat, 31 Jan 2026 01:55:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Voices from Iran: women defy fear in the face of brutal crackdown",
      "description": "Amid Iran's deadly crackdown, three women share their stories of resistance, fear and an unyielding hope for freedom.",
      "url": "https://www.npr.org/2026/01/30/nx-s1-5688912/iran-women-crackdown",
      "published": "Fri, 30 Jan 2026 13:28:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: Interim president proposes amnesty bill",
      "description": "Venezuelan acting President Delcy Rodriguez announced a general amnesty bill that could see the release of hundreds of political prisoners, including opposition leaders, journalists and human rights activists.",
      "url": "https://www.dw.com/en/venezuela-interim-president-proposes-amnesty-bill/a-75737147?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 02:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Justice Department releases more Epstein files",
      "description": "The US Department of Justice has said it released 3 million more pages of documents from the Epstein files. Some Democratic politicians have questioned whether all the files have been made public as legally required.",
      "url": "https://www.dw.com/en/us-justice-department-releases-more-epstein-files/a-75736606?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 22:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "An undying trend: How vampires hold a mirror to society",
      "description": "As the horror movie \"Sinners\" stands poised to sweep the Oscars, we take a look at how and why the vampire genre has long captivated audiences — from folklore to film. Is this trend truly immortal?",
      "url": "https://www.dw.com/en/an-undying-trend-how-vampires-hold-a-mirror-to-society/a-75681267?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 16:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Is US president Trump more popular than polls suggest?",
      "description": "Donald Trump's first year has been marked by cuts, controversies and little congressional constraint. Polls show he is nearing record low approval ratings, but he still holds sway with one critical group.",
      "url": "https://www.dw.com/en/is-us-president-trump-more-popular-than-polls-suggest/a-75726754?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 15:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU asylum policy: What changes for refugees in Germany?",
      "description": "The German government is about to implement the EU's Common European Asylum System (CEAS) to limit irregular migration and speed up asylum procedures.",
      "url": "https://www.dw.com/en/eu-asylum-policy-what-changes-for-refugees-in-germany/a-75728293?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 15:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Justice department releases new batch of Epstein files citing Musk, Trump, Mountbatten-Windsor",
      "description": "The US Justice Department on Friday released more than 3 million pages of documents from its investigative files on disgraced financier Jeffrey Epstein. The latest release includes thousands of references to US President Donald Trump, hundreds to Andrew Mountbatten-Windsor, formerly known as Britain’s Prince Andrew, and details of conversations with billionaire Tesla founder Elon Musk.",
      "url": "https://www.france24.com/en/americas/20260131-us-justice-department-releases-new-batch-of-epstein-files-citing-musk-trump-mountbatten-windsor",
      "published": "Sat, 31 Jan 2026 06:01:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela announces amnesty push targeting mass release of political prisoners",
      "description": "Venezuela's interim President Delcy Rodriguez on Friday announced plans for a \"general amnesty\" law that could trigger the mass release of political prisoners. Rodriguez also proposed the closure of the notorious El Helicoide prison in Caracas, where rights groups say political prisoners were tortured by ousted leader Nicolas Maduro's intelligence services.",
      "url": "https://www.france24.com/en/americas/20260131-venezuela-announces-amnesty-push-targeting-mass-release-of-political-prisoners",
      "published": "Sat, 31 Jan 2026 01:37:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Catherine O'Hara, 'Schitt's Creek' and 'Home Alone' star, dies at 71",
      "description": "Catherine O'Hara, the Emmy-winning Canadian and American actress who starred as Kevin's beleaguered mother in “Home Alone”, has died at the age of 71, her agents announced on Friday.",
      "url": "https://www.france24.com/en/culture/20260130-catherine-o-hara-schitt-s-creek-and-home-alone-star-dies-at-71",
      "published": "Fri, 30 Jan 2026 18:47:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Justice Department releases 3 million pages of new Epstein files",
      "description": "The US Justice Department said Friday that it was releasing a new cache of millions of documents from its investigative files on Jeffrey Epstein, resuming disclosures under a law intended to reveal what the government knew about the millionaire financier's sexual abuse of young girls.",
      "url": "https://www.france24.com/en/americas/20260130-us-justice-department-releases-3-million-pages-of-new-epstein-files",
      "published": "Fri, 30 Jan 2026 16:31:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Macaulay Culkin pays tribute to Home Alone star Catherine O'Hara",
      "description": "Catherine O'Hara, the Emmy-winning actress who starred as Kevin's mother in Home Alone and the eccentric Moira Rose in Schitt's Creek, has died.",
      "url": "https://news.sky.com/story/catherine-ohara-who-starred-in-home-alone-and-schitts-creek-has-died-13500698",
      "published": "Thu, 29 Jan 2026 16:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Astronauts are about to go back to the moon - here's what you need to know",
      "description": "NASA is poised to send astronauts around the moon and back for the first time in more than 50 years.",
      "url": "https://news.sky.com/story/everything-to-know-about-artemis-ii-the-nasa-mission-to-send-astronauts-around-the-moon-13497536",
      "published": "Sat, 31 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump endorses deal struck with Democrats to avert government shutdown",
      "description": "Donald Trump has endorsed a spending deal negotiated by US Senate Republicans and Democrats that would stave off a government shutdown and temporarily fund the Department of Homeland Security.",
      "url": "https://news.sky.com/story/trump-endorses-deal-struck-with-democrats-to-avert-government-shutdown-13500874",
      "published": "Fri, 30 Jan 2026 00:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "After Mexico bans vapes, cartels tighten their grip on a booming market",
      "description": "Organized crime in Mexico is tightening its grip on the vape market, a $1.5 billion industry",
      "url": "https://abcnews.go.com/International/wireStory/after-mexico-bans-vapes-cartels-tighten-grip-booming-129728214",
      "published": "Sat, 31 Jan 2026 01:10:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraqi calligrapher's handwritten Quran ends 6 years of artistry and craft",
      "description": "Iraqi calligrapher Ali Zaman has completed a colossal handwritten Quran manuscript after six years of work",
      "url": "https://abcnews.go.com/International/wireStory/iraqi-calligraphers-handwritten-quran-ends-6-years-artistry-129727158",
      "published": "Sat, 31 Jan 2026 00:09:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Chile's far-right president-elect visits El Salvador mega-prison, plans to talk security with Bukele",
      "description": "Chile’s far-right President-elect José Antonio Kast visited El Salvador’s mega-prison for accused gang members ahead of a meeting with President Nayib Bukele to discuss organized crime",
      "url": "https://abcnews.go.com/International/wireStory/chiles-president-elect-visits-el-salvador-mega-prison-129720506",
      "published": "Fri, 30 Jan 2026 17:45:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cubans scramble to survive as US vise on island tightens in push to oust government",
      "description": "Cubans are hustling to become more self-sufficient as the U.S. government tightens its economic noose over the communist-run island in a move experts say is meant to force a popular uprising and usher in a new government",
      "url": "https://abcnews.go.com/International/wireStory/cubans-scramble-survive-us-vise-island-tightens-push-129708915",
      "published": "Fri, 30 Jan 2026 12:54:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "London's Poems on the Underground celebrates 40 years of bringing verses to commuters",
      "description": "Judith Chernaik, an American writer in London, started the Poems on the Underground project 40 years ago",
      "url": "https://abcnews.go.com/International/wireStory/londons-poems-underground-celebrates-40-years-bringing-verses-129708062",
      "published": "Fri, 30 Jan 2026 12:54:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark unveils legal reform to allow the worst foreign criminals to be deported",
      "description": "Denmark has unveiled a deportation reform under which foreigners who are convicted of serious crimes, like aggravated assault and rape, would be expelled",
      "url": "https://abcnews.go.com/International/wireStory/denmark-unveils-legal-reform-worst-foreign-criminals-deported-129700110",
      "published": "Fri, 30 Jan 2026 08:38:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's army chief accuses US Embassy officials of aiding hiding opposition figure",
      "description": "Uganda’s army chief accused U.S. Embassy officials of helping opposition leader Bobi Wine as he went into hiding",
      "url": "https://abcnews.go.com/International/wireStory/ugandas-army-chief-accuses-us-embassy-officials-aiding-129695220",
      "published": "Fri, 30 Jan 2026 04:58:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hong Kong company’s concession to operate Panama Canal ports is ruled unconstitutional",
      "description": "Panama’s Supreme Court has ruled that the concession held by a subsidiary of Hong Kong’s CK Hutchison Holdings to operate ports at either end of the Panama Canal was unconstitutional, an outcome that advances a U.S. aim to block any influence by China ...",
      "url": "https://abcnews.go.com/International/wireStory/hong-kong-companys-concession-operate-panama-canal-ports-129690068",
      "published": "Thu, 29 Jan 2026 23:37:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mexico's Sheinbaum reiterates sovereignty in Trump call after Olympic snowboarder detained",
      "description": "Mexican President Claudia Sheinbaum and U.S. President Donald Trump spoke over the phone on Thursday in the midst of a controversy over the arrest of a former Olympic snowboarder",
      "url": "https://abcnews.go.com/International/wireStory/mexicos-sheinbaum-reiterates-sovereignty-trump-call-after-olympic-129679711",
      "published": "Thu, 29 Jan 2026 15:05:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope tells Vatican office that processes sex abuse cases to uphold truth, justice and charity",
      "description": "Pope Leo XIV has told the Vatican doctrine office to uphold truth, justice and charity when deciding clergy sex abuse cases",
      "url": "https://abcnews.go.com/International/wireStory/pope-tells-vatican-office-processes-sex-abuse-cases-129674642",
      "published": "Thu, 29 Jan 2026 12:10:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Costa Ricans support Chaves’ successor in the presidential election as crime remains high",
      "description": "Costa Ricans appear ready to vote to continue supporting the program of outgoing President Rodrigo Chaves in Sunday’s presidential election",
      "url": "https://abcnews.go.com/International/wireStory/costa-ricans-support-chaves-successor-presidential-election-crime-129673003",
      "published": "Thu, 29 Jan 2026 23:53:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Father claims daughter accused of sex crimes with Florida middle schoolers is the 'real victim'",
      "description": "A Florida woman back in jail after being arrested again has faced multiple charges of sexual abuse of minors, but her father argues she is the victim.",
      "url": "https://www.foxnews.com/us/father-claims-daughter-accused-sex-crimes-florida-middle-schoolers-real-victim",
      "published": "Fri, 30 Jan 2026 18:38:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida couple sues fertility clinic after allegedly giving birth to someone else's baby",
      "description": "White couple sues Florida fertility clinic after giving birth to baby who appeared \"racially non-Caucasian,\" genetic testing allegedly confirms embryo mix-up.",
      "url": "https://www.foxnews.com/us/florida-couple-sues-fertility-clinic-allegedly-giving-birth-someone-elses-baby",
      "published": "Fri, 30 Jan 2026 17:35:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "California man arrested after fortified underground bunker found with weapons cache",
      "description": "California authorities discovered an underground bunker allegedly filled with illegal guns and ammunition after investigating a marijuana operation.",
      "url": "https://www.foxnews.com/us/california-man-arrested-after-fortified-underground-bunker-found-weapons-cache",
      "published": "Fri, 30 Jan 2026 14:35:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New Ghislaine Maxwell mugshot included in DOJ's latest Epstein files release",
      "description": "The DOJ released never-before-seen Ghislaine Maxwell mugshot from 2020 arrest alongside 3 million pages of materials related to Jeffrey Epstein.",
      "url": "https://www.foxnews.com/us/new-ghislaine-maxwell-mugshot-included-dojs-latest-epstein-files-release",
      "published": "Fri, 30 Jan 2026 14:31:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fox News True Crime Newsletter: Ruby Franke exposed, Elizabeth Smart horror twist, Idaho murders photo chaos",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-ruby-franke-exposed-elizabeth-smart-horror-twist-idaho-murders-photo-chaos",
      "published": "Fri, 30 Jan 2026 13:05:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel set to reopen Gaza’s Rafah border crossing with Egypt for first time since May 2024",
      "description": "Israel announced that the Rafah border crossing between Egypt and the Gaza Strip will reopen \"for limited movement of people only\" on Sunday, Feb. 1.",
      "url": "https://www.foxnews.com/world/israel-set-reopen-gazas-rafah-border-crossing-egypt-first-time-since-may-2024",
      "published": "Fri, 30 Jan 2026 13:34:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "80-year-old lottery winner sentenced for bankrolling $400M drug empire from cottage with son",
      "description": "Lottery winner John Eric Spiby, 80, was sentenced to 16 years in prison for running a $400 million counterfeit pill empire from his cottage after a 2010 windfall.",
      "url": "https://www.foxnews.com/world/80-year-old-lottery-winner-sentenced-bankrolling-400m-drug-empire-cottage-son",
      "published": "Thu, 29 Jan 2026 20:58:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK's Starmer meets Xi in Beijing as Trump pressures allies on China trade",
      "description": "U.K. Prime Minister Keir Starmer meets Chinese President Xi Jinping, while President Donald Trump attempts to dissuade allies from Beijing.",
      "url": "https://www.foxnews.com/world/uks-starmer-meets-xi-beijing-trump-pressures-allies-china-trade",
      "published": "Thu, 29 Jan 2026 14:20:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China executes 11 people convicted in scam crackdown",
      "description": "Chinese authorities on Thursday announced they executed 11 people convicted in a massive cross-border fraud scheme worth roughly $1.4 billion.",
      "url": "https://www.foxnews.com/world/china-executes-11-people-convicted-scam-crackdown",
      "published": "Thu, 29 Jan 2026 07:38:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}