{
  "last_updated": "2026-01-14T22:24:35.803820Z",
  "event_count": 221,
  "events": [
    {
      "title": "'Most Iranians realise that any US military action puts a further target on their backs'",
      "description": "Iran's top judge hinted at fast trials and executions for those who were detained in nationwide protests against the country's theocracy, Rochelle Ferguson Bouyahi welcomes Scott Lucas, Professor of American Studies & International Politics at the Clinton Institute, University College Dublin. Professor Lucas notes a significant shift in the Iranian regime’s stance, saying it now claims the protests are being manipulated, or even orchestrated, by the US and Israel. Authorities are labelling the protesters as domestic terrorists.",
      "url": "https://www.france24.com/en/most-iranians-realise-that-any-us-military-action-puts-a-further-target-on-their-backs",
      "published": "Wed, 14 Jan 2026 15:53:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 48,
      "severity_level": "Critical"
    },
    {
      "title": "Security Council LIVE: Attacks against Ukrainian civilians unacceptable, unjustifiable and must stop, says UN",
      "description": "The UN Security Council is meeting in emergency session in New York over Russia’s ongoing deadly missile and drone strikes targeting Ukrainian civilians and energy infrastructure, as frigid winter conditions grip the war-torn country. Millions have been deprived of electricity, heating and water. The UN Secretary-General has called the stepped up attacks an unacceptable violation of international humanitarian law. Follow live below and find all our in-depth meetings coverage here. UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166743",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Quarter of developing countries poorer than in 2019, World Bank finds",
      "description": "Global growth ‘downshifted’ since Covid pandemic and sub-Saharan Africa particularly affected, report says Business live – latest updates A quarter of countries in the developing world are poorer than they were in 2019 before the Covid pandemic, the World Bank has found. The Washington-based organisation said a large group of low-income countries, many in sub-Saharan Africa, had suffered a negative shock in the six years to the end of last year. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/13/developing-countries-poorer-world-bank-report",
      "published": "Tue, 13 Jan 2026 14:30:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s other Latin American feud: why Colombia’s Petro is not Maduro",
      "description": "Leftwing leader rallies his supporters as US president accuses him of drug trafficking and threatens military action A leftwing South American firebrand calls for his followers to rally in public squares nationwide to defend his country’s sovereignty and decry verbal attacks from Donald Trump. The US president accuses the leader of personally flooding American streets with illegal drugs and imposes sanctions against him and his wife. Threats of military action are followed by a phone conversation between the two leaders. One might imagine that this is a description of the buildup of tensions that led to the 3 January special forces raid on Caracas to capture the Venezuelan leader, Nicolás Maduro, and his wife, Cilia Flores, to face several criminal charges in New York. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/12/trump-latin-america-feud-colombia-gustavo-petro",
      "published": "Mon, 12 Jan 2026 12:07:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "No power or water and -19C: Kyiv seeks relief from Russian strikes and cold",
      "description": "Residents of Ukraine's capital talk about their difficulties keeping warm and enduring power outages, as Russian attacks deepen the energy crisis.",
      "url": "https://www.bbc.com/news/articles/cgm4w1g3dggo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 07:43:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Global employment stable but decent jobs in short supply",
      "description": "Global unemployment remains stable, but progress toward decent work has stalled, according to a new report from the International Labour Organization (ILO), which warns that young people continue to struggle in a job market which risks being further undermined by AI and trade policy uncertainty.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166751",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "At least 28 killed as crane collapses on train in Thailand",
      "description": "Crane in use on high-speed rail project hits passing train, causing it to derail At least 28 people in Thailand have been killed and scores injured after a crane collapsed on to a passenger train and derailed it, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars and smoke rising from the wreckage of the train below. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths",
      "published": "Wed, 14 Jan 2026 15:44:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Ending famine, refugee solidarity in Kenya, Ukraine civilian casualties update",
      "description": "The head of the UN’s emergency food agency has urged world leaders on Monday to end “man-made famines” and conflicts that “drive hunger and desperation”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166744",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Two weeks on, questions linger over targeting and impact of US airstrikes in Nigeria",
      "description": "Very little information has been shared about strikes in Sokoto state Two weeks after the US carried out Christmas Day airstrikes in north-west Nigeria on what it described as Islamic State fighters, questions remain over the specific group that was targeted and the operation’s impact. In the aftermath of the strikes, Donald Trump said in a post on his Truth Social platform that “ISIS Terrorist Scum in Northwest Nigeria , who have been targeting and viciously killing, primarily, innocent Christians” were hit with “numerous perfect strikes”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/questions-targeting-impact-us-airstrikes-in-nigeria",
      "published": "Thu, 08 Jan 2026 05:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "G7 threatens Iran with new sanctions over nationwide protest crackdown killing thousands",
      "description": "Iran protests death toll reaches over 2,400, according to Human Rights Activist News Agency as G7 foreign ministers warn of new sanctions over regime's violent response.",
      "url": "https://www.foxnews.com/world/g7-threatens-iran-new-sanctions-nationwide-protest-crackdown-killing-thousands",
      "published": "Wed, 14 Jan 2026 15:22:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "US plan to exploit Venezuela’s oil could eat up 13% of carbon budget to keep 1.5C limit",
      "description": "Exclusive: ClimatePartner analysis shows how move would risk plunging Earth further into climate catastrophe US plans to exploit Venezuela’s oil reserves could by 2050 consume more than a tenth of the world’s remaining carbon budget to limit global heating to 1.5C, according to an exclusive analysis. The calculation highlights how any moves to further exploit the South American nation’s oil reserves – the largest in the world, at least on paper – would put increasing pressure on climate goals, and risk plunging the Earth further into climate catastrophe. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/12/us-plan-to-exploit-venezuelas-oil-could-eat-up-13-of-carbon-budget-to-keep-15c-limit",
      "published": "Mon, 12 Jan 2026 17:38:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Suspected Venezuelan gangster in Portland CBP attack tied to shooting at apartment complex: police",
      "description": "An alleged Venezuelan gang member's wife was linked to an earlier shooting before a federal confrontation that left both suspects wounded during a Portland traffic stop.",
      "url": "https://www.foxnews.com/us/suspected-venezuelan-gangster-portland-cbp-attack-tied-shooting-apartment-complex-police",
      "published": "Tue, 13 Jan 2026 19:36:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Police believe gun in Ohio dentist slayings tied to surgeon ex as family flags warnings",
      "description": "Columbus police recover weapon with preliminary link to Spencer and Monique Tepe homicides, calling it targeted domestic violence attack by ex-husband.",
      "url": "https://www.foxnews.com/us/surgeon-ohio-dentist-double-murder-allegedly-used-fake-addresses-dodge-lawsuits-he-just-disappeared",
      "published": "Wed, 14 Jan 2026 10:47:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "US launches wave of strikes in Somalia targeting ISIS, al-Shabab terror threats",
      "description": "U.S. Africa Command General Michael E. Langley warns of jihadi threat to homeland as airstrikes against al-Shabab and ISIS-Somalia intensify under Trump administration.",
      "url": "https://www.foxnews.com/world/us-launches-wave-strikes-somalia-targeting-isis-al-shabab-terror-threats",
      "published": "Tue, 13 Jan 2026 20:56:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Greenland: Denmark and Greenland FMs meet Vance, Rubio at White House",
      "description": "The foreign ministers of Denmark and Greenland are meeting at the White House today after President Donald Trump once again reiterated his desire for the United States to control Greenland, the world’s largest island. In a post on Truth Social earlier today, Trump said that anything short of Greenland being “in the hands” of the US was “unacceptable,” adding that NATO would become “more effective” if the island were under American control. His remarks came just hours before the Danish and Greenlandic ministers arrived in Washington for urgent talks with Secretary of State Marco Rubio and Vice President JD Vance, as Denmark simultaneously announced from Copenhagen that it would strengthen its military presence in Greenland with immediate effect. France24 International Affairs Editor Angela Diffley tells us more.",
      "url": "https://www.france24.com/en/video/20260114-greenland-denmark-and-greenland-fms-meet-vance-rubio-at-white-house",
      "published": "Wed, 14 Jan 2026 16:25:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly train accident in Thailand",
      "description": "At least 30 people were killed when a construction crane collapsed onto a moving train in northeastern Thailand, at the site of a planned high-speed rail project intended to eventually link China with much of Southeast Asia, reports Delano D’Souza.",
      "url": "https://www.france24.com/en/video/20260114-deadly-train-accident-in-thailand",
      "published": "Wed, 14 Jan 2026 14:43:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘A torture that never stops’: Sri Lanka failing survivors of conflict sexual violence, UN says",
      "description": "Conflict-related sexual violence in Sri Lanka remains largely unaddressed more than 15 years after the end of the civil war, with survivors still denied justice, recognition and reparations, according to a new report by the UN human rights office, OHCHR, on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166755",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Trump administration ends temporary protected status for Somalis in US",
      "description": "Critics condemn ‘bigoted attack’ as Trump bids to revoke citizenship of naturalized immigrants convicted of fraud The Trump administration is terminating temporary protected status (TPS) for Somalis living in the United States, giving hundreds of people two months to leave the country or face deportation. The homeland security secretary, Kristi Noem , said in a statement that conditions in the east African country had improved sufficiently and that Somalis no longer qualified for the designation under federal law. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/13/trump-administration-ends-tps-somalia",
      "published": "Tue, 13 Jan 2026 22:59:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: A ceasefire that still kills children is not enough, says UNICEF",
      "description": "Airstrikes, drone attacks and hypothermia continue in Gaza despite the ceasefire, with more than 100 youngsters killed since early October, the UN Children’s Fund (UNICEF) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166750",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Storms worsen already dire humanitarian situation, UN warns",
      "description": "The humanitarian crisis across the Gaza Strip remains extremely serious, with harsh winter weather threatening to reverse recent gains in aid delivery, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166747",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘shocked’ by reports of excessive force against protesters in Iran",
      "description": "The UN Secretary-General is shocked by reports of violence and excessive use of force by Iranian authorities against protesters across the country, urging restraint and the immediate restoration of communications as unrest enters its third week.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166739",
      "published": "Sun, 11 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Greetings from Acre, Israel, where an old fortress recalls the time of the Crusades",
      "description": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5669671/acre-israel-knights-fortress",
      "published": "Wed, 14 Jan 2026 09:35:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN World Court begins landmark hearings on Rohingya genocide case against Myanmar",
      "description": "Public hearings opened on Monday at the International Court of Justice (ICJ) in a landmark case brought by the Gambia against Myanmar, alleging violations of the Genocide Convention over the military’s treatment of the Rohingya minority.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166746",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Multiple people killed after construction crane falls, derails train in Thailand",
      "description": "A deadly construction accident unfolded in northeastern Thailand when a crane collapsed onto a moving passenger train, officials said.",
      "url": "https://www.foxnews.com/world/multiple-people-killed-after-construction-crane-falls-derails-train-thailand",
      "published": "Wed, 14 Jan 2026 03:07:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Attempt to overturn the Gambia’s ban on FGM heard by supreme court",
      "description": "Case brought by Muslim leaders and MP follows failed 2024 bid and seen as part of global anti-women’s rights backlash A group of religious leaders and an MP in the Gambia have launched efforts to overturn a ban on female genital mutilation at the country’s supreme court. The court case, due to resume this month, comes after two babies bled to death after undergoing FGM in the Gambia last year. Almameh Gibba, an MP and one of the plaintiffs, tabled a bill to decriminalise FGM that was rejected by the country’s parliament in 2024. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/09/the-gambia-female-genital-mutilation-fgm-supreme-court-case-overturn-ban",
      "published": "Fri, 09 Jan 2026 06:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran signals fast trials and executions for protesters, despite Trump's warning",
      "description": "Iran's judiciary head signaled Wednesday there would be fast trials and executions ahead for suspects detained in nationwide protests despite a warning from President Trump.",
      "url": "https://www.npr.org/2026/01/14/g-s1-105949/death-toll-crackdown-protests-iran",
      "published": "Wed, 14 Jan 2026 05:12:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "International Space Station crew to make emergency return to Earth",
      "description": "A medical emergency will force four astronauts aboard the International Space Station to return to Earth prematurely.",
      "url": "https://www.dw.com/en/international-space-station-crew-to-make-emergency-return-to-earth/a-75504766?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 15:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran updates: Tehran warns of fast trials, executions",
      "description": "The leader of Iran's judiciary has said there will be rapid trials and executions for those arrested in nationwide protests. Washington has threatened military action over the crackdown. DW has the latest.",
      "url": "https://www.dw.com/en/iran-updates-tehran-warns-of-fast-trials-executions/live-75498434?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 08:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Escalating fighting in Sudan, displacement in Syria’s Aleppo, $1.5 billion appeal for South Sudan",
      "description": "More civilians in Sudan continue to be killed and displaced as fighting escalates in multiple parts of the country, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166756",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: ‘The killing of peaceful demonstrators must stop,’ UN rights chief says",
      "description": "As anti-government demonstrations continue across Iran, the UN human rights chief said on Tuesday that he was horrified at the mounting violence directed by security forces against protestors, with reports of hundreds killed and thousands arrested.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166752",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime opened fire with live ammunition on protesters, doctor says: ‘Shoot-to-kill’",
      "description": "Iranian protests that began Dec. 28 saw security forces shift to live ammunition by Jan. 8, with over 3,000 deaths estimated nationwide.",
      "url": "https://www.foxnews.com/world/iran-regime-opened-fire-live-ammunition-protesters-doctor-says-shoot-to-kill",
      "published": "Tue, 13 Jan 2026 18:57:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump admin labels Muslim Brotherhood branches as terrorist organizations",
      "description": "The U.S. designates the Lebanese, Jordanian and Egyptian chapters of the Muslim Brotherhood as terrorist organizations, saying they pose risks to the U.S.",
      "url": "https://www.foxnews.com/world/trump-admin-labels-muslim-brotherhood-branches-terrorist-organizations",
      "published": "Tue, 13 Jan 2026 11:13:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At least 32 killed after crane collapses on train in Thailand",
      "description": "Sixty-four people were left injured, including a one-year-old and an 85-year-old.",
      "url": "https://www.bbc.com/news/articles/ceqz7v1507ro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 13:30:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Beirut's Commodore Hotel, a haven for journalists during Lebanon's civil war, shuts down",
      "description": "Beirut’s Commodore Hotel, once a hub for foreign journalists during Lebanon’s civil war, has closed amid the country’s economic crisis",
      "url": "https://abcnews.go.com/International/wireStory/beiruts-commodore-hotel-haven-journalists-lebanons-civil-war-129192044",
      "published": "Wed, 14 Jan 2026 00:25:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine war: UN appeals for $2.3 billion to support aid teams’ ‘heroic work’",
      "description": "Amid ongoing and intensifying Russian attacks across Ukraine, the UN on Tuesday launched a $2.3 billion humanitarian appeal for 2026 to support 4.1 million of the country’s most vulnerable people.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166749",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Deadly Russian strikes push civilians deeper into winter crisis",
      "description": "Ukraine has entered the new year under intensifying and deadly Russian attacks which have crippled energy systems and left millions without heating, electricity or water amid freezing temperatures, senior UN officials told the Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166748",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Casey Anthony calls Minneapolis ICE shooting a crime, rips JD Vance for protecting ‘Gestapo’ agents",
      "description": "Casey Anthony, dubbed \"America's most hated mom,\" accuses federal authorities of shielding ICE agents from accountability in Minneapolis shooting death.",
      "url": "https://www.foxnews.com/us/casey-anthony-calls-minneapolis-ice-shooting-crime-rips-jd-vance-protecting-gestapo-agents",
      "published": "Wed, 14 Jan 2026 14:51:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iran pushes for fast trials and executions of suspects detained in protests despite Trump's warning: report",
      "description": "Iran chief justice Gholamhossein Mohseni-Ejei calls for fast trials and executions of suspects in ongoing anti-government demonstrations, a report said.",
      "url": "https://www.foxnews.com/world/iran-pushes-fast-trials-executions-suspects-detained-protests-despite-trumps-warning-report",
      "published": "Wed, 14 Jan 2026 11:05:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "How Trump's 'America First' is upending the world order",
      "description": "President Trump is dismantling the global system the U.S. built in the 20th century. Foreign policy experts say he wants a world that looks more like the 19th century.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5667212/how-trumps-america-first-is-upending-the-world-order",
      "published": "Wed, 14 Jan 2026 16:54:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Portugal: meet the DJ priest evangelising through electronic music",
      "description": "Priest by day, DJ by night: that's the life of Guilherme Peixoto, a Portuguese priest who has become a global icon. A fan of electronic music, he rose to fame after DJ'ing at the Church's World Youth Day in 2023, in front of 1.5 million people - but not everyone agrees with his approach. #portugal #dj #catholicism",
      "url": "https://www.france24.com/en/video/20260114-portugal-meet-the-dj-priest-evangelising-through-electronic-music",
      "published": "Wed, 14 Jan 2026 16:39:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran state TV acknowledges 'a lot of martyrs' as death toll surpasses 3,000: report",
      "description": "Iran state TV reportedly acknowledges 'martyrs' as death toll from ongoing anti-government protests reaches over 2,000, according to activist groups.",
      "url": "https://www.foxnews.com/world/iran-state-tv-acknowledges-a-lot-martyrs-death-toll-surpasses-3000-report",
      "published": "Tue, 13 Jan 2026 13:56:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Astronauts to begin return journey from space station due to 'medical concern'",
      "description": "Four astronauts are set to begin their return journey from the International Space Station (ISS) to Earth after their mission was cut short due to a \"medical concern\" with a crew member.",
      "url": "https://news.sky.com/story/astronauts-to-begin-return-journey-from-space-station-due-to-medical-concern-13494211",
      "published": "Wed, 14 Jan 2026 17:09:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "11-year streak of record global warming continues, UN weather agency warns",
      "description": "The past 11 years have been the warmest in the modern era, while oceans continue to heat up, too, says the UN weather agency.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166758",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Increase taxes on sugary drinks and alcohol to save lives, urges WHO",
      "description": "Beverages like sugary drinks and alcohol are too accessible and cost too little in most of the world – helping fuel obesity, diabetes, cancer and injury, the World Health Organization (WHO) warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166754",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Palestinian factions agree on membership of Gaza post-war governance committee, Egypt says",
      "description": "All 15 members of a Palestinian committee intended to administer post-war Gaza have been agreed upon by the parties included in the US-brokered ceasefire plan, Egypt's foreign ministry said on Wednesday. The US said the plan was ready to move into its second phase with the goal of disarming Hamas, rebuilding the devastated enclave and daily governance.",
      "url": "https://www.france24.com/en/middle-east/20260114-consensus-reached-on-gaza-post-war-governance-committee-egypt-says",
      "published": "Wed, 14 Jan 2026 17:31:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Minnesota anti-ICE agitators swarm, confront federal agents during enforcement operations",
      "description": "ICE agents reportedly deployed tear gas as anti-immigration agitators swarmed federal vehicles during enforcement operations in Minneapolis Tuesday.",
      "url": "https://www.foxnews.com/us/minnesota-anti-ice-agitators-swarm-confront-federal-agents-during-enforcement-operations",
      "published": "Wed, 14 Jan 2026 10:33:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Teachers union slams 'Trump regime,' claims ICE murdered Minneapolis agitator in message to supporters",
      "description": "Teachers union sends inflammatory message after ICE shooting, calling Trump administration a \"regime\" and characterizing activist's death as \"murder.\"",
      "url": "https://www.foxnews.com/us/teachers-union-slams-trump-regime-claims-ice-murdered-minneapolis-agitator-message-supporters",
      "published": "Wed, 14 Jan 2026 08:00:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Florida paraglider survives 500-foot plunge into ocean",
      "description": "A Florida paraglider miraculously survived a 500-foot plunge into ocean waters near Singer Island. Lifeguards and beachgoers rescued the uninjured man safely.",
      "url": "https://www.foxnews.com/us/florida-paraglider-survives-500-foot-plunge-ocean",
      "published": "Wed, 14 Jan 2026 07:59:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia losing 'massive' 25,000 troops monthly in Ukraine as war grinds on, NATO chief says",
      "description": "Russia's \"massive\" military losses in Ukraine are unsustainable, NATO's secretary general warned with the conflict about to enter its fourth year with no clear end in sight.",
      "url": "https://www.foxnews.com/world/russia-losing-massive-25000-troops-monthly-ukraine-war-grinds-on-nato-chief-mark-rutte-says",
      "published": "Wed, 14 Jan 2026 14:38:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Bowen: Authoritarian regimes die gradually then suddenly, but Iran is not there yet",
      "description": "The regime's opponents will hope for more pressure to accelerate the process, writes the BBC's international editor.",
      "url": "https://www.bbc.com/news/articles/cedwgn4pqv4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 16:47:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "UK prosecutors seek to reinstate ‘terrorism’ charge against Kneecap rapper",
      "description": "Irish band slams push to reinstate charge against rapper Liam O’Hanna as 'waste of public time and public money'.",
      "url": "https://www.aljazeera.com/news/2026/1/14/uk-prosecutors-seek-to-reinstate-terrorism-charge-against-kneecap-rapper?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 21:08:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Uganda faces mounting calls to end internet blackout before elections",
      "description": "Amnesty International says internet blackout 'especially alarming' as election campaign 'marred by massive repression'.",
      "url": "https://www.aljazeera.com/news/2026/1/14/uganda-faces-mounting-calls-to-end-internet-blackout-before-elections?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 16:05:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela regime claims release of political prisoners is sign of new era",
      "description": "NGOs estimate that there are still close to 1,000 political prisoners in Venezuela despite claims by new leaders Venezuela’s acting president has claimed that the regime’s release of political prisoners sent a “very clear message” that the country was “opening up to a new political moment”, days after the seizure and rendition of the dictator Nicolás Maduro. Delcy Rodríguez also vowed to continue the releases and accused NGOs that have described the process as slow and opaque of “lying to the world and trying to sell falsehoods about Venezuela”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/venezuelan-political-prisoners-released",
      "published": "Wed, 14 Jan 2026 19:25:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Korean prosecutors demand death penalty for former president Yoon Suk Yeol",
      "description": "Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol",
      "published": "Wed, 14 Jan 2026 00:43:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Scientists call another near-record hot year a 'warning shot' from a shifting climate",
      "description": "Scientists calculate that last year was one of the three hottest on record, along with 2024 and 2023. The trend indicates that warming could be speeding up, climate monitoring teams reported.",
      "url": "https://www.npr.org/2026/01/14/g-s1-105993/global-warming-speeding-up-2025-heat-record-climate-change",
      "published": "Wed, 14 Jan 2026 13:38:36 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Protests calling for regime change 'most existential threat to Islamic regime since 1979 revolution'",
      "description": "Nationwide protests in Iran represent one of the most significant challenges to the Islamic Republic since the 1979 Revolution. For deeper insight, Carys Garland speaks with former Iranian activist Alireza Baradaran, who offers perspective on the unprecedented scale of the uprising and the political dynamics shaping the current movement. He reflects on the shifting nature of the protest base, the evolving opposition landscape, and the uncertain future of a deeply fractured society.",
      "url": "https://www.france24.com/en/video/20260114-protests-calling-for-regime-change-most-existential-threat-to-islamic-regime-since-1979-revolution",
      "published": "Wed, 14 Jan 2026 17:13:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Dozens of people killed in ferry boat accident in northern Mali",
      "description": "Residents and local officials in northern Mali say a ferry boat trying to land at a Niger River town in the Timbuktu region hit stones and sank in an accident that left dozens of people dead",
      "url": "https://abcnews.go.com/International/wireStory/dozens-people-killed-ferry-boat-accident-northern-mali-129182553",
      "published": "Tue, 13 Jan 2026 16:49:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "East Jerusalem: Forced shutdown of UN clinic signals escalating disregard for international law",
      "description": "The temporary closure of a UN-run health centre in East Jerusalem is the latest phase in “a pattern of deliberate disregard” for international law, the head of the UN agency that assists Palestine refugees, UNRWA, said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166760",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump admin exit from UN, international organizations raises question of who’s next",
      "description": "U.S. officials say more international organizations could face future cuts after withdrawing from 66 groups, with U.N. agencies potentially targeted next.",
      "url": "https://www.foxnews.com/world/trump-admin-exit-from-un-international-organizations-raises-question-whos-next",
      "published": "Tue, 13 Jan 2026 12:39:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Workers at Chinese factory that produces Labubu toys are being exploited, says NGO",
      "description": "Exclusive: China Labor Watch says people aged 16-18 employed without required special protections A labour rights NGO says it has found evidence of worker exploitation in the supply chain of Labubus, the furry toys that took the world by storm last year and which are expected to continue to grow in popularity in 2026. Labubus, toothy gremlins made by the Chinese toy company Pop Mart, have become one of China’s hottest cultural exports. In the first half of 2025 alone, “the Monsters” line of toys, which includes Labubus, generated 4.8bn yuan (£511m) in sales for the Hong Kong-listed company. In August, Pop Mart’s chief executive, Wang Ning, said the company was on track to reach 20bn yuan in revenues in 2025. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/workers-at-chinese-factory-that-produces-labubu-toys-are-being-exploited-says-ngo",
      "published": "Tue, 13 Jan 2026 09:55:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "DW exclusive: Post-election violence in Tanzania's Mwanza",
      "description": "What happened in Tanzania during the unrest that followed the October election remains unclear. New evidence points to killings and grave human rights abuses by security forces in the second largest city, Mwanza.",
      "url": "https://www.dw.com/en/dw-exclusive-post-election-violence-in-tanzania-s-mwanza/a-75473767?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 10:34:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump envoy announces launch of ‘phase two’ of plan to end Gaza war",
      "description": "Steve Witkoff says Donald Trump's Gaza plan is 'moving from ceasefire to demilitarization, technocratic governance'.",
      "url": "https://www.aljazeera.com/news/2026/1/14/trump-envoy-announces-launch-of-second-phase-of-gaza-plan?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 17:00:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Johns Hopkins professor on his recent visit to Iran amid anti-government protests",
      "description": "NPR's Steve Inskeep asks Youseph Yazdi, a professor at Johns Hopkins School of Medicine, about his recent visit to Iran, where thousands have been killed in anti-government protests.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5675784/johns-hopkins-professor-on-his-recent-visit-to-iran-amid-anti-government-protests",
      "published": "Wed, 14 Jan 2026 04:48:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Woman seen on video allegedly blocking Minnesota ICE operation with car as agitators surround agents",
      "description": "Video shows woman allegedly blocking ICE agents as Minnesota protests escalate against immigration enforcement. Federal officials report 60 agitators were charged in five days.",
      "url": "https://www.foxnews.com/us/woman-seen-video-allegedly-blocking-minnesota-ice-operation-car-agitators-surround-agents",
      "published": "Tue, 13 Jan 2026 18:03:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump envoy reportedly meets with exiled Iranian prince as regime faces protests",
      "description": "The Trump administration allegedly made the first high-level contact with the Iranian opposition amid intensifying nationwide anti-regime protests.",
      "url": "https://www.foxnews.com/world/trump-envoy-reportedly-meets-exiled-iranian-prince-regime-faces-protests",
      "published": "Tue, 13 Jan 2026 18:32:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Republican senator condemns alleged Syrian army abuses as ceasefire follows Aleppo fighting",
      "description": "US Senator demands accountability after alleged human rights violations by Syrian forces against Kurdish civilians in Aleppo amid ongoing conflict.",
      "url": "https://www.foxnews.com/world/republican-senator-condemns-alleged-syrian-army-abuses-ceasefire-follows-aleppo-fighting",
      "published": "Tue, 13 Jan 2026 17:29:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iranian student shot in head at close range amid protests, body buried along roadside",
      "description": "Iranian student Rubina Aminian was shot in the head at close range, joining thousands allegedly killed by government forces, according to Iran Human Rights, a Norway-based group.",
      "url": "https://www.foxnews.com/world/iranian-student-shot-head-close-range-amid-protests-body-buried-along-roadside",
      "published": "Tue, 13 Jan 2026 17:16:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Film show: The Shakespearean drama tipped for Oscar success",
      "description": "Her performance as Shakespeare's wife in \"Hamnet\" won Jessie Buckley the best actress award at the Golden Globes. Our film critic Emma Jones tells us why Chloé Zhao's sensitive direction has made the film a serious contender in the upcoming Academy Awards.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260114-film-show-the-shakespearean-drama-tipped-for-oscar-success",
      "published": "Wed, 14 Jan 2026 14:48:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "US opens new air defense operations cell at Qatar base that Iran targeted in retaliatory attack",
      "description": "U.S. opens new air defense cell at Al Udeid Air Base in Qatar amid Iran tensions, enhancing regional missile defense cooperation across Middle East.",
      "url": "https://www.foxnews.com/world/us-opens-new-air-defense-operations-cell-qatar-base-iran-targeted-retaliatory-attack",
      "published": "Tue, 13 Jan 2026 11:02:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "BTS announces return with new world tour in 2026 and 2027",
      "description": "K-pop band to start tour in April after nearly four-year hiatus due to all seven members needing to complete South Korea’s mandatory military service The BTS comeback is upon us: the K-pop septet has announced a 2026-2027 world tour, kicking off in South Korea in April and running through to March 2027 with more than 70 dates across Asia, North America, South America, Australia and Europe. The tour marks the group’s first headline performances since their 2021–22 Permission to Dance on Stage tour. 9 April and 11-12 April – Goyang, South Korea 17-18 April – Tokyo 25-26 April – Tampa, Florida 2-3 May – El Paso, Texas 7 May and 9-10 May – Mexico City 16-17 May – Stanford, California 23-24 and 27 May – Las Vegas 12-13 June – Busan, South Korea 26-27 June – Madrid 1-2 July – Brussels 6-7 July – London 11-12 July – Munich 17-18 July – Paris 1-2 Aug – East Rutherford, New Jersey 5-6 Aug – Foxborough, Massachusetts 10-11 Aug – Baltimore 15-16 Aug – Arlington, Texas 22-23 Aug – Toronto 27-28 Aug – Chicago 1-2 Sept and 5-6 Sept – Los Angeles 2-3 Oct – Bogotá, Colombia 9-10 Oct – Lima, Peru 16-17 Oct – Santiago, Chile 23-24 Oct – Buenos Aires, Argentina 28 Oct and 30-31 Oct – São Paulo 19 Nov and 21-22 Nov – Kaohsiung, Taiwan 3 Dec and 5-6 Dec – Bangkok 12-13 Dec – Kuala Lumpur, Malaysia 17 Dec, 19-20 Dec and 22 Dec – Singapore 26-27 Dec – Jakarta 12-13 Feb – Melbourne, Australia 20-21 Feb – Sydney 4 March and 6-7 March – Hong Kong 13-14 March – Manila, Philippines Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/14/bts-announces-return-with-new-world-tourm-includin-in-2026-and-2027",
      "published": "Wed, 14 Jan 2026 00:40:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Former Cyprus President George Vassiliou, who put the country on the path to EU membership, has died",
      "description": "Former Cypriot President George Vassiliou, a successful businessman who helped to energize his divided island’s economy and set it on the road to European Union membership, has died",
      "url": "https://abcnews.go.com/International/wireStory/former-cyprus-president-george-vassiliou-put-country-path-129193512",
      "published": "Wed, 14 Jan 2026 04:09:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Amateur stuns world's best to win A$1m in Melbourne",
      "description": "Amateur Jordan Smith is the shock winner of the Million Dollar One Point Slam at the Australian Open, beating reigning men's champion Jannik Sinner along the way.",
      "url": "https://www.bbc.com/sport/tennis/articles/ckgyl1ndw57o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 13:12:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Timeline of how Iran’s deadly protests unfolded",
      "description": "In 17 days, protests in Iran which began over the economy have snowballed into its worst unrest in years. Here's how.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/timeline-of-how-irans-deadly-protests-unfolded?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 19:56:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US frackers were already facing a global oil supply glut. Trump’s Venezuelan dream could make it worse",
      "description": "Picture is as murky as a barrel of oil, with US companies in 2026 expecting their first production drop in four years US shale-oil producers were already contending with oil prices at four-year lows. News that they may soon face a significant competitor in their back yard probably wasn’t how frackers wanted to greet 2026. The US capture of Venezuela’s President Nicolás Maduro and his wife, Cilia Flores, hit the share prices of independent shale-oil producers, such as Diamondback Energy and Devon Energy, last week. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/12/us-oil-producers-global-supply-glut-venezuela",
      "published": "Mon, 12 Jan 2026 11:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump restates desire to take over Greenland, as poll reveals what Americans think",
      "description": "Donald Trump has again restated his desire to acquire Greenland for the US \"for purpose of national security\", saying anything less is \"unacceptable\", even as a poll found less than a fifth of Americans support the idea.",
      "url": "https://news.sky.com/story/trump-restates-desire-to-take-over-greenland-as-poll-finds-most-americans-are-against-it-13494203",
      "published": "Wed, 14 Jan 2026 12:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Amateur beats world number two Sinner as he nets million-dollar tennis prize",
      "description": "An amateur tennis player has netted himself a million-dollar prize after beating world number two Jannik Sinner.",
      "url": "https://news.sky.com/story/amateur-tennis-player-jordan-smith-beats-jannik-sinner-as-he-wins-one-point-slam-in-australia-13494256",
      "published": "Wed, 14 Jan 2026 15:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Watchdog highlights nations where Christians face persecution around the globe",
      "description": "Open Doors' World Watch List 2026 discusses Christian persecution in nations around the globe, including North Korea, Somalia, Yemen, Sudan and others.",
      "url": "https://www.foxnews.com/world/watchdog-highlights-nations-where-christians-face-persecution-around-globe",
      "published": "Wed, 14 Jan 2026 13:53:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "FBI searches home of Washington Post reporter in classified documents probe",
      "description": "Attorney General Bondi accused the journalist of reporting classified information allegedly leaked by a federal contractor, who she said has been arrested.",
      "url": "https://www.bbc.com/news/articles/cvgp19zx3vjo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 17:44:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Palestinians in Gaza rebuild houses with mud and rubble",
      "description": "Palestinians in Gaza are using mud and stones from destroyed homes to rebuild homes after two years of war.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/palestinians-in-gaza-rebuild-houses-with-mud-and-rubble?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 19:50:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death",
      "description": "Lawyers for Adichie and her husband serve Euracare hospital with legal notice after death of 21-month-old The Nigerian author Chimamanda Ngozi Adichie has accused a Lagos hospital of negligence after the death of one of her 21-month-old twin boys. Nkanu Nnamdi died on 6 January after a brief illness. He was one of twin boys born to Adichie and Ivara Esege, a doctor, in 2024 by surrogacy, eight years after the birth of their first child, a girl. Continue reading...",
      "url": "https://www.theguardian.com/books/2026/jan/12/chimamanda-ngozi-adichie-accuses-lagos-hospital-negligence-son-death",
      "published": "Mon, 12 Jan 2026 14:26:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australian chapter of Islamist group Hizb ut-Tahrir has no plans to disband before Labor’s hate speech laws",
      "description": "Organisation singled out by home affairs minister as one that could be targeted by new laws targeting ‘hate groups’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The Australian chapter of the Islamist group Hizb ut-Tahrir has said it has no plan to disband before Labor’s hate speech legislation is brought to parliament, a day after the National Socialist Network (NSN) claimed it would do so . Hizb ut-Tahrir Australia and the neo-Nazi NSN, which are not associated with each other, were named by the home affairs minister, Tony Burke, on Saturday as organisations that could be targeted by proposed legislation to ban alleged “hate groups” after the Asio general director, Mike Burgess, raised concerns about both. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/australian-chapter-of-islamist-group-hizb-ut-tahrir-has-no-plans-to-disband-before-labors-hate-speech-laws",
      "published": "Wed, 14 Jan 2026 14:00:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US says second phase of Gaza peace plan underway",
      "description": "As Trump's Middle East envoy says the peace plan is moving forward, disarming Hamas and sustaining a transitional government in Gaza remain elusive.",
      "url": "https://www.dw.com/en/us-says-second-phase-of-gaza-peace-plan-underway/a-75510389?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 21:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria: No end to conflict between Kurds, central government",
      "description": "The past week's fighting between the Syrian army and Syrian Kurdish paramilitaries shows how difficult the military integration of the two will be to achieve.",
      "url": "https://www.dw.com/en/syria-no-end-to-conflict-between-kurds-central-government/a-75506075?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Rescue or crime? Humanitarian aid workers on trial in Greece",
      "description": "Humanitarian aid workers face up to 20 years in prison if found guilty of facilitating the illegal entry of migrants to Greece. The trial has been dubbed \"the largest case of the criminalization of solidarity in Europe.\"",
      "url": "https://www.dw.com/en/rescue-or-crime-humanitarian-aid-workers-on-trial-in-greece/a-75505957?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 16:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Amid continued sectarian violence, Syrians face mass displacement",
      "description": "More than a year after the fall of Bashar al-Assad in Syria, many people living there are starting to rebuild their lives. However, sectarian violence has flared across Syria and according to the UN Office for the Coordination of Humanitarian Affairs, about 7 million people remain internally displaced. The violence has aggravated the humanitarian situation, as Dr Mohamed Alaa Ahmado, Programs Director at the NGO Mehad, tells FRANCE 24. Among the many challenges, he says, is the need for \"strengthening primary healthcare services\", \"food and non-food items\" and \"psychological support\".",
      "url": "https://www.france24.com/en/tv-shows/perspective/20260114-amid-continued-sectarian-violence-syrians-face-mass-displacement",
      "published": "Wed, 14 Jan 2026 14:17:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US launches phase two of plan to end Gaza conflict, including creation of transitional authority",
      "description": "Donald Trump's special envoy Steve Witkoff has announced the launch of phase two ​of ​the plan to end the conflict in Gaza.",
      "url": "https://news.sky.com/story/us-launches-phase-two-of-plan-to-end-gaza-conflict-including-creation-of-transitional-authority-13494283",
      "published": "Wed, 14 Jan 2026 16:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'It was war': Iranian woman who fled Tehran describes killings",
      "description": "\"It was war.\"",
      "url": "https://news.sky.com/story/everyone-was-being-shot-in-the-head-iranian-woman-who-fled-tehran-describes-killings-and-crackdown-13494160",
      "published": "Wed, 14 Jan 2026 11:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Activists say Iran has aired at least 97 coerced confessions from protesters, often after torture",
      "description": "Iranian state media has aired at least 97 confessions from protesters since Dec. 28, according to the Human Rights Activists News Agency",
      "url": "https://abcnews.go.com/International/wireStory/activists-iran-aired-97-coerced-confessions-protesters-after-129180897",
      "published": "Tue, 13 Jan 2026 21:45:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "California man sues McDonald's after homeless man accused of attacking wife in drive-thru",
      "description": "California widower sues McDonald's after wife allegedly died from drive-thru attack injuries. Lawsuit claims employees watched assault without calling 911.",
      "url": "https://www.foxnews.com/us/california-man-sues-mcdonalds-after-homeless-man-accused-attacking-wife-drive-thru",
      "published": "Wed, 14 Jan 2026 12:55:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "ICE agent struck by Renee Good's vehicle suffered internal bleeding to torso, DHS says",
      "description": "An ICE agent suffered internal bleeding to his torso after Renee Nicole Good's vehicle struck him during the Minneapolis shooting last week, an official said.",
      "url": "https://www.foxnews.com/us/ice-agent-struck-renee-goods-vehicle-suffered-internal-bleeding-torso-dhs-says",
      "published": "Wed, 14 Jan 2026 12:14:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Virginia nanny testifies affair, alibi plan ended in bloodshed after love triangle tore apart affluent family",
      "description": "Brendan Banfield allegedly used fetish website to lure victim for elaborate murder plot that killed his wife and stranger in their Virginia home.",
      "url": "https://www.foxnews.com/us/virginia-nanny-testifies-affair-alibi-plan-ended-bloodshed-after-love-triangle-tore-apart-affluent-family",
      "published": "Wed, 14 Jan 2026 07:00:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Judge scolds alleged Gilgo Beach killer's defense, vows trial will begin ‘come hell or high water'",
      "description": "Judge warns alleged Gilgo Beach serial killer Rex Heuermann's lawyers that trial will start after Labor Day \"come hell or high water\" despite new motions.",
      "url": "https://www.foxnews.com/us/judge-scolds-alleged-gilgo-beach-killer-defense-vows-trial-begin-come-hell-high-water",
      "published": "Tue, 13 Jan 2026 17:28:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korean prosecutor seeks death penalty for ex-President Yoon over martial law declaration: 'Self-coup'",
      "description": "An independent counsel demanded a death sentence for former South Korean President Yoon Suk Yeol on rebellion charges over his controversial martial law decree.",
      "url": "https://www.foxnews.com/world/south-korean-prosecutor-seeks-death-penalty-ex-president-yoon-over-martial-law-declaration-self-coup",
      "published": "Wed, 14 Jan 2026 03:29:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Starlink reportedly made free in Iran - but protesters are taking huge risks by using it",
      "description": "The satellite technology has become a vital communications lifeline after the government shut down the internet last week.",
      "url": "https://www.bbc.com/news/articles/c0r4veg0rrzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 18:15:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Randa Abdel-Fattah threatens defamation action against South Australian premier Peter Malinauskas",
      "description": "Prominent Palestinian author’s removal from Adelaide writers’ week lineup led to unprecedented turmoil culminating in cancellation of festival Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The South Australian premier, Peter Malinauskas, has received a legal notice from the Palestinian writer and academic at the centre of the Adelaide writers’ week maelstrom . On Wednesday, lawyers acting for Randa Abdel-Fattah served a formal concerns notice for defamation to the premier, suggesting the fallout from her cancellation from the 2026 writers’ week – which is itself is now cancelled – is far from over. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/14/randa-abdel-fattah-defamation-concerns-notice-peter-malinauskas-sa-premier",
      "published": "Wed, 14 Jan 2026 10:31:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "FBI searches Washington Post reporter's home",
      "description": "FBI agents searched Hannah Natanson's home as part of an investigation into sharing secret government information. The paper said investigators told her she was not a focus of the probe.",
      "url": "https://www.dw.com/en/fbi-searches-washington-post-reporter-s-home/a-75507082?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 18:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "University of Utah student charged with making gun gestures, threatening to shoot conservative debaters",
      "description": "A University of Utah student allegedly threatened to shoot conservative speakers \"in the neck\" during a debate on campus, leading to his arrest.",
      "url": "https://www.foxnews.com/us/university-utah-student-charged-making-gun-gestures-threatening-shoot-conservative-debaters",
      "published": "Wed, 14 Jan 2026 16:01:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration pauses immigrant visa processing for 75 countries",
      "description": "The pause starting on 21 January will bar foreign nationals who \"would take welfare and public benefits\".",
      "url": "https://www.bbc.com/news/articles/cy7mnzgkp7go?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 18:29:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Canada's Mark Carney faces delicate balancing act in China visit",
      "description": "The PM is seeking to deepen trade and repair ties with China after years of tense relations - without compromising national security or provoking the US.",
      "url": "https://www.bbc.com/news/articles/c98pj370mjjo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 00:00:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Child rights org says Google undermines parental control of child accounts",
      "description": "Melissa McKay of the Digital Childhood Institute filed a complaint with the Federal Trade Commission.",
      "url": "https://www.aljazeera.com/economy/2026/1/14/child-rights-org-says-google-undermines-parental-control-of-child-accounts?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 21:51:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "‘We are stuck’: Young Ugandans want stability, opportunities on eve of vote",
      "description": "Tension as 81-year-old Yoweri Museveni seeks to extend four-decade rule in a country where 70% of people are under 35.",
      "url": "https://www.aljazeera.com/news/2026/1/14/young-ugandans-hope-for-stability-opportunities-on-eve-of-election?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 20:46:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Australia news live: PM ‘stunned’ at Coalition calls for delay on hate speech laws; Joyce compares inherited guns to a ‘lounge suite’",
      "description": "Shadow minister says Coalition has not yet decided on approach to new laws but says they are ‘rushed’. Follow updates live Get our breaking news email , free app or daily news podcast Iranian Australians left distraught with no confirmation their family is safe Almost a week into Iran’s communication blackout, Iranian Australian activist Mohammad Hashemi received a call from his home country. When I heard the stories, what happened to people, I was crying about the situation and what’s going on in our country. We continue to advise do not travel to Iran. If you choose to remain in Iran, you’re responsible for your own safety. Be prepared to shelter in place for an extended period. Make sure you have supplies of water, food and medication. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/15/victoria-bushfires-school-data-hack-adelaide-writers-week-peter-malinauskas-labor-hate-speech-laws-political-reaction-anthony-albanese-sussan-ley-coalition-ntwnfb",
      "published": "Wed, 14 Jan 2026 22:01:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Uganda braces for tense election as Museveni seeks another win",
      "description": "President Museveni's supporters expect victory for the National Resistance Movement. Meanwhile, a youthful base frustrated by unemployment hopes whoever wins will heed their wishes for a better future.",
      "url": "https://www.dw.com/en/uganda-braces-for-tense-election-as-museveni-seeks-another-win/a-75481521?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 13:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "France's government survives two no-confidence votes over Mercosur deal",
      "description": "The French government on Wednesday survived two no-confidence votes filed by the hard left and far right parties, who accused it of not doing enough to stop the EU-Mercosur trade deal after its approval last week. French farmers say the deal threatens local ​agriculture by creating unfair competition with cheaper South American imports.",
      "url": "https://www.france24.com/en/france/20260114-france-government-survives-two-no-confidence-votes-over-mercosur-deal",
      "published": "Wed, 14 Jan 2026 18:22:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Ugandan opposition leader campaigns in flak jacket",
      "description": "The Ugandan opposition leader known as Bobi Wine has been campaigning for president in a flak jacket and helmet as soldiers filled the streets of the capital, Kampala",
      "url": "https://abcnews.go.com/International/wireStory/ugandan-opposition-leader-campaigns-flak-jacket-129193195",
      "published": "Wed, 14 Jan 2026 02:38:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "China had a record $1.2 trillion trade surplus in 2025, as exports rose 6.6% in December",
      "description": "China has reported its trade surplus surged to a record of almost $1.2 trillion last year as exports to other countries made up for slowing shipments to the United States",
      "url": "https://abcnews.go.com/International/wireStory/china-record-12-trillion-trade-surplus-2025-exports-129189558",
      "published": "Wed, 14 Jan 2026 01:05:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Anti-ICE agitators burn American flag outside California federal building",
      "description": "An anti-ICE agitator was allegedly blinded in a confrontation with federal agents outside a federal building in California on Tuesday.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-burn-american-flag-outside-california-federal-building",
      "published": "Wed, 14 Jan 2026 10:43:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland's prime minister says 'we choose Denmark' over the US",
      "description": "Greenland's prime minister said if his territory had to choose between the United States and Denmark, it would choose Denmark, a report said.",
      "url": "https://www.foxnews.com/world/greenlands-prime-minister-says-we-choose-denmark-over-us",
      "published": "Tue, 13 Jan 2026 12:24:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Swiss regions ban pyrotechnics after ski bar fire",
      "description": "The blaze is believed to have started when sparklers attached to champagne bottles set foam padding on the ceiling alight.",
      "url": "https://www.bbc.com/news/articles/cgezqvwr54no?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 16:32:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Uganda election chief says he has had threats over results declaration",
      "description": "This follows comments by a presidential assistant that Bobi Wine would not be declared president, even if he wins.",
      "url": "https://www.bbc.com/news/articles/c62vd7542rno?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 18:18:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Tehran morgue videos show the brutality of Iran's crackdown on protesters",
      "description": "Distressing footage reveals nearly 200 bodies with one victim identified as young as 16.",
      "url": "https://www.bbc.com/news/articles/cly3xpyvxzyo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 16:58:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Dubai chocolate-inspired dessert takes S Korea by storm",
      "description": "Shops are selling hundreds of cookies within minutes as the frenzy sends prices of ingredients surging.",
      "url": "https://www.bbc.com/news/articles/c07xdv0mggzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 06:41:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Three Palestine Action activists end UK hunger strike",
      "description": "This is a breaking news story.",
      "url": "https://www.aljazeera.com/news/2026/1/14/three-palestine-action-activists-end-uk-hunger-strike?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 21:31:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Kneecap’s pro-Palestine supporters protest court appeal",
      "description": "Supporters of Irish-language punk-rap group Kneecap rallied outside London’s Royal Court of Justice.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/kneecaps-pro-palestine-supporters-protest-court-appeal?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 20:27:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Is Starlink helping Iranians break internet blackout, and how does it work?",
      "description": "Experts say Starlink is helping Iranians get information out about the protests. But Iran is also trying to jam signals.",
      "url": "https://www.aljazeera.com/news/2026/1/14/is-starlink-helping-iranians-break-internet-blackout-and-how-does-it-work?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 19:45:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Video shows moment anti-ICE protester is shot in face with projectile",
      "description": "A protester who was shot in the face with a non-lethal round has been blinded in one eye and suffered skull fractures.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/video-shows-moment-anti-ice-protester-is-shot-in-face-with-projectile?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 17:58:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Greenlanders worry over Trump’s threats as they welcome back the sun",
      "description": "Many in Greenland say they're unsure what this new year will bring as US President Donald Trump threatens to take over.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/greenlanders-worry-over-trumps-threats-as-they-welcome-back-the-sun?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 17:54:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What happened in the deadly Thailand rail accident?",
      "description": "A Thai passenger train was crushed by construction cranes that slammed onto carriages, killing at least 29 people.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/what-happened-in-the-deadly-thailand-rail-accident?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 17:13:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Quebec premier François Legault resigns from post in surprise move",
      "description": "Legault’s abrupt resignation follows months of chaos that has rocked the governing Coalition Avenir Québec party Quebec ’s premier, François Legault, has announced his resignation as leader of the province, in an abrupt departure for the polarizing figure whose embattled government faces the prospects of an electoral wipeout in the coming months. Speaking at a hastily arranged press conference in Quebec City on Wednesday, Legault said he was proud to have founded the Coalition Avenir Québec (CAQ) party and won consecutive majority governments beginning in 2018 . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/quebec-premier-francois-legault-resigns",
      "published": "Wed, 14 Jan 2026 17:22:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Why Iran's fate means more to oil markets than Venezuela's",
      "description": "While markets appeared barely fazed by the fate of Venezuela's oil industry, they are considerably more nervous about the potential impact of internal unrest and foreign escalation when it comes to Iran. Rightly so?",
      "url": "https://www.dw.com/en/why-iran-s-fate-means-more-to-oil-markets-than-venezuela-s/a-75507250?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fact check: AI fakes and old videos mislead on Iran protests",
      "description": "Iran's protests face an information blackout, fueling a surge of AI-generated videos and recycled footage online. DW Fact check investigates how disinformation thrives when truth is hard to verify.",
      "url": "https://www.dw.com/en/fact-check-ai-fakes-and-old-videos-mislead-on-iran-protests/a-75504757?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: Bundestag president pushes changes to security",
      "description": "Drones, spies and extremists? Bundestag President Julia Klöckner sounds the alarm on security gaps threatening Germany’s democracy. Her proposals could hit the far-right AfD party the hardest.",
      "url": "https://www.dw.com/en/germany-bundestag-president-pushes-changes-to-security/a-75503530?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 16:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US' JD Vance to host Greenland talks amid takeover threats",
      "description": "The foreign ministers of Denmark and Greenland are hoping to defuse tensions over the Arctic island in Washington talks. US President Donald Trump has doubled down on threats to seize the autonomous Danish territory.",
      "url": "https://www.dw.com/en/us-jd-vance-to-host-greenland-talks-amid-takeover-threats/a-75498027?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 08:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Sadio Mané fires Senegal into Africa Cup of Nations final with win over Egypt",
      "description": "Senegal on Friday evening secured a spot in the Africa Cup of Nations final with a second-half goal from two-time African Footballer of the Year Sadio Mané ending the tournament dreams of seven-time winners Egypt.",
      "url": "https://www.france24.com/en/sport/20260114-sadio-man%C3%A9-fires-senegal-into-africa-cup-of-nations-final-with-win-over-egypt",
      "published": "Wed, 14 Jan 2026 19:36:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Reza Pahlavi, son of Iran's deposed shah, positions himself as an alternative to the regime",
      "description": "In Tehran, some protesters have begun to chant the name of the son of the last shah of Iran. Living in exile in the US for more than four decades, Reza Pahlavi has continued to call for US-backed regime change and has built a growing group of supporters across social media and in the streets. But the pretender to a defunct throne divides many in the opposition, even as he has become a rallying figure for others.",
      "url": "https://www.france24.com/en/asia-pacific/20260114-reza-pahlavi-son-iran-deposed-shah-attempts-become-next-leader",
      "published": "Wed, 14 Jan 2026 17:21:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "In Haiti’s storm-hit south, food vouchers restore choice and dignity for families",
      "description": "Standing outside a colourfully painted building in southeastern Haiti, at the entrance to a bustling shop called Gods Will Depot where bags of food are stacked to the ceiling, Ketia surveys the large pile of groceries she has selected for her family: a big sack of flour, packages of spaghetti, boxed milk, some bars of soap.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166757",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran protests instigated by Israel to distract from Gaza 'genocide,' Columbia professor claims",
      "description": "Columbia professor claims Israel allegedly orchestrating Iran protests with Mossad agents, citing former CIA director's social media post as evidence.",
      "url": "https://www.foxnews.com/us/iran-protests-instigated-by-israel-distract-from-gaza-genocide-columbia-professor-claims",
      "published": "Wed, 14 Jan 2026 12:31:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "DOJ says 'no basis' for civil rights investigation into Minneapolis ICE officer killing",
      "description": "The DOJ declined a civil rights probe into an ICE officer's killing of Renee Good in Minneapolis, breaking from past practices as the FBI investigation continues.",
      "url": "https://www.foxnews.com/us/justice-department-declines-civil-rights-investigation-minneapolis-ice-officer-killing",
      "published": "Tue, 13 Jan 2026 21:51:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Tennessee Highway Patrol debunks viral claims protester was struck by trooper's vehicle",
      "description": "Dashcam video reveals a Tennessee Highway Patrol trooper's encounter with a Memphis protester who appeared to fake being hit, debunking viral claims.",
      "url": "https://www.foxnews.com/us/tennessee-highway-patrol-debunks-viral-claims-protester-struck-trooper-vehicle",
      "published": "Tue, 13 Jan 2026 18:18:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "France condemns Iran protest crackdown, weighs satellite internet aid amid blackout",
      "description": "France condemns Iran's violent crackdown on protests as Paris considers satellite communications support to help Iranians bypass internet blackout.",
      "url": "https://www.foxnews.com/world/france-condemns-iran-protest-crackdown-weighs-satellite-internet-aid-amid-blackout",
      "published": "Wed, 14 Jan 2026 15:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Why two Canadian provinces are in a spat over Crown Royal whisky",
      "description": "The UK-owned, Canadian-made whisky is testing a united \"Team Canada\" approach in the face of US tariffs.",
      "url": "https://www.bbc.com/news/articles/c8x9v241z2qo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 20:35:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Trump administration to suspend immigrant visa processing for 75 countries",
      "description": "US State Department says freeze will affect citizens of Somalia, Haiti, Iran and Eritrea, among other countries.",
      "url": "https://www.aljazeera.com/news/2026/1/14/trump-administration-to-suspend-immigrant-visa-processing-for-75-countries?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 21:42:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China reports record trillion-dollar trade surplus despite Trump tariffs",
      "description": "Results for 2025 risk further unsettling economies about China’s trade practices and overcapacity, and their own over-reliance on Chinese products China has reported a strong export run in 2025 with a record trillion-dollar surplus, as its producers brace for three more years of a Trump administration set on slowing the manufacturing powerhouse by shifting US orders to other markets. Beijing’s resilience to renewed tariff tensions since Donald Trump returned to the US presidency last January has emboldened Chinese firms to shift their focus to south-east Asia, Africa and Latin America to offset US duties. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/china-reports-record-trillion-dollar-trade-surplus-despite-trump-tariffs",
      "published": "Wed, 14 Jan 2026 04:50:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Former NSW Labor minister condemns Forestry Corporation after greater glider ‘den trees’ found at planned logging site",
      "description": "Bob Debus says operations at Glenbog state forest on south coast show native forest logging is untenable Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A former New South Wales Labor environment minister has called on the government to halt imminent logging in a forest on the state’s south coast, after citizen scientists recorded 102 trees that they say are home to endangered greater gliders. Bob Debus, who served as environment minister in the Carr and Iemma governments, also accused the NSW Forestry Corporation (NSWFC) of being found in breach of its own regulations so frequently that the “practice is essentially part of its business model”. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/nsw-logging-halted-greater-glider-den-trees-found",
      "published": "Wed, 14 Jan 2026 14:00:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "'Fundamental disagreement' with US over Greenland remains",
      "description": "Danish and Greenlandic officials said they still have a “fundamental disagreement” with President Donald Trump over Greenland after meeting in Washington with Vice President JD Vance and Secretary of State Marco Rubio.",
      "url": "https://www.dw.com/en/fundamental-disagreement-with-us-over-greenland-remains/live-75504607?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 19:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany: Unjustly jailed man gets €1.3 million compensation",
      "description": "The Bavarian state is to give over €1 million to a man who spent 13 years in jail on murder charges that were overturned. Prosecutors had previously called for him to pay for board and lodgings in jail after his release.",
      "url": "https://www.dw.com/en/germany-unjustly-jailed-man-gets-€1-3-million-compensation/a-75503038?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 12:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Why Greenland? Trump ups pressure as Denmark dispatches top diplomat",
      "description": "No Oval Office made-for-TV drama as U-S vice president JD Vance joined U-S Secretary of State Marco Rubio and the foreign ministers of Greenland and Denmark. We'll ask about renewed pressure by the Trump administration on Copenhagen to hand over that Arctic dependency.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260114-why-greenland-trump-ups-pressure-as-denmark-dispatches-top-diplomat",
      "published": "Wed, 14 Jan 2026 19:22:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US to suspend immigrant visa processing for 75 countries",
      "description": "The US is suspending the process for immigrant visas from 75 countries, the Department of State said on Wednesday.",
      "url": "https://news.sky.com/story/us-to-suspend-immigrant-visa-processing-for-75-countries-13494347",
      "published": "Wed, 14 Jan 2026 20:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "The UK is expected to approve a 'mega' Chinese embassy in London despite objections",
      "description": "Britain’s government is expected to approve a large Chinese embassy near London’s financial district",
      "url": "https://abcnews.go.com/International/wireStory/uk-expected-approve-mega-chinese-embassy-london-despite-129192936",
      "published": "Wed, 14 Jan 2026 02:40:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: UN independent investigators call for immediate release of all political prisoners",
      "description": "More than 100 political prisoners have been released in Venezuela, the Government announced on Monday, just over a week after the seizure and rendition of President Nicolás Maduro in Caracas by the United States.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166745",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine’s former Prime Minister Yulia Tymoshenko accused of bribery: Report",
      "description": "Yulia Tymoshenko has served as Ukraine's prime minister in 2005 and from 2007 to 2010.",
      "url": "https://www.aljazeera.com/news/2026/1/14/ukraines-former-prime-minister-yulia-tymoshenko-accused-of-bribery-report?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 21:59:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Wikipedia at 25: Of collective knowledge and its fault lines",
      "description": "From utopian origins to AI-driven rivals, the \"people's encyclopedia\" has been shaped by debates over neutrality, expertise and the future of shared knowledge.",
      "url": "https://www.dw.com/en/wikipedia-at-25-of-collective-knowledge-and-its-fault-lines/a-75480616?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 16:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Danish official cites 'fundamental disagreement' with US over Greenland after White House meeting",
      "description": "Greenland and Denmark on Wednesday said they “agreed to disagree” with US diplomats after a “frank, constructive” discussion at the White House on US President Donald Trump’s desire to acquire the autonomous territory.",
      "url": "https://www.france24.com/en/americas/20260114-watch-live-denmark-greenland-fms-give-press-conference-after-white-house-meeting",
      "published": "Wed, 14 Jan 2026 18:54:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Japan & So. Korea K-pop diplomacy",
      "description": "Japan and South Korea’s leaders struck a note while meeting in central Japan on 13th January, staging a surprise drum performance to popular K-pop hits. Beyond the symbolism, the two agreed to deepen cooperation on economic security, defence and other diplomatic issues.",
      "url": "https://www.france24.com/en/video/20260114-japan-so-korea-k-pop-diplomacy-1",
      "published": "Wed, 14 Jan 2026 18:07:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Morocco eyeing place in final",
      "description": "The Africa Cup of Nations is reaching a thrilling stage, with the semifinals kicking off this Wednesday as Morocco faces Nigeria and Senegal takes on seven-time champion Egypt in a rematch of their 2021 final, reports sports editor Selina Sykes from Morocco.",
      "url": "https://www.france24.com/en/morocco-eyeing-place-in-final",
      "published": "Wed, 14 Jan 2026 16:44:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Costa Rica's security director says plot to assassinate president uncovered",
      "description": "Costa Rican security officials have reported an alleged plot to assassinate President Rodrigo Chaves",
      "url": "https://abcnews.go.com/International/wireStory/costa-ricas-security-director-plot-assassinate-president-uncovered-129178953",
      "published": "Tue, 13 Jan 2026 15:25:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘Beyond GDP’ economists push for clearer metrics on wellbeing, sustainability",
      "description": "Top finance experts are meeting at UN Geneva this week to push for a radical shake up in the way economic growth is gauged, in response to concerns that GDP measurements provide little insight about progress on key sustainability targets that are vital to our survival.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166740",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Violent repeat offender accused of killing teacher as 911 call revealed her final moments: report",
      "description": "North Carolina teacher Zoe Welsh's final 911 call captured her alleged murder by repeat offender Ryan Camacho, who is accused of breaking into her Raleigh home.",
      "url": "https://www.foxnews.com/us/violent-repeat-offender-accused-killing-teacher-911-call-revealed-her-final-moments-report",
      "published": "Wed, 14 Jan 2026 16:12:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Secret room to be built at Chinese embassy near cable lines, sparking widespread espionage fears",
      "description": "Unredacted plans for China's new London embassy reveal secret underground chamber near cables, sparking espionage concerns among UK security experts.",
      "url": "https://www.foxnews.com/world/secret-room-built-chinese-embassy-near-cable-lines-sparking-widespread-espionage-fears",
      "published": "Tue, 13 Jan 2026 19:21:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Vance to meet Danish and Greenlandic officials in Washington as locals say Greenland is not for sale",
      "description": "U.S. Vice President JD Vance is meeting with Danish and Greenlandic officials in Washington on Wednesday as President Donald Trump insists on controlling Greenland",
      "url": "https://abcnews.go.com/International/wireStory/vance-meet-danish-greenlandic-officials-washington-locals-greenland-129192151",
      "published": "Wed, 14 Jan 2026 00:19:10 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Rio de Janeiro zoo animals treated to popsicles as city faces scorching weather",
      "description": "Animals at Rio de Janeiro’s BioParque zoo received popsicles and frozen treats Tuesday as the city faced another day of extreme heat during Brazil’s summer",
      "url": "https://abcnews.go.com/International/wireStory/rio-de-janeiro-zoo-animals-treated-popsicles-city-129184605",
      "published": "Tue, 13 Jan 2026 18:50:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "US and UK pulling some personnel from Qatar military base",
      "description": "US officials say it is a \"precautionary measure\" and comes as Donald Trump weighs up whether to take action against Iran.",
      "url": "https://www.bbc.com/news/articles/c701xywwxw8o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 21:45:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US launches phase two of Gaza peace plan with new technocratic government",
      "description": "It includes the establishment of a technocratic Palestinian government, as well as the reconstruction and demilitarisation of Gaza, US envoy Steve Witkoff says.",
      "url": "https://www.bbc.com/news/articles/cjw1nxe5pvlo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 20:50:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Italian influencer Chiara Ferragni cleared of cake fraud",
      "description": "Chiara Ferragni had been accused of misleading consumers in her promotion of Christmas cakes and Easter eggs.",
      "url": "https://www.bbc.com/news/articles/c5yvgz7geyvo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 17:12:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Appropriate and unambiguous': White House defends Trump over middle-finger gesture at heckler",
      "description": "Thousands of people have sent donations totalling nearly $700,000 (£521,000) to the heckler, who was suspended from his job at Ford.",
      "url": "https://www.bbc.com/news/articles/c62w8exgw1zo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 20:14:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LA opens ticket draw for 2028 Olympics - with seats starting at $28",
      "description": "If chosen via the draw, fans will be notified via email and will be given a time slot to purchase tickets in April.",
      "url": "https://www.bbc.com/news/articles/c5y47pyp906o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 15:30:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian doctors arrested after 9 babies die in maternity hospital",
      "description": "The newborns died during the long New Year holiday in a Siberian hospital.",
      "url": "https://www.bbc.com/news/articles/cx2wle7028ko?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 12:20:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "K-pop drum duet between Japan and South Korea's leaders caps off summit talks",
      "description": "Leaders of the two East Asian nations played drums to hits from BTS and KPop Demon Hunters.",
      "url": "https://www.bbc.com/news/articles/c0lx49z8ly6o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 06:57:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Danish FM says US ‘conquer’ of Greenland not acceptable",
      "description": "Denmark’s foreign minister said his government opposes Donald Trump’s clear desire to “conquer” Greenland.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/danish-fm-says-us-conquer-of-greenland-not-acceptable?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 19:55:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal beat Egypt 1-0 in AFCON semifinal as Sadio Mane scores late",
      "description": "Mane scores 78th-minute winner to send Senegal through to play either Morocco or Nigeria in Sunday's final.",
      "url": "https://www.aljazeera.com/sports/2026/1/14/senegal-beat-egypt-1-0-egypt-in-afcon-semifinal-as-sadio-mane-scores-late?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 19:30:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mapping who controls what in Yemen in 2026",
      "description": "Al Jazeera examines the groups fighting for control in Yemen and the resulting humanitarian situation on the ground.",
      "url": "https://www.aljazeera.com/news/2026/1/14/mapping-who-controls-what-in-yemen-in-2026?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 18:14:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Musk denies knowledge of Grok producing sexualised images of minors",
      "description": "In the US, Democratic lawmakers have called on Apple and Google to remove X from their respective app stores.",
      "url": "https://www.aljazeera.com/economy/2026/1/14/musk-denies-knowledge-of-grok-producing-sexualised-images-of-minors?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 17:48:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Nigeria vs Morocco – AFCON semifinal extra-time",
      "description": "Follow our live build-up, with full team news coverage, ahead of our text commentary stream of the second semifinal.",
      "url": "https://www.aljazeera.com/sports/liveblog/2026/1/14/live-nigeria-vs-morocco-afcon-2025-semifinal?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 15:48:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What Australian sport can learn from queer ice hockey hit Heated Rivalry",
      "description": "The series challenges the hyper-masculine culture that often dominates men’s sport – and proves the power and potential of LGBTQI+ stories Heated Rivalry, the viral queer ice hockey romance that hit our screens in November, might be doing more than just capturing hearts and winning over hockey fans. With increased attendance at NHL games in North America and interest in the sport in Australia spiking , the power of inclusive and diverse storytelling in a sport setting is showing the industry a new playbook. Based on a book series by the Nova Scotian romance author Rachel Reid, the rivals-to-lovers tale of two fictional ice hockey players – Canada’s Shane Hollander and Russia’s Ilya Rozanov – explores queer love and acceptance in men’s professional sport. Continue reading...",
      "url": "https://www.theguardian.com/sport/2026/jan/14/what-australian-sport-can-learn-from-queer-ice-hockey-hit-heated-rivalry",
      "published": "Wed, 14 Jan 2026 14:00:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How are Iranians accessing the internet despite government efforts?",
      "description": "Iranians are using Starlink to get online during the government's near-total internet shutdown.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5676308/how-are-iranians-accessing-the-internet-despite-government-efforts",
      "published": "Wed, 14 Jan 2026 16:07:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark says there's a 'fundamental disagreement' with Trump over Greenland",
      "description": "The two sides agreed to create a working group to discuss ways to work through differences as President Trump continues to call for a U.S. takeover of Denmark's Arctic territory of Greenland.",
      "url": "https://www.npr.org/2026/01/14/g-s1-106011/greenland-denmark-trump",
      "published": "Wed, 14 Jan 2026 14:57:20 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former U.S. ambassador to Denmark talks about Trump's desire to take over Greenland",
      "description": "NPR's A Martinez asks Rufus Gifford, who served as U.S. ambassador to Denmark under the Obama administration, about President Trump's aspirations to take control of Greenland.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5674870/former-u-s-ambassador-to-denmark-talks-about-trumps-desire-to-take-over-greenland",
      "published": "Wed, 14 Jan 2026 04:48:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French far-right leader Marine Le Pen's appeal trial begins in Paris",
      "description": "Marine Le Pen, a French far-right leader, was back in court Tuesday to appeal an embezzlement conviction that could put her political ambitions at risk.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5676142/french-far-right-leader-marine-le-pens-appeal-trial-begins-in-paris",
      "published": "Wed, 14 Jan 2026 04:47:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A construction crane falls onto a moving train in Thailand, killing more than 30 people",
      "description": "The derailment, in northeastern Thailand, occurred on part of an ambitious planned high-speed rail project that will eventually connect China with much of Southeast Asia.",
      "url": "https://www.npr.org/2026/01/14/g-s1-105943/construction-crane-falls-onto-moving-train-thailand",
      "published": "Wed, 14 Jan 2026 02:57:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tech-savvy Mykhailo Fedorov is Ukraine's new defense minister",
      "description": "Ukrainian President Volodymyr Zelenskyy aims to boost Ukraine's defense capabilities through technology by appointing Mykhailo Fedorov as the new defense minister. What do experts say?",
      "url": "https://www.dw.com/en/tech-savvy-mykhailo-fedorov-is-ukraine-s-new-defense-minister/a-75491995?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Louvre hikes ticket price for non-EU visitors by almost half",
      "description": "The Louvre museum and several other French cultural sites are increasing the price of entry for visitors from outside Europe. So-called \"dual pricing\" is quite common in less wealthy countries but rare in richer regions.",
      "url": "https://www.dw.com/en/louvre-hikes-ticket-price-for-non-eu-visitors-by-almost-half/a-75504604?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 15:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From the Monroe Doctrine to the Donroe Doctrine",
      "description": "America for Americans: That was James Monroe's message to European colonial powers in 1823, to respect the independence of new nations of the Americas. Trump is reinterpreting this doctrine.",
      "url": "https://www.dw.com/en/from-the-monroe-doctrine-to-the-donroe-doctrine/a-75500817?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 15:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine: Anti-corruption agencies target former PM",
      "description": "Ukraine's anti-corruption agency said it notified a party leader of its suspicion of offering bribes to politicians. It did not name them, but the blurred images it published clearly showed former PM Yulia Tymoshenko.",
      "url": "https://www.dw.com/en/ukraine-anti-corruption-agencies-target-former-pm/a-75502973?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 13:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Reservist union head wants troops in Greenland",
      "description": "The president of the German Armed Forces' reservists says European troops should be sent to Greenland to block a US takeover of the territory. Meanwhile, heating bills are set to soar amid a harsh winter.",
      "url": "https://www.dw.com/en/germany-news-reservist-union-head-wants-troops-in-greenland/live-75499952?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 10:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US suspends immigrant visa processing for 75 countries",
      "description": "The US on Wednesday said it was issuing a blanket suspension of immigrant visa processing for applicants from 75 countries including Russia, Iran, Brazil, Egypt, Thailand, Nigeria and Somalia. The freeze will begin on January 21 with no set time for it to end.",
      "url": "https://www.france24.com/en/americas/20260114-us-suspends-immigrant-visa-processing-for-75-countries",
      "published": "Wed, 14 Jan 2026 21:17:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How Iran jammed Starlink (and how Iranians are trying to get around it)",
      "description": "After shutting down the internet, the Iranian government is now attempting to jam the Starlink satellite service made free to Iranians by the company. Iranians are now seeking ways to circumvent this latest wave of censorship.",
      "url": "https://www.france24.com/en/iran-jammed-starlink-get-around-it",
      "published": "Wed, 14 Jan 2026 21:02:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marine Le Pen changes her defence strategy",
      "description": "Today marks the second day of Marine Le Pen’s appeal trial, a pivotal moment for the French far-right leader, who was convicted last spring of embezzling EU funds, a ruling that currently prevents her from running for president next year. The outcome of this appeal is critical to her political future, as overturning the conviction would clear the way for her to contest the 2027 presidential election. France24 journalist Olivia Bizot tells us more.",
      "url": "https://www.france24.com/en/marine-le-pen-changes-her-defence-strategy",
      "published": "Wed, 14 Jan 2026 16:28:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What do Greenlanders want amid rising political tensions?",
      "description": "As political tensions and diplomatic maneuvering intensify around Greenland, attention is turning to the voices of Greenlanders themselves and what they want for their future, a question explored by Eliza Herbert.",
      "url": "https://www.france24.com/en/what-do-greenlanders-want-amid-rising-political-tensions",
      "published": "Wed, 14 Jan 2026 16:27:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French bistros and cafés: Should they get UNESCO intangible heritage status?",
      "description": "In this edition of Entre Nous we dive into the bid to make France's bistros and cafés part of UNESCO's intangible cultural heritage list. We discuss how the bistrot got its name and how they are different from brasseries, bouillons and restaurants. We also discuss how alcohol consumption and wine's powerful lobby in France may represent a weakness for the bid, but also why these gathering places are needed more than ever.",
      "url": "https://www.france24.com/en/tv-shows/entre-nous/20260114-french-bistros-and-caf%C3%A9s-should-they-get-unesco-intangible-heritage-status",
      "published": "Wed, 14 Jan 2026 14:33:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "British activists banned from France over 'destruction' of small boats",
      "description": "Ten British \"far-right activists\" have been banned from France for \"reconnaissance and destruction activities\" against small boats used in migrant crossings.",
      "url": "https://news.sky.com/story/ten-british-far-right-activists-banned-from-france-over-reconnaissance-and-destruction-against-small-boats-13494191",
      "published": "Wed, 14 Jan 2026 16:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Inquiry launched into Latin pop legend Julio Iglesias over allegations of sexual assault",
      "description": "Spanish prosecutors are investigating allegations that singer Julio Iglesias sexually assaulted two former employees in the Caribbean.",
      "url": "https://news.sky.com/story/inquiry-launched-into-latin-pop-legend-julio-iglesias-over-allegations-of-sexual-assault-13494227",
      "published": "Wed, 14 Jan 2026 14:02:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finishing touches being made to key part of &#163;3m Diana memorial revamp",
      "description": "A key part of the £3m revamp of Princess Diana's memorial playground is nearing completion in Germany.",
      "url": "https://news.sky.com/story/finishing-touches-being-made-to-key-part-of-1633m-diana-memorial-revamp-in-germany-13494157",
      "published": "Wed, 14 Jan 2026 11:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Arrests after nine newborn babies die at the same hospital in early January",
      "description": "Two senior doctors at a hospital in southern Russia have been arrested after nine newborn babies died in just a few days earlier this month, investigators have said.",
      "url": "https://news.sky.com/story/russia-arrests-after-nine-newborn-babies-die-at-hospital-in-novokuznetsk-in-early-january-13494151",
      "published": "Wed, 14 Jan 2026 10:48:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU targets Ukraine's military needs with massive new loan program plus billions in budget support",
      "description": "The European Union plans to allocate most of a new loan program to Ukraine's military needs over the next two years",
      "url": "https://abcnews.go.com/International/wireStory/eu-targets-ukraines-military-massive-new-loan-program-129199681",
      "published": "Wed, 14 Jan 2026 08:50:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian Prime Minister Mark Carney arrives in Beijing for a landmark four-day visit to China",
      "description": "Canadian Prime Minister Mark Carney arrives in Beijing for a landmark four-day visit to China",
      "url": "https://abcnews.go.com/International/wireStory/canadian-prime-minister-mark-carney-arrives-beijing-landmark-129198253",
      "published": "Wed, 14 Jan 2026 08:17:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France bans British far-right activists targeting migrant boats",
      "description": "Ten members of a British far-right group have been banned from entering France where they have been accused of destroying small boats used by migrants trying to reach the UK",
      "url": "https://abcnews.go.com/International/wireStory/france-bans-british-activists-targeting-migrant-boats-129196155",
      "published": "Wed, 14 Jan 2026 07:14:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's Takaichi plans to dissolve lower house to set up an early snap election",
      "description": "Japan's Prime Minister Sanae Takaichi plans to dissolve the lower house of Parliament soon for a snap election to seek the public's mandate for her policies",
      "url": "https://abcnews.go.com/International/wireStory/japans-takaichi-plans-dissolve-lower-house-set-early-129195029",
      "published": "Wed, 14 Jan 2026 08:01:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The UK is watering down plans for mandatory digital ID cards after a backlash",
      "description": "The British government has scaled back plans for mandatory digital ID cards, initially proposed as a way of helping control immigration",
      "url": "https://abcnews.go.com/International/wireStory/uk-watering-plans-mandatory-digital-id-cards-after-129194786",
      "published": "Wed, 14 Jan 2026 04:31:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Serbians mark Orthodox Christian New Year according to old tradition",
      "description": "Nearly two weeks after celebrating New Year, many Serbians did it again on Tuesday evening, this time according to old Orthodox Christian tradition",
      "url": "https://abcnews.go.com/International/wireStory/serbians-mark-orthodox-christian-new-year-tradition-129194533",
      "published": "Wed, 14 Jan 2026 04:09:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan voters face soldiers in the street and internet shutdown before election",
      "description": "Ugandans are set to vote in an election for president and other leaders",
      "url": "https://abcnews.go.com/International/wireStory/ugandan-voters-face-soldiers-street-internet-shutdown-presidential-129193873",
      "published": "Wed, 14 Jan 2026 03:46:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A construction crane falls on a passenger train in northeastern Thailand, killing at least 12 people",
      "description": "A construction crane has fallen on a passenger train in northeastern Thailand, killing at least 12 people",
      "url": "https://abcnews.go.com/International/wireStory/construction-crane-falls-passenger-train-northeastern-thailand-killing-129191335",
      "published": "Wed, 14 Jan 2026 01:06:07 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Construction crane falls on passenger train, kills 4",
      "description": "A construction crane falls on a passenger train in northeastern Thailand, killing at least 4",
      "url": "https://abcnews.go.com/International/wireStory/construction-crane-falls-passenger-train-northeastern-thailand-killing-129190943",
      "published": "Tue, 13 Jan 2026 23:48:18 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japanese and South Korean leaders jam to K-pop hits at a summit",
      "description": "The Japanese and South Korean leaders agreed to deepen cooperation between their countries before they let loose with their own surprise cultural exchange in a surprise jam session drumming to K-pop hits",
      "url": "https://abcnews.go.com/International/wireStory/japanese-south-korean-leaders-jam-pop-hits-summit-129191298",
      "published": "Wed, 14 Jan 2026 01:05:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portland officer reassigned after video surfaces with comments about Renee Nicole Good: 'Criminals get shot'",
      "description": "Portland police officer reassigned after video purportedly shows him making comments about Renee Nicole Good, saying at one point, \"Sometimes criminals get shot.\"",
      "url": "https://www.foxnews.com/us/portland-officer-reassigned-video-surfaces-comments-renee-nicole-good-criminals-get-shot",
      "published": "Wed, 14 Jan 2026 14:20:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Supreme Court pins trans athlete's lawyer who won't define 'girl' and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/supreme-court-pins-trans-athletes-lawyer-who-wont-define-girl-more-top-headlines",
      "published": "Wed, 14 Jan 2026 07:20:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "SEE IT: Police guard Chicago home of surgeon ex charged in Ohio dentist double murder",
      "description": "Neighbor shocked to discover Ohio murder suspect lived floors away in luxury Chicago building. Michael McKee accused of killing dentist Spencer Tepe and wife, Monique Tepe.",
      "url": "https://www.foxnews.com/us/see-it-police-guard-chicago-home-surgeon-ex-charged-ohio-dentist-double-murder",
      "published": "Wed, 14 Jan 2026 06:00:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Some US military personnel told to leave Middle East bases, US official confirms",
      "description": "The U.S. has ordered some of its military personnel to depart from bases in the Middle East on Tuesday as tensions with Iran escalate.",
      "url": "https://www.foxnews.com/world/some-us-military-personnel-told-leave-middle-east-bases-us-official-confirms",
      "published": "Wed, 14 Jan 2026 09:31:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Passengers baffled and confused after screams burst from beneath taxiing Air Canada plane",
      "description": "Passengers aboard a taxiing Air Canada flight were left shaken after muffled screams and banging were suddenly heard from beneath the cabin.",
      "url": "https://www.foxnews.com/world/passengers-baffled-confused-screams-burst-taxiing-air-canada-plane",
      "published": "Tue, 13 Jan 2026 22:03:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}