{
  "last_updated": "2026-01-24T21:19:49.168998Z",
  "event_count": 224,
  "events": [
    {
      "title": "Indonesia takes action against mining firms after floods devastate population of world’s rarest ape",
      "description": "Conservationists hail the ‘desperately needed’ measures and urge greater protection after up to 11% of endangered Tapanuli orangutans wiped out The floods and landslides that tore through Indonesia’s fragile Batang Toru ecosystem in November 2024 – killing up to 11% of the world’s Tapanuli orangutan population – prompted widespread scrutiny of the extractive companies operating in the area at the time of the ecological catastrophe. For weeks, investigators searched for evidence that the companies may have damaged the Batang Toru and Garoga watersheds before the disaster, which washed torrents of mud and logs into villages, claiming the lives of more than 1,100 people . Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/23/tapanuli-orangutans-floods-indonesia-government-mining-extraction-companies-aoe",
      "published": "Fri, 23 Jan 2026 05:00:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 46,
      "severity_level": "Critical"
    },
    {
      "title": "Iran will retaliate 'with everything we have' if US attacks, senior diplomat warns",
      "description": "More than 4,500 protesters killed in Iran as foreign minister threatens forceful response to potential U.S. military strikes in escalating regional crisis.",
      "url": "https://www.foxnews.com/world/iran-retaliate-with-everything-we-have-us-attacks-senior-diplomat-warns",
      "published": "Wed, 21 Jan 2026 07:44:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Russian strikes kill one, leave millions without power",
      "description": "Russia carried out another large-scale overnight assault on Ukraine’s energy infrastructure early Saturday, triggering explosions across Kyiv and cutting power to around 1.2 million properties nationwide. In the capital, nearly 6,000 buildings were left without heating as temperatures hovered near −10°C (14°F), with many apartments already freezing due to earlier damage to the city’s centralised heating system. France24 International Affairs commentator Douglas Herbert shares his insights.",
      "url": "https://www.france24.com/en/russian-strikes-kill-one-leave-millions-without-power",
      "published": "Sat, 24 Jan 2026 17:27:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Russian attacks on Ukraine kill one",
      "description": "Another deadly night in Ukraine saw continued Russian bombardments, including strikes on the capital that killed one person and wounded four, while the country’s second-largest city, Kharkiv, was also hit by drone attacks injuring 27. The attacks coincided with the conclusion of the second day of trilateral talks in Abu Dhabi between Russia and Ukraine, where territorial disputes remain the main sticking point. Ukraine’s Foreign Minister condemned Moscow’s actions, saying the missile strikes targeted not only civilians but also undermined the negotiation process. Liza Kaminov reports.",
      "url": "https://www.france24.com/en/russian-attacks-on-ukraine-kill-one",
      "published": "Sat, 24 Jan 2026 13:49:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "US forces strike vessel allegedly tied to narco-terror group killing 2 as crews search for lone survivor",
      "description": "U.S. forces killed two suspected narco-terrorists in an Eastern Pacific strike on an alleged terrorist vessel. One survivor prompted a search and rescue operation.",
      "url": "https://www.foxnews.com/us/us-forces-strike-vessel-allegedly-tied-narco-terror-group-killing-2-crews-search-lone-survivor",
      "published": "Fri, 23 Jan 2026 17:43:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Japan pauses restart of world’s largest nuclear power plant one day after it went online",
      "description": "Operator says it does not know when the problem at the Kashiwazaki-Kariwa plant in Niigata province will be solved, after an alarm sounded during start-up The restart of the world’s largest nuclear power plant was suspended in Japan on Thursday just a day after it went online for the first time in about 14 years, with the operator saying it does not know when the problem will be solved. The Kashiwazaki-Kariwa plant in Niigata province had been closed since the 2011 Fukushima disaster, but operations to relaunch it began on Wednesday after it received the final green light from the nuclear regulator . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/japan-pauses-kashiwazaki-kariwa-worlds-largest-nuclear-power-plant",
      "published": "Fri, 23 Jan 2026 00:19:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of rising internet shutdowns as digital blackouts spread worldwide",
      "description": "A rising trend towards government-enforced internet shutdowns – with at least 300 incidents in more than 54 countries over the last two years – is prompting renewed warnings from the UN about the threat these digital blackouts pose to freedom of expression, access to information and human rights.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166813",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Heavy snow and rainfall kill 61, injure 110 over 3 days in Afghanistan",
      "description": "Dozens were killed and hundreds homes destroyed, according to the country's disaster management authority, in storms impacting 15 of Afghanistan's 34 provinces.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5687209/deadly-snow-rainfall-afghanistan",
      "published": "Sat, 24 Jan 2026 10:00:05 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Heavy snow and rain kill 61, injure 110 over 3 days in Afghanistan, authorities say",
      "description": "Heavy snow and rainfall over the past three days have killed more than 60 people and injured over 100 across Afghanistan, the country’s disaster management authority says, as authorities in the impoverished country struggle to open roads and gain acces...",
      "url": "https://abcnews.go.com/International/wireStory/heavy-snow-rainfall-kill-61-injure-110-3-129516125",
      "published": "Sat, 24 Jan 2026 07:47:08 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Russia-Ukraine war live: Talks end in Abu Dhabi without breakthrough",
      "description": "At least one person has been killed in overnight Russian attacks on the capital and the northeastern city.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/24/live-kyiv-kharkiv-come-under-attack-amid-russia-ukraine-peace-talks?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 06:04:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Seven dead, dozens missing after landslide in Indonesia’s West Bandung",
      "description": "Latest disaster comes weeks after deadly floods and landslides left more than 1,000 people dead in Indonesia's west.",
      "url": "https://www.aljazeera.com/news/2026/1/24/seven-dead-82-missing-after-landslide-in-indonesias-bandung?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 05:02:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Millions of Americans brace for winter storm. And, Zelenskyy's warning for Europe",
      "description": "Millions of Americans are bracing for a massive, life-threatening winter storm this weekend. And, Ukrainian President Zelenskyy delivers a stark message to Europe at the World Economic Forum in Davos.",
      "url": "https://www.npr.org/2026/01/23/g-s1-106988/up-first-newsletter-winter-storm-minnesota-immigration-zelenskyy-davos",
      "published": "Fri, 23 Jan 2026 06:59:29 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Iran in the Human Rights Council, Myanmar election ‘fraud’, migration chief in Cyprus, Mozambique flood update",
      "description": "Disturbing details continued to emerge on Friday about Iran’s State-led crackdown against mass protests, while UN rights chief Volker Türk expressed deep concern that demonstrators could be executed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166819",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Armed militias fire heavy machine guns through Tehran streets in deadly night attacks",
      "description": "Iran protests entered day 24 with 4,519 confirmed deaths. Supreme Leader Ayatollah Ali Khamenei backs security forces amid nationwide demonstrations.",
      "url": "https://www.foxnews.com/world/armed-militias-fire-heavy-machine-guns-tehran-streets-deadly-night-attacks",
      "published": "Tue, 20 Jan 2026 21:06:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Another Christian community at risk in Africa as extremists and war take their toll",
      "description": "Sudan's civil war has reportedly killed 150,000 people and displaced 13 million as Christians face daily terror. Government forces allegedly killed 11 Christians on Christmas Day.",
      "url": "https://www.foxnews.com/world/another-christian-community-risk-africa-extremists-war-take-toll",
      "published": "Sat, 24 Jan 2026 12:55:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian soldier sentenced to death for refusing to fire on protesters during nationwide unrest",
      "description": "Iranian soldier Javid Khales was reportedly sentenced to death for refusing orders to shoot protesters during nationwide unrest, a human rights group says.",
      "url": "https://www.foxnews.com/world/iranian-soldier-sentenced-death-refusing-fire-protesters-nationwide-unrest",
      "published": "Tue, 20 Jan 2026 21:56:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli UN ambassador sends stark warning to Iran amid growing unrest",
      "description": "Israel warns Iran not to test its military readiness amid tensions over ballistic missiles and nuclear capabilities following summer 2025 operations.",
      "url": "https://www.foxnews.com/world/israeli-un-ambassador-sends-stark-warning-iran-amid-growing-unrest",
      "published": "Tue, 20 Jan 2026 19:38:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Tehran warn it will treat any US strike as an \"all-out-war\"",
      "description": "Iran will treat any attack \"as an all-out war against us,\" a senior Iranian official said on Friday, ahead of the arrival of a U.S. military aircraft carrier strike group and other assets in the Middle East in the coming days. \"This military buildup - we hope it is not intended for real confrontation - but our military is ready for the worst-case scenario. This is why everything is on high alert in Iran,\" said the senior Iranian official, speaking on condition of anonymity. Shirli Sitbon reports.",
      "url": "https://www.france24.com/en/tehran-warn-it-will-treat-any-us-strike-as-an-all-out-war",
      "published": "Sat, 24 Jan 2026 16:14:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan's women face 'world's worst' sexual violence amid brutal conflict, minister says",
      "description": "A social affairs minister for Sudan's army-backed government said that that women are the main victims of the brutal conflict ongoing since April 2023. Sulaima Ishaq al-Khalifa said Sudanese women are facing \"the world's worst\" sexual violence, with reports of rape often perpetrated as \"the family witnessed\" the crime.",
      "url": "https://www.france24.com/en/africa/20260124-women-facing-world-worst-sexual-violence-sudan-conflict",
      "published": "Sat, 24 Jan 2026 11:25:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Russian attacks on Ukraine kill 1, wound dozens ahead of second day of peace talks",
      "description": "Russian attacks on Ukraine have killed one person and wounded 31 overnight, as negotiators from Ukraine, Russia and the United States were set to met in Abu Dhabi for a second day of talks aimed at ending Moscow’s nearly four-year invasion",
      "url": "https://abcnews.go.com/International/wireStory/russian-attacks-ukraine-kill-1-wound-18-ahead-129514398",
      "published": "Sat, 24 Jan 2026 06:20:11 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran, US tensions set region on edge",
      "description": "After a brief easing of tensions, relations between the United States and Iran remain strained, with the prospect of potential U.S. strikes weighing heavily, as the Pentagon announced on January 15 that it was redeploying an aircraft carrier strike group -comprising fighter jets, guided-missile destroyers and at least one attack submarine - from the South China Sea toward the Middle East, with reports indicating the force was expected to arrive within about a week, according to Gabrielle Nadler.",
      "url": "https://www.france24.com/en/iran-us-tensions-set-region-on-edge",
      "published": "Sat, 24 Jan 2026 11:13:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns any attack will mean 'all-out war' after Trump says US 'armada' on its way",
      "description": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region.",
      "url": "https://news.sky.com/story/iran-warns-any-attack-will-mean-all-out-war-after-trump-says-us-armada-on-its-way-13498251",
      "published": "Sat, 24 Jan 2026 01:13:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Hotel fire in Pakistan's eastern city of Lahore leaves 3 dead, 8 others injured",
      "description": "A fire in the basement of a hotel in Pakistan’s eastern city of Lahore has killed three people and injured eight others, officials said",
      "url": "https://abcnews.go.com/International/wireStory/hotel-fire-pakistans-eastern-city-lahore-leaves-3-129520752",
      "published": "Sat, 24 Jan 2026 11:29:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "'Half of my friends were killed' - the girls returning to a school caught up in war",
      "description": "Twins whose classmates were killed by shelling say their deaths have made them determined to finish their studies.",
      "url": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 00:03:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "New Zealand landslide: rescue efforts called off for six people buried in disaster",
      "description": "Rescue efforts at Mount Maunganui site switch to recovery operation that police say could take several days Efforts to rescue six people buried by a landslide at a New Zealand holiday park ended on Saturday, with police shifting into a recovery operation. Police Supt Tim Anderson said human remains had been uncovered on Friday night beneath the mountains of dirt and debris that crashed into a campsite in Mount Maunganui on Thursday, adding that it could take several days to locate all of the victims due to the unstable ground. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/24/new-zealand-landslide-rescue-efforts-called-off-for-at-least-six-people-buried-in-disaster",
      "published": "Sat, 24 Jan 2026 02:23:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Two dead and six missing after landslides hit house and campground in New Zealand",
      "description": "Search-and-rescue teams worked through the night at the campground, but there had been no progress in finding missing people, officials say New Zealand is ‘full of grief”, the prime minister has said, after landslides tore through a house and busy campground, leaving two dead and at least six victims still missing. Police said emergency crews were still searching for at least six people, including two teenagers, believed missing beneath the debris of a landslide which struck a Mount Maunganui campsite on Thursday morning. Police were attempting to contact another three people. Families enjoying the summer school holiday were among the campers. Recreational vehicles and at least one structure were crushed, images showed. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/two-confirmed-dead-and-more-presumed-buried-after-landslides-hit-house-and-campground-in-new-zealand",
      "published": "Fri, 23 Jan 2026 01:44:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "At Davos, U.S. allies question a fraying world order",
      "description": "It was a volatile week for trans-Atlantic relations, marked by President Trump statements that unsettled global markets and strained ties with U.S. allies — on topics ranging from Greenland to Gaza.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5686526/trump-davos-world-order",
      "published": "Fri, 23 Jan 2026 14:27:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US tightens military posture near Iran",
      "description": "As the United States maintains pressure and threats against Iran, the Islamic Republic has warned that “any attack against it will be considered a total war.” Some airlines subsequently announced the suspension of their Middle East routes; Air France had done the same, but as of midday the company has announced that it will resume its service to Dubai. France24 correspondent Reza Sayah speaks to us for the first time sinche the internet blockade from Tehran.",
      "url": "https://www.france24.com/en/us-tightens-military-posture-near-iran",
      "published": "Sat, 24 Jan 2026 16:07:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Over 8000 flights canceled in the US due to winter storm",
      "description": "More than 200 million Americans are bracing for an unusually severe winter storm beginning Friday, with forecasts calling for heavy snow and freezing rain. The National Weather Service (NWS) warned that the storm, moving eastward from the High Plains and Rockies, is likely to create “extremely dangerous” conditions across much of the United States. Shirli Sitbon reports.",
      "url": "https://www.france24.com/en/over-8000-flights-canceled-in-the-us-due-to-winter-storm",
      "published": "Sat, 24 Jan 2026 13:51:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN rights chief decries US treatment of migrants, as deaths in ICE custody rise",
      "description": "The UN’s top human rights official has raised alarm over what he described as the growing dehumanisation of migrants in the United States, warning that current immigration enforcement practices are undermining due process, family unity and basic human dignity.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166816",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN Assembly president defends multilateralism, UN Charter in Davos",
      "description": "From Davos, the President of the UN General Assembly on Wednesday warned that the world has entered a “make‑or‑break” moment for multilateralism, saying the rules‑based order can survive only if states speak the truth and act when it’s hard. She called for a cross‑regional alliance to push back against growing lawlessness, disinformation, and power‑based politics.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166803",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Suicide bombing at wedding in northwest Pakistan kills seven",
      "description": "Attack comes as Pakistani military readies for its fight against armed groups in areas along border with Afghanistan.",
      "url": "https://www.aljazeera.com/news/2026/1/24/suicide-bombing-at-wedding-in-northwest-pakistan-kills-seven?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 10:41:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Protests in Iran: Official casualty figures in doubt",
      "description": "The number of people killed in the brutal suppression of protests in Iran remains unclear, with reports that the injured are avoiding medical assistance out of fear.",
      "url": "https://www.dw.com/en/protests-in-iran-official-casualty-figures-in-doubt/a-75642949?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 20:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Winter attacks in Ukraine, looming food aid cuts in Nigeria, drought in Kenya",
      "description": "Russian forces launched a fresh wave of strikes across Ukraine this week which have left hundreds of thousands of families without electricity and heating amid freezing temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166810",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: War crimes probe pledges to continue work for justice and accountability",
      "description": "As President Trump launched the international Board of Peace plan for Gaza on Thursday, top independent rights experts tasked by the UN Human Rights Council with investigating grave abuses linked to the Hamas-Israel war pledged to continue their work seeking justice and accountability for all.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166807",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti explained: why the crisis is deepening — and what comes next",
      "description": "Haiti is entering 2026 facing one of the most complex crises in its recent history. On Wednesday, the Caribbean island nation will be high on the international agenda as the UN Security Council holds its first meeting of the year to update ambassadors.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166801",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At the edge of war: the Central African Republic's uneasy border with Sudan",
      "description": "The land flattens on the approach to Birao, a cut-off town ringed by savannah in the far north of the Central African Republic, where roads dissolve into dust and motorcycles vastly outnumber cars. Less than two hours’ drive from the Sudanese border, this is the edge of a fractured country still piecing itself back together, while absorbing the shockwaves of a neighbouring conflict.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166794",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Thousands of locals have left Kyiv amid blackouts",
      "description": "Residents of the Ukrainian capital are facing massive power outages, a lack of water and heat as Russia intensifies attacks on the country's energy grid. As many as 600,000 may have left the city.",
      "url": "https://www.dw.com/en/thousands-of-locals-have-left-kyiv-amid-blackouts/a-75634402?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 21:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti crisis at breaking point as gangs tighten grip ahead of transition deadline",
      "description": "Haiti’s deepening crisis has reached a critical phase, senior UN officials warned the Security Council on Wednesday, as powerful gangs continue to expand their control across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166806",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Tragic chapter on the trains sends rail superpower Spain into crisis",
      "description": "Spain's vaunted reputation for its high-speed network has been humbled by disaster on the railways.",
      "url": "https://www.bbc.com/news/articles/c0keelnyrvro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 00:03:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the sovereignty of the country’: Guinea-Bissau says US vaccine study suspended",
      "description": "Despite US pushback, officials in west Africa say controversial hepatitis B study on pause amid ethics concerns US health officials insisted it was still on. African health leaders said it was cancelled . At the heart of the controversy is the west African nation of Guinea-Bissau – one of the poorest countries in the world and the proposed site of a hotly debated US-funded study on vaccines. The study on hepatitis B vaccination, to be led by Danish researchers, became a flashpoint after major changes to the US vaccination schedule and prompted questions about how research is conducted ethically in other countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/guinea-bissau-hepatitis-b-vaccine-study",
      "published": "Fri, 23 Jan 2026 17:09:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Half of US braces for huge winter storm",
      "description": "Freezing snow and rain have arrived in parts of Texas, according to reports, with the storm set to move northeast over the weekend. More than 210 million people were under cold weather advisories or warnings.",
      "url": "https://www.dw.com/en/half-of-us-braces-for-huge-winter-storm/a-75621241?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 04:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "62 Nigerian hostages rescued, 2 militants killed, army says",
      "description": "Nigeria's military rescued 62 hostages and killed two militants in operations across Zamfara, Kebbi and Sokoto states after weekend church kidnappings.",
      "url": "https://www.foxnews.com/world/62-nigerian-hostages-rescued-2-militants-killed-army-says",
      "published": "Wed, 21 Jan 2026 14:08:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Turkish pro-Kurd DEM party warns of 'humanitarian tragedy' in siege on Syria's Kobane",
      "description": "DEM, Turkey's pro-Kurdish party, on Saturday called for the blockade on the Kurdish-majority city of Kobane to be lifted immediately, warning of a \"humanitarian tragedy\" in the northern Syrian town. Kurdish forces have withdrawn from areas near Kobane over the past week following pressure from the Syrian military.",
      "url": "https://www.france24.com/en/middle-east/20260124-turkish-pro-kurd-dem-party-warns-of-humanitarian-tragedy-in-siege-on-syria-s-kobane",
      "published": "Sat, 24 Jan 2026 14:26:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "European reliance on US software: A digital sovereignty challenge",
      "description": "The standoff between the US and the EU over Greenland has heightened existing European concerns about over-dependence on the United States, particularly in the digital sector, with French President Emmanuel Macron at one point threatening the U.S. with a so-called “trade bazooka” to restrict major American tech companies—a move complicated by the EU’s deep reliance on those same companies for cloud services, professional tools like Microsoft and Google, social media, entertainment, and payment systems such as Visa; for further insight on digital sovereignty, Leila Murk, an entrepreneur at tech investment firm Meresquier Partners, shares her insights.",
      "url": "https://www.france24.com/en/european-reliance-on-us-software-a-digital-sovereignty-challenge",
      "published": "Sat, 24 Jan 2026 13:47:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran's Revolutionary Guard commander warns the US, says his force has its 'finger on the trigger'",
      "description": "The commander of Iran’s paramilitary Revolutionary Guard, a force which was key in putting down recent nationwide protests in a crackdown that left thousands dead, says the force is “more ready than ever, finger on the trigger.”",
      "url": "https://abcnews.go.com/International/wireStory/irans-revolutionary-guard-commander-warns-us-force-finger-129515790",
      "published": "Sat, 24 Jan 2026 06:49:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Fox News Campus Radicals Newsletter: Union tell-all, Virginia Dems peddle DEI, far-left death threat on campus",
      "description": "Stay up to date with the Fox News Campus Radicals newsletter, which brings you the in-depth investigative stories from college campuses nationwide.",
      "url": "https://www.foxnews.com/us/fox-news-campus-radicals-newsletter-union-tell-all-virginia-dems-peddle-dei-far-left-death-threat-campus",
      "published": "Fri, 23 Jan 2026 18:21:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of sex assaults on teenage prisoners, while families charged to recover remains of loved ones",
      "description": "Iran's prosecutor general Mohammad Movahedi claims government crushed nationwide protests as death toll reaches 544 with over 10,681 arrested.",
      "url": "https://www.foxnews.com/world/iran-accused-sex-assaults-teenage-prisoners-families-charged-recover-remains-loved-ones",
      "published": "Wed, 21 Jan 2026 21:38:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "American flags torched, riot police clash with protesters ahead of Trump Davos arrival",
      "description": "Swiss riots erupt in multiple cities as anti-Trump protesters march against President Trump's World Economic Forum appearance, with police deploying water cannons.",
      "url": "https://www.foxnews.com/world/american-flags-torched-riot-police-clash-protesters-trump-davos-arrival",
      "published": "Tue, 20 Jan 2026 20:11:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Danish PM in Greenland for 'show of support' after Trump threats",
      "description": "Mette Frederiksen visits the territory after weeks of tension over the US president's warnings that he could take control of it.",
      "url": "https://www.bbc.com/news/articles/c78ejd0xmp0o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 03:52:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Indonesia landslide kills 7, dozens more missing",
      "description": "Rescue teams are searching the West Java village for 83 people who are still unaccounted for.",
      "url": "https://www.bbc.com/news/articles/c87r53y4dx0o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 06:02:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Israeli drone strike kills two children collecting firewood in Gaza",
      "description": "The attack hits civilians gathering firewood near Kamal Adwan Hospital in northern Gaza, sources say.",
      "url": "https://www.aljazeera.com/news/2026/1/24/israeli-drone-strike-kills-two-children-collecting-firewood-in-gaza?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 14:49:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump withdraws invitation for Canada to join his global ‘board of peace’",
      "description": "While leaders of many liberal democracies declined to sign on, Mark Carney had, before Davos, accepted in principle Donald Trump withdrew on Thursday an invitation for Canada to join his “board of peace” initiative aimed at resolving global conflicts. “Please let this Letter serve to represent that the Board of Peace is withdrawing its invitation to you regarding Canada’s joining, what will be, the most prestigious Board of Leaders ever assembled, at any time,” Trump wrote in a Truth Social post directed at the Canadian prime minister, Mark Carney . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/22/trump-withdraws-invitation-canada",
      "published": "Fri, 23 Jan 2026 02:28:24 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "DW correspondent arrested in Niger",
      "description": "A correspondent for German international broadcaster Deutsche Welle (DW) was arrested on January 23. It comes after a report published on DW Hausa last year.",
      "url": "https://www.dw.com/en/dw-correspondent-arrested-in-niger/a-75640860?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 16:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump says UK soldiers in Afghanistan 'among greatest of all warriors'",
      "description": "The US president's praise follows his claim that allied forces avoided the front lines during the Afghanistan conflict.",
      "url": "https://www.bbc.com/news/articles/c3edwx37pd9o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 20:48:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "New Zealand calls off rescue efforts for six missing after landslide",
      "description": "Police say they are not expecting to find any more survivors from the landslide, with six people still unaccounted for.",
      "url": "https://www.bbc.com/news/articles/c050vnl7p10o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 06:34:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "‘Remote coercion’: What has US approach been since abduction of Maduro?",
      "description": "Three weeks since attack, US plans focus on oil, but little clarity emerges, as analysts warn of Venezuela faultlines.",
      "url": "https://www.aljazeera.com/news/2026/1/24/remote-coercion-what-has-us-approach-been-since-abduction-of-maduro?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 14:24:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Australian boy injured by shark dies",
      "description": "A 12-year-old boy has died of his injuries after being mauled by a shark in Sydney Harbour, his family says. The attack came amid a spate of attacks in Australia's east.",
      "url": "https://www.dw.com/en/australian-boy-injured-by-shark-dies/a-75636311?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 06:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Eight dead and more than 80 missing after Indonesia landslide",
      "description": "At least eight people have been killed and more than 80 others are missing following a landslide on Indonesia's Java island.",
      "url": "https://news.sky.com/story/eight-dead-and-dozens-missing-after-landslide-on-indonesias-java-island-13498297",
      "published": "Sat, 24 Jan 2026 10:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Landslide on Indonesia's Java island kills at least 8, leaves dozens missing",
      "description": "A predawn landslide triggered by torrential rains on Indonesia’s main island of Java has killed at least eight people and left more than 80 missing",
      "url": "https://abcnews.go.com/International/wireStory/landslide-indonesias-java-island-kills-8-people-leaves-129514688",
      "published": "Sat, 24 Jan 2026 04:17:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Scale of Iran's nationwide protests and bloody crackdown comes into focus",
      "description": "The scale of nationwide protests in Iran and the bloody crackdown that has followed is slowly coming into focus, even though authorities have cut off the country from the internet",
      "url": "https://abcnews.go.com/International/wireStory/scale-irans-nationwide-protests-bloody-crackdown-focus-internet-129514306",
      "published": "Sat, 24 Jan 2026 02:30:16 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UN envoy highlights ‘window to advance peace’ in Colombia",
      "description": "The new year provides an opportunity for Colombia to keep advancing towards lasting peace, a decade after a landmark accord that ended more than 50 years of conflict, the UN Special Representative told the Security Council on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166818",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Man shot and killed in incident involving federal immigration agents in Minneapolis",
      "description": "A person in Minneapolis was reportedly shot during an interaction with Border Patrol agents. DHS tells Fox News that the suspect was armed.",
      "url": "https://www.foxnews.com/us/border-patrol-involved-shooting-reported-minneapolis",
      "published": "Sat, 24 Jan 2026 11:10:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Thousands march through Minneapolis, swarm Target Center demanding ICE removal from Minnesota",
      "description": "Anti-ICE agitators swarmed the Target Center in Minneapolis Friday, and thousands marched downtown demanding a stop to federal immigration enforcement operations in the city.",
      "url": "https://www.foxnews.com/us/thousands-march-through-minneapolis-swarm-target-center-demanding-ice-removal-minnesota",
      "published": "Fri, 23 Jan 2026 20:08:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump pressures UK over Hamas-linked figure as US intel flags potential terror threat",
      "description": "U.S. Treasury sanctioned Zaher Birawi, 64, alleging the Britain-based activist serves as a Hamas senior official through a Popular Conference for Palestinians Abroad leadership role.",
      "url": "https://www.foxnews.com/world/trump-pressures-uk-hamas-linked-figure-us-intel-flags-potential-terror-threat",
      "published": "Thu, 22 Jan 2026 16:46:05 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Protesters take to Minnesota streets despite freezing cold",
      "description": "A new wave of protests has seen hundreds of Minnesota businesses close and thousands of people march in Minneapolis and the Twin Cities to oppose the Trump administration’s expanded immigration enforcement, part of a broader “ICE Out!” general strike against the federal crackdown, while controversy has grown over Immigration and Customs Enforcement’s actions, including the detention of a 5‑year‑old boy along with his father during an operation as they returned from preschool — an incident that has drawn widespread criticism and intensified public outrage over the surge in ICE activity. Professor of Political Science and Legal Studies at Hamline University in Minnesota, David Shulz, tells us more.",
      "url": "https://www.france24.com/en/protesters-take-to-minnesota-streets-despite-freezing-cold",
      "published": "Sat, 24 Jan 2026 13:50:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘Cycle of attacks must end’: Lead UN official in Ukraine",
      "description": "The senior UN official in Ukraine, Matthias Schmale, has issued a condemnation of the massive overnight Russian drone and missile strike on several major Ukrainian cities, killing and injuring civilians, and knocking out energy infrastructure amid sub-zero temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166825",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "US-brokered Russia-Ukraine talks close with no breakthrough",
      "description": "On eve of day 2 of talks in UAE capital, Russian attacks cut off about 1.2 million from power in sub-zero temperatures.",
      "url": "https://www.aljazeera.com/news/2026/1/24/us-brokered-talks-on-ukraine-close-with-no-breakthrough?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 18:32:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Federal officers shoot man dead in Minneapolis — reports",
      "description": "A 37-year-old man has reportedly died after being shot by federal officers in the US city where anti-ICE protests have been going on for weeks.",
      "url": "https://www.dw.com/en/federal-officers-shoot-man-dead-in-minneapolis-reports/a-75641117?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 17:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Bulgarians quit Germany, choose remote work",
      "description": "Many highly skilled Bulgarians are moving back to their home country, swayed by the major income boost for remote work.",
      "url": "https://www.dw.com/en/bulgarians-quit-germany-choose-remote-work/a-75613408?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 10:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Man shot dead by US federal agents in Minneapolis amid immigration crackdown",
      "description": "Federal immigration agents shot dead a man during an operation in Minneapolis on Saturday, officials said, as police chief Brian O’Hara described an \"incredibly volatile scene\" and urged residents to avoid the area amid protests against the Trump administration’s immigration crackdown.",
      "url": "https://www.france24.com/en/americas/20260124-us-federal-agents-carry-out-another-horrific-shooting-minneapolis-governor",
      "published": "Sat, 24 Jan 2026 16:46:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Kosovo authorities arrest over 100 people over alleged ballot manipulation in December vote",
      "description": "Authorities in Kosovo have detained 109 people in connection with alleged vote manipulation that has led to a recount of last month’s early parliamentary election in the Balkan country fueling fears that a yearlong political crisis could drag on",
      "url": "https://abcnews.go.com/International/wireStory/kosovo-authorities-arrest-100-people-alleged-ballot-manipulation-129494514",
      "published": "Fri, 23 Jan 2026 12:17:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria: Renewed clashes risk derailing fragile transition",
      "description": "A tense standoff between the Syrian Government and Kurdish-led forces in the country’s northeast risks igniting wider instability just as Syria struggles to emerge from years of conflict and authoritarian rule, senior UN officials told the Security Council on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166811",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Four attacks in 48 hours: How east Australia's beaches became a 'perfect storm' for sharks",
      "description": "Human-shark encounters in Australia are rising - but experts are keen to point out it isn't the animals' fault.",
      "url": "https://www.bbc.com/news/articles/c0err023g5lo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 05:11:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran rejects UN rights resolution condemning protest killings",
      "description": "A prosecutor said at least twice more people were killed in Iran in half the time compared with the Srebrenica genocide.",
      "url": "https://www.aljazeera.com/news/2026/1/24/iran-rejects-un-rights-resolution-condemning-protest-killings?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 15:54:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US strikes alleged drug boat in Pacific, killing 2",
      "description": "The attack is the first known strike against an alleged drug-trafficking boat since the US military operation that captured Venezuelan leader Nicolas Maduro on January 3.",
      "url": "https://www.dw.com/en/us-strikes-alleged-drug-boat-in-pacific-killing-2/a-75635175?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 03:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Minnesotans begin economic strike against ICE",
      "description": "Hundreds of businesses in Minnesota closed on Friday and thousands of protesters turned out in severely cold weather to demonstrate against the ongoing immigration crackdown in the state. Professor of Law at Harvard Law School, in Cambridge, Massachussetts, Cass Sunstein, shares his insights.",
      "url": "https://www.france24.com/en/minnesotans-begin-economic-strike-against-ice",
      "published": "Sat, 24 Jan 2026 11:28:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "An avalanche in Pakistan and snowstorms in neighboring Afghanistan kill at least 20 people",
      "description": "Authorities say that an avalanche killed nine members of a single family in northwestern Pakistan while a heavy snowstorm in neighboring Afghanistan left 11 people dead",
      "url": "https://abcnews.go.com/International/wireStory/avalanche-pakistan-snowstorms-neighboring-afghanistan-kill-20-people-129496826",
      "published": "Fri, 23 Jan 2026 13:13:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Swiss court orders release on bail of bar owner in probe of fatal New Year's fire",
      "description": "A court has ordered the release on bail of one of the owners of the Swiss bar where a fire broke out during a New Year’s celebration, killing 40 people and injuring more than 100",
      "url": "https://abcnews.go.com/International/wireStory/swiss-court-orders-release-bail-bar-owner-probe-129496869",
      "published": "Fri, 23 Jan 2026 13:21:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Campus Radicals: Union member tell-all, Dems back to DEI ways, more violent leftist threats on campus",
      "description": "Teachers union headlines, anti-Republican death threats and Virginia Democrats' new push for DEI in the classroom rounded out Campus Radicals coverage for the week.",
      "url": "https://www.foxnews.com/us/campus-radicals-teachers-union-tell-all-dems-back-dei-ways-more-violent-leftist-threats-campus",
      "published": "Sat, 24 Jan 2026 09:00:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran Revolutionary Guard commander says regime has 'finger on the trigger' as US warships head to Middle East",
      "description": "Iran's Revolutionary Guard chief warns U.S. it has \"finger on the trigger\" as American warships head to Middle East amid anti-regime protests.",
      "url": "https://www.foxnews.com/world/iran-revolutionary-guard-commander-says-regime-has-finger-trigger-us-warships-head-middle-east",
      "published": "Sat, 24 Jan 2026 16:09:04 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump slams UK island handoff deal that could put key US military base at risk",
      "description": "President Donald Trump calls the United Kingdom's Chagos Islands transfer plan \"an act of great stupidity,\" warning China could exploit the deal.",
      "url": "https://www.foxnews.com/world/trump-slams-uk-island-handoff-deal-put-key-us-military-base-risk",
      "published": "Wed, 21 Jan 2026 18:25:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Vietnam leader To Lam consolidates power as country targets 10% growth",
      "description": "Lam, 68, pledged to accelerate economic growth and was reappointed unanimously by the 180-member Central Committee at the conclusion of the National Party Congress.",
      "url": "https://www.npr.org/2026/01/23/g-s1-106993/vietnam-leader-to-lam-consolidates-power-as-country-targets-10-growth",
      "published": "Fri, 23 Jan 2026 09:40:47 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Gaza reconstruction talks must not distract from massive needs, say UN aid agencies",
      "description": "Amid reconstruction talks on Gaza linked to President Trump's just-launched Board of Peace, UN aid agencies insisted on Friday that what Gazans need most is immediate relief from the ongoing humanitarian catastrophe there.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166815",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Brazilian man pleads guilty after biting, spitting on ICE officers in Hartford arrest: prosecutors",
      "description": "Brazilian national pleads guilty to assault on a federal officer after biting and spitting on ICE officers during Hartford arrest, according to federal prosecutors.",
      "url": "https://www.foxnews.com/us/brazilian-man-pleads-guilty-biting-spitting-ice-officers-hartford-arrest-prosecutors",
      "published": "Fri, 23 Jan 2026 16:28:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens Canada with 100% tariff over possible deal with China",
      "description": "President also claimed US refineries will process seized Venezuelan oil, saying ‘we take the oil’ Donald Trump on Saturday said he would impose a 100% tariff on all Canadian imports if the North American country makes a trade deal with China . Beside that tariff threat, another Trump foreign policy maneuver to make news on Saturday involved the president announcing the US had taken the oil that was on recently seized Venezuelan tankers. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/24/trump-canada-tariff-threat-venezuela-oil",
      "published": "Sat, 24 Jan 2026 15:04:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Canadian Olympic snowboarder turned alleged cocaine kingpin in US custody",
      "description": "Ryan Wedding turned himself in at US consulate in Mexico City and is due to appear in court in California on Monday Ryan Wedding, the Canadian Olympic snowboarder turned alleged drug kingpin , has been arrested after turning himself in at the US embassy in Mexico, law enforcement officials announced on Friday. Wedding, 44, had been sought by the FBI and the Royal Canadian Mounted Police (RCMP) for his role in overseeing what the US attorney general, Pam Bondi , called the “one of the most prolific and violent drug-trafficking organizations” in the world. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/ryan-wedding-arrested",
      "published": "Fri, 23 Jan 2026 18:11:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "‘Unfathomable’: Australian veterans disgusted by Trump’s claim allied troops ‘stayed a little back’ from frontline",
      "description": "In casting doubt on Nato’s reliability, US president references Afghanistan campaign – which involved 40,000 Australian troops and left 47 dead Get our breaking news email , free app or daily news podcast The head of Australia’s largest veteran organisation has categorically rejected Donald Trump’s claim that allied soldiers “stayed a little back” from the frontlines when they supported the US campaign in Afghanistan, calling the comments “unfathomable”. The US president made the comments on Fox News on Thursday, saying he was “not sure” Nato would meet the “ultimate test” of defending the US if it were under threat. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/24/unfathomable-australian-veterans-disgusted-by-trumps-claim-allied-troops-stayed-a-little-back-from-frontline",
      "published": "Sat, 24 Jan 2026 06:32:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis: 37-year-old man shot dead by federal officers",
      "description": "DHS said the shot person was armed and the officer \"fired defensive shots.\" Minnesota Governor Walz stressed the federal government \"cannot be trusted with handling\" the probe. Follow DW.",
      "url": "https://www.dw.com/en/minneapolis-37-year-old-man-shot-dead-by-federal-officers/live-75641710?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 17:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Haiti's transitional council deepens political chaos by voting to oust the prime minister",
      "description": "A member of Haiti’s transitional presidential council has announced that a majority of the panel has voted to fire the country’s embattled Prime Minister Alix Didier Fils-Aimé as the country’s political chaos deepens",
      "url": "https://abcnews.go.com/International/wireStory/haitis-transitional-council-deepens-political-chaos-voting-oust-129498455",
      "published": "Fri, 23 Jan 2026 14:41:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Virginia Democrats frustrate law enforcement with bill axing prison time for violent crime, expert warns",
      "description": "Virginia Democrats propose eliminating minimum prison sentences for violent crimes including rape and manslaughter, sparking widespread controversy and debate.",
      "url": "https://www.foxnews.com/us/virginia-democrats-frustrate-law-enforcement-bill-axing-prison-time-violent-crime-expert-warns",
      "published": "Sat, 24 Jan 2026 06:00:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Man who allegedly threatened to shoot ICE agents had rifles, body armor and ammo cache, feds say",
      "description": "An Ohio man who allegedly threatened ICE agents on social media is facing federal charges after authorities found guns and tactical gear at his home.",
      "url": "https://www.foxnews.com/us/man-allegedly-threatened-shoot-ice-agents-rifles-body-armor-ammo-cache-feds",
      "published": "Fri, 23 Jan 2026 21:03:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators, including clergy, arrested at Minneapolis airport during protest in frigid weather",
      "description": "Faith leaders and clergy arrested at Minneapolis airport during anti-ICE protest demanding airlines refuse federal immigration enforcement cooperation.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-clergy-arrested-minneapolis-airport-protest-frigid-weather",
      "published": "Fri, 23 Jan 2026 18:39:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Climber delays rope-free skyscraper challenge over rain",
      "description": "Alex Honnold is attempting to scale one of the world's tallest buildings, Taipei 101 in Taiwan.",
      "url": "https://www.bbc.com/news/articles/c8rm135lnneo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 15:39:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Bangladesh out of T20 World Cup after ICC’s refusal to change venues",
      "description": "Scotland replace Bangladesh after the BCB's request to relocate its games from India is turned down by the ICC.",
      "url": "https://www.aljazeera.com/sports/2026/1/24/bangladesh-out-of-t20-world-cup-after-iccs-refusal-to-change-venues?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 14:49:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UNESCO has officially added yodeling to its list of 'Intangible Cultural Heritage'",
      "description": "Yodeling has been officially recognized by the UN as part of the world's intangible cultural heritage.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5684328/unesco-has-officially-added-yodeling-to-its-list-of-intangible-cultural-heritage",
      "published": "Sat, 24 Jan 2026 07:27:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Where is the US-China AI 'race' heading in 2026?",
      "description": "With American tech continuing to dominate developing the frontier of artificial intelligence, China is holding its own with globally popular cheaper models and plans for building an AI-powered economy in the near future.",
      "url": "https://www.dw.com/en/where-is-the-us-china-ai-race-heading-in-2026/a-75608670?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 12:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "How Israeli settler violence empties Palestinian villages",
      "description": "Settler violence has forced over 100 people out of a Palestinian Bedouin village in the occupied West Bank in recent weeks, rights groups say. The pattern of harassment is also being repeated elsewhere.",
      "url": "https://www.dw.com/en/how-israeli-settler-violence-empties-palestinian-villages/a-75595251?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 12:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Young people must be ‘truly involved’ in transforming education",
      "description": "With young people under 30 making up more than half of the global population and over 272 million children and youth still out of school, their participation in shaping education is becoming increasingly vital.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166820",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Eighty years at the heart of global development",
      "description": "From humanitarian crises and youth unemployment, to climate resilience and development financing, many of today’s global challenges pass through a single United Nations body that is quietly turning 80 this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166814",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "For every $1 spent protecting nature, $30 goes to destroying it",
      "description": "The world spends billions to protect nature, but trillions are being invested in business activities that harm the environment.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166809",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Two days of peace talks end as Russia continues Ukraine attacks",
      "description": "There is no apparent breakthrough as the three-way talks conclude and Russia maintains its bombardment.",
      "url": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 16:56:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany arrests suspected Hamas member over alleged attack plot",
      "description": "The Lebanese man helped helped plan attacks on Jewish and Israeli institutions in Europe, prosecutors say.",
      "url": "https://www.bbc.com/news/articles/c8rm14lkkvzo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 18:57:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boy, 12, dies from injuries after Sydney shark attack",
      "description": "Nico Antic was swimming in Sydney Harbour when he was attacked last Sunday.",
      "url": "https://www.bbc.com/news/articles/c2k98ql703no?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 05:10:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'A natural partner': US treasury secretary weighs in on Alberta separatism",
      "description": "Scott Bessent's comments come amid a war of words between Ottawa and Washington.",
      "url": "https://www.bbc.com/news/articles/cy8ylqx0zw4o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 03:20:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Electoral violence is on the horizon in Kenya",
      "description": "Conditions in Kenya are ripe for the weaponisation of violence in the presidential vote. It is up to Kenyans to stop it.",
      "url": "https://www.aljazeera.com/opinions/2026/1/24/electoral-violence-is-on-the-horizon-in-kenya?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 10:44:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Over 8,000 flights cancelled as major winter storm bears down across US",
      "description": "More than a dozen states sound the alarm, declaring emergencies or urging people to stay home.",
      "url": "https://www.aljazeera.com/news/2026/1/24/over-8000-flights-cancelled-as-major-winter-storm-bears-down-across-us?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 08:28:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Air France resumes Dubai flights after temporary suspension",
      "description": "Flights were paused after Trump said 'armada' of US warships heading towards the Middle East.",
      "url": "https://www.aljazeera.com/news/2026/1/24/air-france-klm-pause-flights-to-middle-east-including-dubai-israel?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 06:11:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nico Antic, 12, dies in hospital after being attacked by a shark in Sydney",
      "description": "Family confirms boy has died almost a week after the attack, describing him as possessing the ‘most kind and generous spirit’ Get our breaking news email , free app or daily news podcast A 12-year-old boy has died in hospital after being mauled by a shark in Sydney Harbour last weekend, his family has confirmed. The boy, named as Nico Antic in an online fundraiser, had been fighting for his life after being bitten on both legs on 18 January at a harbour beach in Vaucluse, in Sydney’s east. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/24/nico-antic-12-dies-in-hospital-after-being-attacked-by-a-shark-in-sydney",
      "published": "Sat, 24 Jan 2026 03:52:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A Canadian Olympic snowboarder turned alleged drug kingpin is arrested in Mexico",
      "description": "Ryan Wedding was among the FBI's top fugitives and faces charges related to drug trafficking and the killing of a federal witness. He reportedly turned himself in at the U.S. embassy in Mexico",
      "url": "https://www.npr.org/2026/01/23/g-s1-107051/ryan-wedding-arrest-canada-olympic-snowboarder-alleged-drug-kingpin",
      "published": "Fri, 23 Jan 2026 13:35:25 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "New Zealand works to identify human remains after landslide",
      "description": "Of the six people presumed dead, two were teenagers. The coroner's office warned that identifying the human remains could be a long and complex process.",
      "url": "https://www.dw.com/en/new-zealand-works-to-identify-human-remains-after-landslide/a-75637721?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 07:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Brutal' attack on Ukraine amid talks",
      "description": "The first three-way talks between Russia, Ukraine and the US have ended with no apparent breakthrough, following renewed Russian bombardment of Ukrainian targets. France24 correspondent Gulliver Cragg tells us more.",
      "url": "https://www.france24.com/en/brutal-attack-on-ukraine-amid-talks",
      "published": "Sat, 24 Jan 2026 16:11:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Barbaric' attack during Ukraine peace talks - but 'unexpected chemistry' raises hopes",
      "description": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said.",
      "url": "https://news.sky.com/story/barbaric-attack-on-ukraines-largest-cities-during-peace-talks-further-negotiations-expected-as-early-as-next-week-13498413",
      "published": "Sat, 24 Jan 2026 14:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boy, 12, dies after shark attack in Sydney Harbour",
      "description": "An Australian boy attacked by a shark in Sydney Harbour has died in hospital, his family has announced.",
      "url": "https://news.sky.com/story/boy-12-dies-after-shark-attack-in-sydney-harbour-13498258",
      "published": "Sat, 24 Jan 2026 07:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Blood-curdling accounts' of killings and sexual violence: What we know about landmark genocide case",
      "description": "When Dr Ronan Lee spoke to members of the Rohingya community, he heard \"blood-curdling accounts\" of killings and sexual violence allegedly carried out by Myanmar's security forces.",
      "url": "https://news.sky.com/story/blood-curdling-accounts-of-killings-and-sexual-violence-what-we-know-about-landmark-rohingya-genocide-case-13497127",
      "published": "Sat, 24 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Wife of Uganda's opposition leader recounts how armed men attacked her at her home",
      "description": "Armed men have attacked the home of Ugandan opposition leader Bobi Wine, targeting his wife, Barbara Kyagulanyi",
      "url": "https://abcnews.go.com/International/wireStory/wife-ugandas-opposition-leader-recounts-armed-men-attacked-129518396",
      "published": "Sat, 24 Jan 2026 10:09:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Freezing and in the dark, Kyiv residents are stranded in tower blocks as Russia targets power system",
      "description": "Kyiv is facing prolonged winter power outages as Russian missile and drone attacks continue to damage Ukraine’s energy infrastructure",
      "url": "https://abcnews.go.com/International/wireStory/freezing-dark-kyiv-residents-stranded-tower-blocks-russia-129513472",
      "published": "Sat, 24 Jan 2026 00:33:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Envoys travel the globe to push a US plan for ending Russia's war in Ukraine",
      "description": "The U.S.-led push to end Russia’s nearly 4-year-old war in Ukraine gained momentum late last year and is moving ahead in 2026, with leaders, diplomats and envoys traveling to a flurry of meetings to discuss a potential deal",
      "url": "https://abcnews.go.com/International/wireStory/envoys-travel-globe-push-us-plan-ending-russias-129495824",
      "published": "Fri, 23 Jan 2026 12:57:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Keeping people warm amid hostilities and harsh winter weather in Ukraine",
      "description": "As people in war-torn Ukraine face the coldest winter in more than a decade, authorities and humanitarians are working to help them stay warm, particularly the most vulnerable residents.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166822",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Parents’ relentless hunt for missing daughter heats up as new technology breathes life into case",
      "description": "Jennifer Kesse's parents refuse to give up searching for their daughter 20 years after she disappeared in Orlando. New AI technology brings hope.",
      "url": "https://www.foxnews.com/us/parents-relentless-hunt-missing-daughter-heats-up-new-tech-breathes-life-case",
      "published": "Sat, 24 Jan 2026 10:00:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia, Ukraine to discuss territory as Trump says both sides 'want to make a deal'",
      "description": "Abu Dhabi hosts trilateral meeting with the U.S., Ukraine and Russia in a possible sign that the nearly four-year war could be coming to an end.",
      "url": "https://www.foxnews.com/world/russia-ukraine-discuss-territory-trump-says-both-sides-want-make-deal",
      "published": "Fri, 23 Jan 2026 15:25:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Canadian PM Carney fires back at Trump over claim that 'Canada lives because of the United States'",
      "description": "Prime Minister Mark Carney rejected President Donald Trump's claim that \"Canada lives because of the United States,\" declaring Canada \"thrives because we are Canadian.\"",
      "url": "https://www.foxnews.com/world/canadian-pm-carney-fires-back-trump-over-claim-canada-lives-because-united-states",
      "published": "Fri, 23 Jan 2026 10:19:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Stuck between the US and Russia, Canada must prove it can defend its Arctic territory",
      "description": "Canada has been boosting its forces in the Arctic in the face of new threats - and US concerns.",
      "url": "https://www.bbc.com/news/articles/c9vx0p77pn8o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 00:05:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Pentagon to reduce its role in deterrence of North Korea",
      "description": "US policy document suggests South Korea take primary responsibility, as Pentagon prioritises defending US homeland The Pentagon foresees a “more limited” role in deterring North Korea, with South Korea taking primary responsibility for the task, a Pentagon policy document released on Friday said, in a move likely to raise concern in Seoul. South Korea hosts about 28,500 US troops in combined defence against North Korea’s military threat and Seoul has raised its defence budget by 7.5% for this year. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/24/north-korea-pentagon-to-reduce-role-deterrence",
      "published": "Sat, 24 Jan 2026 06:18:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens Canada with 100% tariffs over its new trade deal with China",
      "description": "The announcement is a reversal for Trump, who initially initially praised the agreement with China as something Canadian Prime Minister Mark Carney \"should be doing.\"",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5687236/canada-china-tariffs-trump",
      "published": "Sat, 24 Jan 2026 11:53:17 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Virginia Democrats blasted for threatening historic military college VMI with funding threat over DEI concerns",
      "description": "Virginia Democrats introduce resolution to investigate VMI funding as Governor Spanberger faces criticism for DEI push at historic military college.",
      "url": "https://www.foxnews.com/us/virginia-democrats-blasted-threatening-historic-military-college-vmi-funding-threat-over-dei-concerns",
      "published": "Sat, 24 Jan 2026 08:00:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Pentagon to offer 'more limited' support to US allies in defence strategy shift",
      "description": "The US will also offer “more limited” support to US allies, according to a new national defence strategy document.",
      "url": "https://www.bbc.com/news/articles/cj9r8ezym3ro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 07:57:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US federal agents shoot and kill another person in Minneapolis",
      "description": "Minneapolis police chief Brian O'Hara says a 37-year-old man died in hospital after suffering multiple gunshot wounds.",
      "url": "https://www.aljazeera.com/news/2026/1/24/us-federal-agents-shoot-another-person-in-minneapolis-governor?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 16:56:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Thousands in Minneapolis brave bitter cold to protest ICE crackdown",
      "description": "Protesters march in icy conditions against Trump administration's anti-immigration policies, demanding ICE leave city.",
      "url": "https://www.aljazeera.com/news/2026/1/24/thousands-in-minneapolis-brave-bitter-cold-to-protest-ice-crackdown?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 08:17:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Spanish prosecutors drop sexual assault complaint against Julio Iglesias",
      "description": "Court says alleged abuse and trafficking offences occurred outside Spain, leaving it without jurisdiction Spanish prosecutors have shelved a complaint brought by two women who have accused the singer Julio Iglesias of sexual assault and human trafficking , arguing the country’s courts have no jurisdiction as the alleged offences took place outside Spain. Two female former employees who worked at Iglesias’s Caribbean mansions 10 days ago accused the veteran entertainer of sexual assault, saying they had been subjected “to inappropriate touching, insults and humiliation … in an atmosphere of control and constant harassment”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/spanish-prosecutors-drop-julio-iglesias-complaint",
      "published": "Fri, 23 Jan 2026 18:20:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Man shot by US federal agents in Minneapolis immigration crackdown dies",
      "description": "No description available.",
      "url": "https://www.france24.com/en/americas/20260124-us-federal-agents-carry-out-another-horrific-shooting-minneapolis-governor",
      "published": "Sat, 24 Jan 2026 17:05:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US officials enter Al-Hol camp in Syria",
      "description": "The United Nations announced it will assume control of the Al-Hol camp in north-eastern Syria, which houses thousands of people suspected of having links to the Islamic State group, after Kurdish-led forces that had been managing the facility withdrew amid an advance by Syrian government troops. Yinka Oyetade reports.",
      "url": "https://www.france24.com/en/us-officials-enter-al-hol-camp-in-syria",
      "published": "Sat, 24 Jan 2026 10:27:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US strikes boat killing 2 in Pacific",
      "description": "The US military conducted its first strike on a vessel suspected of drug-trafficking in the eastern Pacific since late last year, killing two people and prompting a US Coast Guard search for a third survivor, in an operation that follows the Trump administration’s campaign against alleged smuggling boats begun in early September and comes shortly after US forces captured Venezuelan leader Nicolás Maduro earlier this month; meanwhile, a Venezuelan town hopes to benefit from initial plans to open the nation’s oil sector to private investment, potentially attracting US energy majors.",
      "url": "https://www.france24.com/en/us-strikes-boat-killing-2-in-pacific",
      "published": "Sat, 24 Jan 2026 10:25:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens Canada with 100% tariffs over China trade deal",
      "description": "Trump made the threat in a social media post as tensions rise between the US and its northern neighbour.",
      "url": "https://www.bbc.com/news/articles/cy4qww3w72lo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 16:27:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China places highest-ranking general under investigation",
      "description": "President Xi has been accused of using investigations to purge political rivals.",
      "url": "https://www.bbc.com/news/articles/c701kr5zqdqo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 14:14:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ceasefire between Syrian army and Kurdish-led forces extended for 15 days",
      "description": "Syrian defence ministry says extension aims to help transfer of ISIS prisoners from facilities previously held by SDF.",
      "url": "https://www.aljazeera.com/news/2026/1/24/ceasefire-between-syrian-army-and-kurdish-led-forces-extended-for-15-days?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 20:25:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens 100 percent tariff on Canada over China deal",
      "description": "Donald Trump's threat comes after Canada reached deal with China last week on trade of agriproducts, electric vehicles.",
      "url": "https://www.aljazeera.com/news/2026/1/24/trump-threatens-100-percent-tariff-on-canada-over-china-deal?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 16:11:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Change is inevitable’: What is next for Iran?",
      "description": "Without changes and a deal with US to lift sanctions, Iran could be set for further unrest, analysts say.",
      "url": "https://www.aljazeera.com/news/2026/1/24/change-is-inevitable-what-is-next-for-iran?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 09:59:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Leaked video shows Venezuela regime’s desperate struggle to control message",
      "description": "Interim leader Delcy Rodríguez told influencers of US threat to kill leaders if they did not cooperate after capture of Maduro The communications minister holds a phone up to a microphone before a gathering of regime-friendly influencers. On speakerphone is Venezuela’s acting president, Delcy Rodríguez , who claims that when US forces captured the dictator Nicolás Maduro , she and other members of his cabinet were given 15 minutes to decide whether to comply with Washington’s demands – “or they would kill us”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/venezuela-leaked-video-delcy-rodriguez-maduro",
      "published": "Fri, 23 Jan 2026 12:00:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Australian journalism ‘sidelined’ in AI-generated news summaries on Copilot, research shows",
      "description": "Exclusive: Experts say AI is likely to create more news deserts, fewer independent voices and threaten the viability of Australian journalism Get our breaking news email , free app or daily news podcast Australian journalism is largely “invisible” in AI-generated news summaries from Microsoft Copilot, which overwhelmingly favour US or European media, research by the University of Sydney has found. Roughly one-fifth of responses to Copilot news prompts feature links to Australian media sources, according to researcher Dr Timothy Koskie from the university’s Centre for AI, Trust and Governance . Continue reading...",
      "url": "https://www.theguardian.com/media/2026/jan/25/ai-generated-news-summaries-microsoft-copilot-australian-journalism",
      "published": "Sat, 24 Jan 2026 19:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China's top general under investigation in latest military purge",
      "description": "Analysts believe these purges aim to reform the military and ensure loyalty to Chinese leader Xi Jinping. Another commission member, Liu Zhenli, is also under investigation.",
      "url": "https://www.npr.org/2026/01/24/g-s1-107210/chinas-top-general-under-investigation-in-latest-military-purge",
      "published": "Sat, 24 Jan 2026 08:38:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US defense plan focuses on homeland, limits help to allies",
      "description": "A new Pentagon strategy paper breaks with much past US defense policy, while ignoring climate change as a growing threat. It also foresees allies receiving less military support from Washington.",
      "url": "https://www.dw.com/en/us-defense-plan-focuses-on-homeland-limits-help-to-allies/a-75638387?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 11:10:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota: Police arrest clergy members amid ICE protests",
      "description": "Thousands of people from various groups have shown up for protests in the adjacent cities of Minneapolis and St. Paul to protest against ICE operations.",
      "url": "https://www.dw.com/en/minnesota-police-arrest-clergy-members-amid-ice-protests/a-75634207?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 02:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China's top general under investigation",
      "description": "Chinese leader Xi Jinping’s military purge has intensified sharply, with the party now investigating the last two top military officials who had survived earlier crackdowns. The vice chair of the Central Military Commission, the PLA’s highest-ranking general, along with another CMC member, are under scrutiny for alleged disciplinary violations, leaving the commission at its smallest size in history and placing Xi in sole operational control, according to Camille Knight.",
      "url": "https://www.france24.com/en/china-s-top-general-under-investigation",
      "published": "Sat, 24 Jan 2026 13:53:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "The most striking photos of the week",
      "description": "From the Northern Lights to the aftermath of protests in Iran, here are the images of the week chosen by the Sky News picture editors.",
      "url": "https://news.sky.com/story/the-most-striking-photos-of-the-week-13498292",
      "published": "Sat, 24 Jan 2026 09:39:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China's top general under investigation in latest military purge",
      "description": "China's Defense Ministry says the military's top general is under investigation for serious violations of discipline and law",
      "url": "https://abcnews.go.com/International/wireStory/chinas-top-general-investigation-latest-military-purge-129514693",
      "published": "Sat, 24 Jan 2026 04:09:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Dangerous nostalgia’ is a threat to multilateralism, UN deputy chief tells Danish MPs",
      "description": "United Nations Deputy Secretary-General Amina Mohammed urged countries to protect the UN Charter in a powerful speech to the Danish Parliament on Thursday, urging countries to “stand up for a rules-based order” – or pay the price.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166812",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "More than 15,000 US flights have now been disrupted by America’s massive winter storm",
      "description": "Massive winter storm triggers over 15,000 flight disruptions as U.S. braces for historic winter weather with more than 190 million Americans in the storm's path.",
      "url": "https://www.foxnews.com/us/more-than-15000-us-flights-have-now-been-disrupted-americas-massive-winter-storm",
      "published": "Sat, 24 Jan 2026 08:07:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "United Kingdom: Man admits drugging, raping ex-wife",
      "description": "A former British local councillor has pleaded guilty to nearly 50 criminal offences, including repeatedly drugging and raping his former wife over a period spanning more than a decade, with the alleged crimes occurring between 2010 and 2023 and a trial scheduled to begin in October. Gabrielle Nadler reports.",
      "url": "https://www.france24.com/en/united-kingdom-man-admits-drugging-raping-ex-wife",
      "published": "Sat, 24 Jan 2026 10:32:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Pakistani human rights lawyers jailed for 17 years over social media posts",
      "description": "A Pakistani court has sentenced a lawyer couple to 17 years in prison each over social media posts authorities said were hostile to the state and its security institutions",
      "url": "https://abcnews.go.com/International/wireStory/pakistani-human-rights-lawyers-jailed-17-years-social-129516505",
      "published": "Sat, 24 Jan 2026 10:42:08 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Berlin vows aggressive cybersecurity stance",
      "description": "Berlin promises to take down bad cyber actors and a new report prompts questions of whether police should carry Tasers to keep them from having to use guns in self-defense. Follow DW here for the latest.",
      "url": "https://www.dw.com/en/germany-news-berlin-vows-aggressive-cybersecurity-stance/live-75639462?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 13:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Limited access restored to Syria’s Al Hol camp amid security concerns",
      "description": "United Nations agencies have regained limited access to Syria’s Al Hol camp and resumed the delivery of essential supplies after days of disruption caused by a volatile security situation, the UN Deputy Spokesperson said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166824",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Iran's top prosecutor criticizes Trump's announcement that 800+ executions were halted: 'Completely false'",
      "description": "Iran’s top prosecutor Mohammad Movahedi is criticizing an announcement from President Donald Trump that Iran recently canceled more than 800 executions.",
      "url": "https://www.foxnews.com/world/irans-top-prosecutor-criticizes-trumps-announcement-800-executions-were-halted-completely-false",
      "published": "Fri, 23 Jan 2026 14:18:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Palestinians say Jared Kushner's vision for Gaza erases what's left of their homes",
      "description": "Jared Kushner unveiled a vision of a futuristic cityscape for Gaza that includes skyscrapers and advanced industrial zones, but Palestinians fear his vision erases what remains of their homes.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5685111/palestinians-say-jared-kushners-vision-for-gaza-erases-whats-left-of-their-homes",
      "published": "Fri, 23 Jan 2026 04:48:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Australian Open: Outside play suspended over extreme heat",
      "description": "Open courts had to be covered mid-play at the Australian Open in Melbourne, as conditions hit an extreme on the Heat Stress Scale. Courts which did not have a roof could not be used until 5:30 pm local time.",
      "url": "https://www.dw.com/en/australian-open-outside-play-suspended-over-extreme-heat/a-75636537?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 06:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "TikTok US venture to collect precise user location data",
      "description": "Details on the expanded access to location information was published in a new privacy policy for the popular social media app.",
      "url": "https://www.bbc.com/news/articles/cvgnj7v2rr5o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 03:06:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How Soviet urban planning is helping Russia freeze Ukraine",
      "description": "Thousands of people are affected when heating plants are targeted by Russian forces.",
      "url": "https://www.bbc.com/news/articles/c338jpk8r1vo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 24 Jan 2026 13:56:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I didn't hear from my son for seven months': Inside Yemen's UAE-run secret prisons",
      "description": "The BBC sees sites on former United Arab Emirates bases in Yemen where detainees say they were abused.",
      "url": "https://www.bbc.com/news/articles/c3r117w55q4o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 14:43:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump covets mineral-rich Greenland, but what natural resources does it actually have?",
      "description": "Greenland's natural resources include large reserves of rare earth deposits.",
      "url": "https://www.bbc.com/news/articles/cly9230yw15o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 12:39:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Villarreal vs Real Madrid – La Liga",
      "description": "Follow our live build-up, with full team news coverage, before our comprehensive text commentary stream.",
      "url": "https://www.aljazeera.com/sports/liveblog/2026/1/24/live-villarreal-vs-real-madrid-la-liga?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 17:01:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syria truce with Kurdish-led forces expires amid uncertainty over renewal",
      "description": "Syria's foreign ministry denies government forces reached an agreement with SDF on extending the deadline.",
      "url": "https://www.aljazeera.com/news/2026/1/24/as-ceasefire-deadline-looms-pressure-on-sdf-to-integrate-with-syrian-army?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 14:20:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump’s imperial tantrum",
      "description": "Trump’s imperial rampage - the tweets, the rants, the petulance.",
      "url": "https://www.aljazeera.com/video/the-listening-post/2026/1/24/trumps-imperial-tantrum?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 12:41:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US army says homeland, curbing China priorities; limited support for allies",
      "description": "A new Pentagon strategy document softens tone on traditional foes, China and Russia.",
      "url": "https://www.aljazeera.com/news/2026/1/24/us-army-says-homeland-curbing-china-priorities-limited-support-for-allies?traffic_source=rss",
      "published": "Sat, 24 Jan 2026 07:06:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Science teachers from Queensland Open Brethren schools told to teach students about vegetarian dinosaurs on Noah’s Ark",
      "description": "Teachers who attended ‘compulsory’ creationist conference run by US-based fundamentalist group told radiometric dating techniques were flawed Get our breaking news email , free app or daily news podcast Teachers employed by a large group of Queensland Christian schools were told to teach creationism in science classes, including that vegetarian baby dinosaurs would have been taken aboard Noah’s Ark. Last year, the Open Brethren organisation Christian Community Ministries (CCM) hosted a Christian science conference by the US-based fundamentalist group Answers in Genesis, which once built a replica of Noah’s Ark – with model dinosaurs included . Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/25/science-teachers-from-queensland-open-brethren-schools-told-to-teach-students-about-vegetarian-dinosaurs-on-noahs-ark",
      "published": "Sat, 24 Jan 2026 19:00:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Olivia Dean’s Man I Need wins Triple J’s Hottest 100",
      "description": "Dancing2 by Keli Holiday comes in second, with almost twice as many Australian songs making the count this year compared to last Get our breaking news email , free app or daily news podcast British pop sensation Olivia Dean has taken out the number one spot in Australia’s largest music poll, Triple J’s Hottest 100, with her single Man I Need. The breezy neo-soul hit, which has spent 10 consecutive weeks atop the Aria singles chart, was widely tipped as the favourite to win the 2025 vote, in which 2.1m votes were cast. Dean finished ahead of Australian artist Keli Holiday, whose TikTok-fuelled earworm Dancing2 claimed No 2. Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/24/olivia-dean-man-i-need-triple-j-hottest-100-winner-australia",
      "published": "Sat, 24 Jan 2026 09:35:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-24T19:36:12.020Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-24T18:21:33.201Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-23T21:11:10.851Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-24T03:46:34.908Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Danish community reacts to Trump's rhetoric around Greenland",
      "description": "Danish citizens say President Trump's latest push to control Greenland is changing their view on Denmark's relationship with America.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5685036/danish-community-reacts-to-trumps-rhetoric-around-greenland",
      "published": "Sat, 24 Jan 2026 07:27:55 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US-NATO deal: Relief and mistrust in Greenland",
      "description": "A \"framework\" agreement between the US and NATO has defused the dispute over Greenland. There is cautious relief among residents, but also fear of becoming a geopolitical pawn once again.",
      "url": "https://www.dw.com/en/us-nato-deal-relief-and-mistrust-in-greenland/a-75641044?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 17:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine: Zelenskyy calls Abu Dhabi talks 'constructive'",
      "description": "The Ukrainian president said the talks with Russia and the US could resume \"as early as next week.\" Meanwhile, Russian missiles have hit Kyiv and Kharkiv, killing one person. DW has more.",
      "url": "https://www.dw.com/en/ukraine-zelenskyy-calls-abu-dhabi-talks-constructive/live-75614291?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 14:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US wants extra Winter Olympics spot for skeleton's Uhlaender",
      "description": "IOC President Kirsty Coventry has been asked to intervene after Katie Uhlaender was the victim of alleged competition manipulation, causing her to miss out on February's Winter Olympics.",
      "url": "https://www.dw.com/en/us-wants-extra-winter-olympics-spot-for-skeleton-s-uhlaender/a-75639366?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 11:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany weighs boon and bane of China's industrial expansion",
      "description": "From cheap exports to cutting-edge tech: A Chinese battery giant's secretive factory in Germany shows how \"Made in China\" and \"Made in Germany\" are colliding — and where they can benefit from each other.",
      "url": "https://www.dw.com/en/germany-weighs-boon-and-bane-of-china-s-industrial-expansion/a-75583089?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 24 Jan 2026 09:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French Prime Minister survives two no confidence votes",
      "description": "On Friday - the French Prime Minister survived not one - but two no confidence motions in Parliament. Both the far-left and the far-right were unhappy that Sebastien LeCornu forced through the income portion of a budget bill without a vote by MP's. We speak with Renaud Foucart, a senior lecturer in Economics at Lancaster University about the budget and the upcoming municipal elections.",
      "url": "https://www.france24.com/en/tv-shows/a-week-in-france/20260124-french-prime-minister-survives-two-no-confidence-votes",
      "published": "Sat, 24 Jan 2026 16:38:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Europe’s digital reliance on US Big Tech: Does the EU have a plan?",
      "description": "Souring transatlantic relations between the EU and US have exposed one of Europe’s greatest vulnerabilities: its heavy reliance on US Big Tech. EU lawmakers are pushing for homegrown alternatives – but how realistic are their goals?",
      "url": "https://www.france24.com/en/europe/20260124-europe-s-digital-reliance-on-us-big-tech-does-the-eu-have-a-plan",
      "published": "Sat, 24 Jan 2026 14:25:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump praises 'very brave' UK troops after fury over Afghanistan remarks",
      "description": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline.",
      "url": "https://news.sky.com/story/trump-pays-tribute-to-very-brave-british-soldiers-who-served-in-afghanistan-13498256",
      "published": "Sat, 24 Jan 2026 06:46:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China no longer America's top defence priority, Pentagon says",
      "description": "China is no longer the US Pentagon's top priority, shifting its focus to the homeland and Western Hemisphere, an influential new strategy document says.",
      "url": "https://news.sky.com/story/china-no-longer-americas-top-defence-priority-pentagon-says-13498252",
      "published": "Sat, 24 Jan 2026 02:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Novak Djokovic apologises after ball nearly hits ball girl at Australian Open",
      "description": "Novak Djokovic has apologised after almost hitting a ball girl with the ball during his history-making Australian Open third-round match on Saturday.",
      "url": "https://news.sky.com/story/djokovic-apologises-after-ball-nearly-hits-ball-girl-during-history-making-win-at-australian-open-13498431",
      "published": "Sat, 24 Jan 2026 15:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan opposition leader claims wife held 'at gunpoint' after 'hundreds of soldiers' raided his home",
      "description": "Uganda's opposition leader claims \"hundreds of soldiers\" raided his home overnight and held his wife at gunpoint, leaving destruction everywhere.",
      "url": "https://news.sky.com/story/ugandan-opposition-leader-bobi-wine-claims-wife-held-at-gunpoint-after-hundreds-of-soldiers-raided-his-home-13498321",
      "published": "Sat, 24 Jan 2026 11:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraq’s dominant political bloc nominates former prime minister al-Maliki as its candidate",
      "description": "Iraq’s dominant political bloc has nominated former prime minister Nouri al-Maliki as its candidate for prime minister",
      "url": "https://abcnews.go.com/International/wireStory/iraqs-dominant-political-bloc-nominates-former-prime-minister-129527146",
      "published": "Sat, 24 Jan 2026 14:49:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Combining exercise with volunteering works out for members of a UK alternative to gyms",
      "description": "A nonprofit organization in the United Kingdom has attracted thousands of members by encouraging residents to “get fit by doing good.”",
      "url": "https://abcnews.go.com/International/wireStory/combining-exercise-volunteering-works-members-uk-alternative-gyms-129513110",
      "published": "Sat, 24 Jan 2026 00:33:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Suicide bomber targets wedding ceremony in northwest Pakistan, killing 7, wounding 25",
      "description": "Police say a suicide bomber has detonated an explosive vest among guests at a wedding ceremony in northwest Pakistan, killing at least seven people and wounding 25 others",
      "url": "https://abcnews.go.com/International/wireStory/suicide-bomber-targets-wedding-ceremony-northwest-pakistan-killing-129496974",
      "published": "Fri, 23 Jan 2026 15:11:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK's Starmer slams Trump for \"insulting and frankly appalling\" comments about non-US NATO troops in Afghanistan",
      "description": "UK's Starmer slams Trump for \"insulting and frankly appalling\" comments about non-US NATO troops in Afghanistan",
      "url": "https://abcnews.go.com/International/wireStory/uks-starmer-slams-trump-insulting-frankly-appalling-comments-129493053",
      "published": "Fri, 23 Jan 2026 11:37:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russia, Ukraine and the US are holding peace talks in Abu Dhabi. They're coming at a key moment",
      "description": "Ukrainian, Russian and U.S. envoys are meeting in the United Arab Emirates, the first known instance that officials from the Trump administration have sat down with both countries as part of Washington’s push to end Moscow’s nearly 4-year-old invasion",
      "url": "https://abcnews.go.com/International/wireStory/russia-ukraine-us-holding-peace-talks-abu-dhabi-129493046",
      "published": "Fri, 23 Jan 2026 13:35:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cold kills another infant in Gaza as West Bank displacement intensifies",
      "description": "Another child in the Gaza Strip has died from hypothermia as winter weather continues to whip the enclave, the UN said on Wednesday, citing information from the health authorities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166804",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Elizabeth Smart reveals her kidnapper tried to abduct her teen cousin as his ‘next wife’",
      "description": "Elizabeth Smart reveals her captor Brian David Mitchell planned to kidnap her cousin Olivia Wright as his second \"wife\" during her nine-month captivity.",
      "url": "https://www.foxnews.com/us/elizabeth-smart-reveals-her-kidnapper-tried-abduct-her-teen-cousin-his-next-wife",
      "published": "Sat, 24 Jan 2026 14:00:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "FBI Director Kash Patel hails transfer of Most Wanted fugitive Alejandro Rosales Castillo after Mexico arrest",
      "description": "Alejandro Castillo, accused of murdering coworker \"Sandy\" Ly Le in 2016, was transferred to Charlotte after his arrest in Mexico after a yearslong manhunt.",
      "url": "https://www.foxnews.com/us/fbi-director-kash-patel-hails-transfer-most-wanted-fugitive-alejandro-rosales-castillo-after-mexico-arrest",
      "published": "Fri, 23 Jan 2026 19:36:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "DHS releases image of illegal immigrant accused of abandoning his 5-year-old son while fleeing ICE",
      "description": "DHS released an image of a father who authorities said abandoned 5-year-old son while fleeing ICE agents in Minneapolis. Officials say family refused child.",
      "url": "https://www.foxnews.com/us/dhs-released-image-illegal-immigrant-accused-abandoning-his-5-year-old-son-while-fleeing-ice",
      "published": "Fri, 23 Jan 2026 17:25:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ruby Franke’s son breaks silence on jailed YouTube mom, reads diaries from before arrest: 'I was brainwashed'",
      "description": "Ruby Franke's son Chad broke his silence on TikTok, reading 2023 diary entries revealing how he was \"brainwashed\" before her child abuse conviction.",
      "url": "https://www.foxnews.com/us/ruby-franke-son-breaks-silence-jailed-youtube-mom-reads-diaries-from-before-arrest-brainwashed",
      "published": "Fri, 23 Jan 2026 17:02:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fox News True Crime Newsletter: Nanny love triangle murders, Luigi Mangione battle, Ohio dentist slayings",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-nanny-love-triangle-murders-luigi-mangione-battle-ohio-dentist-slayings",
      "published": "Fri, 23 Jan 2026 16:55:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Texas posthumously exonerates Tommy Lee Walker, executed 70 years prior for rape and murder of White woman",
      "description": "Dallas County exonerated Tommy Lee Walker, a Black man wrongfully executed in 1956 for rape and murder after a coerced confession and all-White jury trial.",
      "url": "https://www.foxnews.com/us/texas-posthumously-exonerates-tommy-lee-walker-executed-70-years-prior-rape-murder-white-woman",
      "published": "Fri, 23 Jan 2026 16:48:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Indiana judge and wife allegedly shot by 'high-ranking' gang member facing trial in victim's court",
      "description": "Five arrests were made after Lafayette judge Steven Meyer and his wife were shot at their home. The suspects are allegedly connected to a motorcycle gang.",
      "url": "https://www.foxnews.com/us/indiana-judge-wife-allegedly-shot-high-ranking-gang-member-facing-trial-victims-court",
      "published": "Fri, 23 Jan 2026 15:27:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Surgeon accused of killing ex-wife and her dentist husband gets first look at Ohio court with legal defense",
      "description": "A surgeon accused of killing his ex-wife and her dentist husband pleads not guilty to murder charges after his extradition from Illinois to Ohio court proceedings.",
      "url": "https://www.foxnews.com/us/surgeon-accused-killing-ex-wife-dentist-husband-gets-first-look-ohio-court-legal-eagle-defense",
      "published": "Fri, 23 Jan 2026 15:13:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian oil tanker, the Grinch, intercepted as US, allies escalate sanctions crackdown",
      "description": "A Russian oil tanker was intercepted between Spain and Morocco as western powers intensify efforts to disrupt Moscow's sanctions-evading shadow fleet operations.",
      "url": "https://www.foxnews.com/world/navy-boards-russian-oil-tanker-grinch-suspected-evading-western-sanctions",
      "published": "Thu, 22 Jan 2026 21:25:07 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "American OnlyFans star with Mexican cartel ties kidnapped at gunpoint outside mall",
      "description": "An Arizona OnlyFans star was allegedly kidnapped at gunpoint in Mexico, according to video. Nicole Pardo Molina's abduction may be linked to a cartel rivalry in Sinaloa.",
      "url": "https://www.foxnews.com/world/american-onlyfans-star-mexican-cartel-ties-kidnapped-gunpoint-mall",
      "published": "Thu, 22 Jan 2026 21:13:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters still at large after Syrian prison break, contributing to volatile security situation",
      "description": "ISIS prisoners escaped from a northeastern Syria prison, and some remain unaccounted for after chaos made tracking impossible, according to Syria analyst Nanar Hawach.",
      "url": "https://www.foxnews.com/world/isis-fighters-still-large-syrian-prison-break-contributing-volatile-security-situation",
      "published": "Thu, 22 Jan 2026 19:12:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark's prime minister insists sovereignty is non-negotiable as Trump announces Greenland deal 'framework'",
      "description": "Denmark's prime minister said she won't negotiate her nation's sovereignty after President Donald Trump said a \"framework\" on a Greenland deal was reached.",
      "url": "https://www.foxnews.com/world/denmarks-prime-minister-insists-sovereignty-non-negotiable-trump-announces-greenland-deal-framework",
      "published": "Thu, 22 Jan 2026 08:19:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US begins transferring ISIS detainees from Syria to Iraq amid security transition",
      "description": "U.S. forces moved 150 ISIS detainees from Syria to Iraq as CENTCOM began a transfer operation involving up to 7,000 radical prisoners.",
      "url": "https://www.foxnews.com/world/us-begins-transferring-isis-detainees-from-syria-iraq-amid-security-transition",
      "published": "Wed, 21 Jan 2026 14:20:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu agrees to join Trump’s Gaza Board of Peace after initial pushback",
      "description": "Israeli Prime Minister Benjamin Netanyahu said he will join President Donald Trump’s newly formed Gaza Board of Peace after initially criticizing its structure.",
      "url": "https://www.foxnews.com/world/netanyahu-agrees-join-trumps-gaza-board-peace-after-initial-pushback",
      "published": "Wed, 21 Jan 2026 03:35:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}