{
  "last_updated": "2026-01-17T16:46:42.182053Z",
  "event_count": 221,
  "events": [
    {
      "title": "Security Council LIVE: UN raises alarm over deadly Iran protests and ‘possible military strikes’",
      "description": "The UN Security Council is meeting in New York in emergency session on Iran, amid escalating concern over reports that hundreds have been killed during weeks of nationwide anti-government protests. The meeting was requested by the United States. Demonstrations that began in late December, fuelled by soaring inflation, rising food prices and the collapse of the national currency, triggered a deadly and widespread crackdown with thousands injured and detained, according to numerous firsthand accounts. The UN has called for independent investigations into all killings and warned against the possible use of the death penalty against protesters. Follow live coverage below, and UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "Extreme rainfall inundates South Africa and Mozambique",
      "description": "Flood warning raised to highest level with roads washed away and rain forcing evacuation of Kruger national park Large areas of north-eastern South Africa and neighbouring Mozambique have been inundated for several days with exceptionally heavy rainfall. Some locations in South Africa recorded hundreds of millimetres of rain over the weekend, such as Graskop in Mpumalanga, where 113mm fell in 24 hours, and Phalaborwa, which recorded about 85mm of rainfall. Rain has continued to fall across the region since the weekend. The deluge has been driven by a slow-moving cut-off low pressure system that has remained anchored over the region, repeatedly drawing in moisture and triggering intense downpours. Further heavy rainfall is expected on Friday and over the weekend. Maputo, Mozambique’s capital, could expect daily rainfall totals to exceed 200mm by the end of Friday, while western parts of South Africa and north-western Eswatini may record more than 100mm. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/16/weather-tracer-extreme-rainfall-inundates-south-africa-mozambique-flood-warning",
      "published": "Fri, 16 Jan 2026 10:16:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 42,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protest movement subsides amid intense crackdown",
      "description": "Protests in Iran have subsided after a crackdown that has killed thousands under an internet blackout, monitors said Friday, a week after the start of the largest demonstrations in years challenging the country's theocratic system. Siavosh Ghazi, FRANCE 24 Tehran correspondent, said Saturday that security forces remain largely present for a fifth consecutive day as official media continue to report arrests of people described as members of terrorist groups.",
      "url": "https://www.france24.com/en/video/20260117-iran-protest-movement-subsides-amid-intense-crackdown-1",
      "published": "Sat, 17 Jan 2026 10:07:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns of a world in chaos as impunity and unpredictability spreads",
      "description": "In his final annual address outlining his priorities, UN Secretary-General António Guterres warned that the world is “brimming with conflict, impunity, inequality and unpredictability” – even as international cooperation is fraying at the moment it is most needed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166772",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Syrian army enters northern towns after Kurdish fighters withdraw",
      "description": "Syrian government forces entered two northern towns Saturday morning after the command of Kurdish-led fighters said it would evacuate the area in an apparent move to avoid conflict. Two soldiers were killed and others wounded in a clash as they entered the town of Maskana, state media reported. Meanwhile, troops made their way into the town of Deir Hafer.",
      "url": "https://www.france24.com/en/syrian-army-enters-northern-towns-after-kurdish-fighters-withdraw",
      "published": "Sat, 17 Jan 2026 14:10:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Global employment stable but decent jobs in short supply",
      "description": "Global unemployment remains stable, but progress toward decent work has stalled, according to a new report from the International Labour Organization (ILO), which warns that young people continue to struggle in a job market which risks being further undermined by AI and trade policy uncertainty.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166751",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "At least 32 killed as crane collapses on train in Thailand",
      "description": "Crane in use on high-speed rail project hits passing train, causing it to derail At least 32 people in Thailand have been killed and scores injured after a crane collapsed on to a passenger train and derailed it, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars and smoke rising from the wreckage of the train below. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths",
      "published": "Wed, 14 Jan 2026 15:44:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "More than 100 people die as torrential rain and flooding hit three countries",
      "description": "More than 100 people have been killed after torrential rain caused flooding across South Africa, Mozambique and Zimbabwe, with authorities issuing warnings that more severe weather is expected across several countries in southern Africa.",
      "url": "https://news.sky.com/story/more-than-100-people-die-after-torrential-rain-and-flooding-in-south-africa-mozambique-and-zimbabwe-13495037",
      "published": "Fri, 16 Jan 2026 16:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Sydney awaits ‘soggiest weekend of summer’ as Victorian authorities defend flash flood warnings",
      "description": "Floods predicted for NSW south coast after severe storms dumped 180mm in six hours on Victoria’s Lorne and Wye River, washing cars into the sea on the Great Ocean Road Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Authorities have defended the timing of warnings for holidaymakers along Victoria’s surf coast who were hit by an “unprecedented” downpour on Thursday, as Sydney awaited its “soggiest weekend of summer” to date. Weatherzone forecasters predicted 20mm of rainfall was possible in Sydney on both Saturday and Sunday, which would be a record for the time of year. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/16/warnings-for-flash-floods-on-victorias-surf-coast-were-not-issued-late-authorities-say",
      "published": "Fri, 16 Jan 2026 08:50:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Rights group says thousands of protesters killed in Iran",
      "description": "Norway-based rights group Iran Human Rights (IHR) says 3,428 protesters have been verified to have been killed by security forces in Iran since protests began, but warns the actual toll could be several times higher. Other estimates place the death toll at more than 5,000 – and possibly as high as 20,000 – with the internet blackout severely hampering independent verification, IHR said.",
      "url": "https://www.france24.com/en/video/20260117-rights-group-says-thousands-of-protesters-killed-in-iran-1",
      "published": "Sat, 17 Jan 2026 11:29:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "'Massacre' as Uganda election descends into deadly violence - as opposition leader is 'taken away'",
      "description": "At least seven people have been killed as Uganda's presidential election descended into violence, with the opposition party saying their leader had been forcibly taken away.",
      "url": "https://news.sky.com/story/uganda-election-descends-into-deadly-violence-as-president-yoweri-museveni-looks-to-cling-to-power-13495081",
      "published": "Fri, 16 Jan 2026 15:36:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "UNRWA officials lobby congressional staffers against Trump terrorist designation threat",
      "description": "UNRWA officials briefed congressional staffers on potential Trump administration plans to designate the U.N. agency as a terrorist organization.",
      "url": "https://www.foxnews.com/world/unrwa-officials-lobby-congressional-staffers-against-trump-terrorist-designation-threat",
      "published": "Fri, 16 Jan 2026 10:57:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Turkey says Syria using force is an option against US-backed fighters who helped defeat ISIS",
      "description": "Syria conflict escalates as Turkey warns Damascus may use force against Kurdish SDF fighters after deadly clashes near Aleppo reportedly killed 23.",
      "url": "https://www.foxnews.com/world/turkey-says-syria-using-force-option-against-us-backed-fighters-who-helped-defeat-isis",
      "published": "Thu, 15 Jan 2026 14:48:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's protests appear increasingly smothered after a deadly crackdown",
      "description": "The nationwide protests challenging Iran's theocracy appear increasingly smothered a week after authorities shut the country off from the world and escalated a bloody crackdown.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5678539/iran-protests-trump",
      "published": "Thu, 15 Jan 2026 11:56:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Amid Sudan’s humanitarian crisis, Chad shows ‘act of solidarity’",
      "description": "In war-torn Sudan, local communities say they don’t have enough settlements for the internally displaced, few solutions for women who have suffered sexual violence – and there’s a lack of aid available for people with disabilities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166777",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "WFP warns Sudan food aid could run out in March",
      "description": "The World Food Programme (WFP) said on Thursday that it is struggling to keep emergency operations running in Sudan, where more than 1,000 days of war have pushed families to the brink.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166766",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Federal judge restricts ICE agents amid ongoing Minneapolis area protests",
      "description": "U.S. District Judge Kate Menendez, in Minnesota, bars ICE and Border Patrol from using tear gas against peaceful protesters during Operation Metro Surge in Minneapolis following deadly shooting of Renee Good.",
      "url": "https://www.foxnews.com/us/federal-judge-restricts-ice-agents-amid-ongoing-minneapolis-area-protests-over-fatal-shooting",
      "published": "Sat, 17 Jan 2026 00:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Top Iran prayer leader who dubbed protesters 'Trump's soldiers' calls for executions amid ongoing unrest",
      "description": "Iranian cleric reportedly calls for death penalty against protesters as regime claims widespread damage to mosques and hospitals during nationwide unrest.",
      "url": "https://www.foxnews.com/world/top-iran-prayer-leader-who-dubbed-protesters-trumps-soldiers-calls-executions-amid-ongoing-unrest",
      "published": "Fri, 16 Jan 2026 10:19:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Ohio dentist slayings suspect indicted on more aggravated murder, burglary charges",
      "description": "Michael McKee indicted on murder charges in fatal shootings of dentist Spencer Tepe and wife Monique in Columbus, Ohio, domestic violence case.",
      "url": "https://www.foxnews.com/us/ohio-dentist-slayings-suspect-indicted-more-aggravated-murder-burglary-charges",
      "published": "Fri, 16 Jan 2026 13:07:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Game-changing international ocean treaty comes into force",
      "description": "Almost two decades in the making, an international agreement to protect and sustainably use marine life in international waters and the international seabed is due to come into force on Saturday, marking a major step forward in efforts to ensure the health of ocean ecosystems for decades to come.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166762",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN urges ‘maximum restraint’ to avert more death, wider escalation",
      "description": "As nationwide protests in Iran appear to ease after nearly three weeks of unrest and bloodshed, a senior UN official called on Thursday for action to prevent further escalation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166773",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Renee Good was shot 4 times, including in the head, fire report shows",
      "description": "Renee Good suffered four gunshot wounds in the fatal ICE-involved shooting, not three as initially reported, according to a Minneapolis fire incident report.",
      "url": "https://www.foxnews.com/us/renee-good-shot-four-times-including-head-fire-report-shows",
      "published": "Fri, 16 Jan 2026 09:10:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Filipino migrant worker’s death in NSW referred to federal police",
      "description": "Deputy state coroner concludes 21-year-old, who died after exiting a moving vehicle, was ‘exploited’ and exposed to ‘potentially criminal’ conduct in five weeks in Australia Get our breaking news email , free app or daily news podcast A New South Wales coroner has referred the death of a Filipino migrant worker, who died after jumping from a moving vehicle in 2019, to the Australian federal police to consider further investigations. NSW deputy state coroner Rebecca Hosking handed down the findings into the death of 21-year-old Jerwin Royupa on Friday. She concluded Royupa, a trainee at a winery, was “exploited” and exposed to “potentially criminal” conduct during his five weeks in Australia. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/17/filipino-migrant-workers-death-in-nsw-referred-to-federal-police",
      "published": "Sat, 17 Jan 2026 04:26:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iran supreme leader admits thousands killed during recent protests",
      "description": "Ayatollah Ali Khamenei says some deaths were “inhuman” and “savage” but blames the US.",
      "url": "https://www.bbc.com/news/articles/ckglee733wno?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 14:43:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran: Khamenei holds Trump 'guilty' for deaths in protests",
      "description": "Iran's supreme leader, Ayatollah Ali Khamenei, blamed US President Donald Trump for the casualties that occurred during the recent protests in Iran. Follow DW for the latest.",
      "url": "https://www.dw.com/en/iran-khamenei-holds-trump-guilty-for-deaths-in-protests/live-75547340?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 12:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Pakistan road crashes kill at least 24 people and injure 45 others",
      "description": "Authorities in Pakistan say at least two dozen people have been killed and 45 others injured in separate road crashes hours apart",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-road-crashes-kill-24-people-injure-45-129306767",
      "published": "Sat, 17 Jan 2026 10:02:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "WATCH: Ellen Greenberg’s ex-fiancé dodges questions as feds reopen death case of teacher with 23 stab wounds",
      "description": "Federal authorities reportedly reopen investigation into Ellen Greenberg's controversial 2011 death as former fiancé Sam Goldberg spotted in NYC.",
      "url": "https://www.foxnews.com/us/watch-ellen-greenberg-ex-fiance-dodges-questions-feds-reopen-death-case-teacher-with-23-stab-wounds",
      "published": "Sat, 17 Jan 2026 09:00:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Uganda’s opposition leader ‘taken by army’ as Museveni nears re-election",
      "description": "Bobi Wine flown to unknown location, his party says, hours after security forces allegedly killed 10 of his campaigners The Ugandan opposition leader Bobi Wine was taken from his house and brought to an unknown location on Friday, his party said as President Yoweri Museveni closed in on a landslide re-election. Wine’s National Unity Platform party said on Friday evening in a post on X that an army helicopter had landed in his compound in the capital, Kampala, and “forcibly taken him away to an unknown destination”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/uganda-election-early-results-show-museveni-in-lead-as-violence-reported",
      "published": "Fri, 16 Jan 2026 21:33:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Christian and Muslim faith leaders express ‘deep concerns’ about Labor bill’s impact on free speech – as it happened",
      "description": "This blog is now closed Penny Wong says Sussan Ley’s leadership ‘unsalvageable’ after Coalition flags opposition to new hate laws Could Labor’s hate speech laws damage Australia’s free speech? Here’s what you need to know about the contentious bill Get our breaking news email , free app or daily news podcast Larissa Waters , the Greens’ leader, also says she’s concerned there has not been enough time to evaluate the legislation, warning there are a “raft of unintended consequences that could occur”. Waters told RN Breakfast: We’ve only had a handful of days to look at this legislation, and it’s very consequential legislation … And with every turn, experts and stakeholders and faith leaders and academics are finding new concerns with it. A key concern is that you can’t combat hate if you don’t combat it for everyone. A key concern that we have … is that these laws, as they’re drafted right now, could be weaponised to shut down legitimate political protest. Given the tightness of the timeframe … there is a real risk that locking in laws that aren’t right could criminalise people for legitimate political expression. That is a dangerous path. We’ve got serious concerns with respect to whether or not the bill meets its objective … It really is concerning that we’re in this stage where we’re less than one business day away from parliament coming together and these serious concerns persist. We’re in a situation where we’re dealing with such a significant piece of legislation, complicated legislation, legislation which deals with the raft of matters which are contained in this one monster omnibus bill, which is a totally inappropriate way to address this situation. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/16/hate-speech-legislation-political-reaction-anthony-albanese-labor-sussan-ley-coalition-greens-adelaide-festival-writers-week-backlash-sydney-protest-ban-ntwnfb",
      "published": "Fri, 16 Jan 2026 06:15:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "US issues 'military activity' flight advisory over Latin America",
      "description": "The warnings come as Trump has suggested possible military strikes against drug cartel targets in Mexico. However, Mexican authorities said the US advisory has no operational implications for Mexico.",
      "url": "https://www.dw.com/en/us-issues-military-activity-flight-advisory-over-latin-america/a-75545335?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 03:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Top Iranian general threatens to 'cut off' Trump's hand over potential military strikes",
      "description": "Senior Iranian official Mohsen Rezaei warns American military bases in the region would not be safe from retaliation as U.S. aircraft carrier reportedly moves toward Middle East.",
      "url": "https://www.foxnews.com/world/top-iranian-general-threatens-cut-off-trumps-hand-over-potential-military-strikes",
      "published": "Fri, 16 Jan 2026 01:14:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Thousands join ‘Hands off Greenland’ protests amid Trump’s takeover threats",
      "description": "Copenhagen rally organiser says 'world must wake up' as Donald Trump threatens to seize self-governing Danish island.",
      "url": "https://www.aljazeera.com/news/2026/1/17/thousands-join-hands-off-greenland-protests-amid-trumps-takeover-threats?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 16:03:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran’s Khamenei says US, Israel links behind ‘thousands killed’ in protests",
      "description": "The country's supreme leader says foreign-backed protests 'caused massive damage and killed several thousands'.",
      "url": "https://www.aljazeera.com/news/2026/1/17/irans-khamenei-says-us-israel-links-behind-thousands-killed-in-protests?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 11:31:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "No sign of new protests in Iran as a hard-line cleric calls for executions",
      "description": "A Iran returns to an uneasy calm after protests led to a violent crackdown, a senior cleric is calling for the death penalty for detained demonstrators. His sermon Friday also threatened U.S. President Trump.",
      "url": "https://www.npr.org/2026/01/16/g-s1-106345/iran-protests-cleric-ayatollah-ahmad-khatami-trump-threat",
      "published": "Fri, 16 Jan 2026 19:44:18 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Family of Iranian protester searched for her body in a pile of corpses and buried her on a roadside",
      "description": "The family of a 23-year-old Iranian college student believes she was killed by a bullet fired by Iranian security forces",
      "url": "https://abcnews.go.com/International/wireStory/family-iranian-protester-searched-body-pile-corpses-buried-129304045",
      "published": "Sat, 17 Jan 2026 03:53:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "11-year streak of record global warming continues, UN weather agency warns",
      "description": "The past 11 years have been the warmest in the modern era, while oceans continue to heat up, too, says the UN weather agency.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166758",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Photos: Gaza ceasefire brings no relief as Israeli bombings continue",
      "description": "Over 80 percent of Gaza's infrastructure lies in ruins as residents endure precarious living conditions and limited aid.",
      "url": "https://www.aljazeera.com/gallery/2026/1/17/photos-gaza-ceasefire-brings-no-relief-as-israeli-bombings-continue?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 11:35:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US takeover of Greenland could mean ‘end of NATO as we know it’, expert warns",
      "description": "Large crowds gathered in Copenhagen to protest US President Donald Trump’s push to take over Greenland, an autonomous Danish territory. As both Denmark and the United States are members of the NATO alliance, any US aggression against another member state raises profound questions about the bloc’s future. If the United States were to invade Greenland, “this would essentially mean the end of NATO as we know it,” said Guntram Wolff, a senior fellow at Bruegel.",
      "url": "https://www.france24.com/en/video/20260117-us-takeover-of-greenland-could-mean-end-of-nato-as-we-know-it-expert-warns-1",
      "published": "Sat, 17 Jan 2026 12:58:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Kurdish granted national language status in Syria",
      "description": "Syrian President Ahmed al-Sharaa issued a decree on Friday declaring Kurdish a \"national language\", in an apparent gesture of good will towards the minority following clashes in recent days. The decree is the first formal recognition of Kurdish national rights since Syria's independence in 1946.",
      "url": "https://www.france24.com/en/kurdish-granted-national-language-status-in-syria",
      "published": "Sat, 17 Jan 2026 10:12:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Aid cuts push millions in West and Central Africa deeper into hunger",
      "description": "A staggering 55 million people across West and Central Africa are expected to suffer crisis levels of hunger, or worse, during the lean season from June to August as funding cuts to humanitarian operations continue amid rising violence and displacement.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166776",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar’s Rohingya people called ‘Muslim dogs’ before attacks, ICJ hears",
      "description": "Hearings continued on Thursday at the UN’s top court into the Gambia’s claim that Myanmar committed genocide against the Rohingya people, with allegations that military officials incited violence through hate speech, calling the ethnic minority “Muslim dogs” who should be made “extinct”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166764",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Secret Service aware after Iranian state TV airs Trump threat featuring photo of Butler assassination attempt",
      "description": "Iranian state TV allegedly aired threatening message against Trump, referencing his Butler assassination attempt with caption \"this time, it won't miss.\"",
      "url": "https://www.foxnews.com/us/secret-service-aware-after-iranian-state-tv-airs-trump-threat-featuring-photo-butler-assassination-attempt",
      "published": "Fri, 16 Jan 2026 12:14:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "A prosecutor’s child witnessed Charlie Kirk’s assassination — can he take part in the case?",
      "description": "Defense attorneys claim conflict of interest in Charlie Kirk assassination case after prosecutor's family member witnessed the shooting at public event.",
      "url": "https://www.foxnews.com/us/prosecutors-child-witnessed-charlie-kirk-assassination-can-he-take-part-case",
      "published": "Fri, 16 Jan 2026 06:00:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iran appears to reopen airspace after Trump says killing is 'stopping'",
      "description": "Iran appeared to reopen its airspace after a sudden overnight closure disrupted regional flights amid ongoing security warnings and mounting regional tensions.",
      "url": "https://www.foxnews.com/world/iran-appears-reopen-airspace-after-trump-says-killing-stopping",
      "published": "Thu, 15 Jan 2026 08:19:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Korean prosecutors demand death penalty for former president Yoon Suk Yeol",
      "description": "Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol",
      "published": "Wed, 14 Jan 2026 00:43:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "East Jerusalem: Forced shutdown of UN clinic signals escalating disregard for international law",
      "description": "The temporary closure of a UN-run health centre in East Jerusalem is the latest phase in “a pattern of deliberate disregard” for international law, the head of the UN agency that assists Palestine refugees, UNRWA, said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166760",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Khamenei calls Trump a ‘criminal,’ blames him for deadly protests sweeping Iran",
      "description": "Iran's supreme leader accused President Donald Trump of orchestrating protests as tensions escalate. State radio broadcasts threats as thousands reported dead.",
      "url": "https://www.foxnews.com/world/khamenei-calls-trump-criminal-blames-him-deadly-protests-sweeping-iran",
      "published": "Sat, 17 Jan 2026 07:49:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "FAA warns about flying in Central, South America and eastern Pacific, citing possible ‘military activities’",
      "description": "The FAA issued a series of flight safety warnings for U.S. airlines flying over the eastern Pacific near Mexico, Central America and South America",
      "url": "https://www.foxnews.com/world/faa-warns-about-flying-central-south-america-eastern-pacific-citing-possible-military-activities",
      "published": "Sat, 17 Jan 2026 07:20:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Exiled Iranian crown prince reveals 6-step plan to exert pressure on Tehran's regime",
      "description": "Exiled Iranian crown prince Reza Pahlavi outlined his 6-step plan to exert international pressure on the regime, describing it as being \"close to collapse\"",
      "url": "https://www.foxnews.com/world/exiled-iranian-crown-prince-reveals-6-step-plan-exert-pressure-tehrans-regime",
      "published": "Fri, 16 Jan 2026 13:50:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump’s push to acquire Greenland sparks international media frenzy on remote island",
      "description": "A surge of international media has descended on Greenland as President Trump renews his push to acquire the strategic Arctic island.",
      "url": "https://www.foxnews.com/world/trumps-push-acquire-greenland-sparks-international-media-frenzy-remote-island",
      "published": "Fri, 16 Jan 2026 02:44:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Under fire from the sea, families in Odesa try to escape Russian barrage",
      "description": "Ukraine's third largest city has come under sustained attack on its ports in a Russian bid to sap morale.",
      "url": "https://www.bbc.com/news/articles/cnvg70v1z0ro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 00:14:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ceasefire in Palestine? What ceasefire?",
      "description": "While Israeli mass violence continues to kill Palestinians, the UK government continues to choose complicity.",
      "url": "https://www.aljazeera.com/opinions/2026/1/17/ceasefire-in-palestine-what-ceasefire?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 10:37:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Rare twins born in DRC raise cautious hope for endangered mountain gorillas",
      "description": "Virunga park ranger says babies are well cared for by mother Mafuko but high infant mortality makes first weeks critical It was noon by the time Jacques Katutu first saw the newborn mountain gorillas. Cradled in the arms of their mother, Mafuko, the tiny twins clung to her body for warmth in the forest clearing in Virunga national park, in eastern Democratic Republic of the Congo (DRC). Katutu, head of gorilla monitoring in Virunga, has seen dozens of newborns in his 15 years as a ranger. But, he tells the Guardian, even he was touched by the sight of the fragile infant males, who face serious obstacles if they are to become silverbacks one day. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/17/twin-baby-mountain-gorilla-virunga-drc-survival-conservation-aoe",
      "published": "Sat, 17 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Man armed with bow and arrow shot dead by NSW police",
      "description": "The incident at Gunnedah near Tamworth is the third fatality involving police in the state this year Get our breaking news email , free app or daily news podcast A man armed with a bow and arrow has been shot dead by police in New South Wales as they carried out a welfare check – the third fatality involving officers this year. Authorities attended the man’s house in Gunnedah near Tamworth on Friday at 1.40pm after receiving a call about concerns for his welfare. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/16/police-shoot-dead-man-armed-with-bow-and-arrow-in-new-south-wales",
      "published": "Fri, 16 Jan 2026 08:48:24 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Exiled Iranian women in Germany: 'All that remains is rage!'",
      "description": "Iran's regime has been cracking down on protesters with brutal force. Images of bodies in shrouds have provoked shock and outrage around the world — including among five Iranian women living in Germany.",
      "url": "https://www.dw.com/en/exiled-iranian-women-in-germany-all-that-remains-is-rage/a-75532977?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 05:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Big names on Trump's peace panel face huge challenges in Gaza",
      "description": "Whatever the concerns and complexities, it remains the only plan in town, with many world leaders pledging to support it, writes John Sudworth.",
      "url": "https://www.bbc.com/news/articles/c07xvv9r422o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 14:31:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran: The protests, the blackout and the narrative war",
      "description": "Internal revolt and external pressure collide in Iran. Plus, Cory Doctorow on the AI hype machine.",
      "url": "https://www.aljazeera.com/video/the-listening-post/2026/1/17/iran-the-protests-the-blackout-and-the-narrative-war?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 12:47:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "How dangerous are Iranian secret services in Germany?",
      "description": "Iranians in exile are being targeted by the regime's secret services, which is believed to be responsible for thousands of deaths since the start of the mass protests in Iran.",
      "url": "https://www.dw.com/en/how-dangerous-are-iranian-secret-services-in-germany/a-75538204?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 16:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Kyiv schools closed until February after Russia energy strikes",
      "description": "Schools in Ukrainian capital Kyiv will close until the next month, mayor Vitali Klitschko announced Friday, citing \"difficult conditions\" after Russian strikes battered the energy sector amid below-freezing temperatures. FRANCE 24's Gulliver Cragg reports.",
      "url": "https://www.france24.com/en/video/20260117-kyiv-schools-closed-until-february-after-russia-energy-strikes-1",
      "published": "Sat, 17 Jan 2026 11:26:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "South Africa investigates Iran's participation in naval drills off its coast after US criticism",
      "description": "South Africa has launched an investigation over the participation of Iranian warships in naval drills off its coast",
      "url": "https://abcnews.go.com/International/wireStory/south-africa-investigates-irans-participation-naval-drills-off-129278989",
      "published": "Fri, 16 Jan 2026 10:49:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Tyler Robinson's lover Lance Twiggs no longer protected by FBI: What we know about alleged assassin's partner",
      "description": "FBI ends protection for transgender partner of Charlie Kirk's alleged assassin Tyler Robinson after four months of ongoing investigation into the shooting.",
      "url": "https://www.foxnews.com/us/tyler-robinson-lover-lance-twiggs-no-longer-protected-by-fbi-what-we-know-about-alleged-assassins-partner",
      "published": "Sat, 17 Jan 2026 08:00:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Passenger’s Wi-Fi name triggers bomb scare, forces Turkish Airlines emergency landing",
      "description": "Turkish Airlines flight makes emergency landing in Barcelona after passenger creates hoax bomb threat using Wi-Fi hotspot name. No explosives found.",
      "url": "https://www.foxnews.com/world/passengers-wi-fi-name-triggers-bomb-scare-forces-turkish-airlines-emergency-landing",
      "published": "Thu, 15 Jan 2026 22:01:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US sending military assets to Middle East as Trump weighs Iran strike, sources say",
      "description": "A U.S. military aircraft carrier is in motion toward the Middle East amid rising tensions against the Iranian regime, well-placed military sources have confirmed to Fox News.",
      "url": "https://www.foxnews.com/world/us-sending-military-assets-middle-east-trump-weighs-iran-strike-sources-say",
      "published": "Thu, 15 Jan 2026 16:15:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "A regional passenger aircraft with 11 people is missing in Indonesia and a search is underway",
      "description": "A regional passenger aircraft carrying 11 people has lost contact with ground control while approaching a mountainous region between Java and Sulawesi islands in Indonesia",
      "url": "https://abcnews.go.com/International/wireStory/regional-passenger-aircraft-11-people-missing-indonesia-search-129306305",
      "published": "Sat, 17 Jan 2026 09:29:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Ukrainian delegation arrives in US for peace talks as Russia hammers energy sites",
      "description": "A Ukrainian delegation has arrived in the United States for talks on a U.S.-led diplomatic push to end the nearly 4-year-old war",
      "url": "https://abcnews.go.com/International/wireStory/ukrainian-delegation-arrives-us-peace-talks-russia-hammers-129305290",
      "published": "Sat, 17 Jan 2026 07:05:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "At top UN court, Myanmar denies deadly Rohingya campaign amounts to genocide",
      "description": "Myanmar insists its military campaign against the Rohingya ethnic minority was a legitimate counter-terrorism operation, not genocide",
      "url": "https://abcnews.go.com/International/wireStory/top-court-myanmar-denies-deadly-rohingya-campaign-amounts-129271222",
      "published": "Fri, 16 Jan 2026 06:31:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Sudan: A truce of separation",
      "description": "The proposed humanitarian ceasefire in Sudan aims to undermine the unity of the country.",
      "url": "https://www.aljazeera.com/opinions/2026/1/17/sudan-a-truce-of-separation?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 09:35:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "A protester from Iran shares her experience",
      "description": "NPR's Scott Simon speaks with A., an Iranian who recently left the country after participating in several days of protests.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5677587/a-protester-from-iran-shares-her-experience",
      "published": "Sat, 17 Jan 2026 07:43:01 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "911 transcripts, documents detail chaotic scene after ICE agent fatally shot Renee Good",
      "description": "Renee Nicole Good suffered four gunshot wounds, according to newly released reports. Witnesses described the chaotic scene and said she was shot at 'point-blank' range.",
      "url": "https://www.foxnews.com/us/911-transcripts-documents-detail-chaotic-scene-after-ice-agent-fatally-shot-renee-good",
      "published": "Fri, 16 Jan 2026 22:02:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "ICE releases photos after violent Minneapolis protests leave multiple alleged agitators arrested",
      "description": "ICE released photos of four alleged agitators arrested on federal charges during Minneapolis protests outside the Bishop Henry Whipple Federal Building Thursday.",
      "url": "https://www.foxnews.com/us/ice-releases-photos-after-violent-minneapolis-protests-leave-multiple-alleged-agitators-arrested",
      "published": "Fri, 16 Jan 2026 16:11:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "US justice department investigating Minnesota Democrats over alleged obstruction of ICE",
      "description": "It comes as fresh details emerged in the death of a Minneapolis woman shot last week by an ICE agent in the city.",
      "url": "https://www.bbc.com/news/articles/czx1wgvpr1zo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 07:22:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Canada PM hails strategic partnership with China to adapt to ‘new global realities’",
      "description": "Mark Carney holds talks with Xi Jinping on rare Beijing trip as Canada seeks to diversify trade links away from US Business live – latest updates Canada’s prime minister, Mark Carney, has hailed a “new strategic partnership” with China as he held talks in Beijing with President Xi Jinping , the first visit by a Canadian leader in eight years. Addressing Xi in the Great Hall of the People, Carney said: “Together we can build on the best of what this relationship has been in the past to create a new one adapted to new global realities.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/china-canada-partnership-new-global-realities-carney-xi-jinping",
      "published": "Fri, 16 Jan 2026 09:37:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU and Mercosur countries to sign landmark free trade deal",
      "description": "The agreement took 25 years to negotiate and will create one of the world's largest free trade zones. The trade deal will be signed, despite opposition from some European farmers.",
      "url": "https://www.dw.com/en/eu-and-mercosur-countries-to-sign-landmark-free-trade-deal/a-75545794?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 11:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'Not just trade': The EU-Mercosur megadeal",
      "description": "As the EU's share of the global market slips, the Mercosur deal could unlock access to critical raw materials. It's also indicative of a wider EU economic pivot.",
      "url": "https://www.dw.com/en/not-just-trade-the-eu-mercosur-megadeal/a-75507665?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 06:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian troops clash with Kurdish forces as both sides trade blame for breaking withdrawal deal",
      "description": "At least four Syrian soldiers and an unknown number of Kurdish-led troops have been killed in clashes that broke out during the agreed withdrawal of Kurdish fighters across the Euphrates River. The Syrian army now aims to seize the city of Taqba on the river's west bank, which the Kurdish-led Syrian Democratic Forces say they had not agreed to leave.",
      "url": "https://www.france24.com/en/middle-east/20260117-syrian-troops-clash-kurdish-forces-as-sides-trade-blame-breaking-withdrawal-deal",
      "published": "Sat, 17 Jan 2026 16:35:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'Greenland fiasco: Vladimir Putin happiest person in the world' - Lt. General (ret.) Ben Hodges",
      "description": "In a wide‑ranging interview with Gavin Lee, Lt. General (ret.) Ben Hodges, former commander of U.S. Army Europe and NATO Allied Land Command, offers a candid assessment of the current geopolitical landscape: Ukraine, NATO, U.S. foreign policy and Trump's quest \"to dominate the entire Western Hemisphere.\" Hodges argues \"Greenland is not about security, just like Venezuela was not about drugs.\" Drawing on decades of military service, Hodges highlights deep structural risks to Western alliances, and reframes contemporary flashpoints as interconnected strategic challenges.",
      "url": "https://www.france24.com/en/video/20260117-greenland-fiasco-vladimir-putin-happiest-person-in-the-world-lt-general-ret-ben-hodges-3",
      "published": "Sat, 17 Jan 2026 13:30:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "French firms in Brazil eye gains from EU-Mercosur trade deal",
      "description": "French businesses in Brazil are looking to benefit from the newly inked EU-Mercosur deal which Brazil's President Luiz Inacio Lula da Silva and EU chief Ursula von der Leyen on Friday hailed as a victory for multilateralism at a time of global volatility. France is the second largest foreign investor in Brazil, but only its 14th biggest trading partner, a paradox the trade agreement could correct.",
      "url": "https://www.france24.com/en/video/20260117-french-firms-in-brazil-eye-gains-from-eu-mercosur-trade-deal-1",
      "published": "Sat, 17 Jan 2026 11:41:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Italy's Meloni posts anime selfie - as Japan PM serenades her for birthday",
      "description": "Giorgia Meloni might have a new best friend in world politics after Japan's prime minister laid on cake and gifts - and even sang happy birthday to the Italian leader.",
      "url": "https://news.sky.com/story/italys-meloni-posts-anime-selfie-as-japan-pm-serenades-her-for-birthday-13495164",
      "published": "Fri, 16 Jan 2026 20:05:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Senegal hope Morocco final will not be Mane’s AFCON farewell",
      "description": "Former Liverpool forward Sadio Mane announced after the semifinal that he would not appear at another AFCON for Senegal.",
      "url": "https://www.aljazeera.com/sports/2026/1/17/senegal-hope-morocco-final-will-not-be-manes-afcon-farewall?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 15:16:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brazil’s Bolsonaro finds novel way to reduce 27-year sentence: reading books",
      "description": "Former president convicted for coup plot to take advantage of law that knocks four days off jail term for each book read Jair Bolsonaro’s lawyers appear to have been reading up on the country’s penal code and have found a way to help their client reduce the 27-year prison sentence he received last year for plotting a coup: by reading books. There is only one problem: the former far-right Brazilian president has never been known as a bibliophile. “Sorry, I don’t have time to read,” Bolsonaro once declared. “It’s been three years since I read a book.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/brazil-jair-bolsonaro-reduce-sentence-reading-books",
      "published": "Fri, 16 Jan 2026 13:19:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea sentences ex-president to five years in first martial law verdict",
      "description": "Yoon Suk Yeol’s conviction for obstructing own arrest separate from main trial that could lead to death penalty A South Korean court has sentenced former president Yoon Suk Yeol to five years in prison for mobilising presidential security forces to block his own arrest and abusing his powers. It is the first judicial ruling linked to the events surrounding his failed martial law declaration in December 2024. The ruling is separate from Yoon’s main insurrection trial, where prosecutors earlier this week sought the death penalty and a verdict is due next month. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/south-korea-sentences-ex-president-yoon-suk-yeol-five-years-first-martial-law-verdict",
      "published": "Fri, 16 Jan 2026 09:51:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Uganda's longtime leader declared winner in disputed vote",
      "description": "Museveni claims victory in Uganda's contested election as opposition leader Bobi Wine goes into hiding amid chaos, violence and accusations of fraud.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5680817/uganda-museveni-wine-election-disputed-election",
      "published": "Sat, 17 Jan 2026 10:18:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "How European cinema is stealing Hollywood's spotlight",
      "description": "As Hollywood doubles down on sequels, the contenders for the European Film Awards feature bold, political works that are challenging audiences and creating buzz far beyond the continent.",
      "url": "https://www.dw.com/en/how-european-cinema-is-stealing-hollywood-s-spotlight/a-75486301?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 09:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump taps Blair, Rubio for Gaza 'Board of Peace'",
      "description": "US President Donald Trump boasted it is the \"Greatest and Most Prestigious Board ever assembled at any time, any place.\" The body will oversee the transitional government in the war-ravaged Palestinian territory.",
      "url": "https://www.dw.com/en/trump-taps-blair-rubio-for-gaza-board-of-peace/a-75544950?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 01:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump's erratic trade policies are pushing US partners towards China",
      "description": "Key US trade partners are responding to President Donald Trump’s often belligerent and unpredictable policies by looking to take their business elsewhere. Canada's decision on Friday to cut tariffs on Chinese electric vehicles is the latest example of how Trump's erratic trade policies are pushing allies into the arms of America's greatest economic rival.",
      "url": "https://www.france24.com/en/americas/20260117-trump-erratic-trade-policies-pushing-us-partners-towards-china",
      "published": "Sat, 17 Jan 2026 15:22:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘Playing straight into Russia’s hands’: Expert warns Trump’s Greenland push strains NATO",
      "description": "President Donald Trump’s pursuit of Greenland is creating a rift between the US and other NATO allies, fracturing the alliance and “playing straight into Russia’s hands,” said Jean-François Bélanger, assistant professor at the Institute for Military Operations at the Royal Danish Defence College.",
      "url": "https://www.france24.com/en/playing-straight-into-russia-s-hands-expert-warns-trump-s-greenland-push-strains-nato",
      "published": "Sat, 17 Jan 2026 14:23:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump taps former UK PM Tony Blair for Gaza 'board of peace'",
      "description": "US President Donald Trump on Friday gave a key role in post-war Gaza to former British prime minister Tony Blair and appointed a US officer to lead a nascent security force. Trump named members of a board to help supervise Gaza that was dominated by Americans, as he promotes a controversial vision of economic development in a territory that lies in rubble after two-plus years of relentless Israeli bombardment.",
      "url": "https://www.france24.com/en/trump-taps-former-uk-pm-tony-blair-for-gaza-board-of-peace",
      "published": "Sat, 17 Jan 2026 10:21:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Journalists in Bangladesh demand protection amid rising attacks",
      "description": "Journalists and media leaders in Bangladesh are demanding protection after recent attacks on two major newspapers",
      "url": "https://abcnews.go.com/International/wireStory/journalists-bangladesh-demand-protection-amid-rising-attacks-129304825",
      "published": "Sat, 17 Jan 2026 05:54:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ugandan police deny arrest of opposition leader as country awaits final election results",
      "description": "Police in Uganda have denied reports that the main opposition candidate in Thursday’s tense election had been arrested",
      "url": "https://abcnews.go.com/International/wireStory/ugandan-police-deny-arrest-opposition-leader-country-awaits-129304506",
      "published": "Sat, 17 Jan 2026 04:41:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Key accuser in Alexander brothers rape case dies just one week before federal trial begins: report",
      "description": "Kate Whiteman, who first accused Oren and Alon Alexander of rape, has died in Australia. The twins, along with their older brother, await their criminal trial this month.",
      "url": "https://www.foxnews.com/us/key-accuser-alexander-brothers-rape-case-dies-just-one-week-before-federal-trial-begins-report",
      "published": "Fri, 16 Jan 2026 11:50:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Defense argues conflict of interest exists in Charlie Kirk’s assassination case and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/defense-argues-conflict-interest-exists-charlie-kirks-assassination-case-more-top-headlines",
      "published": "Fri, 16 Jan 2026 06:54:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump launches phase 2 of Gaza peace plan — but Hamas disarmament remains the real test",
      "description": "Trump launches phase two of Gaza plan focusing on demilitarization Hamas and reconstruction, but experts warn disarming Hamas remains decisive challenge.",
      "url": "https://www.foxnews.com/world/trump-launches-phase-2-gaza-peace-plan-hamas-disarmament-remains-real-test",
      "published": "Fri, 16 Jan 2026 10:12:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iran enters uneasy calm after deadly anti-regime protests",
      "description": "A tense calm hangs over Iran after a wave of protests drew a bloody crackdown that reportedly left thousands of people dead.",
      "url": "https://www.dw.com/en/iran-enters-uneasy-calm-after-deadly-anti-regime-protests/a-75545347?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 04:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian army moves east of Aleppo after Kurdish forces withdraw",
      "description": "This comes after Syria's government announced its first formal recognition of Kurdish national rights since 1946.",
      "url": "https://www.bbc.com/news/articles/ce3k279e53eo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 12:06:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Machado vows to lead Venezuela 'when right time comes'",
      "description": "The opposition leader says she has a mandate to lead the country after the US seized its president.",
      "url": "https://www.bbc.com/news/articles/cz7y14ypg2qo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 19:01:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Syria decree grants Kurds new rights, formally recognising Kurdish language",
      "description": "The decree is the first formal recognition of Kurdish national rights since Syria's independence in 1946.",
      "url": "https://www.aljazeera.com/news/2026/1/17/syria-decree-grants-kurds-new-rights-formally-recognising-kurdish-language?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 08:47:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration says deporting college student trying to surprise family was a ‘mistake’",
      "description": "Any Lucía López Belloza was detained at Boston’s airport in November and flown to Honduras two days later US citizens and permanent residents: have you been racially profiled by ICE? The Trump administration apologized in court for a “mistake” in the deportation of a Massachusetts college student who was detained trying to fly home to surprise her family in Texas for Thanksgiving. But the administration still argued that the federal government error should not affect her immigration case. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/16/trump-administration-mistake-college-student-detained",
      "published": "Fri, 16 Jan 2026 20:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "CIA chief visits Maduro successor as Machado vows to become Venezuela’s president",
      "description": "John Ratcliffe meets Delcy Rodríguez in Caracas less than two weeks after his agents helped to oust her precedessor The CIA chief whose agents reputedly played a key role in abducting Nicolás Maduro has flown to Venezuela to meet his successor as the sidelined opposition leader, María Corina Machado, vowed she would become the country’s first elected female president. Machado’s comments were broadcast on Friday, a day after she handed her Nobel peace prize medal to Donald Trump in recognition of what she called a principled and decisive move against Maduro, whom US special forces snatched on 3 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/cia-chief-visits-maduro-successor-as-machado-vows-to-become-venezuelas-president",
      "published": "Fri, 16 Jan 2026 17:23:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "The latest on what's happening in Ukraine",
      "description": "Many residents in Kyiv are suffering through freezing temperatures with no heat or electricity after Russian strikes on energy infrastructure.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5678596/the-latest-on-whats-happening-in-ukraine",
      "published": "Sat, 17 Jan 2026 07:43:07 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela's Machado says she presented her Nobel Peace Prize to Trump during their meeting",
      "description": "Venezuelan opposition leader María Corina Machado said she presented her Nobel Peace Prize medal to President Donald Trump at the White House on Thursday even as he has questioned her credibility to take over her country after the U.S. ousted then-President Nicolás Maduro.",
      "url": "https://www.npr.org/2026/01/16/nx-s1-5679424/venezuela-machado-nobel-prize-trump-meeting",
      "published": "Fri, 16 Jan 2026 01:12:37 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Title 'inseparably' linked to person, Nobel Institute says",
      "description": "Nobel prize title 'remains inseparably linked to the person,' organizers of the prize said in statement, after Maria Corina Machado gifted her peace prize medal to Donald Trump.",
      "url": "https://www.dw.com/en/title-inseparably-linked-to-person-nobel-institute-says/a-75543903?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 16 Jan 2026 18:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Uganda's President Yoweri Museveni wins seventh term as rival Bobi Wine rejects 'fake results'",
      "description": "Uganda's incumbent President Yoweri Museveni won a seventh term in office, official results showed Saturday, allowing the former guerrilla to extend his four-decade rule of the East African country. His main opponent, Bobi Wine, remains in hiding after security forces raided his home.",
      "url": "https://www.france24.com/en/africa/20260117-uganda-president-yoweri-museveni-wins-seventh-term-rival-bobi-wine-rejects-fake-results",
      "published": "Sat, 17 Jan 2026 14:06:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Ugandan long-time president wins election amid opposition claims of 'ballot stuffing'",
      "description": "Uganda's long-time leader Yoweri Museveni has won the country's presidential election, officials say, amid claims by the main opposition leader of \"massive ballot stuffing\".",
      "url": "https://news.sky.com/story/ugandan-long-time-president-wins-election-amid-opposition-claims-of-massive-ballot-stuffing-13495258",
      "published": "Sat, 17 Jan 2026 13:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Illegal alien with 24 convictions among ‘worst of the worst’ arrested in Minnesota ICE operation: DHS",
      "description": "Federal agents arrested criminal illegal aliens as the DHS blasted Minnesota Gov. Tim Walz for allegedly protecting dangerous offenders through sanctuary policies.",
      "url": "https://www.foxnews.com/us/illegal-alien-24-convictions-among-worst-of-worst-arrested-minnesota-ice-operation-dhs",
      "published": "Fri, 16 Jan 2026 20:37:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "The border in your backyard: Mexican cartels fuel record fentanyl, meth busts in Rocky Mountain states",
      "description": "The DEA reported record drug seizures in mountain states after 8.7 million fentanyl pills and 3,100 pounds of methamphetamine were confiscated during 2025 operations.",
      "url": "https://www.foxnews.com/us/border-your-backyard-mexican-cartels-fuel-record-fentanyl-meth-busts-rocky-mountain-states",
      "published": "Fri, 16 Jan 2026 18:40:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens new tariffs on countries opposed to Greenland takeover",
      "description": "The president made the threat while a bipartisan group of US lawmakers were visiting Denmark in the hope of easing tensions over the territory.",
      "url": "https://www.bbc.com/news/articles/c9qpy952xvno?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 21:27:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump asks Turkiye’s Erdogan, Egypt’s el-Sisi to join Gaza ‘Board of Peace’",
      "description": "The board will supervise the temporary governance of Gaza, which has been under a fragile ceasefire since October.",
      "url": "https://www.aljazeera.com/news/2026/1/17/trump-asks-turkiyes-erdogan-egypts-el-sisi-to-join-gaza-board-of?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 15:08:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran restores SMS as phased rollback of internet blackout begins",
      "description": "Officials promise a gradual return of internet connectivity after weeks of deadly protests.",
      "url": "https://www.aljazeera.com/news/2026/1/17/iran-restores-sms-as-phased-rollback-of-internet-blackout-begins?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 10:44:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Hands off Greenland' protests draws thousands in Denmark",
      "description": "Organizers have called on Danish and Greenlandic residents to join marches and rallies against US President Donald Trump's push to acquire Greenland.",
      "url": "https://www.dw.com/en/hands-off-greenland-protests-draws-thousands-in-denmark/a-75546625?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 11:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian army enters areas east of Aleppo as Kurds withdraw",
      "description": "The Syrian army announced that it had taken control of Deir Hafer, a town previously under Kurdish control located east of Aleppo.",
      "url": "https://www.dw.com/en/syrian-army-enters-areas-east-of-aleppo-as-kurds-withdraw/a-75545840?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 09:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Most Germans see Trump's policies as threat to NATO",
      "description": "A majority of Germans say President Donald Trump's approach to foreign policy endangers the NATO alliance, according to a new survey.",
      "url": "https://www.dw.com/en/most-germans-see-trump-s-policies-as-threat-to-nato/a-75540685?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 16 Jan 2026 19:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland: Trump announces 10% tariff on Europe – including France, UK, Denmark – starting Feb. 1",
      "description": "US President Donald Trump on Saturday said he was imposing rising tariffs on eight European countries until the US strikes a deal for the \"complete and total purchase\" of Greenland, currently an autonomous territory of Denmark.",
      "url": "https://www.france24.com/en/europe/20260117-greenland-trump-announces-10-tariff-on-europe-%E2%80%93-including-france-uk-denmark-%E2%80%93-starting-feb-1",
      "published": "Sat, 17 Jan 2026 16:31:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US Congressional delegation seeks to reassure Denmark and Greenland after Trump's threats",
      "description": "A bipartisan U.S. Congressional delegation is seeking to reassure Denmark and Greenland after President Donald Trump threatened tariffs if nations don’t support a U.S. takeover of Greenland",
      "url": "https://abcnews.go.com/International/wireStory/us-congressional-delegation-seeks-reassure-denmark-greenland-after-129305263",
      "published": "Sat, 17 Jan 2026 07:05:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Mexican president highlights 'compelling results' in crackdown of cartels in face of Trump threats",
      "description": "Mexican President Claudia Sheinbaum says that efforts to crack down on Mexican cartels and slow migration north were showing “compelling results” in an effort to head off intervention by the Trump administration",
      "url": "https://abcnews.go.com/International/wireStory/mexican-president-highlights-compelling-results-crackdown-cartels-face-129280852",
      "published": "Fri, 16 Jan 2026 11:29:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Families in ‘survival mode’ amid Russian strikes and deadly cold",
      "description": "Families across Ukraine are in “constant survival mode” amid ongoing waves of Russian missile and drone strikes that have left blocks without power for days at a time, while temperatures plunge to deadly lows, the UN Children's Fund (UNICEF) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166774",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "In Haiti’s storm-hit south, food vouchers restore choice and dignity for families",
      "description": "Standing outside a colourfully painted building in southeastern Haiti, at the entrance to a bustling shop called Gods Will Depot where bags of food are stacked to the ceiling, Ketia surveys the large pile of groceries she has selected for her family: a big sack of flour, packages of spaghetti, boxed milk, some bars of soap.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166757",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Cat caught on camera starting dangerous kitchen fire after jumping on stove and turning on burner",
      "description": "Surveillance video captured the moment a cat turned on a stove burner in Garland, Texas, igniting items and causing extensive kitchen damage to the home.",
      "url": "https://www.foxnews.com/us/cat-caught-camera-starting-dangerous-kitchen-fire-jumping-stove-turning-burner",
      "published": "Fri, 16 Jan 2026 19:05:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Georgian demonstrators watch Iran closely as their own protests grind on",
      "description": "Georgians display Iranian Lion and Sun flags during daily protests in Tbilisi, showing solidarity with Iranian demonstrators while opposing EU accession halt by their government.",
      "url": "https://www.foxnews.com/world/georgian-demonstrators-watch-iran-closely-own-protests-grind",
      "published": "Fri, 16 Jan 2026 18:34:41 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran's ethnic minorities could hold key to regime's fate as protests continue",
      "description": "Iran's ethnic minorities, comprising nearly 50% of the population, could prove decisive in ongoing anti-regime protests as Kurdish groups lead resistance.",
      "url": "https://www.foxnews.com/world/irans-ethnic-minorities-could-hold-key-regimes-fate-protests-continue",
      "published": "Fri, 16 Jan 2026 06:50:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Blair and Rubio among names on senior executive of Gaza 'Board of Peace'",
      "description": "The former UK prime minister and US secretary of state will sit on the \"founding executive board\", the White House says.",
      "url": "https://www.bbc.com/news/articles/c07xv92vrz2o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 16:29:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China reports record trillion-dollar trade surplus despite Trump tariffs",
      "description": "Results for 2025 risk further unsettling economies about China’s trade practices and overcapacity, and their own over-reliance on Chinese products China has reported a strong export run in 2025 with a record trillion-dollar surplus, as its producers brace for three more years of a Trump administration set on slowing the manufacturing powerhouse by shifting US orders to other markets. Beijing’s resilience to renewed tariff tensions since Donald Trump returned to the US presidency last January has emboldened Chinese firms to shift their focus to south-east Asia, Africa and Latin America to offset US duties. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/china-reports-record-trillion-dollar-trade-surplus-despite-trump-tariffs",
      "published": "Wed, 14 Jan 2026 04:50:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Canada agrees to cut tariff on Chinese EVs in return for lower tariffs on Canadian farm products",
      "description": "Breaking with the United States, Canada has agreed to cut its 100% tariff on Chinese electric cars in return for lower tariffs on Canadian farm products, Prime Minister Mark Carney said Friday.",
      "url": "https://www.npr.org/2026/01/16/nx-s1-5679469/canada-cut-tariff-chinese-evs-canadian-farm-products",
      "published": "Fri, 16 Jan 2026 06:00:59 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Denmark invites US to participate in drills alongside NATO allies",
      "description": "The United States has been invited to take part in military exercises in Greenland alongside NATO allies, the head of Denmark's Joint Arctic Command told AFP on Friday. This comes after European countries sent small numbers of military personnel to Greenland in a show of support on Thursday.",
      "url": "https://www.france24.com/en/video/20260117-denmark-invites-us-to-participate-in-drills-alongside-nato-allies-1",
      "published": "Sat, 17 Jan 2026 10:05:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Hundreds flee to government-held areas in north Syria ahead of possible offensive",
      "description": "Scores of people have fled to government-held areas in northern Syria",
      "url": "https://abcnews.go.com/International/wireStory/hundreds-flee-government-held-areas-north-syria-ahead-129273622",
      "published": "Fri, 16 Jan 2026 08:41:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Trump's pick for Iceland ambassador apologizes for joking about Arctic nation becoming 52nd state",
      "description": "Former Rep. Billy Long, who was nominated by President Donald Trump to be ambassador to Iceland, apologized after privately joking that the island would become the \"52nd state.\"",
      "url": "https://www.foxnews.com/world/trumps-pick-iceland-ambassador-apologizes-joking-about-arctic-nation-becoming-52nd-state",
      "published": "Fri, 16 Jan 2026 03:12:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Paracetamol is safe in pregnancy, says study refuting Trump autism claims",
      "description": "Researchers say their gold-standard review should put an end to the debate over use of the common painkiller during pregnancy.",
      "url": "https://www.bbc.com/news/articles/c74vdgkw1kzo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 00:13:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US accuses South Africa military of 'cosying up to Iran'",
      "description": "The defence minister orders an inquiry into reports the military flouted orders to expel Iran from naval drills.",
      "url": "https://www.bbc.com/news/articles/c8x95nk72k2o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 11:42:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Syrian army takes control of east Aleppo towns as Kurdish fighters withdraw",
      "description": "Military says it seized 34 villages and towns in the region as it keeps taking over territories from Kurdish fighters.",
      "url": "https://www.aljazeera.com/news/2026/1/17/syrian-army-takes-control-of-east-aleppo-towns-as-kurdish-fighters-withdraw?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 12:42:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's election ends with another term for Museveni",
      "description": "Yoweri Museveni has been declared the winner of the presidential election, extending his rule beyond four decades. Meanwhile, the opposition candidate has reportedly gone into hiding.",
      "url": "https://www.dw.com/en/uganda-s-election-ends-with-another-term-for-museveni/a-75547823?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 13:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Egypt and Nigeria face off for third place",
      "description": "Egypt and Nigeria will decide third place at the Africa Cup of Nations at the Stade Mohammed V in Casablanca on Saturday. FRANCE 24 Sports Editor Selina Sykes reports from Casablanca.",
      "url": "https://www.france24.com/en/afcon-2025-egypt-and-nigeria-face-off-for-third-place",
      "published": "Sat, 17 Jan 2026 16:33:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Ohio dentist murders gun match a ‘big problem’ for surgeon ex: Defense attorney",
      "description": "Evidence allegedly links gun from accused surgeon Michael McKee's property to Ohio dentist double murder, creating a \"big problem\" for defense.",
      "url": "https://www.foxnews.com/us/ohio-dentist-murders-gun-match-big-problem-surgeon-ex-defense-attorney",
      "published": "Fri, 16 Jan 2026 07:00:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Carrick off to perfect start as United beat City 2-0 in Manchester derby",
      "description": "United kick off interim manager ‍Michael Carrick's ‍second stint in charge with an impressive 2-0 derby victory.",
      "url": "https://www.aljazeera.com/sports/2026/1/17/carrick-off-to-perfect-start-as-united-beat-city-2-0-in-manchester-derby?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 14:53:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Photos: Syrian army enters Deir Hafer after SDF withdrawal",
      "description": "Government troops enter the city earlier controlled by the SDF, marking a shift in territorial control in Aleppo region.",
      "url": "https://www.aljazeera.com/gallery/2026/1/17/photos-syrian-army-enters-deir-hafer-after-sdf-withdrawal?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 09:08:54 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Manchester United vs Manchester City 2-0: Premier League – as it happened",
      "description": "All the updates as Bryan Mbeumo and Patrick Dorgu secure a morale-boosting home derby victory for Man United.",
      "url": "https://www.aljazeera.com/sports/liveblog/2026/1/17/live-manchester-united-vs-manchester-city-premier-league?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 09:00:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Syrian forces enter Deir Hafer near Aleppo after Kurdish fighters agree to withdraw",
      "description": "Syrian government forces on Saturday entered Deir Hafer, east of Aleppo, after Kurdish-led fighters agreed to evacuate the town in a move to avoid further confrontation. Last week, the Syrian army drove Kurdish forces out of Aleppo following deadly clashes.",
      "url": "https://www.france24.com/en/middle-east/20260117-syria-forces-enter-deir-hafer-near-aleppo-after-kurdish-fighters-agree-withdraw",
      "published": "Sat, 17 Jan 2026 09:24:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Syrian government forces enter northern towns after Kurdish fighters withdraw",
      "description": "Syrian government forces have entered a northern town after Kurdish-led fighters decided to evacuate",
      "url": "https://abcnews.go.com/International/wireStory/syrian-government-forces-enter-northern-towns-after-kurdish-129304507",
      "published": "Sat, 17 Jan 2026 05:53:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Oregon city reverses vote, removes convicted murderer from police review board after backlash",
      "description": "Salem City Council reverses controversial decision, removes convicted murderer Kyle Hedquist from police advisory boards after intense public outrage and criticism.",
      "url": "https://www.foxnews.com/us/oregon-city-reverses-vote-removes-convicted-murderer-from-police-review-board-after-backlash",
      "published": "Sat, 17 Jan 2026 10:00:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan leader extends 40-year rule after winning contested poll",
      "description": "President Yoweri Museveni wins a seventh term, as his main rival Bobi Wine decries \"fake results\".",
      "url": "https://www.bbc.com/news/articles/c2lgxxrxd52o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 14:28:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japanese mayor apologises after calling staff 'human scum'",
      "description": "Yokohama mayor Takeharu Yamanaka admits using the terms \"idiot\" and \"human scum\" to disparage staff.",
      "url": "https://www.bbc.com/news/articles/czejwl2z80lo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 08:08:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Google appeals landmark antitrust verdict over search monopoly",
      "description": "The tech giant is seeking a pause on court-ordered fixes aimed at limiting its monopoly power.",
      "url": "https://www.bbc.com/news/articles/clyn0ek5rdpo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 02:44:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From camouflage to tracksuits - Guinea's junta leader becomes civilian president",
      "description": "Junta chief Mamadi Doumbouya, set for a seven-year term, has to prove himself as a democratic leader.",
      "url": "https://www.bbc.com/news/articles/cpv70mek448o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 14:41:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "CIA director had two-hour meeting with new Venezuelan leader in Caracas",
      "description": "The pair discussed economic opportunities and preventing Venezuela becoming a place for \"America's adversaries\", a US official said.",
      "url": "https://www.bbc.com/news/articles/cvgjn5yyeljo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 13:28:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China and Canada announce tariffs relief after a high-stakes meeting between Carney and Xi",
      "description": "Canola oil and electric cars are at the centre of the deal agreed by Mark Carney and Xi Jinping after years of strained ties.",
      "url": "https://www.bbc.com/news/articles/cy59pvkqvl5o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 13:11:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN court",
      "description": "Myanmar says The Gambia has failed to provide enough evidence of genocide against the Muslim-minority people.",
      "url": "https://www.bbc.com/news/articles/c1wz8vyq54xo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 16:25:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "S Korea's ex-president Yoon to be jailed for five years over martial law bid",
      "description": "This is the first of the verdicts in the four trials linked to Yoon's shock decree in 2024.",
      "url": "https://www.bbc.com/news/articles/cy4qdpxp78po?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 06:14:25 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Landscape beneath Antarctica's icy surface revealed in unprecedented detail",
      "description": "Scientists believe the map could shed light on how Antarctica's vast ice sheet will respond to climate change.",
      "url": "https://www.bbc.com/news/articles/c9qpx2qqeq7o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 00:00:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Actor Timothy Busfield charged with sexually abusing boys on set of TV series",
      "description": "The actor starred in the West Wing TV series and is also known for the baseball film Field of Dreams.",
      "url": "https://www.bbc.com/news/articles/cj9rvkde0xxo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 00:24:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda’s President Yoweri Museveni wins seventh term: Electoral Commission",
      "description": "Museveni, 81, secured 71.65 percent support, electoral commission says, after contentious election campaign.",
      "url": "https://www.aljazeera.com/news/2026/1/17/ugandas-president-yoweri-museveni-wins-seventh-term-electoral-commission?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 13:13:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal vs Morocco: AFCON final – teams, start time, lineups",
      "description": "Morocco carry the weight of a nation into the 2025 AFCON final as the hosts look to end a 50-year wait against Senegal.",
      "url": "https://www.aljazeera.com/sports/2026/1/17/senegal-vs-morocco-afcon-final-teams-start-time-lineups?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 13:09:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda’s Bobi Wine says escaped raid on house amid disputed vote",
      "description": "Opposition ‍leader claims escaping police and army raid hours before Museveni, 81, was declared the winner.",
      "url": "https://www.aljazeera.com/news/2026/1/17/ugandas-wine-says-escaped-raid-on-house-amid-disputed-presidential-vote?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 12:00:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian Open: Djokovic targets Sincaraz to end wait for record 25th slam",
      "description": "Novak Djokovic ready to turn back clock at Australian Open despite falling behind Carlos Alcaraz and Jannik Sinner.",
      "url": "https://www.aljazeera.com/sports/2026/1/17/australian-open-djokovic-ready-to-upset-alcaraz-sinner-rivalry?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 11:20:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON final: Senegal criticises lack of ‘fair play’ ahead of Morocco clash",
      "description": "Senegal criticises lack of 'fair play' before facing host nation Morocco in the 2025 CAF Africa Cup of Nations final.",
      "url": "https://www.aljazeera.com/sports/2026/1/17/afcon-final-senegal-criticizes-lack-of-fair-play-ahead-of-morocco-clash?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 10:06:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Clippers rally past Raptors in OT for fifth straight NBA win",
      "description": "Los Angeles Clippers overcome a 14-point deficit to beat Toronto Raptors 121-117, while Nets and Cavaliers also win.",
      "url": "https://www.aljazeera.com/sports/2026/1/17/clippers-rally-past-raptors-in-ot-for-fifth-straight-nba-win?traffic_source=rss",
      "published": "Sat, 17 Jan 2026 09:50:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Controversial US study on hepatitis B vaccines in Africa is cancelled",
      "description": "$1.6m project drew outrage over ethical questions about withholding vaccines proven to prevent disease The controversial US-funded study on hepatitis B vaccines among newborns in Guinea-Bissau has been halted, according to Yap Boum, a senior official at the Africa Centres for Disease Control and Prevention (CDC). “The study has been cancelled,” Boum told journalists at a press conference on Thursday morning. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/hepatitis-b-vaccines-study-africa-cancel",
      "published": "Fri, 16 Jan 2026 15:03:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Julio Iglesias denies sexual abuse claims of two former female employees",
      "description": "Women allege Spanish singer subjected them ‘to inappropriate touching, insults and humiliation … in atmosphere of control’ The Spanish singer Julio Iglesias has broken his silence over allegations that he sexually abused two women who worked in his Caribbean mansions, saying he has never “abused, coerced or disrespected any woman”. The 82-year-old entertainer, whose career spans six decades, had been accused by two female former employees who allege they had been sexually assaulted and subjected “to inappropriate touching, insults and humiliation … in an atmosphere of control and constant harassment”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/julio-iglesias-denies-sexual-abuse-claims-of-two-former-female-employees",
      "published": "Fri, 16 Jan 2026 07:58:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US says it reached deal with Taiwan to lower tariffs and boost investments",
      "description": "US to lower tariffs on Taiwanese goods to 15% as chip and tech businesses pledge $250bn spending in US operations The US said on Thursday that it had signed a deal with Taiwan to reduce tariffs on goods from the democratic island, while increasing Taiwanese semiconductor and tech companies’ investments in America. The agreement, the US commerce department said, “will drive a massive reshoring of America’s semiconductor sector”. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/us-taiwan-tariff-deal",
      "published": "Thu, 15 Jan 2026 22:07:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘I’m back’: Damien Martyn out of hospital after surviving meningitis",
      "description": "Former Australia batter given a ‘50/50 chance of surviving’ Spent eight days in induced coma Damien Martyn has said he is back after overcoming a meningitis scare, which he said took his life out of his hands. In a heartfelt post on his social media accounts, the former Australia batter said he was given a 50% chance to live after battling the disease, which causes an infection and swelling of fluid and membranes around the brain and spinal cord. The 54-year-old was put into an induced coma on 27 December and was fighting for his life in a Gold Coast intensive care unit until he woke eight days later. Continue reading...",
      "url": "https://www.theguardian.com/sport/2026/jan/17/damien-martyn-declares-im-back-after-leaving-hospital-following-meningitis",
      "published": "Sat, 17 Jan 2026 10:14:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-17T07:15:07.061Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What a visit to a French clown school reveals about clowning",
      "description": "A visit to the Gaulier clown school - home to alumni including Sacha Baron Cohen and Emma Thompson - reveals that clowning is all about the art of failure.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5640672/what-a-visit-to-a-french-clown-school-reveals-about-clowning",
      "published": "Sat, 17 Jan 2026 07:42:48 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A South Korean court sentences Yoon to 5 years in prison on charges related to martial law decree",
      "description": "A South Korean court has sentenced former President Yoon Suk Yeol to five years in prison, the first verdict in eight criminal trials for allegations that include his 2024 martial law decree.",
      "url": "https://www.npr.org/2026/01/16/g-s1-106260/a-south-korean-court-sentences-yoon-to-5-years-in-prison-on-charges-related-to-martial-law-decree",
      "published": "Fri, 16 Jan 2026 04:09:17 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland to boost the Arctic island's security",
      "description": "Troops from several European countries, including France, Germany, Norway and Sweden, are arriving in Greenland after talks between Denmark, Greenland and the U.S. on Wednesday highlighted disagreement.",
      "url": "https://www.npr.org/2026/01/15/g-s1-106113/european-troops-arrive-greenland",
      "published": "Thu, 15 Jan 2026 05:26:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Merz to host Syrian leader despite criticism",
      "description": "Syria's interim President Ahmed al-Sharaa's planned visit to Berlin next week has been criticized by Kurdish and Alawite groups in Germany.",
      "url": "https://www.dw.com/en/germany-news-merz-to-host-syrian-leader-despite-criticism/live-75545809?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 16:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Five graphics that show Greenland’s importance to Trump",
      "description": "Its entire population would fit in a large sports stadium but Greenland’s current presence on the geopolitical stage is huge. DW takes a look at the reasons it's so coveted — from natural resources to climate change.",
      "url": "https://www.dw.com/en/five-graphics-that-show-greenland-s-importance-to-trump/a-75547831?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 15:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ethiopia dam: Egypt, Sudan welcome Trump mediation",
      "description": "The leaders of Egypt and Sudan both welcome US president's offer to mediate in the Nile dam dispute with Ethiopia.",
      "url": "https://www.dw.com/en/ethiopia-dam-egypt-sudan-welcome-trump-mediation/a-75547719?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 15:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Elon Musk seeking up to $134 billion from OpenAI, Microsoft",
      "description": "Musk co-founded OpenAI in 2015 as a nonprofit, but says the company now mainly serves Microsoft's interests. OpenAI has accused Musk of leading a campaign of \"harrassment.\"",
      "url": "https://www.dw.com/en/elon-musk-seeking-up-to-134-billion-from-openai-microsoft/a-75546664?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 12:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How are ICE agents recruited, and who are they?",
      "description": "Donald Trump's second presidential term has seen a rapid rise in the number of Immigration and Customs Enforcement (ICE) agents. But who are these people, and where is the US government finding them?",
      "url": "https://www.dw.com/en/how-are-ice-agents-recruited-and-who-are-they/a-75506003?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 10:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran's exiled crown prince asks Europe's help to end regime",
      "description": "The eldest son of the last shah, Reza Pahlavi, has said Iran's regime is on its \"last legs\" and called on countries to take action in support of demonstrators.",
      "url": "https://www.dw.com/en/iran-s-exiled-crown-prince-asks-europe-s-help-to-end-regime/a-75544196?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 16 Jan 2026 20:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Morocco and Senegal prepare for final showdown",
      "description": "Hosts Morocco and Senegal will fight it out in a heavyweight Africa Cup of Nations final this weekend after tense last-four victories on Wednesday. The tournament has delivered a final showdown for the trophy between Africa's two modern footballing powerhouses, the continent's best sides according to the FIFA rankings.",
      "url": "https://www.france24.com/en/afcon-2025-morocco-and-senegal-prepare-for-final-showdown",
      "published": "Sat, 17 Jan 2026 14:09:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada announces trade deal with China on EVs, canola",
      "description": "Canada and China struck an initial trade deal on Friday that will slash tariffs on electric vehicles and ⁠canola, as both nations promised to tear down trade barriers while forging new strategic ties during Prime Minister Mark Carney's visit. FRANCE 24 speaks to Jean-Baptiste Monnier, Asia Centre Vice President, to shed more light on the implications of the trade agreement.",
      "url": "https://www.france24.com/en/video/20260117-canada-announces-trade-deal-with-china-on-evs-canola-1",
      "published": "Sat, 17 Jan 2026 11:45:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Clash of the fallen giants as Egypt Face Nigeria",
      "description": "The Super Eagles and the Pharaohs meet this Saturday in Casablanca for the Africa Cup of Nations third-place playoff. A showdown between two heavyweights left disappointed, both sides will be desperate to bow out of the tournament with pride restored.",
      "url": "https://www.france24.com/en/tv-shows/sports/20260117-afcon-2025-clash-of-the-fallen-giants-as-egypt-face-nigeria",
      "published": "Sat, 17 Jan 2026 09:09:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sir Tony Blair 'honoured' to be part of Trump's efforts to rebuild Gaza",
      "description": "Sir Tony Blair has said he is \"honoured\" to be appointed as part of a team that will be key to Donald Trump's plan to rebuild Gaza.",
      "url": "https://news.sky.com/story/tony-blair-to-oversee-gazas-future-as-part-of-trumps-greatest-and-most-prestigious-board-of-peace-13495223",
      "published": "Sat, 17 Jan 2026 00:49:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza's four layers of governance - and where Sir Tony Blair fits in",
      "description": "Like so much of the politics in the Middle East, the new governance structure for Gaza is complicated and contentious.",
      "url": "https://news.sky.com/story/board-of-peace-is-best-option-for-gazans-in-desperate-need-of-stability-13495291",
      "published": "Sat, 17 Jan 2026 11:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Venezuela is going to be free', says opposition leader Machado",
      "description": "Venezuela's opposition leader said she is \"confident\" Nicolas Maduro's \"criminal\" regime will be dismantled and free elections will be held.",
      "url": "https://news.sky.com/story/venezuelas-machado-is-confident-maduros-criminal-regime-will-end-13495117",
      "published": "Fri, 16 Jan 2026 17:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Julio Iglesias responds to sex abuse and trafficking allegations",
      "description": "Julio Iglesias has denied abusing two former domestic employees behind a criminal complaint against him, calling the accusations \"completely false\".",
      "url": "https://news.sky.com/story/julio-iglesias-responds-to-sex-abuse-and-trafficking-allegations-13494936",
      "published": "Fri, 16 Jan 2026 09:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "We can learn a lot from Antarctica's weird biology",
      "description": "Even though it's high summer in the Antarctic, the ocean around the Rothera research station is -1 Celsius.",
      "url": "https://news.sky.com/story/antarctica-the-tiny-change-that-could-tip-the-balance-at-the-end-of-the-world-13494858",
      "published": "Fri, 16 Jan 2026 01:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Machado gave Trump her Nobel Peace Prize medal in pursuit of a greater prize",
      "description": "The Nobel Peace Prize means a lot to Maria Corina Machado but, clearly, giving it away means even more.",
      "url": "https://news.sky.com/story/venezuelas-machado-gave-trump-her-gold-medal-in-pursuit-of-a-greater-prize-13494861",
      "published": "Fri, 16 Jan 2026 03:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sri Lanka unveils a rare purple star sapphire claimed to be the biggest of its kind",
      "description": "A massive purple star sapphire weighing 3,563 carats has been unveiled in Sri Lanka",
      "url": "https://abcnews.go.com/International/wireStory/sri-lanka-unveils-rare-purple-star-sapphire-claimed-129306758",
      "published": "Sat, 17 Jan 2026 10:19:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Horses leap through flames and pets go to church in Spanish animal rituals honoring St. Anthony",
      "description": "In Spain, hundreds of people watched horses gallop through flames as part of Las Luminarias, a centuries-old tradition",
      "url": "https://abcnews.go.com/International/wireStory/horses-leap-flames-pets-church-spanish-animal-rituals-129305751",
      "published": "Sat, 17 Jan 2026 08:09:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Egypt and Sudan welcome Trump's offer to mediate Nile River dam dispute",
      "description": "Egypt and Sudan welcome President Trump's offer to resume U.S. mediation with Ethiopia over the Nile River water dispute",
      "url": "https://abcnews.go.com/International/wireStory/egypt-sudan-trumps-offer-mediate-nile-river-dam-129305291",
      "published": "Sat, 17 Jan 2026 07:06:14 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "British police force chief behind decision to ban Maccabi fans from Aston Villa match retires",
      "description": "A British police force chief has retired following criticism over a decision to ban Maccabi Tel Aviv fans from a match against Aston Villa last year",
      "url": "https://abcnews.go.com/International/wireStory/british-police-force-chief-decision-ban-maccabi-fans-129281490",
      "published": "Fri, 16 Jan 2026 11:46:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says he may punish countries with tariffs if they don’t back the US controlling Greenland",
      "description": "President Donald Trump says he may punish countries with tariffs if they don’t back the U.S. controlling Greenland",
      "url": "https://abcnews.go.com/International/wireStory/trump-punish-countries-tariffs-dont-back-us-controlling-129280611",
      "published": "Fri, 16 Jan 2026 11:31:20 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian court considers central bank's $232B lawsuit against Euroclear over seized assets",
      "description": "A court in Moscow has started considering a lawsuit filed by Russia’s Central Bank against Euroclear, the Brussels-based clearing house that holds the bulk of Moscow’s frozen assets in Europe",
      "url": "https://abcnews.go.com/International/wireStory/russian-court-considers-central-banks-232b-lawsuit-euroclear-129273499",
      "published": "Fri, 16 Jan 2026 08:25:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Julio Iglesias denies sexual abuse allegations, calling them 'absolutely untrue'",
      "description": "Julio Iglesias has denied allegations of sexual assault made by two former employees",
      "url": "https://abcnews.go.com/International/wireStory/julio-iglesias-denies-sexual-abuse-allegations-calling-absolutely-129271097",
      "published": "Fri, 16 Jan 2026 05:14:07 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Vote counting underway in Uganda as opposition leader criticizes process",
      "description": "Vote counting is underway in Uganda’s tense presidential election, which took place amid an internet shutdown and voting delays",
      "url": "https://abcnews.go.com/International/wireStory/vote-counting-underway-uganda-opposition-leader-criticizes-process-129270159",
      "published": "Fri, 16 Jan 2026 04:51:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former TV anchor accused of killing her mother ruled incompetent, murder case put on hold",
      "description": "Former TV news anchor accused of killing her mother ruled mentally incompetent for trial. Angelynn Mock allegedly stabbed 80-year-old mother on Halloween.",
      "url": "https://www.foxnews.com/us/former-news-anchor-accused-killing-mother-incompetent-trial-judge-rules",
      "published": "Fri, 16 Jan 2026 18:50:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fox News True Crime Newsletter: Virginia nanny's story, dentist murders charges, Barry Morphew's plea",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-virginia-nannys-story-dentist-murders-charges-barry-morphew-plea",
      "published": "Fri, 16 Jan 2026 15:44:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Smiling anti-ICE agitator accused of punching Florida trooper as DeSantis asserts, 'This is not Minneapolis'",
      "description": "An anti-ICE agitator allegedly punched a trooper in the face, Florida Attorney General James Uthmeier said, noting, \"We don't put up with this nonsense.\"",
      "url": "https://www.foxnews.com/us/smiling-anti-ice-agitator-accused-punching-florida-trooper-desantis-asserts-this-not-minneapolis",
      "published": "Fri, 16 Jan 2026 12:06:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Photos reveal Virginia nanny took slain wife’s place in master bedroom weeks after love triangle murders",
      "description": "Investigators testify in Brendan Banfield murder trial as ex-IRS agent accused of killing wife Christine and Joseph Ryan in Virginia. Prosecutors say he moved mistress into bedroom.",
      "url": "https://www.foxnews.com/us/photos-reveal-virginia-nanny-took-slain-wifes-place-master-bedroom-weeks-after-love-triangle-murders",
      "published": "Fri, 16 Jan 2026 08:00:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NATO ambassador says Europe 'has a tendency to overreact' over Greenland dispute",
      "description": "U.S. NATO ambassador Matthew Whitaker defends American focus on Greenland amid European backlash, calling Arctic security crucial for continental defense.",
      "url": "https://www.foxnews.com/world/nato-ambassador-says-europe-has-tendency-overreact-over-trumps-greenland-dispute",
      "published": "Sat, 17 Jan 2026 06:00:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australia removes 4.7M kids from social media platforms in first month of historic ban",
      "description": "Australia says millions of underage social media accounts were shut down in the first month after a sweeping new ban on users under 16 took effect.",
      "url": "https://www.foxnews.com/world/australia-removes-4-7m-kids-from-social-media-platforms-first-month-historic-ban",
      "published": "Fri, 16 Jan 2026 03:22:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Latin America rebel groups urged to form 'super guerrilla' alliance against Trump",
      "description": "Nestor Gregorio Vera urges rival factions to unite against U.S. intervention after Venezuela strongman's capture.",
      "url": "https://www.foxnews.com/world/latin-america-rebel-groups-urged-form-super-guerrilla-alliance-against-trump",
      "published": "Thu, 15 Jan 2026 21:25:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Ukrainian PM accused of bribing politicians with US dollars to weaken Zelenskyy's government",
      "description": "Ukrainian authorities seized stacks of U.S. dollars during raids targeting former Prime Minister Yulia Tymoshenko, who allegedly planned to bribe lawmakers",
      "url": "https://www.foxnews.com/world/former-ukrainian-pm-accused-bribing-politicians-us-dollars-weaken-zelenskyys-government",
      "published": "Thu, 15 Jan 2026 18:37:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Troops from Europe deploy to Greenland in rapid 2-day mission as Trump eyes US takeover",
      "description": "European countries are deploying military personnel to Greenland for a quick mission as the Trump administration is pushing to acquire the Danish territory.",
      "url": "https://www.foxnews.com/world/troops-from-europe-deploy-greenland-rapid-2-day-mission-trump-eyes-us-takeover",
      "published": "Thu, 15 Jan 2026 10:52:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}