{
  "last_updated": "2026-01-22T23:44:17.805188Z",
  "event_count": 225,
  "events": [
    {
      "title": "Davos onlookers notice Trump’s ‘board of peace’ logo resembles UN emblem",
      "description": "The US president unveiled the board with a gold logo whose resemblance to the UN emblem sparked European criticism Donald Trump ’s newly launched “board of peace” already has a logo – and perceptive eyes have noted its close resemblance to the United Nations emblem, except reworked in Trump fashion: all in gold, and focused squarely on the US. Launched this week at the World Economic Forum in Davos, the initiative was first endorsed back in November by the UN security council, on the understanding that it would focus on brokering a ceasefire in Gaza. Since then, however, Trump has positioned it as a global body tasked with resolving international conflicts of all stripes, and to be chaired by Trump himself, in what appears to be part of the administration’s latest effort to reshape the postwar global order. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/22/trump-board-peace-davos-un",
      "published": "Thu, 22 Jan 2026 18:53:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 48,
      "severity_level": "Critical"
    },
    {
      "title": "Iran will retaliate 'with everything we have' if US attacks, senior diplomat warns",
      "description": "More than 4,500 protesters killed in Iran as foreign minister threatens forceful response to potential U.S. military strikes in escalating regional crisis.",
      "url": "https://www.foxnews.com/world/iran-retaliate-with-everything-we-have-us-attacks-senior-diplomat-warns",
      "published": "Wed, 21 Jan 2026 07:44:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Half of all Sudanese children not in education due to civil war",
      "description": "In tonight's edition, an unspoken crisis emerges in Sudan, as the country faces one of the world's longest school closures. Also, South Africa’s iconic Kruger National Park reels from devastating floods, with damage of over $30 million, and 15 camps shut. And IShowSpeed celebrated his 21st birthday while hitting 50 million subscribers, exploring markets, tasting jollof, and visiting art galleries in Nigeria.",
      "url": "https://www.france24.com/en/half-of-all-sudanese-children-not-in-education-due-to-civil-war",
      "published": "Thu, 22 Jan 2026 21:20:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 43,
      "severity_level": "Critical"
    },
    {
      "title": "Trump's Board of Peace: 'Boards & committees do not resolve conflicts, mediators resolve conflicts'",
      "description": "François Picard is pleased to welcome Aaron David Miller, Diplomat, and Senior Fellow at the Carnegie Endowment for International Peace. In Gaza, where fundamental and irreconcilable differences remain between the warring parties, the former US Mideast negotiator offers a scathing assessment of Trump's peace initiative: \"No country that's credible, has a democratic process, and has thought this through, is going to sign up to a board which has no set of governing principles, and is completely tethered to the whims, fantasies, and likes or dislikes of a single individual.\"",
      "url": "https://www.france24.com/en/video/20260122-trump-s-board-of-peace-boards-committees-do-not-resolve-conflicts-mediators-resolve-conflicts-1",
      "published": "Thu, 22 Jan 2026 19:24:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of rising internet shutdowns as digital blackouts spread worldwide",
      "description": "A rising trend towards government-enforced internet shutdowns – with at least 300 incidents in more than 54 countries over the last two years – is prompting renewed warnings from the UN about the threat these digital blackouts pose to freedom of expression, access to information and human rights.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166813",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Rising hunger and displacement pose growing economic risk, UN tells Davos",
      "description": "As global leaders gather at the World Economic Forum in Davos this week, UN agencies are warning that rising hunger and displacement are not only humanitarian emergencies but growing threats to global economic stability.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166791",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Shooting in Australian town leaves 3 dead and 1 wounded",
      "description": "Three people were killed and another was wounded on Thursday in a shooting at an Australian country town, police said",
      "url": "https://abcnews.go.com/International/wireStory/shooting-australian-town-leaves-3-dead-1-wounded-129445257",
      "published": "Thu, 22 Jan 2026 03:06:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "'Vanity project':  Does Trump seek to 'cement legacy' with Greenland deal and Board of Peace?",
      "description": "Rochelle FERGUSON BOUYAHI welcomes Dafydd Townley, Teaching Fellow in US politics and International Security at the University of Portsmouth, joining us from Davos. He dives right into Donald Trump’s arctic exploits: from soliciting leaders to join his “Board of Peace” to his relentless pursuit of Greenland. Europe and NATO are caught in the crosshairs on this treacherous trek through legacy politics, transactional diplomacy, and the ever-evolving sociopolitical and economic landscape as the ice melts in a warming world.",
      "url": "https://www.france24.com/en/video/20260122-vanity-project-does-trump-seek-to-cement-legacy-with-greenland-deal-and-board-of-peace-1",
      "published": "Thu, 22 Jan 2026 17:41:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of 'catastrophic' hunger crisis in Nigeria as food aid funding runs out",
      "description": "The U.N. World Food Program warns that over a million people in northeast Nigeria could lose emergency food aid soon without new funding",
      "url": "https://abcnews.go.com/International/wireStory/warns-catastrophic-hunger-crisis-nigeria-food-aid-funding-129449369",
      "published": "Thu, 22 Jan 2026 07:50:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Why Chile’s wildfires are spreading faster and burning hotter",
      "description": "Chile is facing a severe wildfire emergency marked by unusually large and fast-moving fires that have killed people, destroyed homes and forced tens of thousands to flee",
      "url": "https://abcnews.go.com/International/wireStory/chiles-wildfires-spreading-faster-burning-hotter-129452922",
      "published": "Thu, 22 Jan 2026 09:21:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "World enters era of ‘global water bankruptcy’",
      "description": "The world has moved beyond a water crisis and into a state of global water bankruptcy, says a new flagship report released on Tuesday by UN researchers.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166800",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: Atrocities ‘repeated town by town’, ICC prosecutor tells UN Security Council",
      "description": "Atrocities in Sudan’s Darfur region are spreading from town to town in an organized campaign of violence that includes mass executions, rape and ethnic targeting, amounting to war crimes and crimes against humanity, the prosecutor of the International Criminal Court told the UN Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166790",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Armed militias fire heavy machine guns through Tehran streets in deadly night attacks",
      "description": "Iran protests entered day 24 with 4,519 confirmed deaths. Supreme Leader Ayatollah Ali Khamenei backs security forces amid nationwide demonstrations.",
      "url": "https://www.foxnews.com/world/armed-militias-fire-heavy-machine-guns-tehran-streets-deadly-night-attacks",
      "published": "Tue, 20 Jan 2026 21:06:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Mark Carney says Canada must ‘be a beacon to a world that’s at sea’",
      "description": "In post-Davos speech, Canadian PM jabs at Trump, saying the arc of history ‘can still bend towards progress and justice’ Canada’s prime minister, Mark Carney, said his country must be a “beacon to a world that’s at sea” and that national unity was critical as his government faces a dramatic reshaping of the world political order – and mounting domestic challenges The national address, given at a historic military fortress in Quebec City, was far narrower in scope than the prime minister’s remarks earlier in the week at the World Economic Summit in Davos, Switzerland. Dubbed the ‘Carney Doctrine’, the Davos speech lamented the disintegration of rules-based order amid a rise of “great powers” that used economic “coercion” as a weapon. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/carney-says-canada-must-be-a-beacon-to-a-world-thats-at-sea",
      "published": "Thu, 22 Jan 2026 21:53:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian soldier sentenced to death for refusing to fire on protesters during nationwide unrest",
      "description": "Iranian soldier Javid Khales was reportedly sentenced to death for refusing orders to shoot protesters during nationwide unrest, a human rights group says.",
      "url": "https://www.foxnews.com/world/iranian-soldier-sentenced-death-refusing-fire-protesters-nationwide-unrest",
      "published": "Tue, 20 Jan 2026 21:56:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly protests crackdown in Iran: Some funerals of protesters turn into demonstrations",
      "description": "The number of people killed in protests against the Iranian regime has been rising since demonstrations began in late December. An NGO reported on January 20 that more than 4,500 people had been killed. However, it added that the figure was provisional because a nationwide internet blackout meant that the death toll had been hard to establish. The real number is thought to be much higher.",
      "url": "https://www.france24.com/en/deadly-protests-crackdown-in-iran-some-funerals-of-protesters-turn-into-demonstrations",
      "published": "Thu, 22 Jan 2026 17:08:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Cold and dark: UN rights chief condemns Russian strikes on Ukraine’s power grid",
      "description": "Russian attacks on Ukraine’s energy infrastructure have cut heat, electricity and water to hundreds of thousands of civilians in freezing winter conditions, prompting the UN human rights chief to denounce the strikes as “cruel” and a clear violation of international law.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166798",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli UN ambassador sends stark warning to Iran amid growing unrest",
      "description": "Israel warns Iran not to test its military readiness amid tensions over ballistic missiles and nuclear capabilities following summer 2025 operations.",
      "url": "https://www.foxnews.com/world/israeli-un-ambassador-sends-stark-warning-iran-amid-growing-unrest",
      "published": "Tue, 20 Jan 2026 19:38:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Gunman at large in Australian town after three people shot dead",
      "description": "A gunman is reported to be at large in an Australian town following shootings that killed three people and wounded one.",
      "url": "https://news.sky.com/story/gunman-at-large-in-lake-cargelligo-australia-after-three-people-shot-dead-13497500",
      "published": "Thu, 22 Jan 2026 09:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Mozambique floods heighten disease, malnutrition risks – UN agencies",
      "description": "Catastrophic flooding across Mozambique is devastating lives and livelihoods, sharply increasing the risk of disease outbreaks and malnutrition, while also forcing dangerous wildlife – including crocodiles – into flooded urban areas, the UN warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166793",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Two dead and nine missing after landslides hit house and campground in New Zealand",
      "description": "Search-and-rescue teams worked through the night at the campground, but there had been no progress in finding missing people, officials say Emergency crews were searching for victims of landslides on New Zealand’s North Island that tore through a house and a busy campground, leaving at least two dead. Police reported that as many as nine people may be missing in the landslides, which hit on Thursday, including children. Families enjoying the summer school holiday were among the campers. Recreational vehicles and at least one structure were crushed, images showed. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/two-confirmed-dead-and-more-presumed-buried-after-landslides-hit-house-and-campground-in-new-zealand",
      "published": "Thu, 22 Jan 2026 23:25:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Three people dead and alleged gunman at large after shooting in NSW town",
      "description": "Two women and a man have died after a shooting at Lake Cargelligo as police urge locals to stay inside Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A large-scale manhunt is under way after an alleged gunman fatally shot three people, including a pregnant woman, and critically injured a fourth in the New South Wales’s central west region. NSW police said the alleged perpetrator, Julian ‘Hoolio’ Ingram, aged 37, was believed to be “on the move” in a vehicle on Friday morning. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/three-people-dead-after-shooting-in-nsw-town-lake-cargelligo-as-police-urge-locals-to-stay-inside-ntwnfb",
      "published": "Thu, 22 Jan 2026 21:32:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Trump takes spotlight at 2026 World Economic Forum in Davos",
      "description": "After a week of twists and turns, US President Donald Trump delivered a highly anticipated speech at the World Economic Forum in Davos on Wednesday. Earlier at Davos, French President Emmanuel Macron decried bullying on the global stage and Canadian Prime Minister Mark Carney warned that \"the old order is not coming back\". For analysis, FRANCE 24's Charles Pellegrin talks to Brett Bruen, president and CEO of the Global Situation Room, who is just back from Davos.",
      "url": "https://www.france24.com/en/tv-shows/people-profit/20260122-trump-takes-spotlight-at-2026-world-economic-forum-in-davos",
      "published": "Thu, 22 Jan 2026 15:47:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘Alarming’ increase in use of death penalty last year, despite global trend towards abolition",
      "description": "Despite a downward trend in the use of the death penalty globally, 2025 saw an ‘alarming’ increase in the number of executions in a small number of retentionist countries, the UN human rights office (OHCHR) warned on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166789",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN Assembly president defends multilateralism, UN Charter in Davos",
      "description": "From Davos, the President of the UN General Assembly on Wednesday warned that the world has entered a “make‑or‑break” moment for multilateralism, saying the rules‑based order can survive only if states speak the truth and act when it’s hard. She called for a cross‑regional alliance to push back against growing lawlessness, disinformation, and power‑based politics.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166803",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Hong Kong national security trial of three pro-democracy activists begins",
      "description": "Chow Hang-tung, Lee Cheuk-yan and Albert Ho, who led Tiananmen Square vigils, are accused of inciting subversion The national security trial of three pro-democracy activists who organised an annual memorial in Hong Kong to mark the Tiananmen Square massacre opened on Thursday, in another landmark case brought under the Beijing-imposed law that has practically crushed protests in the semiautonomous Chinese city. Chow Hang-tung , Lee Cheuk-yan and Albert Ho are charged with inciting subversion under Hong Kong’s national security law . Their trial is one of the most high-profile national security cases to be heard in Hong Kong since Beijing imposed the law in 2020 . The defendants face a maximum penalty of 10 years’ imprisonment if convicted. The law has a near-100% conviction rate. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/hong-kong-national-security-trial-pro-democracy-activists-chow-hang-tung-lee-cheuk-yan-albert-ho",
      "published": "Wed, 21 Jan 2026 23:45:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Ryan Coogler's Jim Crow-era vampire film 'Sinners' makes Hollywood history with 16 Oscar nominations",
      "description": "Ryan Coogler’s vampire epic \"Sinners\" dominated Oscar nominations on Thursday with a record 16 nods. The Academy also rewarded international films and handed a strong showing to Warner Bros.",
      "url": "https://www.france24.com/en/culture/20260122-coogler-sinners-makes-hollywood-history-with-16-oscar-nominations",
      "published": "Thu, 22 Jan 2026 15:57:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Winter attacks in Ukraine, looming food aid cuts in Nigeria, drought in Kenya",
      "description": "Russian forces launched a fresh wave of strikes across Ukraine this week which have left hundreds of thousands of families without electricity and heating amid freezing temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166810",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: War crimes probe pledges to continue work for justice and accountability",
      "description": "As President Trump launched the international Board of Peace plan for Gaza on Thursday, top independent rights experts tasked by the UN Human Rights Council with investigating grave abuses linked to the Hamas-Israel war pledged to continue their work seeking justice and accountability for all.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166807",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti explained: why the crisis is deepening — and what comes next",
      "description": "Haiti is entering 2026 facing one of the most complex crises in its recent history. On Wednesday, the Caribbean island nation will be high on the international agenda as the UN Security Council holds its first meeting of the year to update ambassadors.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166801",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At the edge of war: the Central African Republic's uneasy border with Sudan",
      "description": "The land flattens on the approach to Birao, a cut-off town ringed by savannah in the far north of the Central African Republic, where roads dissolve into dust and motorcycles vastly outnumber cars. Less than two hours’ drive from the Sudanese border, this is the edge of a fractured country still piecing itself back together, while absorbing the shockwaves of a neighbouring conflict.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166794",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Two dead and several missing in New Zealand landslides",
      "description": "Heavy rains have ravaged the country's North Island, with a minister comparing it to a \"war zone\".",
      "url": "https://www.bbc.com/news/articles/cje11x527n4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 09:14:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "World leaders to hold emergency summit on Greenland. And, SCOTUS weighs Fed case",
      "description": "European leaders hold an emergency summit on a possible U.S.-Greenland deal. And, the Supreme Court weighs whether the president can fire Fed governors.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106787/up-first-newsletter-eu-emergency-meeting-trump-greenland-canada-scotus-fed",
      "published": "Thu, 22 Jan 2026 07:06:59 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Death toll in South Africa school bus crash rises to 14 as the driver is charged with murder",
      "description": "Authorities in South Africa say that two teenagers have died from injuries sustained in a school bus crash in the country's Gauteng province, raising the death toll to 14",
      "url": "https://abcnews.go.com/International/wireStory/death-toll-south-africa-school-bus-crash-rises-129456096",
      "published": "Thu, 22 Jan 2026 11:22:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti crisis at breaking point as gangs tighten grip ahead of transition deadline",
      "description": "Haiti’s deepening crisis has reached a critical phase, senior UN officials warned the Security Council on Wednesday, as powerful gangs continue to expand their control across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166806",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Japan suspends world's largest nuclear plant hours after restart",
      "description": "The operator says reactor remains \"stable\" and has no \"radioactive impact outside\".",
      "url": "https://www.bbc.com/news/articles/cx2yy8z91n4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 13:13:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Spain: Train collides with crane in wake of 2 deadly crashes",
      "description": "Emergency crews are responding after a train collided with a construction crane in near Spain's Cartagena. The incident has added to growing scrutiny of rail safety after two serious accidents this week.",
      "url": "https://www.dw.com/en/spain-train-collides-with-crane-in-wake-of-2-deadly-crashes/a-75606801?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 12:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Flooding causes widespread damage across southern Africa",
      "description": "Deadly floodings across southern Africa has submerged roads, homes and schools, forcing evacuations.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/flooding-causes-widespread-damage-across-southern-africa?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 15:47:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Trump's provocative rhetoric about Greenland threatens long-standing world order",
      "description": "President Trump says he won't take Greenland by force, but he delivered provocative statements that have threatened to tear down the pillars of the world order constructed by the U.S. 80 years ago.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5684112/trumps-provocative-rhetoric-about-greenland-threatens-long-standing-world-order",
      "published": "Thu, 22 Jan 2026 04:44:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "62 Nigerian hostages rescued, 2 militants killed, army says",
      "description": "Nigeria's military rescued 62 hostages and killed two militants in operations across Zamfara, Kebbi and Sokoto states after weekend church kidnappings.",
      "url": "https://www.foxnews.com/world/62-nigerian-hostages-rescued-2-militants-killed-army-says",
      "published": "Wed, 21 Jan 2026 14:08:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of sex assaults on teenage prisoners, while families charged to recover remains of loved ones",
      "description": "Iran's prosecutor general Mohammad Movahedi claims government crushed nationwide protests as death toll reaches 544 with over 10,681 arrested.",
      "url": "https://www.foxnews.com/world/iran-accused-sex-assaults-teenage-prisoners-families-charged-recover-remains-loved-ones",
      "published": "Wed, 21 Jan 2026 21:38:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "American flags torched, riot police clash with protesters ahead of Trump Davos arrival",
      "description": "Swiss riots erupt in multiple cities as anti-Trump protesters march against President Trump's World Economic Forum appearance, with police deploying water cannons.",
      "url": "https://www.foxnews.com/world/american-flags-torched-riot-police-clash-protesters-trump-davos-arrival",
      "published": "Tue, 20 Jan 2026 20:11:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Israeli strike in Gaza kills three journalists, first responders say",
      "description": "Another eight Palestinians were killed by Israeli artillery and gunfire across Gaza on Wednesday, according to medics.",
      "url": "https://www.bbc.com/news/articles/c98pnzp50nqo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 20:44:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Filipino journalist Frenchie Cumpio found guilty of terror financing in verdict rights groups call ‘absurd’",
      "description": "Reporters Without Borders said the ruling against the 26-year-old journalist showed a ‘blatant disregard for press freedom’ in the Southeast Asian nation A young Filipino journalist who spent nearly six years in a crowded provincial prison was found guilty of terror financing on Thursday, in a case rights groups and a UN rapporteur labelled a “travesty of justice”. Community journalist and radio broadcaster Frenchie Cumpio, 26, and former roommate Marielle Domequil broke down in tears and hugged each other as the guilty verdict was read and they were sentenced to 12-18 years in prison by judge Georgina Uy Perez of the Tacloban regional court. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/frenchie-mae-cumpio-philippine-journalist-found-guilty",
      "published": "Thu, 22 Jan 2026 03:28:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ISIS takes credit for Kabul suicide bombing at Chinese restaurant",
      "description": "ISIS-K claims responsibility for deadly suicide blast at Chinese restaurant in Kabul, killing seven people, including one Chinese national.",
      "url": "https://www.foxnews.com/world/isis-takes-credit-kabul-suicide-bombing-chinese-restaurant",
      "published": "Tue, 20 Jan 2026 08:24:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Ugandan MP and Bobi Wine ally arrested over election violence",
      "description": "The opposition politician is accused of election violence in which at least seven people were killed.",
      "url": "https://www.bbc.com/news/articles/cq844z9y4q9o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 13:14:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Several missing after New Zealand landslide hits campsite at beauty spot",
      "description": "Rescue efforts are under way to free people buried under rubble after landslides hit a campsite and house in New Zealand.",
      "url": "https://news.sky.com/story/several-missing-after-new-zealand-campsite-landslide-with-no-sign-of-life-detected-for-hours-official-says-13497417",
      "published": "Thu, 22 Jan 2026 06:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Police officer cleared of failing to stop school shooting gunman who killed 21",
      "description": "A former police officer has been acquitted of criminal child-endangerment charges related to his role in the flawed law enforcement response to the 2022 Uvalde school shooting that left 19 children and two teachers dead.",
      "url": "https://news.sky.com/story/texas-jury-clears-police-officer-accused-of-failing-to-stop-uvalde-school-shooting-gunman-13497447",
      "published": "Thu, 22 Jan 2026 07:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Nigeria church attackers demand ransoms as search intensifies for over 150 hostages",
      "description": "The gunmen who abducted more than 150 church worshippers in Nigeria’s conflict-hit northwest are demanding 17 motorcycles as ransom from families",
      "url": "https://abcnews.go.com/International/wireStory/nigeria-church-attackers-demand-ransoms-search-intensifies-150-129458838",
      "published": "Thu, 22 Jan 2026 13:46:18 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Brother killed after teen becomes 'enraged' over video game, stabs sibling: police",
      "description": "Oklahoma teenager allegedly calls 911 to confess stabbing his brother to death over a video game dispute. William Spencer, 19, now faces murder charges.",
      "url": "https://www.foxnews.com/us/brother-killed-after-teen-becomes-enraged-over-video-game-stabs-sibling-police",
      "published": "Thu, 22 Jan 2026 17:49:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Phoenix gas station murder suspect had weapons charge tossed before fatal shooting, records show",
      "description": "Man accused of killing Danny Lyn Kaster at Phoenix QuikTrip allegedly shot victim over bathroom dispute. Family says ordinary interaction turned deadly.",
      "url": "https://www.foxnews.com/us/phoenix-gas-station-murder-suspect-had-weapons-charge-tossed-before-fatal-shooting-records-show",
      "published": "Thu, 22 Jan 2026 10:00:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump pressures UK over Hamas-linked figure as US intel flags potential terror threat",
      "description": "U.S. Treasury sanctioned Zaher Birawi, 64, alleging the Britain-based activist serves as a Hamas senior official through a Popular Conference for Palestinians Abroad leadership role.",
      "url": "https://www.foxnews.com/world/trump-pressures-uk-hamas-linked-figure-us-intel-flags-potential-terror-threat",
      "published": "Thu, 22 Jan 2026 16:46:05 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "France seizes oil tanker in Mediterranean sailing from Russia: Macron",
      "description": "French President Emmanuel Macron says vessel subject to international sanctions, suspected of 'flying false flag'.",
      "url": "https://www.aljazeera.com/news/2026/1/22/france-seizes-oil-tanker-in-mediterranean-sailing-from-russia-macron?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 17:27:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Greenland and the world order",
      "description": "Is there a deal between the U.S., Denmark and Greenland? Mary Louise Kelly and the team on NPR's national security podcast break it down.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5685021/greenland-and-the-world-order",
      "published": "Thu, 22 Jan 2026 16:13:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Kurds in the Middle East: Struggle for a homeland",
      "description": "The Kurdish people are one of the largest ethnic groups in the world without their own country. Many are native to the region where four countries — Iran, Iraq, Syria and Turkey — meet and share languages and culture.",
      "url": "https://www.dw.com/en/kurds-in-the-middle-east-struggle-for-a-homeland/a-75612377?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 20:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Fact check: Trump's speech at the World Economic Forum",
      "description": "At Davos, Trump made bold claims about Greenland, NATO spending and China’s wind power. DW Fact Check examines where his statements clash with historical records and current data.",
      "url": "https://www.dw.com/en/fact-check-trump-s-speech-at-the-world-economic-forum/a-75601073?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 13:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "EU leaders divided on Greenland crisis narrative as they weigh anti-coercion instrument preparations",
      "description": "Did Trump back down because Europe was tough, or was it because of Europe's willingness to negotiate? FRANCE 24's Brussels correspondent Dave Keating explains that 'EU leaders are not in agreement about the narrative of the past several days and that's going to be a problem because they need to decide tonight whether to make preparations for the anti-coercion instrument to use in case Donald Trump decides to go ahead with the Greenland threats after all'.",
      "url": "https://www.france24.com/en/eu-leaders-divided-on-greenland-crisis-narrative-as-they-weigh-anti-coercion-instrument-preparations",
      "published": "Thu, 22 Jan 2026 19:25:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "EU must remain vigilant and ready to respond to threats, Macron says",
      "description": "The European ​Union must remain ⁠vigilant and ready to respond firmly in ​case ‍of new threats, President ​Emmanuel Macron said in ​Brussels ahead of an emergency EU leaders summit to discuss U.S. President Donald Trump's public ‍intends to acquire ​Greenland. FRANCE 24's Nicholas Rushworth reports.",
      "url": "https://www.france24.com/en/eu-must-remain-vigilant-and-ready-to-respond-to-threats-macron-says",
      "published": "Thu, 22 Jan 2026 19:11:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Conservative Utah student says radical left-wing classmate threatened to 'Kirk' him before campus arrest",
      "description": "University of Utah student arrested after allegedly threatening conservative peers with death, mimicking rifle gestures at campus event in concerning incident.",
      "url": "https://www.foxnews.com/us/conservative-utah-student-says-radical-left-wing-classmate-threatened-kirk-him-before-campus-arrest",
      "published": "Thu, 22 Jan 2026 08:00:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Video shows severely damaged building in Ukraine from Russian attack",
      "description": "A Russian drone strike hit a residential building in the Ukrainian city of Dnipro, injuring seven people.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/video-shows-severely-damaged-building-in-ukraine-from-russian-attack?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 16:23:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump vs. U.S. allies: How will this end?",
      "description": "The president has backed off his threat to take Greenland by force. But his highly inflammatory remarks in Switzerland rattled U.S. allies and threatened to tear down the pillars of the world order.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106678/trump-allies-nato",
      "published": "Thu, 22 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "ICE arrests in the US: What's true, what's fake",
      "description": "Across the United States, arrests by ICE agents - and protests against them - continue. As Donald Trump's immigration crackdown has intensified, more and more videos have gained traction online, showing ICE arrests filmed by bystanders. And whilst there are verified videos showing aggression by federal agents, not all the videos are authentic. In Truth or Fake, Vedika Bahl goes through what's real and what's misleading.",
      "url": "https://www.france24.com/en/ice-arrests-in-the-us-what-s-true-what-s-fake",
      "published": "Thu, 22 Jan 2026 20:31:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "No going back? Europeans seek unity as transatlantic ties hit new low",
      "description": "While the world waited Wednesday on what Donald Trump would utter on Greenland, what if we missed the bigger picture? That for 73 minutes, the US president before an audience of traditional transatlantic allies in Davos, hurled invectives and insults while doubling down on what’s now official US policy, the assessment that Europe’s a continent in civilizational decline, implied in that, overrun by non-Christians and non-whites. How do Europeans respond? Even far-right aficionados of MAGA have a hard time with the Greenland grab. Trump's imminent threat has passed for now, but can European leaders establish a common framework for what lies ahead? How do what the Canadian prime minister called “middle powers” coalesce? And if the time for flattery and calling Trump daddy truly has passed, then what’s the next step for Europe, for NATO, for nations the world over that still believe in the rules-based order of old?",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260122-no-going-back-europeans-seek-unity-as-transatlantic-ties-hit-new-low",
      "published": "Thu, 22 Jan 2026 19:22:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Death toll in Pakistan shopping plaza fire rises to 67, officials say",
      "description": "Police and hospital officials say the death toll from a devastating fire at a shopping plaza in Pakistan’s southern city of Karachi has jumped to 67 after body parts of dozens more people were found",
      "url": "https://abcnews.go.com/International/wireStory/death-toll-pakistan-shopping-plaza-fire-rises-67-129460886",
      "published": "Thu, 22 Jan 2026 13:05:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria: Renewed clashes risk derailing fragile transition",
      "description": "A tense standoff between the Syrian Government and Kurdish-led forces in the country’s northeast risks igniting wider instability just as Syria struggles to emerge from years of conflict and authoritarian rule, senior UN officials told the Security Council on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166811",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Fox News ‘Antisemitism Exposed’ Newsletter: Legendary coach calls out anti-Israel protesters' silence on Iran",
      "description": "Fox News' \"Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.",
      "url": "https://www.foxnews.com/us/fox-news-antisemitism-exposed-newsletter-legendary-coach-calls-out-anti-israel-protesters-silence-iran",
      "published": "Thu, 22 Jan 2026 14:07:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Australia’s worst heatwave since black summer made five times more likely by global heating, analysis finds",
      "description": "Extreme heat ‘is getting worse and whether we like it or not … there’s ultimately a limit to what we can actually physically cope with,’ scientist says Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Human-caused global heating made the intense heatwave that affected much of Australia in early January five times more likely, new analysis suggests. The heatwave earlier this month was the most severe since the 2019-20 black summer, with temperatures over 40C in Melbourne and Sydney, even hotter conditions in regional Victoria and New South Wales and extreme heat also affecting Western Australia, South Australia and Tasmania. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/23/australias-worst-heatwave-since-black-summer-made-five-times-more-likely-by-global-heating-analysis-finds",
      "published": "Thu, 22 Jan 2026 13:01:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "European leaders to meet for emergency summit about the U.S. and Greenland",
      "description": "European leaders will gather in Brussels Thursday night for an emergency meeting on tensions with the U.S. over Greenland and President Trump's tariff threats.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5684116/european-leaders-to-meet-for-emergency-summit-about-the-u-s-and-greenland",
      "published": "Thu, 22 Jan 2026 06:58:58 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "EU holds emergency summit amid Greenland upheaval",
      "description": "US President Trump's sudden declaration of a \"breakthrough\" on Greenland seemed to render an emergency EU summit partly moot, as it was originally called to discuss the threat of US tariffs on Europe and how to respond.",
      "url": "https://www.dw.com/en/eu-holds-emergency-summit-amid-greenland-upheaval/a-75612236?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 18:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "67 people killed in Pakistan shopping centre fire",
      "description": "The remains of dozens more people killed in an inferno at a shopping centre in Pakistan have been found, bringing the total number killed to 67.",
      "url": "https://news.sky.com/story/remains-of-dozens-more-people-recovered-from-shopping-centre-fire-in-pakistan-taking-number-killed-to-67-13497708",
      "published": "Thu, 22 Jan 2026 18:38:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukraine's Zelenskyy says his repeated warnings to Europe feel like 'Groundhog Day'",
      "description": "Ukrainian President Volodymyr Zelenskyy is criticizing European allies for their slow and fragmented response to Russia's invasion",
      "url": "https://abcnews.go.com/International/wireStory/ukraines-zelenskyy-repeated-warnings-europe-feel-groundhog-day-129460875",
      "published": "Thu, 22 Jan 2026 13:45:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "EU leaders gather to chart a new course for transatlantic ties after Trump threats over Greenland",
      "description": "European Union leaders are gathering for emergency talks to address transatlantic relations after a turbulent two weeks dominated by U.S. President Donald Trump's renewed threats to take control of Greenland",
      "url": "https://abcnews.go.com/International/wireStory/eu-leaders-gather-chart-new-transatlantic-ties-after-129447474",
      "published": "Thu, 22 Jan 2026 07:05:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yale hosts controversial speaker Trita Parsi accused of promoting Iranian regime interests",
      "description": "Controversial Iranian American Trita Parsi to speak at Yale, sparking outrage amid deadly Iran protests that allegedly killed over 16,000 people.",
      "url": "https://www.foxnews.com/us/yale-hosts-controversial-speaker-trita-parsi-accused-promoting-iranian-regime-interests",
      "published": "Thu, 22 Jan 2026 06:00:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump slams UK island handoff deal that could put key US military base at risk",
      "description": "President Donald Trump calls the United Kingdom's Chagos Islands transfer plan \"an act of great stupidity,\" warning China could exploit the deal.",
      "url": "https://www.foxnews.com/world/trump-slams-uk-island-handoff-deal-put-key-us-military-base-risk",
      "published": "Wed, 21 Jan 2026 18:25:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Top EU official warns Trump's tariff threat over Greenland pushback is 'a mistake'",
      "description": "EU chief calls President Donald Trump's Greenland tariff threats \"a mistake\" as European leaders warn of downward spiral in transatlantic trade relations.",
      "url": "https://www.foxnews.com/world/top-eu-official-warns-trumps-tariff-threat-over-greenland-pushback-a-mistake",
      "published": "Tue, 20 Jan 2026 13:23:56 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Australia news live: Littleproud says Ley ‘broke the Coalition’ by accepting resignations; federal public service commissioner resigns",
      "description": "Follow updates live Sussan Ley confident she will survive as opposition leader and says door is open to Nationals rejoining Coalition Get our breaking news email , free app or daily news podcast Liberal senator says party still ‘believes’ in the Coalition Anne Ruston, a Liberal senator, said the party still believes in the Coalition and would like to see it continue, but said Sussan Ley was left with “no option but to accept” multiple resignations after members of the Nationals broke a “fundamental rule”. We believe in the coalition and we would like to see a coalition continue, but the circumstances around the actions of the National party this week left the leader with no option but to accept the resignations of three people who, by their own admission, broke the very fundamental rule of a coalition and that is shadow cabinet solidarity. So I think the leader is absolutely right. The most important thing that we can do as of today is to focus on the future of responding to the needs of the Australian public because that’s what they elected us to do. That’s obviously a matter for the National party and their deliberations as to why they chose yesterday as a day to make public comment, and I’m not going to make any further comment than that. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/23/australia-news-live-sussan-ley-liberals-coalition-nationals-littleproud-hastie-taylor-anthony-albanese-labor-spill-ntwnfb",
      "published": "Thu, 22 Jan 2026 23:32:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "In fiery Davos speech, Zelensky blasts EU's lack of \"political will\"",
      "description": "Ukrainian President Volodymyr Zelensky on Thursday blasted the EU's lack of \"political will\" in countering Russian leader Vladimir Putin, during a fiery address criticising some of Kyiv's top allies at the World Economic Forum. FRANCE 24's Eliza Herbert reports.",
      "url": "https://www.france24.com/en/in-fiery-davos-speech-zelensky-blasts-eu-s-lack-of-political-will",
      "published": "Thu, 22 Jan 2026 19:56:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Philippine court convicts journalist of terror financing charge in ruling condemned by media groups",
      "description": "A Philippine court has found a Filipina journalist guilty of financing terrorism in a verdict that was condemned by press freedom watchdogs but welcomed by anti-communist insurgency officials",
      "url": "https://abcnews.go.com/International/wireStory/philippine-court-convicts-journalist-terror-financing-charge-ruling-129445362",
      "published": "Thu, 22 Jan 2026 04:01:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UN strongly condemns demolition of UNRWA headquarters in East Jerusalem",
      "description": "The reported demolition underway early Tuesday of the headquarters of UN agency UNRWA by Israeli forces in occupied East Jerusalem - reportedly “under the watch of lawmakers and a member of the Government” - has prompted swift condemnation from the global body.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166792",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Iran blocked the internet amid deadly protests. Some voices are still getting through",
      "description": "Weeks into an internet blackout in Iran, NPR speaks to a protester who is still online and a U.S.-based activist who is trying to get more Starlink terminals into the country to get more people online.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5680784/iran-blocked-the-internet-amid-deadly-protests-some-voices-are-still-getting-through",
      "published": "Thu, 22 Jan 2026 04:44:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Germany news: Berlin mulls sending migrants to third nations",
      "description": "Germany has joined a group of five nations to explore the deportations to third-country migrant hubs. Meanwhile, firefighters tackled a blaze at a property once belonging to prominent Nazi Joseph Goebbels.",
      "url": "https://www.dw.com/en/germany-news-berlin-mulls-sending-migrants-to-third-nations/live-75604347?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 12:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Three dead in shooting in Australia's New South Wales",
      "description": "A man is being sought in connection with the shootings in the small town of Lake Cargelligo on Thursday.",
      "url": "https://www.bbc.com/news/articles/c4g00mv29j5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 22:38:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "What we know about Trump's  'framework of future deal' over Greenland",
      "description": "Denmark and Greenland have made it clear they will not relinquish sovereignty of the world's largest island.",
      "url": "https://www.bbc.com/news/articles/c86vvjxe9z7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 18:15:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Is the world’s rules-based order ruptured?",
      "description": "Canadian Prime Minister Mark Carney says system is broken, with world powers employing force.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/22/is-the-worlds-rules-based-order-ruptured?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 21:11:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy urges Europe to act as a global power",
      "description": "Ukrainian President Volodymyr Zelenskyy, in Davos, urged Europe to show more courage and unity.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/zelenskyy-urges-europe-to-act-as-a-global-power?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 19:53:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Real Madrid remain football’s top earners but Liverpool overtake Man Utd",
      "description": "Real Madrid remain the top earner in world football but Liverpool leap in ranking, while Manchester United slide.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/liverpool-overtake-man-utd-but-real-madrid-remain-footballs-top-earners?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 16:39:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Hand shape in Indonesian cave may be world’s oldest known rock art",
      "description": "Archaeologists say stencil painted with ochre in limestone cave on Muna Island was created at least 67,800 years ago The faded outline of a hand on a cave wall in Indonesia may be the world’s oldest known rock art, according to archaeologists who say it was created at least 67,800 years ago. The ancient hand stencil was discovered in a limestone cave popular with tourists on Muna Island, part of south-eastern Sulawesi, where it had gone unnoticed between more recent paintings of animals and other figures. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/21/hand-shape-indonesia-cave-rock-art-67800-years-old",
      "published": "Wed, 21 Jan 2026 16:00:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Fact check: Are fans cancelling World Cup 2026 tickets over US immigration fears?",
      "description": "Fears over US immigration policies are fueling viral claims that thousands are canceling World Cup 2026 tickets. Are fans really backing out—and could ICE target visitors?",
      "url": "https://www.dw.com/en/fact-check-are-fans-cancelling-world-cup-2026-tickets-over-us-immigration-fears/a-75562821?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 16:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Davos 2026: Zelenskyy repeats call for Europe to 'act now'",
      "description": "\"Without action now, there is no tomorrow,\" Ukrainian President Zelenskyy tells world leaders at Davos, adding that Europe needs to be able to protect itself. Follow DW for more.",
      "url": "https://www.dw.com/en/davos-2026-zelenskyy-repeats-call-for-europe-to-act-now/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 15:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "India's dilemma over Trump's Gaza 'Board of Peace'",
      "description": "Trump's 'Board of Peace' is testing India's long held balancing act between Israel and the Palestinians, raising questions about costs, strategy, and global leadership.",
      "url": "https://www.dw.com/en/india-s-dilemma-over-trump-s-gaza-board-of-peace/a-75607689?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 15:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Where is the US-China AI 'race' heading in 2026?",
      "description": "With American tech continuing to dominate developing the frontier of artificial intelligence, China is holding its own with globally popular cheaper models and plans for building an AI-powered economy in the near future.",
      "url": "https://www.dw.com/en/where-is-the-us-china-ai-race-heading-in-2026/a-75608670?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 14:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Davos: Germany's Merz says old world order 'unraveling'",
      "description": "German Chancellor Merz said the world has \"entered an era of great power politics\" where Russia and China challenge the US. In his speech at Davos, Merz said Europe must boost competitiveness and invest in defense.",
      "url": "https://www.dw.com/en/davos-germany-s-merz-says-old-world-order-unraveling/a-75606240?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 13:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'Europe can, too, weaponise the economy and the single market', expert says",
      "description": "Speaking with FRANCE 24's Mark Owen, Grégoire Roos, Director of Europe, Russia and Eurasia programme at Chatham House, says that there is a 'convergence in messaging to Donald Trump' among EU leaders, who 'have bought time by, at last, taking the full measure of the power on which they have been sitting for so long, the single market and the dependencies that many around the world entertain vis-à-vis the single market'.",
      "url": "https://www.france24.com/en/europe-can-too-weaponize-the-economy-and-the-single-market-expert-says",
      "published": "Thu, 22 Jan 2026 20:56:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Who's on Trump's Board of Peace - and who said no",
      "description": "Donald Trump says \"a lot of great people\" want to join his Board of Peace - but some world leaders are clearly worried the controversial initiative could undermine the United Nations.",
      "url": "https://news.sky.com/story/what-is-trumps-board-of-peace-and-is-it-going-to-replace-the-un-13497460",
      "published": "Thu, 22 Jan 2026 08:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "For every $1 spent protecting nature, $30 goes to destroying it",
      "description": "The world spends billions to protect nature, but trillions are being invested in business activities that harm the environment.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166809",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World leaders join Trump to sign Board of Peace agreement and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/world-leaders-join-trump-board-peace-agreement-more-top-headlines",
      "published": "Thu, 22 Jan 2026 07:01:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump floats ‘Board of Peace’ to replace UN, signals major global power shift",
      "description": "President Donald Trump invited dozens of countries including Russia, China, and Ukraine to join his Board of Peace initiative, with a signing ceremony planned for Davos, Switzerland.",
      "url": "https://www.foxnews.com/world/trump-floats-board-peace-replace-un-signals-major-global-power-shift",
      "published": "Tue, 20 Jan 2026 17:36:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US unveils plans for 'New Gaza' with skyscrapers",
      "description": "\"We're going to be very successful in Gaza,\" President Trump says, as his administration laid out its vision for post-war reconstruction.",
      "url": "https://www.bbc.com/news/articles/cy7mmpljze7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 21:55:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "German nurse jailed for murders could be linked to 100 more deaths",
      "description": "Prosecutors are reviewing dozens more suspected deaths linked to a former palliative care nurse.",
      "url": "https://www.bbc.com/news/articles/ckgjjy55x2mo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 18:12:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Vampire film Sinners breaks Oscar nominations record",
      "description": "The horror is up for 16 awards - setting a new record for the most Oscar nominations for a single film.",
      "url": "https://www.bbc.com/news/articles/cz0ppdjmjy9o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 15:10:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Are we witnessing the death of traditional TV?",
      "description": "The Oscars leave ABC for YouTube in 2029, signaling a major shift in how audiences watch live events.",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/22/are-we-witnessing-the-death-of-traditional-tv?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 20:31:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Paramount Skydance extends Warner Bros takeover bid offer",
      "description": "The Ellison-owned media giant will now give investors until February 20 to consider its bid.",
      "url": "https://www.aljazeera.com/economy/2026/1/22/paramount-skydance-extends-warner-bros-takeover-bid-offer?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 20:18:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Canada aquarium that threatened to kill its whales wants to sell them to US",
      "description": "Marineland seeks approval to sell belugas to United States after its China export proposal was rejected ‘It’s heartbreaking’: how 30 captive beluga whales have become pawns in row over animal cruelty Marineland, the Canadian amusement park and aquarium which has threatened to kill its captive whales , wants government approval to sell the belugas to the United States after its China export proposal was rejected, according to an official and a former trainer. The former tourist attraction near the famed Niagara Falls has been mired in controversy for years. Twenty animals, including 19 belugas, have died at the park since 2019, according to a tally by the Canadian Press. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/canada-marineland-aquarium-whales-us",
      "published": "Thu, 22 Jan 2026 17:33:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘Manosphere’ influencers pushing testosterone tests are convincing healthy young men there is something wrong with them, study finds",
      "description": "Researcher points to ‘medicalisation of masculinity’ after investigating how men’s health is being monetised online “If you’re not waking up in the morning with a boner, there’s a large possibility that you have low testosterone levels,” an influencer on TikTok with more than 100,000 followers warns his viewers. Despite screening for low testosterone being medically unwarranted in most young men, this group is being aggressively targeted online by influencers and wellness companies promoting hormone tests and treatments as essential to being a “real man”, a study published in the journal Social Science and Medicine has found. Continue reading...",
      "url": "https://www.theguardian.com/society/2026/jan/22/manosphere-influencers-testosterone-tests-young-men",
      "published": "Thu, 22 Jan 2026 14:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Former U.S. ambassador discusses the path forward after Trump's Davos speech",
      "description": "NPR's A Martinez speaks with Alan Leventhal, a former U.S. ambassador to Denmark, about developments following President Trump's speech in Davos.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5684143/former-u-s-ambassador-discusses-the-path-forward-after-trumps-davos-speech",
      "published": "Thu, 22 Jan 2026 06:58:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Sinners' breaks records at 2026 Oscar nominations",
      "description": "The film by Ryan Coogler earned 16 nods for the 98th Academy Awards, which will be presented on March 15. A new Oscar category was also introduced for the first time in 25 years.",
      "url": "https://www.dw.com/en/sinners-breaks-records-at-2026-oscar-nominations/a-75606280?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 15:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Vampire horror 'Sinners' leads Oscar nominees, followed by 'One Battle After Another'",
      "description": "The Academy of Motion Picture Arts and Sciences have announced the nominees for the 98th Academy Awards, with Ryan Coogler's vampire horror \"Sinners\" leading the charge. Racking up a record 16 nominations in various categories, \"Sinners\" is followed by Paul Thomas Anderson's \"One Battle After Another\", on 13 nominations. FRANCE 24's Olivia Salazar-Winspear takes us through the movies and the movie stars who could be in line for a gold statuette on March 15.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260122-vampire-horror-sinners-leads-oscar-nominees-followed-by-one-battle-after-another",
      "published": "Thu, 22 Jan 2026 16:53:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky says US 'security guarantees' for Ukraine ready after meeting with Trump",
      "description": "Ukrainian President Volodymyr Zelensky said Thursday he and US President Donald Trump had agreed on post-war US security guarantees for Ukraine, without providing further details. The deal, which awaits signatures and parliamentary approval, would be a key step in plans to end the Russian invasion.",
      "url": "https://www.france24.com/en/europe/20260122-zelensky-says-us-security-guarantees-ready-after-meeting-with-trump",
      "published": "Thu, 22 Jan 2026 16:33:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky says that \"nothing has changed\" since last Davos summit",
      "description": "Ukrainian President Volodymyr Zelensky criticised what he called the EU’s lack of “political will” towards his Russian counterpart Vladimir Putin at Davos.",
      "url": "https://www.france24.com/en/video/20260122-zelensky-says-that-nothing-has-changed-since-last-davos-summit",
      "published": "Thu, 22 Jan 2026 15:59:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany expels a Russian diplomat after a suspect is arrested in an espionage case",
      "description": "The German government has expelled a Russian diplomat over a case involving espionage related to the war in Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/germany-expels-russian-diplomat-after-suspect-arrested-espionage-129451704",
      "published": "Thu, 22 Jan 2026 09:20:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "After presidential election, Ugandan police detain a key ally of opposition figure Bobi Wine",
      "description": "Police have detained a key ally of Ugandan opposition figure Bobi Wine, accusing him of involvement in election-related violence",
      "url": "https://abcnews.go.com/International/wireStory/after-presidential-election-ugandan-police-detain-key-ally-129447736",
      "published": "Thu, 22 Jan 2026 07:29:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Armed husband confronts suspected Florida kidnapper after wife is followed home",
      "description": "Florida husband shoots man who allegedly tried to abduct his wife while she walked her dog on New Year's Day. Police rule shooting justified self-defense.",
      "url": "https://www.foxnews.com/us/armed-husband-confronts-suspected-florida-kidnapper-after-wife-followed-home",
      "published": "Thu, 22 Jan 2026 17:10:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Marine veteran shot in deadly robbery texted mom and sister to express his love before his death",
      "description": "Four individuals, including three 18-year-olds and a juvenile, have been arrested following the robbery and murder of Marine veteran Michael Ryan Burke.",
      "url": "https://www.foxnews.com/us/marine-veteran-shot-deadly-robbery-texted-mom-sister-express-his-love-before-his-death",
      "published": "Thu, 22 Jan 2026 14:24:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Murder rate drops to lowest level since 1900 across major US cities nationwide",
      "description": "Historic crime milestone as U.S. murders reach lowest levels since 1900. Major cities report record safety improvements through strategic enforcement.",
      "url": "https://www.foxnews.com/us/murder-rate-drops-lowest-level-since-1900-across-major-us-cities-nationwide",
      "published": "Thu, 22 Jan 2026 12:35:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Indiana judge shooting leaves ‘long list’ of potential suspects days into manhunt: defense attorney",
      "description": "Indiana Judge Steven Meyer and wife shot allegedly after shooter used dog ruse to get them to open door. Multiple law enforcement agencies investigating.",
      "url": "https://www.foxnews.com/us/indiana-judge-shooting-leaves-long-list-potential-suspects-days-manhunt-defense-attorney",
      "published": "Thu, 22 Jan 2026 07:00:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fourth shark attack in three days rocks Australia as authorities close beaches and deploy drumlines",
      "description": "A string of shark attacks near Sydney prompted beach closures across New South Wales. The latest victim attacked at Point Plomer suffered only minor cuts.",
      "url": "https://www.foxnews.com/world/fourth-shark-attack-three-days-rocks-australia-authorities-close-beaches-deploy-drumlines",
      "published": "Tue, 20 Jan 2026 07:24:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Peru’s interim president embroiled in scandal over secret meetings with Chinese businessmen",
      "description": "Opposition lawmakers say they will seek to impeach José Jerí over undisclosed meetings in Lima’s Chinatown Peru ’s interim president, José Jerí, has denied lying to the country and claimed he was the victim of a plot to discredit him amid a growing political scandal over his secretive meetings with Chinese businessmen. Jerí, 39, who took office in October after his predecessor Dina Boluarte was forced out, told a congressional oversight committee on Wednesday that he had been the target of a smear campaign designed to destabilise the country ahead of elections in April. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/peru-president-chinese-businessmen-secret-meeting",
      "published": "Thu, 22 Jan 2026 17:20:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Top AZ county lawyer fired after dad accuses him of filming 12-year-old at store, performing sex act in car",
      "description": "Arizona county attorney Paul Correa was accused of filming a 12-year-old at Target last December. The girls father reportedly saw Correa in his car with \"disheveled\" pants.",
      "url": "https://www.foxnews.com/us/top-az-county-lawyer-fired-dad-accuses-him-filming-12-year-old-store-performing-sex-act-car",
      "published": "Thu, 22 Jan 2026 15:57:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela moves to open up oil sector to private investors as demanded by Trump",
      "description": "Venezuelan lawmakers on Thursday gave initial approval to opening the country's oil sector to private investors, as Caracas moved swiftly to rebuild ties with Washington following the US capture of President Nicolas Maduro.",
      "url": "https://www.france24.com/en/americas/20260122-venezuela-moves-to-open-up-oil-sector-to-private-investors-as-us-ties-thaw",
      "published": "Thu, 22 Jan 2026 19:15:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Danish leader says her country can't negotiate on sovereignty",
      "description": "Denmark’s prime minister is saying after U_S_ President Donald Trump announced he agreed a “framework of a future deal” on Arctic security with the head of NATO that her country can’t negotiate on its sovereignty and she has been “informed that this ha...",
      "url": "https://abcnews.go.com/International/wireStory/danish-leader-country-negotiate-sovereignty-shes-told-case-129445256",
      "published": "Thu, 22 Jan 2026 03:08:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Human trafficking depends on corruption at every step",
      "description": "In 2011, a trafficker in Chile was convicted for recruiting economically vulnerable Peruvian citizens and arranging for them to be brought into the country – destined to become victims of sexual exploitation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166797",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota agitators stalk, pelt Border Patrol agents with food and spit at gas stations, DHS says",
      "description": "Anti-ICE agitators allegedly stalked, threw food at and spit on federal agents in Minneapolis, forcing crowd control measures, according to DHS.",
      "url": "https://www.foxnews.com/us/minnesota-agitators-stalk-pelt-border-patrol-agents-food-spit-gas-stations-dhs-says",
      "published": "Thu, 22 Jan 2026 08:02:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Former Iowa school superintendent arrested by ICE expected to plead guilty to federal charges",
      "description": "Former Des Moines Public Schools Superintendent Ian Roberts is set to plead guilty to a pair of federal charges following his September 2025 arrest by ICE.",
      "url": "https://www.foxnews.com/us/former-iowa-school-superintendent-arrested-ice-expected-plead-guilty-federal-charges",
      "published": "Thu, 22 Jan 2026 07:34:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "UN to take over al-Hol camp for IS families in Syria after unrest",
      "description": "A UN spokesman said conditions inside the camp remained \"tense and volatile\" after Kurdish-led forces withdrew.",
      "url": "https://www.bbc.com/news/articles/clyzzzd2y7do?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 22:46:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US envoy meets SDF commander, calls for Syria ceasefire to be upheld",
      "description": "After meeting with the SDF's commander, US's Tom Barrack said all parties agreed upholding the truce is 'essential'.",
      "url": "https://www.aljazeera.com/news/2026/1/22/us-envoy-meets-sdf-commander-calls-for-syria-ceasefire-to-be-upheld?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 18:53:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Jack Smith testifies to US Congress while Trump calls for his prosecution",
      "description": "Trump pushed the Justice Department to charge Smith, the former prosecutor who led investigations into his actions.",
      "url": "https://www.aljazeera.com/news/2026/1/22/former-special-counsel-jack-smith-testifies-before-us-congress-committee?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 18:41:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "How a strategic hill decided the Thai-Cambodia ceasefire",
      "description": "Hill 350, a strategic high point on the Thailand-Cambodia border, was fiercely contested in fighting last year.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/how-a-strategic-hill-decided-the-thai-cambodia-ceasefire?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 17:57:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Senegal coach defends AFCON final walk-off before expected sanction",
      "description": "Senegal face investigation following players and coaches walk-off in injury time of AFCON final against hosts Morocco.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/senegal-coach-defends-afcon-final-walk-off-ahead-of-expected-sanction?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 17:20:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: Far-right extremist 'Saxon Separatists' stand trial",
      "description": "The trial of 8 suspected right-wing extremists accused of planning a coup is beginning in the German city of Dresden. Their goal: A Nazi state.",
      "url": "https://www.dw.com/en/germany-far-right-extremist-saxon-separatists-stand-trial/a-75601683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 14:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Donald Trump retreats on Greenland threats",
      "description": "President Donald Trump announced Wednesday that he was scrapping his planned tariffs on eight European nations in an effort to force U.S. control over Greenland, pulling a dramatic reversal shortly after insisting he wanted to get the island “including right, title and ownership.”",
      "url": "https://www.france24.com/en/donald-trump-retreats-on-greenland-threats",
      "published": "Thu, 22 Jan 2026 17:06:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "NATO chief Mark Rutte's shows he's the 'Trump Whisperer' after Greenland diplomacy with Trump",
      "description": "NATO Secretary-General Mark Rutte appears to have been instrumental in persuading U.S. President Donald Trump to scrap his threat of tariffs as he presses for control over Greenland",
      "url": "https://abcnews.go.com/International/wireStory/nato-chief-mark-ruttes-shows-trump-whisperer-after-129448435",
      "published": "Thu, 22 Jan 2026 07:29:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fire at Cox's Bazar refugee camp in Bangladesh destroyed homes and displaced thousands of Rohingya",
      "description": "A massive fire this week has destroyed hundreds of makeshift homes in a Rohingya refugee camp in Cox's Bazar, Bangladesh, displacing more than 2,000 people",
      "url": "https://abcnews.go.com/International/wireStory/fire-coxs-bazar-refugee-camp-bangladesh-destroyed-homes-129445988",
      "published": "Thu, 22 Jan 2026 06:09:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Dangerous nostalgia’ is a threat to multilateralism, UN deputy chief tells Danish MPs",
      "description": "United Nations Deputy Secretary-General Amina Mohammed urged countries to protect the UN Charter in a powerful speech to the Danish Parliament on Thursday, urging countries to “stand up for a rules-based order” – or pay the price.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166812",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Idaho murder victims' families express outrage after crime scene photos accidentally released",
      "description": "Crime scene photos from the 2022 Idaho student murders were accidentally released, sparking outrage from victims' families who called for respect.",
      "url": "https://www.foxnews.com/us/idaho-murder-victims-families-express-outrage-after-crime-scene-photos-accidentally-released",
      "published": "Thu, 22 Jan 2026 08:39:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump’s ‘Board of Peace’ sees Hamas disarmed and glitzy Gaza towers",
      "description": "Donald Trump launched his “Board of Peace” with a vision of Gaza that sees Hamas disarmed and real estate developed.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/trumps-board-of-peace-sees-hamas-disarmed-and-glitzy-gaza-towers?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 18:42:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Can China rely on domestic oil after Iran, Venezuela shocks?",
      "description": "Donald Trump's moves against two key suppliers have revived debate over China’s fragile oil balance. With domestic output flat and oil fields aging, how much capacity — if any — exists to raise production?",
      "url": "https://www.dw.com/en/can-china-rely-on-domestic-oil-after-iran-venezuela-shocks/a-75516569?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 18:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Hong Kong: Organizers of Tiananmen vigil put on trial",
      "description": "Two of the defendants pleaded not guilty before the Hong Kong court, while the other pleaded guilty but pledged to keep working to end one-party rule in China. They're accused of \"inciting subversion of state power.\"",
      "url": "https://www.dw.com/en/hong-kong-organizers-of-tiananmen-vigil-put-on-trial/a-75604100?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 12:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "The decision to move IS prisoners from Syria to Iraq came at the request of Baghdad, officials say",
      "description": "Iraq has asked that Islamic State group prisoners be moved from northeast Syria to its detention centers",
      "url": "https://abcnews.go.com/International/wireStory/decision-move-prisoners-syria-iraq-request-baghdad-officials-129450036",
      "published": "Thu, 22 Jan 2026 13:05:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Virginia Dems introduce classroom DEI curriculum law on day 1 of legislative session",
      "description": "Virginia Democrats introduce HB 614 requiring DEI curriculum in schools, mandating instruction on \"historically marginalized communities\" across all districts.",
      "url": "https://www.foxnews.com/us/virginia-dems-introduce-classroom-dei-curriculum-law-day-1-legislative-session",
      "published": "Thu, 22 Jan 2026 11:20:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters break free from Syrian jail amid chaotic government handover",
      "description": "U.S. military boosts regional presence with F-15 fighter jets and USS Abraham Lincoln deployment as ISIS prison break highlights security risks amid Syria's political realignment.",
      "url": "https://www.foxnews.com/world/isis-fighters-break-free-from-syrian-jail-amid-chaotic-government-handover",
      "published": "Mon, 19 Jan 2026 22:10:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "UK holds off joining Trump's Board of Peace over Putin concerns",
      "description": "Foreign Secretary Yvette Cooper says the Russian president has shown no commitment to peace in Ukraine.",
      "url": "https://www.bbc.com/news/articles/cp9jj1j74ggo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 15:40:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Kangaroos’ giant ancestor probably able to hop despite 250kg weight, scientists say",
      "description": "Research for first time suggests tendon and bones in heavier species would have made bounding possible Giant 250kg kangaroos that once roamed Australia would probably have been able to hop despite their enormous size, researchers have said. While modern kangaroos are known for their ability to travel large distances by jumping with both hind legs at the same time, it has long been debated whether their extinct relatives would have been so springy. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/giant-kangaroo-ancestor-hop-250kg-weight",
      "published": "Thu, 22 Jan 2026 16:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "A vast Syrian camp for ISIS families faces an uncertain fate after a security handover",
      "description": "The huge al-Hol camp in northeastern Syria for years has posed an intractable problem — a destitute and increasingly dangerous detention site where ISIS ideology lives on.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5683970/syria-camp-isis-women-children",
      "published": "Thu, 22 Jan 2026 13:39:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Resistance in occupied Ukraine 'under constant surveillance'",
      "description": "A new report sheds light on the scope of the resistance in occupied Ukraine. FRANCE 24's Mark Owen speaks with the author of that report, Dr Jade McGlynn, Head of Ukraine and Russia programme at the CSNS at King's College London. She explains that resistance fighters in occupied Ukraine are 'pretty much under constant surveillance and that the risks are incredibly high' with routine enforced disappearances to black sites.",
      "url": "https://www.france24.com/en/ukraine-s-resistance-under-constant-surveillance",
      "published": "Thu, 22 Jan 2026 20:59:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Prison breaks and renewed clashes raise alarm in northeast Syria",
      "description": "The United Nations continues to monitor developments in northeast Syria following clashes between government troops and the Kurdish-led SDF militia during which scores of detained ISIL militants reportedly escaped from prison.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166799",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump told to 'f--- off' by Danish lawmaker during European Parliament debate about Greenland",
      "description": "European Parliament member Anders Vistisen confronts President Donald Trump's Greenland interest with profanity-laced rebuke, drawing a reprimand from parliament leadership.",
      "url": "https://www.foxnews.com/world/trump-told-f-k-off-danish-lawmaker-european-parliament-greenland-debate",
      "published": "Tue, 20 Jan 2026 16:27:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Mamdani defends Mahmoud Khalil on deportation order",
      "description": "Mayor Zohran Mamdani says pro-Palestine activist Mahmoud Khalil ‘deserves to stay’ in New York City.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/mamdani-defends-mahmoud-khalil-on-deportation-order?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 20:38:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "'It's all about the land': Zelensky says Ukraine to talk to US and Russia",
      "description": "The meeting came as US envoy Steve Witkoff headed to Moscow for a meeting with Russia's Vladimir Putin.",
      "url": "https://www.bbc.com/news/articles/c4g44r22j5jo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 17:37:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France seizes suspected Russian 'shadow fleet' oil tanker in the Mediterranean",
      "description": "The vessel, named Grinch, was stopped by the French navy as it travelled through waters between Spain and Morocco.",
      "url": "https://www.bbc.com/news/articles/cdexxr2y907o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 18:32:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ICE detains five-year-old and father in Minnesota, lawyer says",
      "description": "The boy was taken along with his father, the lawyer and school officials say. ICE says it kept the boy safe as his father ran.",
      "url": "https://www.bbc.com/news/articles/cwyrrqwxpz7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 23:16:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Son-in-law of Venezuelan opposition candidate freed from jail, wife says",
      "description": "Rafael Tudares was arrested after his father-in-law, Edmundo González, ran against Nicolás Maduro in the election.",
      "url": "https://www.bbc.com/news/articles/cq5yywx39e7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 11:35:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU suspends approval of US trade deal",
      "description": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland.",
      "url": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 23:41:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South African police not yet able to defeat gangs, minister says",
      "description": "Police Minister Firoz Cachalia says organised crime is growing more complex, requiring new strategies.",
      "url": "https://www.bbc.com/news/articles/cx2ll9wr562o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 08:23:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-intelligence officer accused of betraying Austria in Russia spying trial",
      "description": "Egisto Ott, 63, denies charges of handing over information to Russian agents.",
      "url": "https://www.bbc.com/news/articles/cz0pnjv1zy5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 14:03:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rapid rollback of Kurdish-led forces reshapes Sharaa's Syria",
      "description": "The retreat of the Syrian Democratic Forces (SDF) in the north-east marks the biggest change of control in Syria since the fall of Bashar al-Assad.",
      "url": "https://www.bbc.com/news/articles/c9311l0d40qo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 12:08:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fact-checking Trump's Davos speech",
      "description": "The US president made a series of contested claims, ranging from the status of Greenland to Nato spending.",
      "url": "https://www.bbc.com/news/articles/c301jgd1qj6o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 19:19:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Son-in-law of opposition figure Edmundo Gonzalez released in Venezuela",
      "description": "Rafael Tudares Bracho, who is married to Gonzalez's daughter, was arrested shortly before Maduro's third inauguration.",
      "url": "https://www.aljazeera.com/news/2026/1/22/son-in-law-of-opposition-figure-edmundo-gonzalez-released-in-venezuela?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 22:03:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Two popular Tunisian journalists handed three-year jail terms",
      "description": "Press rights campaigners slammed the case against Bohran Bssaies and Mourad Zghidi as \"legal persecution\".",
      "url": "https://www.aljazeera.com/news/2026/1/22/two-popular-tunisian-journalists-handed-three-year-jail-terms?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 21:47:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump sues JPMorgan and CEO Dimon over alleged ‘debanking’",
      "description": "The $5bn lawsuit alleges JPMorgan abruptly closed multiple accounts in 2021 cutting off Trump & his firms from financing",
      "url": "https://www.aljazeera.com/economy/2026/1/22/trump-sues-jpmorgan-and-ceo-dimon-over-alleged-debanking?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 19:47:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Vance portrays US immigration officers as victims of ‘far left’",
      "description": "US Vice President JD Vance blamed the “far left” for chaotic and at times violent immigration operations in Minnesota.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/vance-portrays-us-immigration-officers-as-victims-of-far-left-assault-do?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 19:47:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Remnants of abandoned US base leech toxic waste in Greenland",
      "description": "Greenland residents call thousands of rusted barrels ‘American flowers,’ left behind when the US abandoned its base.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/remnants-of-abandoned-us-base-leech-toxic-waste-in-greenland?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 19:23:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Inside Trump’s plan to rebuild Gaza without Palestinians",
      "description": "The US launches a \"Board of Peace\" for Gaza, but Palestinians have no seat at the table.",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/22/aje-onl-pal_phasetwoceasefire_av_v2-210126?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 16:49:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Toronto man posed as pilot to rack up hundreds of free flights, prosecutors say",
      "description": "Dallas Pokornik accused of using fake ID to fool airlines in case likened to Hollywood thriller Catch Me If You Can A Toronto man posed as a pilot for years in order to fool airlines into giving him hundreds of free flights, prosecutors have alleged, in a case that has prompted comparisons to the Hollywood thriller Catch Me If You Can. Authorities in Hawaii announced this week that Dallas Pokornik, 33, had been charged with wire fraud after he allegedly fooled three major US carriers into giving him free tickets over a span of four years. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/canada-pilot-airline-tickets",
      "published": "Thu, 22 Jan 2026 18:22:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former South Korean PM jailed for 23 years for role in martial law insurrection",
      "description": "Han Duck-soo verdict marks first judicial ruling stemming from ex-president Yoon Suk Yeol’s 2024 martial law decree South Korea’s former prime minister Han Duck-soo has been sentenced to 23 years in prison for his role in an insurrection stemming from the former president Yoon Suk Yeol’s failed martial law declaration . The judge, Lee Jin-kwan, ordered Han’s immediate detention. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/former-south-korea-pm-han-duck-soo-jailed-martial-law-insurrection",
      "published": "Wed, 21 Jan 2026 11:13:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-22T23:42:58.205Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-22T17:11:05.505Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-22T23:07:43.518Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-22T22:45:10.220Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-22T03:36:02.156Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump signs Board of Peace charter at Davos as allies split on Gaza plan",
      "description": "The signing ceremony marked the most concrete step yet in Trump's effort to establish the board, whose final composition has yet to be confirmed.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106799/board-of-peace-gaza-trump",
      "published": "Thu, 22 Jan 2026 13:45:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The Taiwanese president's proposal to hike defense spending faces gridlock at home",
      "description": "Opposition parties are slamming the brakes on billions in defense funding as the China escalates military pressure.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5683130/taiwan-defense-spending",
      "published": "Thu, 22 Jan 2026 11:54:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Merz and Meloni reshape Germany-Italy relations",
      "description": "Chancellor Friedrich Merz and Prime Minister Giorgia Meloni are showing closer ties than their countries have in years. Meloni is no longer seen as a right-wing outsider, taking on a role as mediator with Donald Trump.",
      "url": "https://www.dw.com/en/merz-and-meloni-reshape-germany-italy-relations/a-75607617?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 18:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former US prosecutor says Trump 'willfully' broke laws",
      "description": "Ex-Special Counsel Jack Smith said there was \"proof beyond a reasonable doubt\" that Donald Trump \"engaged in criminal activity\" to overturn the 2020 election results. Trump has called the inquiry politically motivated.",
      "url": "https://www.dw.com/en/former-us-prosecutor-says-trump-willfully-broke-laws/a-75612566?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 18:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland 'ready to negotiate' better partnership, PM says",
      "description": "Jens-Frederik Nielsen said sovereignty was a \"red line\" that needed to be respected as he said Greenland was ready to negotiate after Trump backtracked on suggesting force could be used to acquire it. Follow DW.",
      "url": "https://www.dw.com/en/greenland-ready-to-negotiate-better-partnership-pm-says/live-75599036?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 17:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India: Woman arrested over suicide of man she accused",
      "description": "Police in India have arrested a woman who accused a man of sexual misconduct on a bus on social media, who then took his own life soon after. His family accused the woman of engagement farming with a spurious claim.",
      "url": "https://www.dw.com/en/india-woman-arrested-over-suicide-of-man-she-accused/a-75610488?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 16:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From Inuit to Vikings to Trump: The history of Greenland",
      "description": "After being inhabited only by Indigenous peoples for centuries, the Arctic island saw the Vikings in the 10th century and the Danes in 1721, and it attracted US interest back in 1867.",
      "url": "https://www.dw.com/en/from-inuit-to-vikings-to-trump-the-history-of-greenland/a-75604169?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 14:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany expels Russian diplomat, summons ambassador over espionage case",
      "description": "Germany has expelled an individual after uncovering espionage linked to Russia and summoned Moscow's ambassador. Berlin says the move signals zero tolerance for spying under diplomatic cover.",
      "url": "https://www.dw.com/en/germany-expels-russian-diplomat-summons-ambassador-over-espionage-case/a-75609339?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 13:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "For Europe's far right 'there's no way to win voters while they're trying to appease Trump'",
      "description": "Speaking with FRANCE 24's Sharon Gaffney, Georgios Samaras, Assistant Professor of Public Policy at the School for Government at King’s College London, says that Donald Trump is deeply unpopular among the general population across Europe and that for far right parties in Europe 'there's no way to win voters while they're trying to appease Trump'.",
      "url": "https://www.france24.com/en/tv-shows/a-propos/20260122-for-europe-s-far-right-there-s-no-way-to-win-voters-while-they-re-trying-to-appease-trump",
      "published": "Thu, 22 Jan 2026 22:07:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "REPLAY: Greenland PM holds press conference",
      "description": "Greenland PM holds press conference after Trump's declarations at Davos.",
      "url": "https://www.france24.com/en/replay-greenland-pm-holds-press-conference",
      "published": "Thu, 22 Jan 2026 17:41:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy lashes out at Europe ahead of first trilateral peace talks",
      "description": "Volodymyr Zelenskyy has lashed out at Europe during his Davos speech ahead of a trilateral meeting between Ukraine, the US and Russia on Friday.",
      "url": "https://news.sky.com/story/zelenskyy-lashes-out-at-europe-ahead-of-first-trilateral-peace-talks-13497839",
      "published": "Thu, 22 Jan 2026 22:30:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Truth bombs fall on Europe that can't act without US and is stuck in a Groundhog Day-style doom loop",
      "description": "Volodymyr Zelenskyy dropped a barrage of truth bombs on his European allies about their collective failure to stand up to Russian President Vladimir Putin and be respected by his US counterpart, Donald Trump.",
      "url": "https://news.sky.com/story/volodymyr-zelenskyy-europe-cant-act-without-us-leadership-and-is-stuck-in-a-groundhog-day-style-doom-loop-ukrainian-president-says-13497797",
      "published": "Thu, 22 Jan 2026 19:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Is Trump's peace board a new UN or a gang of friends?",
      "description": "When it was announced, four months ago, the idea of a Board of Peace seemed wholly entwined with the future of Gaza.",
      "url": "https://news.sky.com/story/is-trumps-peace-board-a-new-un-or-a-gang-of-friends-13497816",
      "published": "Thu, 22 Jan 2026 21:07:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The penny dropped over Trump's Greenland plans - self-defeating, undeliverable and frankly mad",
      "description": "European governments and their diplomats here in Washington are as relieved as they are exasperated by this extraordinary Greenland show and latest act which played out in the Swiss Alps over the past 24 hours.",
      "url": "https://news.sky.com/story/the-truth-behind-trumps-greenland-deal-13497401",
      "published": "Thu, 22 Jan 2026 02:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nigerian bandits who kidnapped 150 churchgoers demand motorbikes in return",
      "description": "Nigerian bandits who kidnapped more than 150 churchgoers are demanding 17 motorbikes in return.",
      "url": "https://news.sky.com/story/nigerian-bandits-who-kidnapped-150-churchgoers-demand-motorbikes-in-return-13497721",
      "published": "Thu, 22 Jan 2026 16:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mexican authorities arrest alleged crime figure 'El Botox' in killing of lime growers' leader",
      "description": "Mexican authorities have arrested an alleged organized crime figure in Michoacan linked to the killing of a lime growers' leader",
      "url": "https://abcnews.go.com/International/wireStory/mexican-authorities-arrest-alleged-crime-figure-el-botox-129462394",
      "published": "Thu, 22 Jan 2026 12:49:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Son-in-law of Venezuelan opposition candidate released after 380 days in detention",
      "description": "The son-in-law of Venezuelan opposition figure Edmundo González has been released after more than a year in detention",
      "url": "https://abcnews.go.com/International/wireStory/son-law-venezuelan-opposition-candidate-released-after-380-129453607",
      "published": "Thu, 22 Jan 2026 10:26:07 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's Navy intercepts an oil tanker in the Mediterranean sailing from Russia",
      "description": "Officials say that France’s Navy, working with intelligence provided by the United Kingdom, intercepted an oil tanker in the Mediterranean Sea that traveled from Russia, in a mission targeting the sanctioned Russian shadow fleet",
      "url": "https://abcnews.go.com/International/wireStory/frances-navy-intercepts-oil-tanker-mediterranean-sailing-russia-129453344",
      "published": "Thu, 22 Jan 2026 09:37:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French Navy intercepts oil tanker in Mediterranean sailing from Russia on a mission against its so-called shadow fleet",
      "description": "French Navy intercepts oil tanker in Mediterranean sailing from Russia on a mission against its so-called shadow fleet",
      "url": "https://abcnews.go.com/International/wireStory/french-navy-intercepts-oil-tanker-mediterranean-sailing-russia-129453343",
      "published": "Thu, 22 Jan 2026 09:29:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The Philippine president is dismissed from hospital and says he's fine after an abdominal ailment",
      "description": "Philippine President Ferdinand Marcos Jr. has been taken to hospital overnight for an abdominal ailment that he says may be due to stress and age",
      "url": "https://abcnews.go.com/International/wireStory/philippine-president-dismissed-hospital-fine-after-abdominal-ailment-129447278",
      "published": "Thu, 22 Jan 2026 07:13:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cold kills another infant in Gaza as West Bank displacement intensifies",
      "description": "Another child in the Gaza Strip has died from hypothermia as winter weather continues to whip the enclave, the UN said on Wednesday, citing information from the health authorities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166804",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Surgeon ex-husband accused in Ohio dentist slayings retains lawyer who won prior high-profile murder trial",
      "description": "Surgeon accused of killing ex-wife and her husband retains attorney who defended doctor acquitted in 14 murders. McKee faces aggravated murder charges.",
      "url": "https://www.foxnews.com/us/surgeon-ex-husband-accused-ohio-dentist-slayings-retains-lawyer-who-won-prior-high-profile-murder-trial",
      "published": "Thu, 22 Jan 2026 16:45:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "White House, DHS push back on claims ICE targeted 5-year-old in Minnesota, say child was 'abandoned'",
      "description": "The Department of Homeland Security said Thursday that \"ICE did NOT target a child\" in Minnesota after Democrats alleged the 5-year-old had been arrested.",
      "url": "https://www.foxnews.com/us/white-house-dhs-push-back-claims-ice-targeted-5-year-old-minnesota-say-child-abandoned",
      "published": "Thu, 22 Jan 2026 15:00:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Boat captain accused of selling cocaine found at sea to undercover cops in sun-soaked tourist haven: police",
      "description": "A Florida charter boat captain was caught allegedly trafficking cocaine to undercover deputies in a dramatic marina bust that seized 23 kilos of illegal drugs.",
      "url": "https://www.foxnews.com/us/boat-captain-accused-selling-cocaine-found-sea-undercover-cops-sun-soaked-tourist-haven-police",
      "published": "Thu, 22 Jan 2026 14:41:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Casey Anthony claims US is racist and sexist, says White men have ‘never been marginalized’",
      "description": "Casey Anthony claims America has \"long-standing history\" of systemic racism against non-White men in controversial Substack post about DEI policies.",
      "url": "https://www.foxnews.com/us/casey-anthony-claims-us-racist-sexist-says-white-men-never-marginalized",
      "published": "Thu, 22 Jan 2026 11:24:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "California ‘party mom’ accused of grooming victims for sex, drinking in ritzy mansion, teens testify at trial",
      "description": "California mom Shannon O'Connor faces 63 charges for allegedly hosting alcohol parties where 14-year-old freshmen were encouraged to engage sexually.",
      "url": "https://www.foxnews.com/us/california-party-mom-accused-grooming-victims-sex-drinking-ritzy-mansion-teens-testify-trial",
      "published": "Thu, 22 Jan 2026 09:00:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark's prime minister insists sovereignty is non-negotiable as Trump announces Greenland deal 'framework'",
      "description": "Denmark's prime minister said she won't negotiate her nation's sovereignty after President Donald Trump said a \"framework\" on a Greenland deal was reached.",
      "url": "https://www.foxnews.com/world/denmarks-prime-minister-insists-sovereignty-non-negotiable-trump-announces-greenland-deal-framework",
      "published": "Thu, 22 Jan 2026 08:19:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US begins transferring ISIS detainees from Syria to Iraq amid security transition",
      "description": "U.S. forces moved 150 ISIS detainees from Syria to Iraq as CENTCOM began a transfer operation involving up to 7,000 radical prisoners.",
      "url": "https://www.foxnews.com/world/us-begins-transferring-isis-detainees-from-syria-iraq-amid-security-transition",
      "published": "Wed, 21 Jan 2026 14:20:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu agrees to join Trump’s Gaza Board of Peace after initial pushback",
      "description": "Israeli Prime Minister Benjamin Netanyahu said he will join President Donald Trump’s newly formed Gaza Board of Peace after initially criticizing its structure.",
      "url": "https://www.foxnews.com/world/netanyahu-agrees-join-trumps-gaza-board-peace-after-initial-pushback",
      "published": "Wed, 21 Jan 2026 03:35:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces apprehend sanctioned vessel in Caribbean maritime operation targeting illicit oil transport",
      "description": "U.S. military forces apprehended Motor Vessel Sagitta in the Caribbean as part of Operation Southern Spear targeting sanctioned tanker vessels.",
      "url": "https://www.foxnews.com/world/us-forces-apprehend-sanctioned-vessel-caribbean-maritime-operation-targeting-illicit-oil-transport",
      "published": "Tue, 20 Jan 2026 16:40:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump confirms he invited Putin to join his Board of Peace: 'He's been invited'",
      "description": "U.S. President Donald Trump on Monday confirmed Russian President Vladimir Putin was invited to the Board of Peace for supervision of the Gaza plan.",
      "url": "https://www.foxnews.com/world/trump-confirms-he-invited-putin-join-his-board-peace-hes-been-invited",
      "published": "Tue, 20 Jan 2026 02:40:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}