{
  "last_updated": "2026-01-19T22:23:23.545368Z",
  "event_count": 221,
  "events": [
    {
      "title": "Security Council LIVE: UN raises alarm over deadly Iran protests and ‘possible military strikes’",
      "description": "The UN Security Council is meeting in New York in emergency session on Iran, amid escalating concern over reports that hundreds have been killed during weeks of nationwide anti-government protests. The meeting was requested by the United States. Demonstrations that began in late December, fuelled by soaring inflation, rising food prices and the collapse of the national currency, triggered a deadly and widespread crackdown with thousands injured and detained, according to numerous firsthand accounts. The UN has called for independent investigations into all killings and warned against the possible use of the death penalty against protesters. Follow live coverage below, and UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "15 years after Fukushima, Japan prepares to restart the world’s biggest nuclear plant",
      "description": "A return to nuclear power is at the heart of Japan’s energy policy but, in the wake of the 2011 disaster, residents’ fears about tsunamis, earthquakes and evacuation plans remain The activity around the Kashiwazaki-Kariwa nuclear power plant is reaching its peak: workers remove earth to expand the width of a main road, while lorries arrive at its heavily guarded entrance. A long perimeter fence is lined with countless coils of razor wire, and in a layby, a police patrol car monitors visitors to the beach – one of the few locations with a clear view of the reactors, framed by a snowy Mount Yoneyama. When all seven of its reactors are working, Kashiwazaki-Kariwa generates 8.2 gigawatts of electricity, enough to power millions of households. Occupying 4.2 sq km of land in Niigata prefecture on the Japan Sea coast, it is the biggest nuclear power plant in the world. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/japan-nuclear-plant-restart-kashiwazaki-kariwa-fukushima",
      "published": "Mon, 19 Jan 2026 01:46:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 57,
      "severity_level": "Critical"
    },
    {
      "title": "Chile declares 'state of catastrophe' as wildfires leave at least 18 dead",
      "description": "Chile's president warned the death toll cold rise in the Ñuble and Biobío regions.",
      "url": "https://www.bbc.com/news/articles/cz7ypw4rjrzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 03:30:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Chilean president declares state of catastrophe as wildfires kill at least 18",
      "description": "Fires blaze through 8,500 hectares, forcing 50,000 people to evacuate as firefighters struggle to extinguish flames Wildfires raging across central and southern Chile have killed at least 18 people, scorched thousands of hectares of forest and destroyed scores of homes, authorities said, as the South American country swelters under a heatwave. Chile’s president, Gabriel Boric, declared a state of catastrophe in the country’s central Biobío region and the neighbouring Ñuble region, about 500km (300 miles) south of Santiago, the capital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chile-president-declares-state-of-catastrophe-as-wildfires-kill",
      "published": "Sun, 18 Jan 2026 20:16:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of emergency after eight police officers killed in prison gang violence",
      "description": "President announces 30-day order after inmates also took 46 people hostage at three prisons Guatemala’s president has declared a 30-day nationwide state of emergency to combat criminal gangs after authorities accused them of killing eight police officers and holding hostages at three prisons. The killings occurred in the capital, Guatemal City, and surrounding areas a day after gang-affiliated inmates took 46 people hostage in the three prisons across the country to demand incarcerated gang leaders be moved to lower-security facilities. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/guatemala-state-of-emergency-police-officers-killed-prison-gang-violence",
      "published": "Mon, 19 Jan 2026 12:53:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns of a world in chaos as impunity and unpredictability spreads",
      "description": "In his final annual address outlining his priorities, UN Secretary-General António Guterres warned that the world is “brimming with conflict, impunity, inequality and unpredictability” – even as international cooperation is fraying at the moment it is most needed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166772",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "'Most challenging situation’ for transatlantic relations as Trump threatens EU with tariffs",
      "description": "EU member states on Monday are exploring countermeasures in response to US President Donald Trump's tariff threats over Greenland, which he has expressed interest in acquiring despite opposition from Denmark and the EU. “This is not only about trade; it is putting enormous, unexpected stress on the transatlantic relationship,” said Carsten Brzeski, Global Head of Macro for ING Research, adding that it is likely the most challenging situation for transatlantic relations since the end of World War II. \"There are no winners in trade wars\", he said.",
      "url": "https://www.france24.com/en/video/20260119-most-challenging-situation-for-transatlantic-relations-as-trump-threatens-eu-with-tariffs-2",
      "published": "Mon, 19 Jan 2026 19:06:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of siege after gang violence",
      "description": "Guatemala is in a state of emergency following a weekend of gang-related violence. Gang-affiliated inmates rioted in three prisons. Seven police officers were killed as authorities took action.",
      "url": "https://www.dw.com/en/guatemala-declares-state-of-siege-after-gang-violence/a-75557482?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 05:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protests: What we know about the varying death tolls",
      "description": "What is the death toll from the protests in Iran? Since the demonstrations broke out against the theocratic regime late December, the number reported has continued to rise...though it has been harder than ever to verify an exact count with an internet blackout in the country hindering communications. As of 19 January, two main rights groups confirmed nearly 4000 deaths, though the figure is likely a significate underestimate. Vedika Bahl goes through what we know in Truth or Fake.",
      "url": "https://www.france24.com/en/iran-protests-what-we-know-about-the-varying-death-tolls",
      "published": "Mon, 19 Jan 2026 20:50:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Viral protest video against Iran’s supreme leader sparks copycat demonstrations worldwide",
      "description": "Viral video shows Iranian refugee lighting cigarette with burning photo of supreme leader, sparking global defiance movement amid Iran protests.",
      "url": "https://www.foxnews.com/world/viral-protest-video-against-irans-supreme-leader-sparks-copycat-demonstrations-worldwide",
      "published": "Sun, 18 Jan 2026 21:52:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "US strike eliminates al Qaeda operative connected to ISIS ambush that killed 3 Americans in Syria",
      "description": "U.S. forces killed an al Qaeda-affiliated leader allegedly linked to an ISIS attack that killed three Americans in Syria, as CENTCOM launched counterterrorism operations Jan. 16.",
      "url": "https://www.foxnews.com/world/us-strike-eliminates-al-qaeda-operative-connected-isis-ambush-killed-3-americans-syria",
      "published": "Sat, 17 Jan 2026 16:59:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "China’s economy hit growth target last year despite Trump trade war and property crisis",
      "description": "Economy weathered a fraught geopolitical landscape to reach 5% goal but domestic structural challenges ‘not going away’, say experts China’s population falls again as birthrate hits record low Business live – latest updates China has said its economy grew 5% last year, hitting Beijing’s official target as the world’s second-largest economy overcame Donald Trump’s tariff war with a record trade surplus. Data released on Monday by Beijing’s National Bureau of Statistics showed the Chinese economy hit the official target of “around” 5% – the same growth as in 2024 – despite a slowdown to 4.5% in the final three months of the year. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/chinas-economy-hit-growth-goal-last-year-despite-trump-trade-war-and-property-crisis",
      "published": "Mon, 19 Jan 2026 06:26:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Tributes pour in after death of Italian designer Valentino",
      "description": "Italian designer Valentino Garavani, whose luxurious dresses adorned some of the world's most elegant women from Jackie Kennedy to Audrey Hepburn, has died aged 93, his foundation said on Monday. Valentino's death comes just months after the passing of another Italian style legend, Giorgio Armani, and there were tributes from the global fashion world and beyond. FRANCE 24's Seema Gupta reports from Rome.",
      "url": "https://www.france24.com/en/tributes-pour-in-after-death-of-italian-designer-valentino",
      "published": "Mon, 19 Jan 2026 19:53:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Spain train crash: What we know about the fatal derailment so far",
      "description": "At least 40 people have been killed and 170 others injured after two high-speed trains derailed in southern Spain on Sunday.",
      "url": "https://news.sky.com/story/what-we-know-so-far-about-the-fatal-train-crash-in-spain-13496110",
      "published": "Mon, 19 Jan 2026 08:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Bodies of 23 recovered from shopping centre fire in Pakistan, as dozens remain missing",
      "description": "Rescuers have recovered the bodies of at least 23 people killed in a massive fire at a shopping centre in Pakistan, with dozens still missing.",
      "url": "https://news.sky.com/story/bodies-of-23-recovered-from-shopping-centre-fire-in-pakistan-as-dozens-remain-missing-13496194",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Blast at a hotel in downtown Kabul leaves multiple casualties, officials say",
      "description": "An explosion at a hotel in downtown Kabul has left several people dead and injured, according to officials",
      "url": "https://abcnews.go.com/International/wireStory/blast-hotel-downtown-kabul-leaves-multiple-casualties-officials-129343424",
      "published": "Mon, 19 Jan 2026 08:25:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russia plots major strike on Europe's largest nuclear plant power lines: source",
      "description": "Ukraine nuclear facilities face Russian attack threats as Moscow weighs strikes on power substations to force capitulation, officials say. Zaporizhzhia is a primary target.",
      "url": "https://www.foxnews.com/world/russia-threaten-ukraine-europe-nuclear-plant-winter-energy-war-escalates",
      "published": "Sun, 18 Jan 2026 19:21:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "World Economic Forum boots Iranian foreign minister from Davos summit amid deadly crackdown on protesters",
      "description": "World Economic Forum withdraws Iranian foreign minister's Davos invitation amid deadly nationwide protests that have killed thousands of civilians.",
      "url": "https://www.foxnews.com/world/world-economic-forum-boots-iranian-foreign-minister-from-davos-summit-amid-deadly-crackdown-protesters",
      "published": "Mon, 19 Jan 2026 09:49:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Pakistan: At least 14 dead in Karachi mall fire",
      "description": "A mall in Pakistan's Karachi was on fire for more than 24 hours. At least 14 people have been killed while over 60 are still missing.",
      "url": "https://www.dw.com/en/pakistan-at-least-14-dead-in-karachi-mall-fire/a-75557903?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 07:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Spain seeks answers as high-speed train crash toll rises to 40",
      "description": "The death toll from a high-speed train collision in southern Spain rose to 40 on Monday as the government vowed a full investigation into its causes. The crash late on Sunday is Spain's deadliest train accident since 2013, when 80 people died after a train veered off a curved section of track outside the northwestern city of Santiago de Compostela. FRANCE 24's Emerald Maxwell reports.",
      "url": "https://www.france24.com/en/spain-seeks-answers-as-high-speed-train-crash-toll-rises-to-40",
      "published": "Mon, 19 Jan 2026 19:51:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Iran tells protesters who joined 'riots' to surrender within three days",
      "description": "Iran's national police chief Ahmad-Reza Radan on Monday issued an ultimatum to young people \"deceived\" into joining the \"riots\" to turn themselves in for more lenient punishment. The protests constituted the biggest challenge to the Iranian leadership in years, with the full scale of the violence yet to emerge amid an internet blackout.",
      "url": "https://www.france24.com/en/middle-east/20260119-iran-tells-protesters-who-joined-riots-to-surrender-within-three-days",
      "published": "Mon, 19 Jan 2026 17:21:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Protesters rally in Davos as Oxfam reports record billionaire wealth",
      "description": "Protesters gathered in Davos, Switzerland, on Sunday ahead of the World Economic Forum’s annual meeting to denounce the concentration of wealth among global elites. Meanwhile, Oxfam released a report showing that the collective wealth of the world’s billionaires surged to a record level in 2025.",
      "url": "https://www.france24.com/en/protesters-rally-in-davos-as-oxfam-reports-record-billionaire-wealth",
      "published": "Mon, 19 Jan 2026 16:27:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Amid Sudan’s humanitarian crisis, Chad shows ‘act of solidarity’",
      "description": "In war-torn Sudan, local communities say they don’t have enough settlements for the internally displaced, few solutions for women who have suffered sexual violence – and there’s a lack of aid available for people with disabilities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166777",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "WFP warns Sudan food aid could run out in March",
      "description": "The World Food Programme (WFP) said on Thursday that it is struggling to keep emergency operations running in Sudan, where more than 1,000 days of war have pushed families to the brink.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166766",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Yemen faces worst food crisis since 2022, aid group warns",
      "description": "Aid cuts, conflict and economic collapse push millions of Yemenis towards severe hunger in 2026.",
      "url": "https://www.aljazeera.com/news/2026/1/19/yemen-faces-worst-food-crisis-since-2022-aid-group-warns?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 14:12:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Senegal awaits return of AFCON champions",
      "description": "In tonight's edition, Senegal eagerly awaited the return of its champions on Monday, with the population given a national holiday after the country's AFCON win over Morocco. Also, the Congolese army says it has regained control of the city of Uvira following the withdrawal of the M23 armed group. And heavy rains have flooded South Africa, Mozambique, and Zimbabwe, overwhelming rivers and infrastructure.",
      "url": "https://www.france24.com/en/senegal-awaits-return-of-afcon-champions",
      "published": "Mon, 19 Jan 2026 21:36:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Game-changing international ocean treaty comes into force",
      "description": "Almost two decades in the making, an international agreement to protect and sustainably use marine life in international waters and the international seabed is due to come into force on Saturday, marking a major step forward in efforts to ensure the health of ocean ecosystems for decades to come.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166762",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN urges ‘maximum restraint’ to avert more death, wider escalation",
      "description": "As nationwide protests in Iran appear to ease after nearly three weeks of unrest and bloodshed, a senior UN official called on Thursday for action to prevent further escalation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166773",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran’s supreme leader acknowledges thousands killed as Trump calls for new leadership: reports",
      "description": "Iran's supreme leader Khamenei reportedly acknowledges thousands died in recent protests for the first time, as death toll estimates reach over 3,000.",
      "url": "https://www.foxnews.com/world/irans-supreme-leader-acknowledges-thousands-killed-trump-calls-new-leadership",
      "published": "Sat, 17 Jan 2026 20:28:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At least 39 dead in Spain train collision",
      "description": "At least 39 people were killed in a high-speed train collision in southern Spain Sunday, police said. Efforts to recover the bodies are continuing, and the death toll is likely to rise.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5681943/at-least-39-dead-in-spain-train-collision",
      "published": "Mon, 19 Jan 2026 06:48:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Hackers target Iran state TV's satellite transmission to broadcast exiled crown prince",
      "description": "Hackers disrupted Iranian state television satellite transmissions to air footage supporting the country's exiled crown prince and calling on security forces to not “point your weapons at the people,” online video showed early Monday, the latest disruption to follow nationwide protests in the country. FRANCE 24's Jennie Shin reports.",
      "url": "https://www.france24.com/en/hackers-target-iran-state-tv-s-satellite-transmission-to-broadcast-exiled-crown-prince",
      "published": "Mon, 19 Jan 2026 21:24:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "New Orleans tourists shot when man fleeing gunfire ducks into famed restaurant",
      "description": "Three tourists wounded in a deadly New Orleans shooting at the famed Dooky Chase's Restaurant when a man ran inside to escape gunfire, authorities said.",
      "url": "https://www.foxnews.com/us/new-orleans-tourists-shot-when-man-fleeing-gunfire-ducks-famed-restaurant",
      "published": "Mon, 19 Jan 2026 14:39:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Labor’s hate speech laws set to pass as Ley and Albanese cut deal on bill crafted in wake of Bondi terror attack",
      "description": "Liberals MPs agreed late on Monday to back Labor’s revised bill, which came in the wake of the Bondi beach terror attack Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Hate speech laws designed to help combat antisemitism in the wake of the Bondi beach terror attack are set to pass after Sussan Ley agreed to cut a deal with Anthony Albanese. Ahead of a Coalition party room meeting to settle a final position, Liberals MPs agreed late on Monday to back Labor’s revised bill after talks between the prime minister and opposition leader. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/labor-coalition-deal-hate-speech-laws-ley-albanese",
      "published": "Mon, 19 Jan 2026 10:40:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Greenland threats: Europe 'must be ready to respond in kind', expert says",
      "description": "Speaking with FRANCE 24's Mark Owen, Scott Lucas, Professor of International Politics at the Clinton Institute at the University of Dublin, says that Europe must be 'ready to respond in kind' if the US proceeds with the threat of punitive tariffs for the eight European countries that oppose plans to take over Greenland.",
      "url": "https://www.france24.com/en/greenland-threats-europe-must-be-ready-to-respond-in-kind-expert-says",
      "published": "Mon, 19 Jan 2026 20:22:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "IS group prisoners are 'big issue' for Syrian government and Kurdish SDF",
      "description": "A day after the Kurdish-led Syrian Democratic Forces (SDF) agreed to quit large parts of Syria under a ceasefire, the Syrian army said \"a number of\" Islamic State (IS) group prisoners, who had been under SDF control, had escaped. The SDF said it ​lost control of a prison following an attack by government fighters. FRANCE 24's Wassim Nasr notes that IS group prisoners are an important issue in Syria today.",
      "url": "https://www.france24.com/en/is-group-prisoners-are-big-issue-for-syrian-government-and-kurdish-sdf",
      "published": "Mon, 19 Jan 2026 20:23:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran state TV hacked to show exiled Crown Prince Pahlavi",
      "description": "Iranian state TV hacked to show exiled Crown Prince Reza Pahlavi urging military to join protesters as death toll reportedly reaches nearly 4,000.",
      "url": "https://www.foxnews.com/world/iran-state-tv-hacked-show-exiled-crown-prince-pahlavi",
      "published": "Mon, 19 Jan 2026 07:46:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "IMF warns of trade tension risk to global growth",
      "description": "Trade tensions and a reversal in the AI boom are among the main risks to global economic growth, the IMF says.",
      "url": "https://www.bbc.com/news/articles/c0r47ey0d1vo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 11:04:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "South African team helps search for politician swept away by Mozambique floodwaters",
      "description": "Mozambique President Daniel Chapo cancels a trip to Davos due to severe floods in the country",
      "url": "https://www.bbc.com/news/articles/c62nen4n971o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 14:22:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Why Germany probably won't get political at 2026 World Cup",
      "description": "After their very public protest at the last World Cup in Qatar, Germany's football team looks unlikely to do the same in the United States in 2026.",
      "url": "https://www.dw.com/en/why-germany-probably-won-t-get-political-at-2026-world-cup/a-75504617?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 15:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Secretary-General on UN at 80: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "European leaders warn Trump tariffs over Greenland 'risk a dangerous downward spiral'",
      "description": "European leaders unite against Trump's tariff threats over Greenland acquisition, warning of damage to transatlantic relations as tensions escalate.",
      "url": "https://www.foxnews.com/world/european-leaders-warn-trump-tariffs-over-greenland-risk-dangerous-downward-spiral",
      "published": "Sun, 18 Jan 2026 09:46:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "What we know about Spain's worst rail disaster in over a decade",
      "description": "What caused the train to derail remains unclear but officials say an investigation has been launched.",
      "url": "https://www.bbc.com/news/articles/clye22ljxw4o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 21:00:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Thirteen schoolchildren killed after bus collides with lorry in South Africa",
      "description": "The fatal collision is just the latest in South Africa, where the road safety record is poor.",
      "url": "https://www.bbc.com/news/articles/cvgdmkxl1mko?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 13:13:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Man seriously injured in Sydney's third shark attack in two days",
      "description": "In three separate incidents, a 12-year-old was also injured and an 11-year-old received assistance after his surfboard was bitten.",
      "url": "https://www.bbc.com/news/articles/c8013p5v2yvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 09:38:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Man seriously injured in Sydney's third shark attack in two days",
      "description": "In three separate incidents, a 12-year-old was also injured and an 11-year-old received assistance after his surfboard was bitten.",
      "url": "https://www.bbc.com/news/articles/c8013p5v2yvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 09:38:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "'A head-spinning day of crisis meetings all over Europe' as Trump reiterates push for Greenland",
      "description": "The EU said on Monday it wanted to engage with the United States after President Donald Trump threatened tariffs on European countries in the standoff over Greenland, but was ready to act if needed. FRANCE 24's Brussels correspondent Dave Keating says that 'there are signs of split between European leaders as the reality sets in'.",
      "url": "https://www.france24.com/en/a-head-spinning-day-of-crisis-meetings-all-over-europe-as-trump-reiterates-push-for-greenland",
      "published": "Mon, 19 Jan 2026 19:34:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "What may have caused deadly train crash in Spain - and why it's been described as 'truly strange'",
      "description": "A faulty rail joint may be key to understanding the cause of one of Spain's deadliest railway disasters in years, experts have said.",
      "url": "https://news.sky.com/story/spain-train-crash-how-it-unfolded-13496307",
      "published": "Mon, 19 Jan 2026 16:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "9 Guatemalan police officers dead after gang attacks",
      "description": "The death toll from suspected gang attacks on Guatemalan police has risen to nine",
      "url": "https://abcnews.go.com/International/wireStory/9-guatemalan-police-officers-dead-after-gang-attacks-129350972",
      "published": "Mon, 19 Jan 2026 10:55:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Man and boy critical after 3 shark attacks off Sydney in just over 24 hours",
      "description": "Three separate shark attacks in Sydney in just over 24 hours have left a man and a boy critically injured, police said",
      "url": "https://abcnews.go.com/International/wireStory/man-boy-critical-after-3-shark-attacks-off-129342696",
      "published": "Mon, 19 Jan 2026 08:09:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "School bus crash in South Africa kills at least 13 children, police say",
      "description": "Authorities in South Africa say a collision between a truck and a school minibus in Gauteng province has killed at least 13 children",
      "url": "https://abcnews.go.com/International/wireStory/school-bus-crash-south-africa-kills-13-children-129341763",
      "published": "Mon, 19 Jan 2026 09:05:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Aid cuts push millions in West and Central Africa deeper into hunger",
      "description": "A staggering 55 million people across West and Central Africa are expected to suffer crisis levels of hunger, or worse, during the lean season from June to August as funding cuts to humanitarian operations continue amid rising violence and displacement.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166776",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar’s Rohingya people called ‘Muslim dogs’ before attacks, ICJ hears",
      "description": "Hearings continued on Thursday at the UN’s top court into the Gambia’s claim that Myanmar committed genocide against the Rohingya people, with allegations that military officials incited violence through hate speech, calling the ethnic minority “Muslim dogs” who should be made “extinct”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166764",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UFO task force eyed as lawmaker warns of strange objects in skies and waters defying known technology",
      "description": "Vermont UFO task force proposed by Rep. Troy Headrick would investigate unidentified anomalous phenomena reports and assess airspace safety risks in coordination with federal partners.",
      "url": "https://www.foxnews.com/us/ufo-task-force-eyed-lawmaker-warns-strange-objects-skies-waters-defying-known-technology",
      "published": "Mon, 19 Jan 2026 12:23:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "California hiker found dead after striking out to search for missing group",
      "description": "A hiker was found dead in the California mountains after searching for lost friends, authorities said. Rescue teams successfully saved the initial four missing hikers.",
      "url": "https://www.foxnews.com/us/california-hiker-found-dead-after-striking-out-search-missing-group",
      "published": "Mon, 19 Jan 2026 10:59:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Grieving father says daughter’s death by illegal alien shows cost of sanctuary policies",
      "description": "A year after Katie Abraham was killed by an illegal immigrant, her father Joe faults Gov. JB Pritzker’s weak policies and backs DHS’s Operation Midway Blitz.",
      "url": "https://www.foxnews.com/us/grieving-father-says-daughters-death-illegal-alien-shows-cost-sanctuary-policies",
      "published": "Sun, 18 Jan 2026 17:50:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Australian boy fighting for life after shark attack, rescued by friends in Sydney Harbor waters",
      "description": "A 12-year-old boy is fighting for his life after a catastrophic shark attack in Sydney Harbor. He was rescued by heroic friends who leaped from a cliff to save him.",
      "url": "https://www.foxnews.com/world/australian-boy-fighting-life-after-shark-attack-rescued-friends-sydney-harbor-waters",
      "published": "Mon, 19 Jan 2026 09:23:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US believes its power matters more than international law, UN chief tells BBC",
      "description": "António Guterres says Washington's \"clear conviction\" is that multilateral solutions are irrelevant.",
      "url": "https://www.bbc.com/news/articles/c4g0zx0llpzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 06:17:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Why Myanmar election won't change Europe's mind on junta",
      "description": "Seeking international legitimacy, Myanmar's ruling military junta claims elections this week are a return to democracy. But it will take more than the junta's word to convince the EU that the polls are free and fair.",
      "url": "https://www.dw.com/en/why-myanmar-election-won-t-change-europe-s-mind-on-junta/a-75563513?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 14:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Floods in Mozambique displace more than 300,000 people in one province, governor says",
      "description": "Flooding in Mozambique has displaced over 300,000 people, according to the Gaza province governor",
      "url": "https://abcnews.go.com/International/wireStory/floods-mozambique-displace-300000-people-province-governor-129357204",
      "published": "Mon, 19 Jan 2026 14:41:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators disrupt Minnesota church, shout down worshippers during Sunday service",
      "description": "Anti-ICE protesters allegedly disrupted Minneapolis church services, shouting at parishioners over immigration enforcement. Federal investigation launched.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-disrupt-minnesota-church-shout-worshippers-sunday-service",
      "published": "Mon, 19 Jan 2026 16:00:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "California man kills wife, teen daughter in murder-suicide: authorities",
      "description": "Los Angeles County shooting leaves three dead in apparent murder-suicide as 19-year-old daughter escapes gunfire unharmed, sheriff's deputies report.",
      "url": "https://www.foxnews.com/us/california-man-kills-wife-teen-daughter-murder-suicide-authorities",
      "published": "Sun, 18 Jan 2026 14:30:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran locks nation into ‘darker’ digital blackout, viewing internet as an ‘existential threat’",
      "description": "Iran enters 22nd day of internet shutdown with limited connectivity restored as NetBlocks reports shift toward \"filternet plus\" censorship scheme whitelisting only business services.",
      "url": "https://www.foxnews.com/world/iran-locks-nation-darker-digital-blackout-viewing-internet-existential-threat",
      "published": "Mon, 19 Jan 2026 16:33:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Top GOP senator says Syria ceasefire welcome but actions must match words",
      "description": "Syria reaches fragile ceasefire with Kurdish forces as U.S. senator warns about reported crimes by government troops during military operation against SDF.",
      "url": "https://www.foxnews.com/world/top-gop-senator-says-syria-ceasefire-welcome-actions-must-match-words",
      "published": "Mon, 19 Jan 2026 11:42:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of killing 16,500 in sweeping ‘genocide’ crackdown: report",
      "description": "Supreme Leader Ayatollah Ali Khamenei acknowledges thousands killed in Iran protests as regime allegedly accelerates executions to more than eight per day.",
      "url": "https://www.foxnews.com/world/iran-accused-killing-16500-sweeping-genocide-crackdown-report",
      "published": "Sun, 18 Jan 2026 22:07:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Rare twins born in DRC raise cautious hope for endangered mountain gorillas",
      "description": "Virunga park ranger says babies are well cared for by mother Mafuko but high infant mortality makes first weeks critical It was noon by the time Jacques Katutu first saw the newborn mountain gorillas. Cradled in the arms of their mother, Mafuko, the tiny twins clung to her body for warmth in the forest clearing in Virunga national park, in eastern Democratic Republic of the Congo (DRC). Katutu, head of gorilla monitoring in Virunga, has seen dozens of newborns in his 15 years as a ranger. But, he tells the Guardian, even he was touched by the sight of the fragile infant males, who face serious obstacles if they are to become silverbacks one day. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/17/twin-baby-mountain-gorilla-virunga-drc-survival-conservation-aoe",
      "published": "Sat, 17 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "The World Economic Forum opens amid tensions between Europe and the U.S.",
      "description": "Tension is high as the World Economic Forum in Davos opens and President Trump threatens Europe over Greenland.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5682006/the-world-economic-forum-opens-amid-tensions-between-europe-and-the-u-s",
      "published": "Mon, 19 Jan 2026 17:05:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Davos 2026 updates: Spanish PM cancels trip amid train crash",
      "description": "It's opening day of the World Economic Forum in Davos, Switzerland. Spanish Prime Minister Pedro Sanchez will be a prominent absentee; his office says he won't travel given the huge train crash in Spain. DW has more.",
      "url": "https://www.dw.com/en/davos-2026-updates-spanish-pm-cancels-trip-amid-train-crash/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "The end of appeasement? EU threatens Trump with counter-tariffs over Greenland",
      "description": "So much for appeasement: The same Europeans who held their nose and swallowed their pride when the EU agreed Donald Trump’s tariffs last summer can no longer ignore the obvious, that there are limits with a president of the United States who tends to treat them as vassals, not allies… even as adversaries for pushing back on its white nationalist brand of nativism.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260119-the-end-of-appeasement-eu-threatens-trump-with-counter-tariffs-over-greenland",
      "published": "Mon, 19 Jan 2026 19:19:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Fighting erupts near prisons holding IS extremists one day after ceasefire agreed",
      "description": "Fighting has broken out between Syrian government troops and the Kurdish-led Syrian Democratic Forces (SDF), just a day after a ceasefire was announced by the country's state media.",
      "url": "https://news.sky.com/story/fighting-erupts-near-prisons-holding-is-extremists-in-syria-a-day-after-kurdish-led-sdf-agreed-ceasefire-with-damascus-13496377",
      "published": "Mon, 19 Jan 2026 20:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Who are the Kurds?",
      "description": "The Kurds are widely believed to be the largest stateless ethnic group in the world.",
      "url": "https://www.aljazeera.com/news/2026/1/19/who-are-the-kurds-2?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 15:05:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "In Iran, the US-Israeli addiction to hybrid warfare is on full display",
      "description": "Hybrid war tactics help explain why Trump’s strategy oscillates between threats of war and false offers of peace.",
      "url": "https://www.aljazeera.com/opinions/2026/1/19/in-iran-the-us-israeli-addiction-to-hybrid-warfare-is-on-full-display?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 14:35:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'Sentimental Value' sweeps European Film Awards. Next step, Oscars?",
      "description": "Joachim Trier's drama won the top accolades, adding to the buzz ahead of the Oscar awards. Iran was also in the spotlight, with director Jafar Panahi decrying the government's brutal crackdown on protest.",
      "url": "https://www.dw.com/en/sentimental-value-sweeps-european-film-awards-next-step-oscars/a-75553966?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump links Greenland ambitions to Nobel Peace Prize snub",
      "description": "US President Donald Trump linked his aggressive stance on Greenland to last year’s decision not to award him the Nobel Peace Prize, telling Norway’s prime minister that he no longer felt “an obligation to think purely of Peace,” two European officials said Monday. Trump's message to Jonas Gahr Støre appears to ratchet up a standoff between Washington and its closest allies over his threats to take over Greenland, a self-governing territory of NATO member Denmark. FRANCE 24's Kethevane Gorjestani brings you this analysis.",
      "url": "https://www.france24.com/en/trump-links-greenland-ambitions-to-nobel-peace-prize-snub",
      "published": "Mon, 19 Jan 2026 16:34:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "UK PM Starmer says trade war in no one’s interest after Trump's tariff threats",
      "description": "British Prime Minister Keir Starmer said Monday that US President Donald Trump’s threat of tariffs against allies over Greenland is “completely wrong” and a trade war is in no one’s interest. Trump said Saturday that he would charge a 10% import tax starting in February on goods from eight European nations, including the UK, because of their opposition to American control of Greenland, setting up a potentially dangerous test of US partnerships in Europe. Greenland is a semiautonomous territory of NATO ally Denmark.",
      "url": "https://www.france24.com/en/uk-pm-starmer-says-trade-war-in-no-one-s-interest-after-trump-s-tariff-threats",
      "published": "Mon, 19 Jan 2026 16:31:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The misunderstanding that may have triggered Trump's latest Greenland threat",
      "description": "Sir Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year.",
      "url": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
      "published": "Sun, 18 Jan 2026 19:26:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Police in South Africa say a school bus crash has killed at least 12 children",
      "description": "Police in South Africa say a school bus crash has killed at least 12 children",
      "url": "https://abcnews.go.com/International/wireStory/police-south-africa-school-bus-crash-killed-12-129341750",
      "published": "Mon, 19 Jan 2026 07:21:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "A look at some of Europe’s deadliest train accidents in recent years",
      "description": "A high-speed train derailment in southern Spain has left at least 39 people dead and injured more than 150, according to authorities",
      "url": "https://abcnews.go.com/International/wireStory/europes-deadliest-train-accidents-recent-years-129341379",
      "published": "Mon, 19 Jan 2026 06:41:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Food insecurity in Lebanon, Libya migrants freed, UNHCR tackles multiple emergencies – despite cuts",
      "description": "Since 2026, nearly 17 percent of Lebanon’s population has been living in a state of major food insecurity – a situation that is likely to worsen in the coming year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166787",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen: Children are dying and it’s going to get worse, warns aid veteran",
      "description": "In Yemen, renewed political instability and economic woes linked to the war threaten to complicate the already difficult task of helping vulnerable people suffering from deepening hunger, illness and displacement, the UN’s top aid official there said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166786",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Japan’s prime minister calls snap election as approval ratings ride high",
      "description": "Sanae Takaichi tells senior figures in ruling Liberal Democratic party she plans to dissolve lower house on 23 January Japan’s prime minister, Sanae Takaichi , has called a snap election as she attempts to capitalise on high approval ratings since becoming the country’s first female prime minister three months ago. Takaichi, a conservative who is embroiled in a deepening dispute with China over the security of Taiwan, said on Monday she would dissolve the lower house of the Diet – Japan’s parliament – on 23 January, with an election to follow on 8 February. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/japan-snap-election-sanae-takaichi-ldp",
      "published": "Mon, 19 Jan 2026 09:39:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Australia politics live: Burke introduces gun control legislation; Ley to reveal Coalition position on hate speech bill",
      "description": "Follow updates live Get our breaking news email , free app or daily news podcast The attorney general, Michelle Rowland, says the two bills on gun control and hate speech will be introduced to parliament this morning and that there has been “constructive engagement” with the Coalition over the last 48 hours. But on whether that deal is signed, sealed and delivered, Rowland, speaking on the ABC’s Radio National Breakfast, won’t guarantee the Coalition will support the bill when introduced and she says she won’t “pre-empt” anything. I don’t want to pre-empt any of those conversations, and particularly since they have been undertaken in good faith … some of those issues go around the listing of hate groups and that framework. And it is a fact that the opposition has sought a number of amendments to this area. I will point out that the removal of the serious vilification provisions do mean that these remaining provisions in the prohibited hate groups section do need to do a lot of work. I think we’re really close. I mean, effectively, the laws won’t be as strong as what the government want them to be, and that’s that’s been public for a while. But importantly, this will still involve the strongest hate speech laws that Australia’s ever had. We’ve got to deal with the parliament that we have, and I can’t see a pathway in the current parliament. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/20/hate-speech-gun-reform-anthony-albanese-bondi-terror-attack-ntwnfb",
      "published": "Mon, 19 Jan 2026 22:19:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "China's economy is rising, but many citizens are left behind, analysts say",
      "description": "China's National Bureau of Statistics released data on its 2025 GDP growth Monday. Analysts say it reveals strong economic growth for the country, but ordinary people still face deep challenges.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5679532/chinas-economy-is-rising-but-many-citizens-are-left-behind-analysts-say",
      "published": "Mon, 19 Jan 2026 05:00:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Hollywood stars lead tributes to designer Valentino",
      "description": "Tributes have flooded in for designer Valentino, who has been hailed as an \"eternal symbol of Italian high fashion\".",
      "url": "https://news.sky.com/story/italian-fashion-designer-valentino-dies-13496264",
      "published": "Mon, 19 Jan 2026 14:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Lawyers for Swiss bar owners condemn 'vindictiveness' after deadly fire",
      "description": "Lawyers for the Moretti couple say \"lies\" have been circulating about their clients, in their first public statement since the fire.",
      "url": "https://www.bbc.com/news/articles/c5yvl4x3nqeo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 14:53:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Clashes reported after Syria and Kurdish-led forces agree ceasefire",
      "description": "An agreement between the government and the SDF will bring an autonomous region in the north-east under state control.",
      "url": "https://www.bbc.com/news/articles/c4gwk37ewvwo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 20:59:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "US Fed Chair Powell to attend Supreme Court session on Cook case: Report",
      "description": "Powell appears to be casting off last year’s more subdued response to Trump’s repeated attacks on the Fed, AP reported.",
      "url": "https://www.aljazeera.com/economy/2026/1/19/us-fed-chair-powell-to-attend-supreme-court-session-on-cook-case-report?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 20:03:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Sheinbaum reassures Mexico after US military movements spark concern",
      "description": "Mexico is showing sensitivity to U.S. military movements since the attack earlier this month on Venezuela",
      "url": "https://abcnews.go.com/International/wireStory/sheinbaum-reassures-mexico-after-us-military-movements-spark-129356861",
      "published": "Mon, 19 Jan 2026 14:25:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "What to know about the annual World Economic Forum meeting in Davos",
      "description": "Nearly 3,000 high-level participants from business, government and beyond plus untold numbers of activists, journalists and observers are converging on the Swiss town of Davos for the World Economic Forum’s annual meeting",
      "url": "https://abcnews.go.com/International/wireStory/annual-world-economic-forum-meeting-davos-129341982",
      "published": "Mon, 19 Jan 2026 07:53:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators occupy Minnesota Target store, demand retailer stop helping federal agents",
      "description": "Anti-ICE protesters staged a sit-in at Minneapolis Target store, claiming retailer allows federal immigration agents to use parking lot as staging ground.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-occupy-minnesota-target-store-demand-retailer-stop-helping-federal-agents",
      "published": "Mon, 19 Jan 2026 16:22:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Fox News Campus Radicals Newsletter: Teachers unions' far-left activism, campus threats against VP Vance",
      "description": "Stay up to date with the Fox News Campus Radicals newsletter, which brings you the in-depth investigative stories from college campuses nationwide.",
      "url": "https://www.foxnews.com/us/fox-news-campus-radicals-newsletter-teachers-unions-far-left-activism-campus-threats-against-vp-vance",
      "published": "Mon, 19 Jan 2026 12:00:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Viral video shows ICE agent telling agitators they're disrupting arrest of child sex offender in Minnesota",
      "description": "Viral video shows alleged interference with ICE operation targeting suspected child sex offender in Minnesota. Federal agents confronted by protesters.",
      "url": "https://www.foxnews.com/us/viral-video-shows-ice-agent-telling-agitators-theyre-disrupting-arrest-child-sex-offender-minnesota",
      "published": "Sun, 18 Jan 2026 22:34:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "ICE says 2 demonstrators were arrested in Minnesota for allegedly assaulting officers",
      "description": "Two protesters allegedly assaulted federal officers during anti-ICE demonstrations in Minnesota, leading to their arrests as clashes between protesters and officers continue.",
      "url": "https://www.foxnews.com/us/ice-says-2-demonstrators-were-arrested-minnesota-allegedly-assaulting-officers",
      "published": "Sun, 18 Jan 2026 21:49:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Incoming NT administrator insulted PM and claimed First Nations people ‘main group’ behind crime",
      "description": "Exclusive: David Connolly says he won’t publicly express political opinions after he was announced for a role similar to that of a state governor Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The Northern Territory’s incoming administrator levelled a series of insults at Anthony Albanese and claimed First Nations people were “the main group responsible” for crime in the Top End in a 2024 speech, it can be revealed. David Connolly is due to begin his tenure as administrator – King Charles’s representative in the territory, which is the equivalent of a state governor – next month. A former NT Cattlemen’s Association president, Connolly was chosen for the role by the territory’s Country Liberal chief minister, Lia Finocchiaro. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/incoming-nt-administrator-insulted-pm-and-claimed-first-nations-people-main-group-behind",
      "published": "Mon, 19 Jan 2026 14:00:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Italian fashion designer Valentino dies at 93",
      "description": "Garavani built one of the most recognizable luxury brands in the world. His clients included royalty, Hollywood stars, and first ladies.",
      "url": "https://www.npr.org/2026/01/19/1114518694/valentino-garavani-dead",
      "published": "Mon, 19 Jan 2026 14:58:23 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump attends World Economic Forum amid U.S.-European tensions over Greenland",
      "description": "President Trump is attending the World Economic Forum meeting in Davos this year with fellow world leaders who seek answers on Ukraine and Gaza.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5680097/trump-attends-world-economic-forum-amid-u-s-european-tensions-over-greenland",
      "published": "Mon, 19 Jan 2026 05:00:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Volcano on French island of La Réunion draws crowds for spectacular eruption",
      "description": "It hadn't erupted since 2023. The Piton de la Fournaise erupted in front of dozens gathered to watch the spectacular show on the French island of La Réunion. It is one of the most active volcanoes in the world. #volcano #eruption #nature",
      "url": "https://www.france24.com/en/video/20260119-volcano-on-french-island-of-la-r%C3%A9union-draws-crowds-for-spectacular-eruption",
      "published": "Mon, 19 Jan 2026 17:05:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Six countries confirm US invitations to Gaza peace board",
      "description": "Trump invites multiple countries, including Jordan, Greece and India, to join his \"Board of Peace\" for Gaza reconstruction and governance oversight.",
      "url": "https://www.foxnews.com/world/six-countries-confirm-us-invitations-gaza-peace-board",
      "published": "Sun, 18 Jan 2026 14:21:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Economic Forum invites Iranian foreign minister to Davos after regime slaughter of Iranian civilians",
      "description": "World Economic Forum is facing calls to exclude Iranian officials from Davos after the regime slaughtered thousands of its civilians, rights groups say.",
      "url": "https://www.foxnews.com/world/world-economic-forum-invites-iranian-foreign-minister-davos-after-regime-slaughter-iranian-civilians",
      "published": "Sun, 18 Jan 2026 12:04:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Protests explode in Greenland amid Trump takeover push: 'We are not interested in being Americans'",
      "description": "Thousands marched in Greenland wearing \"Make America Go Away\" hats, rejecting Trump's purchase demands and tariff threats saying, \"We are not interested in being Americans.\"",
      "url": "https://www.foxnews.com/world/protests-explode-greenland-amid-trump-takeover-push-we-not-interested-being-americans",
      "published": "Sat, 17 Jan 2026 18:16:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "From a refugee family to Nobel Laureate: Omar Yaghi’s story",
      "description": "Nobel laureate Omar Yaghi on how humble beginnings fueled breakthrough science against the climate crisis.",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/19/aje-onl-tt_glb_omaryaghi_av_v2-190126?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 18:47:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Maccabi football fans and the ousting of a UK police chief – why it matters",
      "description": "Experts warn that politicisation of a policing decision sets a 'dangerous precedent' for democracy in the UK.",
      "url": "https://www.aljazeera.com/features/2026/1/19/maccabi-football-fans-and-the-ousting-of-a-uk-police-chief-why-it-matters?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 16:19:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump asks Putin to join Gaza ‘board of peace’ even as Ukraine war rages",
      "description": "The Kremlin says it is seeking to \"clarify all the nuances\" of the offer from Washington.",
      "url": "https://www.aljazeera.com/news/2026/1/19/trump-asks-putin-to-join-gaza-board-of-peace-even-as-ukraine-war-rages?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 13:38:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brazil’s Bolsonaro finds novel way to reduce 27-year sentence: reading books",
      "description": "Former president convicted for coup plot to take advantage of law that knocks four days off jail term for each book read Jair Bolsonaro’s lawyers appear to have been reading up on the country’s penal code and have found a way to help their client reduce the 27-year prison sentence he received last year for plotting a coup: by reading books. There is only one problem: the former far-right Brazilian president has never been known as a bibliophile. “Sorry, I don’t have time to read,” Bolsonaro once declared. “It’s been three years since I read a book.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/brazil-jair-bolsonaro-reduce-sentence-reading-books",
      "published": "Fri, 16 Jan 2026 13:19:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Man in critical condition with ‘probably life-changing injuries’ after third Sydney shark attack in two days",
      "description": "All northern beaches remain closed on Tuesday after attack in Manly on Monday evening follows attacks in Dee Why and Vaucluse Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A man believed to be in his 20s is in a critical condition after being bitten by a shark in the third attack at Sydney beaches in two days. He was taken to Royal North Shore hospital on Monday evening after New South Wales ambulance officers treated the man at Manly beach in Sydney’s north following the attack. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/man-in-critical-condition-after-third-sydney-shark-attack-in-two-days",
      "published": "Mon, 19 Jan 2026 21:22:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany cautiously thankful for US 'Board of Peace' invite",
      "description": "Germany has said peace in Gaza is a \"core interest\" but added Berlin sees the UN as the place to resolve conflict. The US plan received mixed reviews and will likely ruffle feathers with an invitation for Vladimir Putin.",
      "url": "https://www.dw.com/en/germany-cautiously-thankful-for-us-board-of-peace-invite/a-75571485?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 20:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump writes Norway's PM, ties Greenland to peace prize snub",
      "description": "The US president wrote to complain about not getting a Nobel Peace Prize, a decision that doesn't rest with Norway's PM. He said he would devote more thought to US interests, after having \"stopped 8 Wars PLUS.\"",
      "url": "https://www.dw.com/en/trump-writes-norway-s-pm-ties-greenland-to-peace-prize-snub/a-75562817?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 14:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "WEF: Donald Trump set to dominate Davos 2026",
      "description": "Weeks after attacking Venezuela, capturing its controversial leader, and reviving Greenland ambitions, the US president's presence in Davos is expected to raise the stakes at the WEF's annual meeting.",
      "url": "https://www.dw.com/en/wef-donald-trump-set-to-dominate-davos-2026/a-75509182?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 05:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Spain train crash: PM Sanchez vows to 'find out the truth'",
      "description": "Spain's Prime Minister Pedro Sanchez promised to \"find out the truth\" as he spoke at a news conference near the site of the train crash in southern Spain. Regional officials confirmed that at least 40 people have died.",
      "url": "https://www.dw.com/en/spain-train-crash-pm-sanchez-vows-to-find-out-the-truth/live-75556054?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 00:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Gunmen abduct more than 150 Christians in mass kidnapping",
      "description": "Armed bandits have kidnapped more than 150 Christians in simultaneous attacks on a number of churches in Nigeria.",
      "url": "https://news.sky.com/story/gunmen-abduct-more-than-150-christians-in-mass-kidnapping-13496319",
      "published": "Mon, 19 Jan 2026 17:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Gunmen abduct over 150 worshippers from 3 churches in Nigeria",
      "description": "Gunmen have abducted more than 150 worshippers in simultaneous attacks on three churches in northwest Nigeria",
      "url": "https://abcnews.go.com/International/wireStory/gunmen-abduct-150-worshippers-3-churches-nigeria-129351483",
      "published": "Mon, 19 Jan 2026 11:09:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Florida triple murder of 3 tourists was 'senseless,' 'random,' sheriff says",
      "description": "Florida man accused of randomly shooting three stranded tourists at Kissimmee rental home. Ahmad Bojeh arrested and charged with premeditated murder.",
      "url": "https://www.foxnews.com/us/florida-triple-murder-3-tourists-senseless-random-sheriff-says",
      "published": "Mon, 19 Jan 2026 07:56:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian regime elites allegedly move millions of dollars out of country amid sanctions",
      "description": "Treasury sanctions target Iran's shadow banking as Mojtaba Khamenei allegedly transferred $328 million overseas according to Treasury Department reports.",
      "url": "https://www.foxnews.com/world/iranian-regime-elites-allegedly-move-tens-millions-dollars-out-country-amid-sanctions",
      "published": "Sun, 18 Jan 2026 20:29:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian drone strikes leave hundreds of thousands without power across Russian-controlled area",
      "description": "Ukrainian drone strikes against Russian energy infrastructure left over 200,000 without power as both sides continue targeting electrical grids.",
      "url": "https://www.foxnews.com/world/ukrainian-drone-strikes-leave-hundreds-thousands-without-power-across-russian-controlled-area",
      "published": "Sun, 18 Jan 2026 14:07:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Argentina's bungled hunt for Hitler's right-hand man Martin Bormann revealed in declassified files",
      "description": "Files show Argentina's bungled hunt for Hitler's henchman Martin Bormann, marked by mistaken arrests and bureaucratic incompetence in the post-war era.",
      "url": "https://www.foxnews.com/world/argentinas-bungled-hunt-hitlers-right-hand-man-martin-bormann-revealed-declassified-files",
      "published": "Sun, 18 Jan 2026 06:00:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian army, SDF start implementing ceasefire despite clashes",
      "description": "Despite some reported clashes, the Syrian army and the Syrian Democratic Forces (SDF) are implementing a new ceasefire.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/syrian-army-sdf-start-implementing-ceasefire-despite-clashes?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 19:27:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump escalates tensions across Europe with new threats about Greenland acquisition",
      "description": "President Trump said the U.S. will impose tariffs on eight European countries until the U.S. acquires Greenland. The announcement came as a congressional delegation visited Denmark to ease tensions.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5680873/trump-escalates-tensions-across-europe-with-new-threats-about-greenland-acquisition",
      "published": "Mon, 19 Jan 2026 05:00:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Former diplomat on Trump's tariff threats against NATO allies over Greenland issue",
      "description": "NPR's Steve Inskeep asks Kurt Volker, a former U.S. ambassador to NATO, about what critics perceive as the Trump administration's threat to the transatlantic alliance.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5681384/former-diplomat-on-trumps-tariff-threats-against-nato-allies-over-greenland-issue",
      "published": "Mon, 19 Jan 2026 05:00:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "High-speed train crash in Spain kills at least 39",
      "description": "More than 400 passengers were on board the trains that derailed near the city of Córdoba, in Spain's worst rail crash in more than a decade.",
      "url": "https://www.bbc.com/news/articles/cedw6ylpynyo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 08:20:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration says deporting college student trying to surprise family was a ‘mistake’",
      "description": "Any Lucía López Belloza was detained at Boston’s airport in November and flown to Honduras two days later US citizens and permanent residents: have you been racially profiled by ICE? The Trump administration apologized in court for a “mistake” in the deportation of a Massachusetts college student who was detained trying to fly home to surprise her family in Texas for Thanksgiving. But the administration still argued that the federal government error should not affect her immigration case. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/16/trump-administration-mistake-college-student-detained",
      "published": "Fri, 16 Jan 2026 20:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "CIA chief visits Maduro successor as Machado vows to become Venezuela’s president",
      "description": "John Ratcliffe meets Delcy Rodríguez in Caracas less than two weeks after his agents helped to oust her precedessor The CIA chief whose agents reputedly played a key role in abducting Nicolás Maduro has flown to Venezuela to meet his successor as the sidelined opposition leader, María Corina Machado, vowed she would become the country’s first elected female president. Machado’s comments were broadcast on Friday, a day after she handed her Nobel peace prize medal to Donald Trump in recognition of what she called a principled and decisive move against Maduro, whom US special forces snatched on 3 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/cia-chief-visits-maduro-successor-as-machado-vows-to-become-venezuelas-president",
      "published": "Fri, 16 Jan 2026 17:23:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "China expected to get London embassy go-ahead this week after years of wrangling",
      "description": "Decision expected on Monday or Tuesday, potentially smoothing relations before Keir Starmer’s visit to China Why Chinese ‘mega embassy’ is not such a worry for British spies A decision on China’s proposed mega embassy in London is expected on Monday or Tuesday, with Chinese officials and British diplomats in Beijing holding their breath in anticipation of the planning application finally being approved. The saga, which has been running since 2018, is widely expected to end with the British government giving the green light for construction. If it does, one group likely to be grateful is those who work in the British embassy’s dilapidated building in Beijing. The UK’s plans to redevelop its outpost in China’s capital have been blocked for years by the Chinese government because of the London embassy row. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/19/china-expected-to-get-london-embassy-go-ahead-uk",
      "published": "Mon, 19 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says he's pursuing Greenland after perceived Nobel Peace Prize snub",
      "description": "\"Considering your Country decided not to give me the Nobel Peace Prize… I no longer feel an obligation to think purely of Peace,\" Trump wrote in a message to the Norwegian Prime Minister.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5682038/trump-greenland-nobel-peace-prize",
      "published": "Mon, 19 Jan 2026 10:27:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Universal Orlando visitor dies after riding Revenge of the Mummy roller coaster, state report says",
      "description": "A 70-year-old woman died after riding Universal Orlando's Revenge of the Mummy roller coaster in November, according to a new state report.",
      "url": "https://www.foxnews.com/us/universal-orlando-visitor-dies-after-riding-revenge-mummy-roller-coaster",
      "published": "Mon, 19 Jan 2026 13:30:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Texas couple labeled fake ‘Chip and Joanna Gaines’ admits $5M dream home renovation scam",
      "description": "Texas couple allegedly defrauded over 40 homeowners of nearly $5M through fake construction business promoted on social media. The Judges face federal charges.",
      "url": "https://www.foxnews.com/us/texas-couple-labeled-fake-chip-joanna-gaines-admits-5m-dream-home-renovation-scam",
      "published": "Sun, 18 Jan 2026 16:00:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says he will '100%' carry out Greenland tariffs threat, as EU vows to protect its interests",
      "description": "Kaja Kallas, the EU's foreign policy chief, said the bloc has \"no interest to pick a fight, but we will hold our ground\".",
      "url": "https://www.bbc.com/news/articles/c4g5345ylk0o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 21:46:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Spanish PM vows to find cause of deadly high-speed train crash",
      "description": "Pedro Sanchez announces three days of mourning after at least 40 people died in Sunday's collision in southern Spain.",
      "url": "https://www.bbc.com/news/articles/c2d7rk0865go?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 21:30:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Europe won't be blackmailed,' Danish PM says in wake of Trump Greenland threats",
      "description": "Trump says he will impose new taxes on eight US allies in February if they oppose his proposed takeover of the autonomous Danish territory.",
      "url": "https://www.bbc.com/news/articles/ceqz0llpnyqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 07:15:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Keir Starmer says Trump’s tariffs over Greenland are ‘completely wrong’",
      "description": "Keir Starmer said Donald Trump’s threats to impose tariffs on allies over Greenland are ‘completely wrong’.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/keir-starmer-says-trumps-tariffs-over-greenland-are-completely?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 13:44:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "How can the EU respond to US 'blackmail' over Greenland?",
      "description": "European leaders have three main options for responding to the Trump administration’s economic threats. If they don’t get it right, Trump may be emboldened to take over Greenland.",
      "url": "https://www.dw.com/en/how-can-the-eu-respond-to-us-blackmail-over-greenland/a-75570573?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 18:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany updates: Berlin brings back EV subsidies",
      "description": "The German government has reintroduced subsidies for electric vehicles, but the move is under fire for including hybrids. Meanwhile, the IMF is predicting stronger economic growth in 2026. Follow DW.",
      "url": "https://www.dw.com/en/germany-updates-berlin-brings-back-ev-subsidies/live-75560659?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about the train crash in Spain",
      "description": "A high-speed train in southern Spain derailed Sunday evening, colliding with another train and killing at least 39 people",
      "url": "https://abcnews.go.com/International/wireStory/train-crash-spain-129342990",
      "published": "Mon, 19 Jan 2026 09:29:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Families in ‘survival mode’ amid Russian strikes and deadly cold",
      "description": "Families across Ukraine are in “constant survival mode” amid ongoing waves of Russian missile and drone strikes that have left blocks without power for days at a time, while temperatures plunge to deadly lows, the UN Children's Fund (UNICEF) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166774",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "West Virginia teacher fired after arrest on child sex abuse charge",
      "description": "West Virginia teacher Emily Joy Wise, 38, was fired after allegedly sexually abusing a child under 16. She's held on $250,000 bail following her arrest.",
      "url": "https://www.foxnews.com/us/west-virginia-teacher-fired-after-arrest-child-sex-abuse-charge",
      "published": "Mon, 19 Jan 2026 14:17:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anti-ICE mob storms Minnesota church over pastor's alleged ties to immigration enforcement",
      "description": "Anti-ICE agitators disrupted worship at Cities Church in St. Paul, chanting inside the sanctuary after claiming one of the pastors was affiliated with ICE.",
      "url": "https://www.foxnews.com/us/anti-ice-mob-storms-minnesota-church-over-pastors-alleged-ties-immigration-enforcement",
      "published": "Sun, 18 Jan 2026 19:47:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Could events in Syria have a wider impact for Kurds?",
      "description": "Syrian army takes control of areas formerly under control of Kurdish-led forces.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/19/could-events-in-syria-have-a-wider-impact-for-kurds?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 19:03:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Bulgaria: President Radev steps down before snap election",
      "description": "Bulgarian President Rumen Radev has resigned. Within the next three months, the eastern EU member state will hold its eighth parliamentary election in five years.",
      "url": "https://www.dw.com/en/bulgaria-president-radev-steps-down-before-snap-election/a-75572086?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 19:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Hungary's MOL to buy Serbia's Russia-owned NIS oil company if US approves",
      "description": "Hungary’s MOL Group energy company said on Monday they have signed a preliminary agreement to buy a 56.15% stake in Serbia’s Russia-owned main oil supplier that has been sanctioned by the United States",
      "url": "https://abcnews.go.com/International/wireStory/hungarys-mol-buy-serbias-russia-owned-nis-oil-129355495",
      "published": "Mon, 19 Jan 2026 13:53:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syrian government forces clash with Kurdish fighters as IS prisoners escape",
      "description": "Syrian government forces and Kurdish fighters have clashed around two prisons i housing members of the Islamic State group in Syria’s northeast",
      "url": "https://abcnews.go.com/International/wireStory/syrian-government-forces-clash-kurdish-fighters-prisoners-escape-129354286",
      "published": "Mon, 19 Jan 2026 13:54:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "India agrees to boost trade and strategic ties with UAE amid regional tensions",
      "description": "India and the UAE are aiming to double bilateral trade to $200 billion by 2032",
      "url": "https://abcnews.go.com/International/wireStory/india-agrees-boost-trade-strategic-ties-uae-amid-129350927",
      "published": "Mon, 19 Jan 2026 10:58:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US troops pull out of major Iraq airbase amid ongoing regional consolidation effort, progress against ISIS",
      "description": "The U.S. withdrawal of troops from Ain al-Asad Airbase was completed by Friday as part of regional consolidation following progress on ISIS as CENTCOM calls for \"teamwork.\"",
      "url": "https://www.foxnews.com/world/us-troops-pull-out-major-iraq-airbase-amid-ongoing-regional-consolidation-effort-progress-against-isis",
      "published": "Sat, 17 Jan 2026 15:54:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "China’s population falls again as birthrate drops 17% to record low",
      "description": "Fourth year of decline deepens concerns over ageing, shrinking workforce and long-term economic impact China’s population fell for a fourth consecutive year in 2025 as the birthrate plunged to another record low despite the introduction of polices aimed at encouraging people to have children. Registered births dropped to 7.92 million in 2025 – or 5.63 for every 1,000 members of the population – down 17% from 9.54 million in 2024, and the lowest since records began in 1949. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/china-population-falls-again-birthrate-record-low",
      "published": "Mon, 19 Jan 2026 12:12:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Germany-US rift is looming after a year of Trump",
      "description": "The second term of US President Donald Trump has brought unprecedented strain on once-solid German-American relations. The issue of Greenland could be a tipping point. DW looks back on a year of trans-Atlantic tensions.",
      "url": "https://www.dw.com/en/germany-us-rift-is-looming-after-a-year-of-trump/a-75562705?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 12:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting leader was once a DEA 'priority target': report",
      "description": "Venezuela's interim president Delcy Rodríguez was reportedly labeled a DEA \"priority target\" in 2022, appearing in intelligence files since at least 2018.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-leader-once-dea-priority-target-report",
      "published": "Sun, 18 Jan 2026 11:33:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "ISIL fighters flee jail as Syrian army clashes with Kurdish-led SDF",
      "description": "Syrian army tells Al Jazeera Arabic it is now in complete control of city of al-Shaddadi in northeast Syria.",
      "url": "https://www.aljazeera.com/news/2026/1/19/isil-fighters-flee-jail-as-syrian-army-clashes-with-kurdish-led-sdf?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 18:42:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "'Europe is at a total loss': Russia gloats over Greenland tensions",
      "description": "The BBC's Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump's desire to buy Greenland.",
      "url": "https://www.bbc.com/news/articles/c17zpvkddpzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 16:26:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Italian fashion designer Valentino dies aged 93",
      "description": "One of the giants of 20th century fashion, his creations were worn by celebrities including Elizabeth Taylor, Julia Roberts and Gwyneth Paltrow.",
      "url": "https://www.bbc.com/news/articles/cdx4rpxxvg7o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 18:00:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ghana arrests Nigerians accused of running cyber-crime networks",
      "description": "There is a growing trend of foreigners being lured to Ghana under the pretext of lucrative work.",
      "url": "https://www.bbc.com/news/articles/cr4k35q6yr0o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 15:15:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan PM Takaichi calls snap election three months after taking office",
      "description": "Sanae Takaichi, who took office last October, hopes the vote will give her a stronger mandate.",
      "url": "https://www.bbc.com/news/articles/c1dk0x0v6pdo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 12:00:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's birth rate hits record low as population continues to shrink",
      "description": "Beijing has been trying hard to encourage more young people to marry and have children.",
      "url": "https://www.bbc.com/news/articles/c79r7v7qr53o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 07:12:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Shameful' and 'terrible look' - the chaos that marred Senegal's Afcon triumph",
      "description": "Senegal beat Morocco to win the Africa Cup of Nations after the final is overshadowed when they temporarily refuse to play.",
      "url": "https://www.bbc.com/sport/football/articles/c70ljednyl6o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 10:46:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Norway PM: Trump ‘preoccupied’ with Nobel Peace Prize on Greenland texts",
      "description": "Norway PM Jonas Gahr Store rebuked Donald Trump after after text exchange involving Greenland and the Nobel Peace Prize.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/norway-pm-trump-preoccupied-with-nobel-peace-prize-on-greenland-texts?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 20:52:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump’s Gaza ‘Board of Peace’ draws scepticism",
      "description": "US President Donald Trump has unveiled a proposed “Board of Peace” aimed at rebuilding Gaza.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/trumps-gaza-board-of-peace-draws-scepticism?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 20:28:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bulgaria’s President Rumen Radev says he will resign ahead of snap election",
      "description": "Radev widely expected to form his own political party prior to upcoming snap vote.",
      "url": "https://www.aljazeera.com/news/2026/1/19/bulgarias-president-says-he-is-stepping-down-ahead-of-snap-elections?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 19:07:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The US economy seems strong after a year of Trump, but is it really?",
      "description": "While economic growth is strong, the gap between the haves and have-nots is widening.",
      "url": "https://www.aljazeera.com/economy/2026/1/19/the-us-economy-seems-strong-after-a-year-of-trump-but-is-it-really?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 16:51:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AR Rahman: Indian composer faces backlash for ‘bias’ in Bollywood remarks",
      "description": "The Oscar-winning composer faces backlash for saying he lost work due to 'communal bias' in Bollywood.",
      "url": "https://www.aljazeera.com/features/2026/1/19/ar-rahman-indian-composer-faces-backlash-for-bias-in-bollywood-remarks?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 16:48:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal, Morocco, play out an embarrassing AFCON 2025 final in Rabat",
      "description": "Africa Cup of Nations final marred by on- and off-field controversy with Senegal claiming 1-0 win over hosts Morocco.",
      "url": "https://www.aljazeera.com/sports/2026/1/19/senegal-morocco-play-out-an-embarrassing-afcon-2025-final-in-rabat?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 16:45:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Djokovic wins opening match against Martinez at Australian Open",
      "description": "Novak Djokovic begins his hunt for ‍a record ‍25th Grand Slam title with a straight-sets victory against Pedro Martinez.",
      "url": "https://www.aljazeera.com/sports/2026/1/19/djokovic-wins-opening-match-against-martinez-at-australian-open?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 16:39:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Smotrich says Trump’s plan for Gaza is ‘bad for Israel’",
      "description": "Israel's far-right Finance Minister Bezalel Smotrich criticised US President Donald Trump's plan for Gaza.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/smotrich-says-trumps-plan-for-gaza-is-bad-for?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 15:33:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Inter Milan vs Arsenal: UEFA Champions League – team news, start, lineups",
      "description": "Leaders Arsenal itching to get back to winning ways against Inter in league phase of UEFA Champions League on Tuesday.",
      "url": "https://www.aljazeera.com/sports/2026/1/19/inter-milan-vs-arsenal-uefa-champions-league-team-news-start-lineups?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 13:04:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Debt collector hired to chase unpaid taxes for the ATO pays zero corporate tax itself",
      "description": "Neither Recoveriescorp nor its parent entity has paid the tax since securing multi-million dollar government contracts Get our breaking news email , free app or daily news podcast A private debt collector has paid zero corporate tax since securing contracts worth tens of millions of dollars from the Australian Taxation Office to pursue arrears payments, including from welfare recipients. The parent entity of the outsource operator, Recoveriescorp, has recorded large income streams in its two most recent annual accounts, according to Guardian Australia analysis, with revenue surpassing $100m during 2025. Do you know more? Email jonathan.barrett@theguardian.com Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/debt-collector-hired-by-ato-pays-zero-corporate-tax",
      "published": "Mon, 19 Jan 2026 14:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-19T16:56:37.088Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A road trip through the checkpoints, chaos and congestion along West Africa's coastline",
      "description": "The coastal corridor from Lagos to Abidjan is shaping into a West African megalopolis. Starting in Lagos, Nigeria, we navigate the chaos, the checkpoints, and the road that could change it all.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5529402/a-road-trip-through-the-checkpoints-chaos-and-congestion-along-west-africas-coastline",
      "published": "Mon, 19 Jan 2026 17:04:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Norway says Trump cited Nobel loss when discussing Greenland",
      "description": "The prime minister of Norway says President Trump cited the Nobel Prize as a reason for not pursuing a peaceful resolution on Greenland.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5682119/norway-says-trump-cited-nobel-loss-when-discussing-greenland",
      "published": "Mon, 19 Jan 2026 16:20:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Italian fashion designer Valentino dies aged 93",
      "description": "The legendary fashion designer founded his namesake company in 1959 in Rome.",
      "url": "https://www.dw.com/en/italian-fashion-designer-valentino-dies-aged-93/a-75571115?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 17:10:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A cow has learned to use sticks to scratch herself — a scientific first",
      "description": "A cow in Austria has been observed using tools ― the first time such behavior has been recorded in cattle. Have we underestimated the gentle bovines all this time?",
      "url": "https://www.dw.com/en/a-cow-has-learned-to-use-sticks-to-scratch-herself-a-scientific-first/a-75525650?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 16:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The key elections in Africa in 2026",
      "description": "Benin's parliamentary elections and Uganda's general elections, both held in January, marked the beginning of a busy and decisive year at ballot boxes across the African continent.",
      "url": "https://www.dw.com/en/the-key-elections-in-africa-in-2026/a-75558971?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 14:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Human cost of wildlife conservation in Tanzania",
      "description": "Trophy hunting interests are turning the screw on northern Tanzania's Maasai communities and wildlife paradise. Meanwhile, well-funded conservation efforts are attracting scrutiny amid rising Maasai eviction cases.",
      "url": "https://www.dw.com/en/human-cost-of-wildlife-conservation-in-tanzania/a-75447264?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Updates: Denmark, Greenland float NATO mission on island",
      "description": "Denmark's defense minister said he and Greenland's defense minister raised the possibility of a NATO surveillance mission in Greenland in a meeting with the NATO chief Mark Rutte.",
      "url": "https://www.dw.com/en/updates-denmark-greenland-float-nato-mission-on-island/live-75558976?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 09:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China: Population sinks for fourth year in a row",
      "description": "Financial incentives for future parents have failed to have the desired effect. At the current rate, China's population could drop as low as 800 million by the year 2100, according to the United Nations.",
      "url": "https://www.dw.com/en/china-population-sinks-for-fourth-year-in-a-row/a-75558927?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 08:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French prime minister to push 2026 budget through parliament without vote",
      "description": "French Prime Minister Sébastien Lecornu has announced he will invoke Article 49.3 of the Constitution to pass the 2026 budget bill into law without parliamentary approval. He admitted that resorting to this tool represented a 'partial failure' as he had promised not to do so. But after a host of concessions the government has made, he is betting he now has enough political support, notably from the Socialists, to survive even if no-confidence motions were filed.",
      "url": "https://www.france24.com/en/tv-shows/business/20260119-french-prime-minister-to-push-2026-budget-through-parliament-without-vote",
      "published": "Mon, 19 Jan 2026 21:46:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A 'joyful' designer who worked on 'elevating the beauty of women': Valentino dead at 93",
      "description": "Speaking on FRANCE 24, fashion journalist Dana Thomas pays tribute to the legendary Valentino, a 'joyful and joyous' fashion designer who worked on 'elevating the beauty of women'. Valentino Garavani passed away on Monday aged 93 at his home in Rome.",
      "url": "https://www.france24.com/en/a-joyful-designer-who-worked-on-elevating-the-beauty-of-women-valentino-dead-at-93",
      "published": "Mon, 19 Jan 2026 20:58:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Replay: French PM Lecornu to trigger special power to break budget deadlock",
      "description": "French Prime Minister Sebastien Lecornu confirmed on Monday that he would ram his budget bill through parliament without a vote using special constitutional powers, conceding it was a \"partial failure\", after weeks of stalled negotiations.",
      "url": "https://www.france24.com/en/replay-french-pm-lecornu-to-trigger-special-power-to-break-budget-deadlock",
      "published": "Mon, 19 Jan 2026 19:51:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Celebrated Italian fashion designer Valentino dies aged 93",
      "description": "Italian haute couture designer Valentino Garavani died at his home in Rome, his foundation said Monday. He was 93. Universally known by his first name, Valentino was adored by generations of royals, first ladies and movie stars, from Jackie Kennedy Onassis to Julia Roberts and Queen Rania of Jordan.",
      "url": "https://www.france24.com/en/europe/20260119-celebrated-italian-fashion-designer-valentino-dies-aged-93",
      "published": "Mon, 19 Jan 2026 17:43:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French PM Lecornu will use special power to force through budget with ‘regret’",
      "description": "French ​Prime ⁠Minister Sébastien Lecornu confirmed on Monday that he will invoke a special ​constitutional power, Article 49.3, to force a budget ‍for 2026 ​through parliament without a vote. The decision, he said, was made with \"regret\" after budget negotiations came to an impasse. The use of Article 49.3 can trigger a no-confidence vote, which can topple the government.",
      "url": "https://www.france24.com/en/france/20260119-french-pm-lecornu-will-use-special-constitutional-power-to-pass-budget-without-parliamentary-vote",
      "published": "Mon, 19 Jan 2026 16:44:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's extraordinary letter to Norway about Greenland - in full and fact-checked",
      "description": "The letter from US President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary.",
      "url": "https://news.sky.com/story/trumps-extraordinary-letter-to-norway-about-greenland-in-full-and-fact-checked-13496272",
      "published": "Mon, 19 Jan 2026 15:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What is mysterious iron 'bar' in space?",
      "description": "Astronomers have spotted a mysterious cloud in the shape of a bar 2,600 light-years from Earth.",
      "url": "https://news.sky.com/story/ring-nebula-what-is-mysterious-iron-bar-in-space-13496185",
      "published": "Mon, 19 Jan 2026 11:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's peace board invitation is a gift for Putin",
      "description": "So invading your neighbour is apparently no barrier to being an arbiter of peace.",
      "url": "https://news.sky.com/story/donald-trumps-peace-board-invitation-is-a-gift-for-vladimir-putin-but-it-will-disgust-ukraine-13496257",
      "published": "Mon, 19 Jan 2026 14:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bulgaria's left-leaning President Rumen Radev says he is stepping down",
      "description": "Bulgaria’s left-leaning president Rumen Radev has announced his decision to step down",
      "url": "https://abcnews.go.com/International/wireStory/bulgarias-left-leaning-president-rumen-radev-stepping-129354165",
      "published": "Mon, 19 Jan 2026 13:29:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What to know about Syria's main Kurdish-led force and its deal with Damascus",
      "description": "The Kurdish-led Syrian Democratic Forces are set to merge into the Syrian army after suffering major setbacks",
      "url": "https://abcnews.go.com/International/wireStory/syrias-main-kurdish-led-force-deal-damascus-after-129347117",
      "published": "Mon, 19 Jan 2026 09:39:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Five face trial in Peru in rare prosecution over the killing of an Amazon defender",
      "description": "Five men are set to stand trial in Peru over the 2023 killing of an Indigenous Amazon defender",
      "url": "https://abcnews.go.com/International/wireStory/face-trial-peru-rare-prosecution-killing-amazon-defender-129346450",
      "published": "Mon, 19 Jan 2026 09:29:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Catholic cardinals urge Trump administration to embrace a moral compass in foreign policy",
      "description": "Three U.S. Catholic cardinals have urged the Trump administration to use a moral compass in foreign policy",
      "url": "https://abcnews.go.com/International/wireStory/us-catholic-cardinals-urge-trump-administration-embrace-moral-129346423",
      "published": "Mon, 19 Jan 2026 14:49:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU executive arm, Russia and Thailand asked to join Trump's Board of Peace for Gaza",
      "description": "The EU's executive arm, Russia and Thailand say they've been asked to join U.S. President Donald Trump’s new Board of Peace that will supervise the next phase of the Gaza peace plan",
      "url": "https://abcnews.go.com/International/wireStory/eu-executive-arm-russia-thailand-asked-join-trumps-129344329",
      "published": "Mon, 19 Jan 2026 08:57:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian court sentences American to 5 years on charges of illegally transporting arms",
      "description": "A Russian court has convicted and sentenced an American on charges of illegally transporting weapons",
      "url": "https://abcnews.go.com/International/wireStory/russian-court-sentences-american-5-years-charges-illegally-129342012",
      "published": "Mon, 19 Jan 2026 08:01:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Retired South Carolina couple found dead in homicides at home",
      "description": "Beloved church members Larry and Sandra Moore found dead in their South Carolina home. The faithful couple described as \"backbones\" of their congregation.",
      "url": "https://www.foxnews.com/us/retired-south-carolina-couple-found-dead-homicides-home",
      "published": "Mon, 19 Jan 2026 14:55:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Charlie Kirk’s widow Erika Kirk demands speedy trial, alleging 'undue delay' from Tyler Robinson defense",
      "description": "In a court filing made public over the weekend, Erika Kirk's attorney notified the court that she is invoking her rights to a speedy trial as a victim under Utah law.",
      "url": "https://www.foxnews.com/us/charlie-kirk-widow-erika-kirk-demands-speedy-trial-alleging-undue-delay-from-tyler-robinson-defense",
      "published": "Mon, 19 Jan 2026 13:23:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portland DA cracks down on drug crimes as Seattle pulls back on enforcement",
      "description": "Portland DA announces drug prosecution crackdown for those refusing treatment, contrasting sharply with Seattle's lenient approach to possession cases.",
      "url": "https://www.foxnews.com/us/portland-da-cracks-down-drug-crimes-seattle-softens-enforcement",
      "published": "Mon, 19 Jan 2026 08:00:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ICE agent confronts agitators interfering with alleged child sex offender arrest and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/ice-agent-agitators-alleged-child-sex-offender-more-top-headlines",
      "published": "Mon, 19 Jan 2026 06:52:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Harvard student exposes 'systematic' liberal bias forcing conservatives to avoid certain classes",
      "description": "Harvard student says \"systematic\" bias exists at Ivy League school, with conservative students avoiding courses due to left-leaning faculty influence.",
      "url": "https://www.foxnews.com/us/harvard-student-exposes-systematic-liberal-bias-forcing-conservatives-avoid-certain-classes",
      "published": "Mon, 19 Jan 2026 06:00:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Woman wakes up with 8-foot python coiled on her chest while sleeping: 'Don't move'",
      "description": "A Brisbane woman calmly removed an 8-foot carpet python from her bedroom after waking to find the non-venomous snake on top of her chest Monday night.",
      "url": "https://www.foxnews.com/world/woman-wakes-up-8-foot-python-coiled-her-chest-while-sleeping-dont-move",
      "published": "Sat, 17 Jan 2026 23:11:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}