{
  "last_updated": "2026-01-21T15:34:46.384440Z",
  "event_count": 224,
  "events": [
    {
      "title": "Catholic cardinals warn US foreign policy under Trump risks global suffering",
      "description": "Church leaders cite Greenland threats, Venezuela action and aid cuts as undermining human dignity and peace Three cardinals in the US Catholic church have criticized the Trump administration ’s foreign policy, saying its push to obtain or otherwise seize Greenland , recent military action in Venezuela , and cuts to humanitarian aid risk “destroying international relations and plunging the world into incalculable suffering”. “Our country’s moral role in confronting evil around the world, sustaining the right to life and human dignity, and supporting religious liberty are all under examination,” said a joint statement from Blase Cupich, Robert McElroy and Joseph Tobin, respectively the archbishops of Chicago, Washington DC and Newark, New Jersey. The Associated Press contributed Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/catholic-cardinals-trump-foreign-policy",
      "published": "Tue, 20 Jan 2026 14:44:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 51,
      "severity_level": "Critical"
    },
    {
      "title": "Chilean president declares state of catastrophe as wildfires kill at least 18",
      "description": "Fires blaze through 8,500 hectares, forcing 50,000 people to evacuate as firefighters struggle to extinguish flames Wildfires raging across central and southern Chile have killed at least 18 people, scorched thousands of hectares of forest and destroyed scores of homes, authorities said, as the South American country swelters under a heatwave. Chile’s president, Gabriel Boric, declared a state of catastrophe in the country’s central Biobío region and the neighbouring Ñuble region, about 500km (300 miles) south of Santiago, the capital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chile-president-declares-state-of-catastrophe-as-wildfires-kill",
      "published": "Sun, 18 Jan 2026 20:16:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of emergency after eight police officers killed in prison gang violence",
      "description": "President announces 30-day order after inmates also took 46 people hostage at three prisons Guatemala’s president has declared a 30-day nationwide state of emergency to combat criminal gangs after authorities accused them of killing eight police officers and holding hostages at three prisons. The killings occurred in the capital, Guatemal City, and surrounding areas a day after gang-affiliated inmates took 46 people hostage in the three prisons across the country to demand incarcerated gang leaders be moved to lower-security facilities. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/guatemala-state-of-emergency-police-officers-killed-prison-gang-violence",
      "published": "Mon, 19 Jan 2026 12:53:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Iran will retaliate 'with everything we have' if US attacks, senior diplomat warns",
      "description": "More than 4,500 protesters killed in Iran as foreign minister threatens forceful response to potential U.S. military strikes in escalating regional crisis.",
      "url": "https://www.foxnews.com/world/iran-retaliate-with-everything-we-have-us-attacks-senior-diplomat-warns",
      "published": "Wed, 21 Jan 2026 07:44:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Men charged with contract killing of Indigenous leader to go on trial in Peru",
      "description": "Prosecution over death of Quinto Inuma Alvarado seen as test of ability to curb attacks on environmental defenders Five men are due to go on trial on Tuesday over the killing of an Amazonian Indigenous leader, in a legal case that could test whether Peru can hold perpetrators accountable for violence linked to illegal logging and drug trafficking in one of the world’s most dangerous regions for environmental defenders. The Kichwa tribal leader Quinto Inuma Alvarado was killed on 29 November 2023, after repeatedly denouncing illegal activity within his community’s territory. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/trial-peru-amazon-quinto-inuma-alvarado-indigenous-leader",
      "published": "Tue, 20 Jan 2026 10:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Is a new world 'without rules' emerging? What global leaders have said",
      "description": "The world order is in the \"midst of a rupture\", leaders have warned - telling how international law is being \"trampled underfoot\" and \"imperial ambitions are resurfacing\".",
      "url": "https://news.sky.com/story/is-a-new-world-without-rules-emerging-what-global-leaders-have-said-13497144",
      "published": "Wed, 21 Jan 2026 13:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protests: Family recounts fatal shooting",
      "description": "A grieving family member told DW about how their loved one was killed by security forces in Tehran. Thousands of people have been reported killed but assessing the true scale of the violence remains complicated.",
      "url": "https://www.dw.com/en/iran-protests-family-recounts-fatal-shooting/a-75592109?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 13:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Rising hunger and displacement pose growing economic risk, UN tells Davos",
      "description": "As global leaders gather at the World Economic Forum in Davos this week, UN agencies are warning that rising hunger and displacement are not only humanitarian emergencies but growing threats to global economic stability.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166791",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Japan restarts world's largest nuclear plant as Fukushima memories loom large",
      "description": "Japan restarts a reactor at the world's largest nuclear plant nearly 15 years after the Fukushima meltdown.",
      "url": "https://www.bbc.com/news/articles/cq6v0v32rg1o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 13:18:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "World enters era of ‘global water bankruptcy’",
      "description": "The world has moved beyond a water crisis and into a state of global water bankruptcy, says a new flagship report released on Tuesday by UN researchers.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166800",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: Atrocities ‘repeated town by town’, ICC prosecutor tells UN Security Council",
      "description": "Atrocities in Sudan’s Darfur region are spreading from town to town in an organized campaign of violence that includes mass executions, rape and ethnic targeting, amounting to war crimes and crimes against humanity, the prosecutor of the International Criminal Court told the UN Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166790",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's top diplomat issues most direct threat yet to US",
      "description": "Iran's foreign minister has issued a direct threat against the United States, warning of retaliation if attacked",
      "url": "https://abcnews.go.com/International/wireStory/irans-top-diplomat-issues-direct-threat-us-crackdown-129409485",
      "published": "Wed, 21 Jan 2026 03:13:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Armed militias fire heavy machine guns through Tehran streets in deadly night attacks",
      "description": "Iran protests entered day 24 with 4,519 confirmed deaths. Supreme Leader Ayatollah Ali Khamenei backs security forces amid nationwide demonstrations.",
      "url": "https://www.foxnews.com/world/armed-militias-fire-heavy-machine-guns-tehran-streets-deadly-night-attacks",
      "published": "Tue, 20 Jan 2026 21:06:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian soldier sentenced to death for refusing to fire on protesters during nationwide unrest",
      "description": "Iranian soldier Javid Khales was reportedly sentenced to death for refusing orders to shoot protesters during nationwide unrest, a human rights group says.",
      "url": "https://www.foxnews.com/world/iranian-soldier-sentenced-death-refusing-fire-protesters-nationwide-unrest",
      "published": "Tue, 20 Jan 2026 21:56:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli strike kills three journalists in Gaza, civil defence agency says",
      "description": "Three journalists were killed by an Israeli strike in Gaza on Wednesday, the Palestinian territory's civil defence agency said. Israel has been the biggest killer of journalists for three years running, Reporters Without Borders data shows, with the country's forces killing 220 media professionals since the war in Gaza began.",
      "url": "https://www.france24.com/en/middle-east/20260121-israeli-strike-kills-three-journalists-gaza-civil-defence-agency-says",
      "published": "Wed, 21 Jan 2026 15:12:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Spain in mourning after second train crash kills 1. Death toll in first rises to 43",
      "description": "Commuter rail service in Spain’s northeastern Catalonia region has been suspended after a Barcelona commuter train crash killed one person and injured 37 others",
      "url": "https://abcnews.go.com/International/wireStory/train-crashes-spain-killing-1-person-129411090",
      "published": "Wed, 21 Jan 2026 09:16:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Cold and dark: UN rights chief condemns Russian strikes on Ukraine’s power grid",
      "description": "Russian attacks on Ukraine’s energy infrastructure have cut heat, electricity and water to hundreds of thousands of civilians in freezing winter conditions, prompting the UN human rights chief to denounce the strikes as “cruel” and a clear violation of international law.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166798",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli UN ambassador sends stark warning to Iran amid growing unrest",
      "description": "Israel warns Iran not to test its military readiness amid tensions over ballistic missiles and nuclear capabilities following summer 2025 operations.",
      "url": "https://www.foxnews.com/world/israeli-un-ambassador-sends-stark-warning-iran-amid-growing-unrest",
      "published": "Tue, 20 Jan 2026 19:38:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Apple overtakes Samsung in phones sales worldwide",
      "description": "After 14 years behind Samsung, Apple is back on top in global smartphone sales, just as Chinese rivals step up the pressure. Foldables and advanced AI are the new battleground in the fight for the next billion users.",
      "url": "https://www.dw.com/en/apple-overtakes-samsung-in-phones-sales-worldwide/a-75448316?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 09:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Mozambique floods heighten disease, malnutrition risks – UN agencies",
      "description": "Catastrophic flooding across Mozambique is devastating lives and livelihoods, sharply increasing the risk of disease outbreaks and malnutrition, while also forcing dangerous wildlife – including crocodiles – into flooded urban areas, the UN warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166793",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "World Economic Forum boots Iranian foreign minister from Davos summit amid deadly crackdown on protesters",
      "description": "World Economic Forum withdraws Iranian foreign minister's Davos invitation amid deadly nationwide protests that have killed thousands of civilians.",
      "url": "https://www.foxnews.com/world/world-economic-forum-boots-iranian-foreign-minister-from-davos-summit-amid-deadly-crackdown-protesters",
      "published": "Mon, 19 Jan 2026 09:49:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Australians to perform acts of kindness on national day of mourning for Bondi terror attack victims",
      "description": "Mitzvahs – or charitable acts – will include preparing meals for vulnerable communities while the Sydney Opera House will host a memorial service Get our breaking news email , free app or daily news podcast Thousands of Australians are expected to perform acts of kindness on Thursday to commemorate the victims of last month’s Bondi terror attack , as the Jewish tradition of mitzvah spreads across faiths and backgrounds. A mitzvah , which is a core value in Judaism , has come to mean any charitable act and is being requested of Australians to mark the national day of mourning . Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/australians-to-perform-acts-of-kindness-on-national-day-of-mourning-for-bondi-terror-attack-victims-ntwnfb",
      "published": "Wed, 21 Jan 2026 14:00:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Greetings from Kalk Bay, a South African fishing village where wild seals await scraps",
      "description": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "url": "https://www.npr.org/2026/01/21/g-s1-106277/south-africa-kalk-bay",
      "published": "Wed, 21 Jan 2026 10:10:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Spain: Driver killed, passengers injured in new train crash",
      "description": "A commuter train has crashed near Barcelona in northeastern Spain. The accident comes days after a deadly high-speed train collision in Andalusia killed 42.",
      "url": "https://www.dw.com/en/spain-driver-killed-passengers-injured-in-new-train-crash/a-75586098?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 00:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘Alarming’ increase in use of death penalty last year, despite global trend towards abolition",
      "description": "Despite a downward trend in the use of the death penalty globally, 2025 saw an ‘alarming’ increase in the number of executions in a small number of retentionist countries, the UN human rights office (OHCHR) warned on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166789",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Illegal immigrant accused in DUI crash that killed college soccer player, girlfriend: report",
      "description": "Immigration detainer issued for suspect accused of fatal DUI crash that killed two young people, including college student-athlete in North Carolina.",
      "url": "https://www.foxnews.com/us/illegal-immigrant-accused-dui-crash-killed-college-soccer-player-girlfriend-report",
      "published": "Tue, 20 Jan 2026 15:39:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Denied mourning: The ordeal of the family of Robina Aminian, killed in Iran",
      "description": "Robina Aminian, 23, is one of thousands of victims of the Iranian state's recent crackdown on anti-regime protesters. The young woman was shot in the back of the head on January 8 during a protest in Tehran. Her aunt, living in Norway, spoke to FRANCE 24 about the personal and bureaucratic torment the family was subjected to after her niece’s death.",
      "url": "https://www.france24.com/en/middle-east/20260121-denied-mourning-the-ordeal-of-the-family-of-robina-aminian-killed-in-iran",
      "published": "Wed, 21 Jan 2026 13:24:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Shifting global norms: Trump embracing 'different logic of power, defying international law'",
      "description": "François Picard is pleased to welcome Kethevane Gorjestani & Patrice Paoli, former diplomat / spokesperson for the French government in Arabic. He offers a candid assessment of shifting global dynamics, particularly in response to US foreign policy under a combative, unpredictable President Donald Trump. At a time when traditional alliances and multilateral institutions face mounting pressure, Ambassador Paoli argues that Europe must step up with a clear, unified voice to defend international law, multilateralism, and cooperative engagement.",
      "url": "https://www.france24.com/en/video/20260121-shifting-global-norms-trump-embracing-different-logic-of-power-defying-international-law",
      "published": "Wed, 21 Jan 2026 11:17:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "The US attack on Venezuela and the collapse of international law",
      "description": "The intervention exposes how great-power geopolitics have hollowed out the UN Charter system.",
      "url": "https://www.aljazeera.com/opinions/2026/1/21/the-us-attack-on-venezuela-and-the-collapse-of-international-law?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 11:32:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Senegalese city of Saint-Louis threatened by rising sea levels",
      "description": "Senegal's former capital Saint-Louis, a coastal city and UNESCO World Heritage site, is threatened by rising sea levels caused by climate change. Estimates show that 70 percent of the city could disappear underwater by 2100. Thousands of fishermen have already been relocated. Our France 2 colleagues report, with FRANCE 24's Lauren Bain.",
      "url": "https://www.france24.com/en/tv-shows/focus/20260121-senegalese-city-of-saint-louis-threatened-by-rising-sea-levels",
      "published": "Wed, 21 Jan 2026 12:54:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Fukushima nuclear plant operator restarts reactor at another plant, reviving safety concerns",
      "description": "The utility that operates the Fukushima plant that melted down in 2011 restarted a reactor at the world’s largest nuclear power plant, which it also operates in north-central Japan",
      "url": "https://abcnews.go.com/International/wireStory/fukushima-nuclear-plant-operator-restarts-reactor-plant-reviving-129412146",
      "published": "Wed, 21 Jan 2026 06:09:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti explained: why the crisis is deepening — and what comes next",
      "description": "Haiti is entering 2026 facing one of the most complex crises in its recent history. On Wednesday, the Caribbean island nation will be high on the international agenda as the UN Security Council holds its first meeting of the year to update ambassadors.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166801",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At the edge of war: the Central African Republic's uneasy border with Sudan",
      "description": "The land flattens on the approach to Birao, a cut-off town ringed by savannah in the far north of the Central African Republic, where roads dissolve into dust and motorcycles vastly outnumber cars. Less than two hours’ drive from the Sudanese border, this is the edge of a fractured country still piecing itself back together, while absorbing the shockwaves of a neighboring conflict.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166794",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Gunman jailed for life in killing of Japan ex-PM Shinzo Abe",
      "description": "The gunman charged with killing Japan's former prime minister Shinzo Abe was found guilty January 21 and jailed for life. The shooting more than three years ago forced a reckoning in a country with little experience of gun violence, and ignited scrutiny of alleged ties between prominent conservative lawmakers and a secretive sect, the Unification Church.",
      "url": "https://www.france24.com/en/gunman-jailed-for-life-in-killing-of-japan-ex-pm-shinzo-abe",
      "published": "Wed, 21 Jan 2026 10:45:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Train driver killed in second deadly Spain rail crash in days",
      "description": "At least 37 people have been injured, five seriously, in a second crash, after Sunday's two-train collision in Andalusia.",
      "url": "https://www.bbc.com/news/articles/c1m78xl0gmpo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 09:55:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Spain suffers second deadly train crash in space of two days",
      "description": "A train driver has been killed and 37 people injured after a commuter train derailed near Barcelona.",
      "url": "https://news.sky.com/story/driver-killed-and-20-injured-after-train-derails-near-barcelona-13496913",
      "published": "Tue, 20 Jan 2026 23:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Thousands of workers flee Cambodia scam centres, officials say",
      "description": "Amnesty International deeply concerned for scores of people ‘walking around in search of assistance’ Thousands of people, including suspected victims of human trafficking, are estimated to have been released or escaped from scam compounds across Cambodia over recent days, after growing international pressure to crackdown on the multibillion-dollar industry. The Indonesian embassy in Phnom Penh said it had received reports from 1,440 of its nationals who had been released from scam centres, while large queues of Chinese nationals were also seen outside the Chinese embassy. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/thousands-of-workers-flee-cambodia-scam-centres-officials-say",
      "published": "Wed, 21 Jan 2026 06:55:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Georgia teen arrested after father turns him in following pair of shootings, police say",
      "description": "Georgia father turns in his own 16-year-old son to police after teen allegedly shot juvenile in face and neck during vehicle attack in Lovejoy area, according to police.",
      "url": "https://www.foxnews.com/us/georgia-teen-arrested-after-father-turns-him-following-pair-shootings-police-say",
      "published": "Wed, 21 Jan 2026 03:00:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "American flags torched, riot police clash with protesters ahead of Trump Davos arrival",
      "description": "Swiss riots erupt in multiple cities as anti-Trump protesters march against President Trump's World Economic Forum appearance, with police deploying water cannons.",
      "url": "https://www.foxnews.com/world/american-flags-torched-riot-police-clash-protesters-trump-davos-arrival",
      "published": "Tue, 20 Jan 2026 20:11:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Colombian ex-paramilitary leader jailed for crimes against Indigenous groups",
      "description": "Salvatore Mancuso given 40-year sentence, which could be reduced after truth and reparation activities A Colombian court has sentenced a former paramilitary leader to 40 years in prison for crimes committed against Indigenous communities in the province of La Guajira, including homicides, forced disappearances and the displacement of people from 2002 to 2006. The special tribunal that hears cases from the country’s armed conflict said in its ruling that Salvatore Mancuso was responsible for 117 crimes committed by fighters under his command in La Guajira. However, it added that Mancuso’s time in prison could be reduced to eight years, if he collaborated with truth and reparation activities that benefited victims of his former paramilitary group. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/colombia-ex-paramilitary-leader-salvatore-mancuso-jailed-crimes-against-indigenous-groups",
      "published": "Tue, 20 Jan 2026 12:12:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Shinzo Abe’s killer sentenced to life in prison over shooting of Japanese former PM",
      "description": "Abe was killed by Tetsuya Yamagami in 2022 while campaigning in the city of Nara, a shooting that shocked Japan, where gun crime is almost unheard of A court in Japan has sentenced the assassin of former prime minister Shinzo Abe to life in prison – a case that shocked the public and exposed politicians’ ties to an influential religious group. Tetsuya Yamagami, 45, had earlier pleaded guilty to killing Abe in July 2022 as he was making an election campaign speech in the western city of Nara. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/tetsuya-yamagami-assassinated-shinzo-abe-japan-life-sentence",
      "published": "Wed, 21 Jan 2026 05:21:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump says 'I won't use force' to obtain Greenland in Davos speech",
      "description": "The U.S. president is in Davos, Switzerland for the World Economic Forum's annual meeting. Trump's push to acquire Greenland has turned to antagonism toward allies in recent days.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5683078/trump-davos-speech-tariffs-greenland",
      "published": "Wed, 21 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "USAID cuts: 'If aid stops in a day, no one can adapt,' NGO Solidarités International says",
      "description": "A year on from the US announcing it was stopping all international aid, one leading charity has spoken to FRANCE 24 about how it is impossible to fill the gap and no one ever will. Just over a month after the announcement, 83 percent of USAID had been terminated, representing around 40 percent of all international aid. We spoke to Kevin Goldberg, who is executive director of the NGO Solidarités International. He told us that they are used to dealing with emergencies, but this was on a scale they had never seen before.",
      "url": "https://www.france24.com/en/tv-shows/perspective/20260121-usaid-cuts-if-aid-stops-in-a-day-no-one-can-adapt-ngo-solidarit%C3%A9s-international-says",
      "published": "Wed, 21 Jan 2026 14:37:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump attacks on NATO allies sideline efforts to support Ukraine",
      "description": "Attacks by Donald Trump against his NATO allies over Greenland, the Chagos islands and the future of global security have sidelined critical plans to secure new support for Ukraine.",
      "url": "https://news.sky.com/story/trump-attacks-on-nato-allies-and-calls-for-greenland-sideline-efforts-to-support-ukraine-13497086",
      "published": "Wed, 21 Jan 2026 11:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Guterres in London: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ISIS takes credit for Kabul suicide bombing at Chinese restaurant",
      "description": "ISIS-K claims responsibility for deadly suicide blast at Chinese restaurant in Kabul, killing seven people, including one Chinese national.",
      "url": "https://www.foxnews.com/world/isis-takes-credit-kabul-suicide-bombing-chinese-restaurant",
      "published": "Tue, 20 Jan 2026 08:24:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Three journalists among 11 Palestinians killed in Israel’s attacks on Gaza",
      "description": "The three journalists worked for a committee supervising Egyptian aid in Gaza and were documenting a newly set-up camp.",
      "url": "https://www.aljazeera.com/news/2026/1/21/three-journalists-among-11-palestinians-killed-in-israels-attacks-on-gaza?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 14:42:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Nigerian troops rescue 62 hostages in crackdown on armed gangs, army says",
      "description": "Nigerian troops have freed 62 hostages - and killed two militants in a separate operation - as part of an ongoing offensive against armed gangs, the army has said.",
      "url": "https://news.sky.com/story/nigerian-troops-rescue-62-hostages-in-crackdown-on-armed-gangs-army-says-13497081",
      "published": "Wed, 21 Jan 2026 11:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Illegal immigrant allegedly ran from deadly wrong-way DUI crash that killed motorcyclist, records show",
      "description": "Deadly wrong-way crash on Tennessee interstate leads to vehicular homicide charges against suspect now held for ICE after allegedly fleeing scene.",
      "url": "https://www.foxnews.com/us/illegal-immigrant-ran-from-deadly-wrong-way-dui-crash-killed-motorcyclist-records-show",
      "published": "Tue, 20 Jan 2026 19:28:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Florida madman stalked tourists near Disney before allegedly killing them in random attack: family",
      "description": "Three men attending Florida car show allegedly gunned down by neighbor while waiting for rental car assistance. Random shooting shocks community.",
      "url": "https://www.foxnews.com/us/florida-madman-stalked-tourists-near-disney-before-allegedly-killing-them-random-attack-family",
      "published": "Tue, 20 Jan 2026 18:09:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Europol busts Europe-wide drug ring in ‘largest-ever’ operation",
      "description": "Hague-based agency for fighting international and organised crime says it has dealt 'massive blow' to narco traffickers.",
      "url": "https://www.aljazeera.com/news/2026/1/21/europol-busts-europe-wide-drug-ring-in-largest-ever-op?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:12:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘Barbaric new era’: Palestinians, UN slam Israeli demolition of UNRWA HQ",
      "description": "Head of UN agency for Palestinian refugees says demolition in East Jerusalem is 'blatant breach of international law'.",
      "url": "https://www.aljazeera.com/news/2026/1/21/barbaric-new-era-palestinians-un-slam-israeli-demolition-of-unrwa-hq?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 11:12:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "New ceasefire reached between Syria's military and Kurdish-led forces",
      "description": "After clashes resumed between Syria's military and the Kurdish-led Syrian Democratic Forces a new ceasefire agreement was reached on January 20. Syria's government said it will give the SDF four days to establish an integration plan for Hasakahh province or risk state forces entering the area. This follows the breakdown of a previous agreement between the two parties.",
      "url": "https://www.france24.com/en/new-ceasefire-reached-between-syria-s-military-and-kurdish-led-forces",
      "published": "Wed, 21 Jan 2026 12:21:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran locks nation into ‘darker’ digital blackout, viewing internet as an ‘existential threat’",
      "description": "Iran enters 22nd day of internet shutdown with limited connectivity restored as NetBlocks reports shift toward \"filternet plus\" censorship scheme whitelisting only business services.",
      "url": "https://www.foxnews.com/world/iran-locks-nation-darker-digital-blackout-viewing-internet-existential-threat",
      "published": "Mon, 19 Jan 2026 16:33:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Top GOP senator says Syria ceasefire welcome but actions must match words",
      "description": "Syria reaches fragile ceasefire with Kurdish forces as U.S. senator warns about reported crimes by government troops during military operation against SDF.",
      "url": "https://www.foxnews.com/world/top-gop-senator-says-syria-ceasefire-welcome-actions-must-match-words",
      "published": "Mon, 19 Jan 2026 11:42:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Global markets on alert as Europe to suspend approval of US trade deal",
      "description": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland.",
      "url": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 06:10:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Life sentence for man who killed Japan's ex-PM Shinzo Abe",
      "description": "Abe's assassination stunned the country where there is virtually no gun crime.",
      "url": "https://www.bbc.com/news/articles/c86v5lj39zpo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 11:01:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Key takeaways from Trump’s one-year anniversary briefing",
      "description": "Immigration crackdowns, protests, and escalating global chaos have defined the second Trump administration.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/21/key-takeaways-from-trumps-one-year-anniversary-briefing?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 13:01:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "New Zealand prime minister sets date for 2026 election",
      "description": "Cost of living likely to dominate the agenda ahead of 7 November poll as centre-right National party battles to retain power The prime minister, Christopher Luxon, has announced New Zealand’s next general election will be held on 7 November, kickstarting a campaign cycle that could become one of the country’s most contested in years. On Wednesday, Luxon told reporters the National party would continue its agenda to “fix the basics and build the future”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/new-zealand-prime-minister-sets-date-for-2026-election",
      "published": "Wed, 21 Jan 2026 02:55:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria : Did Washington \"abandon\" the Kurds?",
      "description": "Syria's government and the Kurdish-led Syrian Democratic Forces agreed a new ceasefire on January 20 as Washington said the SDF's purpose in fighting Islamic State group jihadists was largely over. The announcement came after the army sent reinforcements to the Kurds' province stronghold in the northeast. FRANCE 24's Wassim Nasr breaks it down for us.",
      "url": "https://www.france24.com/en/syria-did-washington-abandon-the-kurds-1",
      "published": "Wed, 21 Jan 2026 12:24:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Minnesota: ICE force US citizen from his home",
      "description": "Federal immigration agents forced open a door and detained a US citizen in his Minnesota home at gunpoint without a warrant then led him out onto the streets in his underwear in subfreezing conditions.",
      "url": "https://www.france24.com/en/video/20260121-minnesota-ice-force-us-citizen-from-his-home-1",
      "published": "Wed, 21 Jan 2026 11:07:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria: Did Washington \"abandon\" the Kurds?",
      "description": "Syria's government and the Kurdish-led Syrian Democratic Forces agreed a new ceasefire on January 20 as Washington said the SDF's purpose in fighting Islamic State group jihadists was largely over. The announcement came after the army sent reinforcements to the Kurds' province stronghold in the northeast. FRANCE 24's Wassim Nasr breaks it down for us.",
      "url": "https://www.france24.com/en/syria-did-washington-abandon-the-kurds",
      "published": "Wed, 21 Jan 2026 10:56:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Investigation in Spanish train collision \"could take months\"",
      "description": "A high-speed train in southern Spain derailed on January 18, colliding with another high-speed train, killing at least 42 people and injuring more than 150, Spanish authorities reported. Two days later, another train crashed into a wall which had fell onto the train tracks. Despite safety concerns regarding the railway system, authorities say investigation into the first incident could take months. FRANCE 24's Sarah Morris has more from Madrid.",
      "url": "https://www.france24.com/en/investigation-in-spanish-train-collision-could-take-months",
      "published": "Wed, 21 Jan 2026 10:47:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ambush in northwest Nigeria kills 5 soldiers and 1 police officer",
      "description": "The Nigerian army reports that five soldiers and one police officer have been killed in an ambush in Zamfara state",
      "url": "https://abcnews.go.com/International/wireStory/ambush-northwest-nigeria-kills-5-soldiers-1-police-129411215",
      "published": "Wed, 21 Jan 2026 04:41:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown",
      "description": "The images from one mortuary in Tehran were shown to families who went to identify their loved ones.",
      "url": "https://www.bbc.com/news/articles/c0r4957rq8ro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 05:56:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukraine's parliament and half of Kyiv with no heating after Russian strikes",
      "description": "President Zelensky says Russia has started using \"far more\" ballistic missiles in its attacks on Ukraine.",
      "url": "https://www.bbc.com/news/articles/cwy1lpgqenxo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 18:40:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Greenland: Trump says he 'won't use force' to take island",
      "description": "US President Donald Trump rolled back threats of open conflict, but said the US would remember if it is denied Greenland. Meanwhile, France suggested organizing a \"NATO exercise\" on the island. DW has more.",
      "url": "https://www.dw.com/en/greenland-trump-says-he-won-t-use-force-to-take-island/live-75588065?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 10:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Danish veterans of US wars feel betrayed by Trump's threats against Greenland",
      "description": "Danish veterans feel betrayed as the U.S. escalates threats to seize Greenland, a territory of Denmark",
      "url": "https://abcnews.go.com/International/wireStory/danish-veterans-us-wars-feel-betrayed-trumps-threats-129411330",
      "published": "Wed, 21 Jan 2026 04:49:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Food insecurity in Lebanon, Libya migrants freed, UNHCR tackles multiple emergencies – despite cuts",
      "description": "Since 2026, nearly 17 percent of Lebanon’s population has been living in a state of major food insecurity – a situation that is likely to worsen in the coming year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166787",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen: Children are dying and it’s going to get worse, warns aid veteran",
      "description": "In Yemen, renewed political instability and economic woes linked to the war threaten to complicate the already difficult task of helping vulnerable people suffering from deepening hunger, illness and displacement, the UN’s top aid official there said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166786",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Leftist pastor calls Minnesota church invasion divine judgment on 'MAGA evangelicals' amid DOJ probe",
      "description": "Federal officials investigate alleged civil rights violations after ICE protesters disrupted Minnesota church service, sparking Christian debate.",
      "url": "https://www.foxnews.com/us/leftist-pastor-calls-minnesota-church-invasion-divine-judgment-maga-evangelicals-amid-doj-probe",
      "published": "Tue, 20 Jan 2026 17:53:39 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Top EU official warns Trump's tariff threat over Greenland pushback is 'a mistake'",
      "description": "EU chief calls President Donald Trump's Greenland tariff threats \"a mistake\" as European leaders warn of downward spiral in transatlantic trade relations.",
      "url": "https://www.foxnews.com/world/top-eu-official-warns-trumps-tariff-threat-over-greenland-pushback-a-mistake",
      "published": "Tue, 20 Jan 2026 13:23:56 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UN strongly condemns demolition of UNRWA headquarters in East Jerusalem",
      "description": "The reported demolition underway early Tuesday of the headquarters of UN agency UNRWA by Israeli forces in occupied East Jerusalem - reportedly “under the watch of lawmakers and a member of the Government” - has prompted swift condemnation from the global body.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166792",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Germany's rail service dealt major blow by government",
      "description": "The government is reportedly walking back promises to fund major projects for national train operator Deutsche Bahn. DB is beset by chronic punctuality problems, decrepit infrastructure and a lack of investment.",
      "url": "https://www.dw.com/en/germany-s-rail-service-dealt-major-blow-by-government/a-75590884?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 11:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "NATO chief aims to deescalate Europe-US crisis as Davos braces for Trump",
      "description": "NATO chief Mark Rutte said Wednesday \"thoughtful diplomacy\" was needed to deal with tensions over Greenland, as President Donald Trump headed to Davos pushing US claims on the territory. Rutte has sought to deflect Trump's interest in the Danish autonomous territory into a broader discussion at NATO on bolstering Arctic security and has dismissed the crisis could cause the collapse of NATO. FRANCE 24's Angela Diffley tells us more.",
      "url": "https://www.france24.com/en/nato-chief-aims-to-deescalate-europe-us-crisis-as-davos-braces-for-trump",
      "published": "Wed, 21 Jan 2026 11:37:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Cause of death revealed weeks after woman died following Universal Orlando ride: report",
      "description": "Authorities released the identity and cause of death of a 70-year-old woman months after she died following a ride on Universal Orlando’s Revenge of the Mummy roller coaster.",
      "url": "https://www.foxnews.com/us/cause-death-revealed-weeks-after-woman-died-following-universal-orlando-ride-report",
      "published": "Wed, 21 Jan 2026 01:44:21 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Air India crash plane had record of safety defects, campaigners claim",
      "description": "Campaigners say they have evidence the plane had previously suffered a series of technical failures, including a fire.",
      "url": "https://www.bbc.com/news/articles/czx1p47x589o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 00:00:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland’s strategic position in seven maps: Why Trump wants the island",
      "description": "The world’s largest island sits in the Arctic Circle and is strategically and economically valuable.",
      "url": "https://www.aljazeera.com/news/2026/1/21/greenlands-strategic-position-in-seven-maps-why-trump-wants-the-island?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 13:56:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Fear grips Nigerian village after mass church kidnapping",
      "description": "Armed attackers abducted over 170 people from three churches in northern Nigeria.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/21/fear-grips-nigerian-village-after-mass-church-kidnapping?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:49:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "‘Rupture in the world order’: Speeches by Carney, world leaders in Davos",
      "description": "World leaders, rattled by Trump's latest gambit in Greenland, look to present united front at World Economic Forum.",
      "url": "https://www.aljazeera.com/economy/2026/1/21/rupture-in-the-world-order-speeches-by-carney-world-leaders-at-davos?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:39:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump live news: US president says ‘won’t use force’ to acquire Greenland",
      "description": "The US president, at the World Economic Forum, says he'll have 'many meetings' on Greenland as Europe tensions simmer.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/21/trump-live-news-us-president-in-davos-as-greenland-threats-spark-outrage?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:05:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Veteran diplomat on Trump's objectives with his World Economic Forum speech",
      "description": "NPR's Leila Fadel asks veteran diplomat Richard Haass about President Trump's objectives with his address to the World Economic Forum in Switzerland.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5683098/veteran-diplomat-on-trumps-objectives-with-his-world-economic-forum-speech",
      "published": "Wed, 21 Jan 2026 06:46:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Former president of Ireland talks about Trump's plan for his Board of Peace",
      "description": "What is President Trump's Board of Peace actually for? NPR's Leila Fadel asks Mary Robinson, former president of Ireland and member of The Elders, a group of world leaders who advocate for peace.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5683093/former-president-of-ireland-talks-about-trumps-plan-for-his-board-of-peace",
      "published": "Wed, 21 Jan 2026 04:47:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump delivers highly awaited speech at World Economic Forum",
      "description": "President Trump delivers a highly anticipated speech in Davos, Switzerland, amid major splits with allies over his plans to take over the Danish territory of Greenland.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5683140/trump-delivers-highly-awaited-speech-at-world-economic-forum",
      "published": "Wed, 21 Jan 2026 04:47:05 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Free solo climb on Netflix: 'If you fall, you're gonna die'",
      "description": "Rock climber Alex Honnold plans to scale the facade of what was once the world's tallest building – live on Netflix. But not all are impressed by the idea.",
      "url": "https://www.dw.com/en/free-solo-climb-on-netflix-if-you-fall-you-re-gonna-die/a-75580558?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 09:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US and Europe \"need each other\" says NATO chief at Davos",
      "description": "US President Donald Trump touched down in a tense Davos on Wednesday to give an \"America First\" speech that will push his world-shaking bid to seize control of Greenland. Trump's claims over the Danish territory have dominated the meeting in the Swiss ski resort, where Trump landed by helicopter. His arrival comes amid growing tensions with the US European allies, which NATO chief Mark Rutte is trying to deescalate.",
      "url": "https://www.france24.com/en/us-and-europe-need-each-other-says-nato-chief-at-davos",
      "published": "Wed, 21 Jan 2026 15:05:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine endures a bitter winter after Russian attacks as peace efforts overshadowed",
      "description": "Ukrainian President Volodymyr Zelenskyy says about 4,000 buildings in Kyiv remain without heating, and nearly 60% of the city is without power following days of Russian attacks on Ukraine’s power grid",
      "url": "https://abcnews.go.com/International/wireStory/ukraine-endures-bitter-winter-after-russian-attacks-peace-129418924",
      "published": "Wed, 21 Jan 2026 10:33:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump set to meet with foreign leaders at the World Economic Forum and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/trump-set-meet-foreign-leaders-world-economic-forum-more-top-headlines",
      "published": "Wed, 21 Jan 2026 06:40:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Top Trump admin education official exposes blue state financial aid fraud offenders",
      "description": "Trump education official exposes $1 billion student aid fraud scheme, with California and Minnesota identified as hubs for college scammers nationwide.",
      "url": "https://www.foxnews.com/us/top-trump-admin-education-official-exposes-blue-state-financial-aid-fraud-offenders",
      "published": "Wed, 21 Jan 2026 06:00:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump floats ‘Board of Peace’ to replace UN, signals major global power shift",
      "description": "President Donald Trump invited dozens of countries including Russia, China, and Ukraine to join his Board of Peace initiative, with a signing ceremony planned for Davos, Switzerland.",
      "url": "https://www.foxnews.com/world/trump-floats-board-peace-replace-un-signals-major-global-power-shift",
      "published": "Tue, 20 Jan 2026 17:36:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Second lady Usha Vance announces she is pregnant with fourth child",
      "description": "Vance posted on social media that she is looking forward to welcoming a boy in late July.",
      "url": "https://www.bbc.com/news/articles/crkr7z7ky6po?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 23:50:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia parliament passes gun reform and anti-hate bills after Bondi shooting",
      "description": "The reforms are in response to Australia's worst mass shooting in decades at a Jewish festival in December.",
      "url": "https://www.bbc.com/news/articles/c20ge5qwdl2o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 15:11:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Video: Syria SDF ‘outlived usefulness to US’ explains Al Jazeera reporter",
      "description": "Syria’s army has taken control of a large part of the country that had been under the Kurdish-led SDF.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/21/video-syria-sdf-outlived-usefulness-to-us-explains-al-jazeera-reporter?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:39:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Killer of Japan’s former PM Shinzo Abe sentenced to life in prison",
      "description": "The man who killed Japan’s former Prime Minister Shinzo Abe in 2022 has been sentenced to life in prison.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/21/killer-of-japans-former-pm-shinzo-abe-sentenced-to-life-in-prison?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 11:38:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Blinken and British counterpart signal trans-Atlantic unity with visit to Ukraine",
      "description": "Secretary of State Antony Blinken and his British counterpart, David Lammy, are raising alarms about Iranian ballistic missiles in Russia that threaten Ukraine.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5106395/blinken-and-british-counterpart-signal-transatlantic-unity-with-visit-to-ukraine",
      "published": "Wed, 21 Jan 2026 07:05:29 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea jails ex-PM Han Duck-soo over martial law crisis",
      "description": "A South Korean court has delivered a lengthy prison sentence to a former prime minister over his role in the political turmoil triggered by ex-President Yoon Suk Yeol declaring martial law over a year ago.",
      "url": "https://www.dw.com/en/south-korea-jails-ex-pm-han-duck-soo-over-martial-law-crisis/a-75586886?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 06:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Film show: Pierre Niney is a 'Guru' with a dark side",
      "description": "Manon Kerjean tells us why Pierre Niney's performance in \"Gourou\" recalls the punchy rhetoric of American coaches in Yann Gozlan's latest film. But first, we discuss the big winners at this year's Lumières awards, selected by the foreign press in Paris, as François Ozon's adaptation of \"L'Étranger\" picks up the top prize. Manon also tells us why Erige Sehiri's film \"Promised Sky\" provides an insight into the socio-political reality in Tunisia and raises powerful points about families, both biological and chosen. Plus we check out the film adaptation of the beloved French comic \"Les Légendaires\".",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260121-film-show-pierre-niney-is-a-guru-with-a-dark-side",
      "published": "Wed, 21 Jan 2026 14:34:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Man who killed former Japanese PM Shinzo Abe jailed for life",
      "description": "A man has been sentenced to life in prison for assassinating former Japanese prime minister Shinzo Abe, according to public broadcaster NHK.",
      "url": "https://news.sky.com/story/man-who-killed-former-japanese-prime-minister-shinzo-abe-jailed-for-life-13496930",
      "published": "Wed, 21 Jan 2026 05:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Surfer 'lucky to survive' Sydney's fourth shark attack in three days",
      "description": "A surfer has become the latest victim of a shark attack in Australia - the fourth off Sydney in just three days.",
      "url": "https://news.sky.com/story/surfer-lucky-to-survive-sydneys-fourth-shark-attack-in-three-days-13496507",
      "published": "Tue, 20 Jan 2026 08:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting",
      "description": "Australia's politicians have fast-tracked reforms to toughen gun control and hate crime laws in response to December's Bondi Beach shooting.",
      "url": "https://news.sky.com/story/australia-fast-tracks-tougher-gun-and-hate-laws-after-bondi-beach-shooting-13496476",
      "published": "Tue, 20 Jan 2026 07:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany arrests woman accused of supplying war-related information to Russian agent",
      "description": "Prosecutors say German authorities have arrested a woman accused of supplying information related to Russia’s war in Ukraine to a Russian intelligence agent and helping to get him access to political events in Berlin",
      "url": "https://abcnews.go.com/International/wireStory/germany-arrests-woman-accused-supplying-war-related-information-129417238",
      "published": "Wed, 21 Jan 2026 08:58:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "New Zealand election scheduled for Nov. 7 with the costs of living and housing the top issues",
      "description": "New Zealand Prime Minister Christopher Luxon has announced a national election will be held Nov. 7",
      "url": "https://abcnews.go.com/International/wireStory/new-zealand-election-scheduled-nov-7-costs-living-129403716",
      "published": "Tue, 20 Jan 2026 22:01:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Missouri couple accused of locking teens in chicken pen, shooting them with BB guns in abuse case",
      "description": "A Missouri couple is accused of locking teens in a chicken pen and shooting them with BB guns in an alleged abuse case. Both were arrested and held without bond.",
      "url": "https://www.foxnews.com/us/missouri-couple-accused-locking-teens-chicken-pen-shooting-them-bb-guns-abuse-case",
      "published": "Tue, 20 Jan 2026 21:17:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Indiana judge in bizarre Natalia Grace case shot in home attack as police hunt suspect",
      "description": "Indiana judge who presided over controversial Natalia Grace case allegedly shot at home by unknown suspect. Both judge and wife in stable condition.",
      "url": "https://www.foxnews.com/us/indiana-judge-bizarre-natalia-grace-case-shot-home-attack-police-hunt-suspect",
      "published": "Tue, 20 Jan 2026 17:30:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota police chiefs allege some ICE agents racially profiled US citizens, including off-duty officers",
      "description": "Minnesota police chiefs report federal immigration officers allegedly racially profiled American citizens and off-duty cops during enforcement operations.",
      "url": "https://www.foxnews.com/us/minnesota-police-chiefs-allege-some-ice-agents-racially-profiled-us-citizens-including-off-duty-officers",
      "published": "Tue, 20 Jan 2026 14:34:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Suspect uttered 4 words before shooting Indiana judge and wife: dispatch audio",
      "description": "A shooter shot a Lafayette judge and his wife at their home before fleeing the scene. Steven and Kimberly Meyer are stable as the manhunt continues in Indiana.",
      "url": "https://www.foxnews.com/us/suspected-uttered-4-words-before-shooting-indiana-judge-wife-dispatch-audio",
      "published": "Tue, 20 Jan 2026 12:31:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US drug overdose deaths plummet 20% as Trump administration cracks down on southern border",
      "description": "Drug overdose deaths plummeted over 20% as border enforcement tightened, new CDC data shows. Experts suggest stronger policies may curb fentanyl flow.",
      "url": "https://www.foxnews.com/us/us-drug-overdose-deaths-plummet-20-trump-administration-cracks-down-southern-border",
      "published": "Tue, 20 Jan 2026 11:19:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fourth shark attack in three days rocks Australia as authorities close beaches and deploy drumlines",
      "description": "A string of shark attacks near Sydney prompted beach closures across New South Wales. The latest victim attacked at Point Plomer suffered only minor cuts.",
      "url": "https://www.foxnews.com/world/fourth-shark-attack-three-days-rocks-australia-authorities-close-beaches-deploy-drumlines",
      "published": "Tue, 20 Jan 2026 07:24:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US veteran gets 5 years in Russian prison after authorities reportedly force him to dock with firearm onboard",
      "description": "U.S. Navy veteran Charles Wayne Zimmerman was sentenced to 5 years in Russian prison after allegedly failing to declare a firearm oboard his yacht in Sochi port.",
      "url": "https://www.foxnews.com/world/us-veteran-gets-5-years-russian-prison-authorities-reportedly-force-him-dock-firearm",
      "published": "Mon, 19 Jan 2026 18:06:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli PM Netanyahu agrees to join Trump's Board of Peace",
      "description": "Israel is the latest country to publicly accept an invitation to Trump's new organisation, joining Albania, Bahran, Hungary, Morocco and the UAE.",
      "url": "https://www.bbc.com/news/articles/cn8jek4vv8ko?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 15:14:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Nigeria police confirm mass church abductions after previous denial",
      "description": "More than 160 people were reportedly taken from three churches in the northern Kaduna state.",
      "url": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 13:08:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "UK defends Chagos deal after Trump calls it 'act of great stupidity'",
      "description": "The US president says it is \"another in a very long line of National Security reasons why Greenland has to be acquired\".",
      "url": "https://www.bbc.com/news/articles/c0mkp021rvro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 20:33:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "‘Serious mistake’: there’s no benefit for Australia in joining Donald Trump’s ‘board of peace’ – only risk",
      "description": "To tie ourselves to the worst excesses of the Trump regime would be an act of national sabotage Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The company you keep. Vladimir Putin, Viktor Orbán, Donald Trump. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/22/australia-trump-board-of-peace-risk-analysis",
      "published": "Wed, 21 Jan 2026 14:00:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Sydney Water blames food outlets for illegally adding to fatberg. But restaurants say ‘if it’s a problem, it’s their problem’",
      "description": "Huge spike in fats, oils and grease going to Malabar treatment plant follows 2017 changes to reporting regime and reduced inspections, critics say Get our breaking news email , free app or daily news podcast Sydney Water says up to 12,000 food businesses in the city’s south-west could be illegally discharging fats, oils and grease into the sewage catchment that flows to Malabar – home to a problematic fatberg that could be as big as four buses . The rise in restaurants and food manufacturers without proper grease traps and waste control measures is partly due to an increase in businesses overall. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/fatberg-poo-balls-sydney-businesses-could-be-illegally-discharging-waste",
      "published": "Wed, 21 Jan 2026 14:00:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mass walkout of shadow cabinet is only latest chapter in Nationals’ chaotic decline",
      "description": "Departure of all eight remaining frontbenchers was not sparked by principled policy differences, but by ego, ideology and arrogance Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast With so little fanfare that almost nobody noticed, the Nationals senators Bridget McKenzie and Ross Cadell first defied their colleagues on the floor of parliament nearly six months ago. Late one night in September, the pair voted with Pauline Hanson and One Nation on a motion about migration, ignoring the pleas of Coalition colleagues, including Liberal Anne Ruston, not to cross the floor. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/21/mass-walkout-of-shadow-cabinet-is-only-the-latest-chapter-in-the-nationals-chaotic-decline",
      "published": "Wed, 21 Jan 2026 12:02:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Kurds vs. Syrian government troops: What you need to know",
      "description": "Syria's government is trying to forcefully absorb a Syrian Kurdish paramilitary group that once controlled much of the country's northeast. The fight ultimately comes down to a clash about Syria's future governance.",
      "url": "https://www.dw.com/en/kurds-vs-syrian-government-troops-what-you-need-to-know/a-75580975?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 19:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about the trial in Hong Kong against Tiananmen vigil organizers",
      "description": "A national security trial for former organizers of Hong Kong’s Tiananmen Square vigil opens Thursday",
      "url": "https://abcnews.go.com/International/wireStory/trial-hong-kong-tiananmen-vigil-organizers-129404464",
      "published": "Wed, 21 Jan 2026 04:14:56 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Human trafficking depends on corruption at every step",
      "description": "In 2011, a trafficker in Chile was convicted for recruiting economically vulnerable Peruvian citizens and arranging for them to be brought into the country – destined to become victims of sexual exploitation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166797",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Alleged scam mastermind arrested after being exposed by BBC",
      "description": "Kuong Li featured in a 2023 BBC Eye investigation into alleged scam compounds in South East Asia.",
      "url": "https://www.bbc.com/news/articles/cwy8v31kkv1o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 23:43:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "New ceasefire in Syria after Kurdish-led forces pull out of camp for IS families",
      "description": "The government announces a four-day ceasefire with the SDF, which says it was \"compelled\" to withdraw its fighters from al-Hol camp.",
      "url": "https://www.bbc.com/news/articles/c4g39w8k8zwo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 19:12:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel's Somaliland recognition: Strategic ripples in Africa",
      "description": "Protests and defiance occurred in Somalia after Israel's recognition of the breakaway region of Somaliland. Analysts say it could inspire secessionist movements in other parts of the continent.",
      "url": "https://www.dw.com/en/israel-s-somaliland-recognition-strategic-ripples-in-africa/a-75590942?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 14:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany sees thousands join pro-Kurdish protests",
      "description": "German cities saw large pro-Kurdish demonstrations on Tuesday as Syrian government troops clash with Kurdish forces in northeastern Syria.",
      "url": "https://www.dw.com/en/germany-sees-thousands-join-pro-kurdish-protests/a-75586115?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 02:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Lobster roll à la parisienne: A French take on an American East Coast favourite",
      "description": "If you were asked to name great sandwiches in France, you might say ham and cheese on a baguette, or perhaps a traditional croque-monsieur. You probably wouldn't immediately think of a lobster roll. However, this American East Coast delicacy has been taking Paris by storm thanks to Moise Sfez. He's the creator of Homer Lobster, which now has five restaurants across Paris. He spoke to FRANCE 24's Delano D'Souza in Entre Nous.",
      "url": "https://www.france24.com/en/tv-shows/entre-nous/20260121-lobster-roll-%C3%A0-la-parisienne-a-french-take-on-an-american-east-coast-favourite",
      "published": "Wed, 21 Jan 2026 15:03:32 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "As fires in Chile burn, a mobile clinic fights to save furry survivors",
      "description": "Veterinarians and volunteers in Chile are racing to help animals affected by devastating fires",
      "url": "https://abcnews.go.com/International/wireStory/fires-chile-burn-mobile-clinic-fights-save-furry-129408759",
      "published": "Wed, 21 Jan 2026 01:25:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Barcelona commuter train crashes Tuesday night, two days after deadly train collision in Spain",
      "description": "Barcelona commuter train crashes Tuesday night, two days after deadly train collision in Spain",
      "url": "https://abcnews.go.com/International/wireStory/barcelona-commuter-train-crashes-tuesday-night-days-after-129397776",
      "published": "Tue, 20 Jan 2026 16:57:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota pastor condemns anti-ICE agitators who interrupted service: ‘Shameful and unlawful’",
      "description": "Anti-ICE protesters allegedly disrupted Minneapolis church service, shouting at parishioners in viral video. Pastor condemns 'shameful' intimidation.",
      "url": "https://www.foxnews.com/us/minnesota-pastor-condemns-anti-ice-agitators-interrupted-service-shameful-unlawful",
      "published": "Tue, 20 Jan 2026 18:15:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syrian government takes control of camp housing thousands linked to the Islamic State group",
      "description": "Syrian government forces have taken full control of camp in northeast Syria housing thousands of people linked to the Islamic State group",
      "url": "https://abcnews.go.com/International/wireStory/syrian-government-takes-control-camp-housing-thousands-linked-129411769",
      "published": "Wed, 21 Jan 2026 05:45:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters break free from Syrian jail amid chaotic government handover",
      "description": "U.S. military boosts regional presence with F-15 fighter jets and USS Abraham Lincoln deployment as ISIS prison break highlights security risks amid Syria's political realignment.",
      "url": "https://www.foxnews.com/world/isis-fighters-break-free-from-syrian-jail-amid-chaotic-government-handover",
      "published": "Mon, 19 Jan 2026 22:10:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Gunmen abduct dozens of worshippers from multiple Nigerian churches using sophisticated weapons",
      "description": "Gunmen allegedly abducted dozens of worshippers from two churches in Nigeria's Kaduna state, with security forces deployed to track the captors.",
      "url": "https://www.foxnews.com/world/gunmen-abduct-dozens-worshippers-multiple-nigerian-churches-using-sophisticated-weapons",
      "published": "Mon, 19 Jan 2026 21:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Keir Starmer to visit China with British business leaders next week, say reports",
      "description": "Prime minister’s reported trip follows approval by UK government for Beijing to build new embassy in London UK politics live – latest updates Davos live – latest updates Keir Starmer will reportedly visit China next week after controversial plans for Beijing to build a vast embassy in London were approved by his government. The UK prime minster will lead a delegation of blue-chip British companies, according to Reuters. The same firms, which include BP, HSBC, Intercontinental Hotels Group, Jaguar Land Rover and Rolls-Royce were also said to be among those who will join a revamped “UK-China CEO council”. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/21/keir-starmer-visit-china-british-business-leaders",
      "published": "Wed, 21 Jan 2026 10:09:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Gen Xers the new baby boomers: analysis identifies Australia’s richest landholders by generation",
      "description": "Those born between 1965 and 1980 own an average of $1.455m in housing and land, KPMG report finds Get our breaking news email , free app or daily news podcast Gen X households now hold the most property wealth of any generation, as baby boomers downsize their homes and move more of their money into cash and retirement accounts. Once known as the “slacker generation” , those born between 1965 and 1980 are mostly now aged over 50 years and have enjoyed years of inflated home prices. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/gen-xers-the-new-baby-boomers-analysis-identifies-australias-richest-landholders-by-generation",
      "published": "Wed, 21 Jan 2026 14:00:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Europol busts massive synthetic drug production network",
      "description": "Europol has reported the break-up of a major synthetic drug supply network. Authorities called it is the biggest such operation they have ever undertaken, and a \"major blow\" to organized crime.",
      "url": "https://www.dw.com/en/europol-busts-massive-synthetic-drug-production-network/a-75595738?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 15:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Davos 2026: Trump calls Europe unrecognizable at WEF",
      "description": "Trump's appearance at the WEF comes as US allies are increasingly concerned over his plans to take over Greenland. He is also expected to speak about his proposal to create a \"Board of Peace.\" DW has more.",
      "url": "https://www.dw.com/en/davos-2026-trump-calls-europe-unrecognizable-at-wef/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 15:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: More and more people turning away from alcohol",
      "description": "While a considerable majority of Germans drink alcohol, the proportion is on the wane with many citing health worries. Meanwhile, a debate about inheritance tax is brewing in the German government. DW has the latest.",
      "url": "https://www.dw.com/en/germany-news-more-and-more-people-turning-away-from-alcohol/live-75587808?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 10:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Mercosur delayed by two years as MEPs refer it to top EU court",
      "description": "European Union lawmakers on January 21 to hold up ratification of a major free trade agreement with the Mercosur group of South American countries over concerns about the legality of the deal. The deal was seen as a central priority of European Commission President Ursula von der Leyen. France, Europe's major agricultural producer, wanted stronger protections for farmers and has sought to delay the pact. FRANCE 24's Dave Keating tells us more straight from Brussels.",
      "url": "https://www.france24.com/en/mercosur-delayed-by-two-years-as-meps-refer-it-to-top-eu-court",
      "published": "Wed, 21 Jan 2026 15:03:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Press cartoonists on Trump's arrival for Davos forum in Switzerland",
      "description": "PRESS REVIEW – Wednesday, January 21: US President Donald Trump's upcoming arrival at Davos is all over the front pages, as cartoonists depict the ongoing tensions with Europe. Also, Israel has demolished a United Nations agency for Palestinian refugees compound in East Jerusalem. Next, the Moroccan papers continue to debate the outcome of the Africa Cup of Nations final. Finally, swans find love after heartbreak.",
      "url": "https://www.france24.com/en/tv-shows/press-review/20260121-press-cartoonists-on-trump-s-arrival-for-davos-forum-in-switzerland",
      "published": "Wed, 21 Jan 2026 11:15:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Prison breaks and renewed clashes raise alarm in northeast Syria",
      "description": "The United Nations continues to monitor developments in northeast Syria following clashes between government troops and the Kurdish-led SDF militia during which scores of detained ISIL militants reportedly escaped from prison.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166799",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "American chess prodigy had multiple drugs in system when found dead amid cheating controversy: report",
      "description": "Chess grandmaster Daniel Naroditsky was found dead with multiple drugs in his system after being accused of cheating, a toxicology report reveals.",
      "url": "https://www.foxnews.com/us/american-chess-prodigy-had-multiple-drugs-system-when-found-dead-amid-cheating-controversy-report",
      "published": "Tue, 20 Jan 2026 17:21:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump told to 'f--- off' by Danish lawmaker during European Parliament debate about Greenland",
      "description": "European Parliament member Anders Vistisen confronts President Donald Trump's Greenland interest with profanity-laced rebuke, drawing a reprimand from parliament leadership.",
      "url": "https://www.foxnews.com/world/trump-told-f-k-off-danish-lawmaker-european-parliament-greenland-debate",
      "published": "Tue, 20 Jan 2026 16:27:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Could US Congress stop Trump from taking over Greenland?",
      "description": "Some of the president's fellow Republicans oppose him - but it's not clear if they would join Democrats to block a takeover of the island.",
      "url": "https://www.bbc.com/news/articles/c701rvrpjwko?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 15:06:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Detained veteran Ugandan opposition figure critically ill in hospital, his party says",
      "description": "Kizza Besigye’s party says his condition is critical, but authorities say he was taken to hospital for a routine check-up.",
      "url": "https://www.bbc.com/news/articles/c5y2q5j71pqo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 14:15:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ryanair boss thanks Elon Musk for 'boost' in ticket sales after online row",
      "description": "Musk and Ryanair boss Michael O'Leary have called each other \"idiots\" in recent days, but the airline executive says it's helping lift sales",
      "url": "https://www.bbc.com/news/articles/ckgyzl4gd1do?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 11:38:11 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Colombia sentences ex-paramilitary leader Mancuso to 40 years in jail",
      "description": "Salvatore Mancuso's group committed more than 100 crimes, many targeting an indigenous group, the tribunal ruled.",
      "url": "https://www.bbc.com/news/articles/c338mdg1gn5o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 16:39:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-president accused of murder plot extradited to Burkina Faso",
      "description": "Paul-Henri Sandaogo Damiba has not commented on the accusations from Burkina Faso.",
      "url": "https://www.bbc.com/news/articles/cddg5ermzn7o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 16:34:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cow astonishes scientists with rare use of tools",
      "description": "The discovery suggests cows may have far greater cognitive abilities than previously assumed.",
      "url": "https://www.bbc.com/news/articles/cj0n127y74go?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 14:54:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Stripped naked’: Yemeni detainee recounts torture in UAE-run prison",
      "description": "A Yemeni man Ali Hassan Ali who spent more than two years in detention in secret prisons seeks justice.",
      "url": "https://www.aljazeera.com/features/2026/1/21/stripped-naked-yemeni-detainee-recounts-torture-in-uae-run-prison?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 15:21:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says he wants ‘ownership’ of Greenland, but ‘won’t use force’",
      "description": "Donald Trump said the US needs “ownership” of Greenland, but he “won’t use force” to acquire the territory.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/21/trump-says-he-wants-ownership-of-greenland-but-wont-use?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 15:20:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fact-checking US President Trump’s speech marking one year in office",
      "description": "Trump marked his second term anniversary by showcasing achievements, immigration actions, and addressing foreign policy.",
      "url": "https://www.aljazeera.com/news/2026/1/21/fact-checking-us-president-trumps-speech-marking-one-year-in-office?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 14:51:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU parliament refers Mercosur free trade deal to bloc’s top court",
      "description": "Court of Justice of the EU will determine if accord with South American nations is compatible with the bloc's policy.",
      "url": "https://www.aljazeera.com/news/2026/1/21/eu-parliament-refers-mercosur-free-trade-deal-to-blocs-top-court?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 13:52:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syrian army takes control of camp holding thousands linked to ISIL",
      "description": "SDF chief Abdi urged US-led coalition to 'bear responsibilities' for securing facilities coming under gov't control.",
      "url": "https://www.aljazeera.com/news/2026/1/21/syria-takes-control-of-camp-holding-thousands-linked-to-isil?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 13:32:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Can Europe break with Trump? A tale of energy, defence, economic dependence",
      "description": "Trump has angered European leaders with his Greenland ambitions and tariffs-for-all-who-oppose approach.",
      "url": "https://www.aljazeera.com/economy/2026/1/21/can-europe-break-with-trump-a-tale-of-energy-defence-economic-dependence?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 13:20:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US, Russia envoys meet in Davos as Ukraine reconstruction plan postponed",
      "description": "US envoy Witkoff to meet Putin on Thursday, the Kremlin confirms, as signing of $800bn Ukraine deal is put on hold.",
      "url": "https://www.aljazeera.com/news/2026/1/21/us-russian-envoys-meet-in-davos-as-prosperity-plan-for-ukraine-postponed?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:32:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AI’s growing thirst for water is becoming a public health risk",
      "description": "AI’s rapid expansion is placing growing pressure on water supplies and public health.",
      "url": "https://www.aljazeera.com/opinions/2026/1/21/ais-growing-thirst-for-water-is-becoming-a-public-health-risk?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:04:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN condemns Israel’s demolition of UNRWA HQ in occupied East Jerusalem",
      "description": "UN condemns Israel’s demolition of UNRWA HQ in occupied East Jerusalem",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/21/un-condemns-israels-demolition-of-unrwa-hq-in-occupied-east-jerusalem?traffic_source=rss",
      "published": "Wed, 21 Jan 2026 12:01:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former South Korean PM jailed for 23 years for role in martial law insurrection",
      "description": "Han Duck-soo verdict marks first judicial ruling stemming from ex-president Yoon Suk Yeol’s 2024 martial law decree South Korea’s former prime minister Han Duck-soo has been sentenced to 23 years in prison for his role in an insurrection stemming from the former president Yoon Suk Yeol’s failed martial law declaration . The judge, Lee Jin-kwan, ordered Han’s immediate detention. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/former-south-korea-pm-han-duck-soo-jailed-martial-law-insurrection",
      "published": "Wed, 21 Jan 2026 11:13:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-21T15:30:29.625Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-21T15:27:30.982Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-21T15:29:41.777Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-21T03:36:07.009Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How the word 'cravat' came from the battlefields of 17th century Europe",
      "description": "In this installment of NPR's \"Word of the Week\" series we trace the origins of the \"cravat\" (borrowed from the French \"cravate\") back to the battlefields of 17th century Europe.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5682323/cravat-word-of-the-week",
      "published": "Wed, 21 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's Greenland demand has been a gift to U.S. geopolitical foes like Russia",
      "description": "The tensions between the U.S. and Western Allies are a source of satisfaction to many in the Kremlin.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5683070/trumps-greenland-demand-have-been-a-gift-to-u-s-geopolitical-foes-like-russia",
      "published": "Wed, 21 Jan 2026 04:49:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Countries invited to join Trump's Board of Peace react with apprehension",
      "description": "President Trump has invited scores of nations to join his Board of Peace, but so far the reaction has been tentative.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5683176/countries-invited-to-join-trumps-board-of-peace-react-with-apprehension",
      "published": "Wed, 21 Jan 2026 04:48:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel agrees to join Trump's Board of Peace as some European nations say no",
      "description": "Prime Minister Benjamin Netanyahu of Israel said Wednesday he had agreed to join U.S. President Donald Trump's Board of Peace, after his office earlier criticized makeup of the board.",
      "url": "https://www.npr.org/2026/01/21/g-s1-106641/netanyahu-join-trump-board-of-peace",
      "published": "Wed, 21 Jan 2026 02:05:31 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New EU anti-racism strategy misses the point, say NGOs",
      "description": "Diversity groups say the EU has weakened its newly-released policy to tackle discrimination. But was it due to fears of negative reactions from the Trump administration?",
      "url": "https://www.dw.com/en/new-eu-anti-racism-strategy-misses-the-point-say-ngos/a-75588965?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 15:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European Parliament votes to delay Mercosur deal in court",
      "description": "Lawmakers voted narrowly to challenge the EU trade deal with Latin America in the bloc's top court, a move that could derail the deal. Chancellor Friedrich Merz said the deal should be provisionally enacted anyway.",
      "url": "https://www.dw.com/en/european-parliament-votes-to-delay-mercosur-deal-in-court/a-75593480?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 15:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan: Assassin of ex-PM Shinzo Abe jailed for life",
      "description": "The man who shot ex-Japan PM Shinzo Abe with a handmade gun in 2022 is due to spend his life in prison. The killer, Tetsuya Yamagami, said his actions were fueled by anger over the controversial Unification Church.",
      "url": "https://www.dw.com/en/japan-assassin-of-ex-pm-shinzo-abe-jailed-for-life/a-75586510?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 06:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Chile's president-elect picks Pinochet lawyers as ministers",
      "description": "Chilean President-elect Jose Antonio Kast has named two lawyers who defended dictator Augusto Pinochet to his new cabinet. The far-right leader said his picks were \"not the result of quotas, calculations or pressure.\"",
      "url": "https://www.dw.com/en/chile-s-president-elect-picks-pinochet-lawyers-as-ministers/a-75586298?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 04:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Elon Musk mulls buying Ryanair amid spat with airline boss",
      "description": "Elon Musk has asked his followers on X if he should buy Ryanair after a spat with the European budget airline's outspoken CEO Michael O'Leary.",
      "url": "https://www.dw.com/en/elon-musk-mulls-buying-ryanair-amid-spat-with-airline-boss/a-75586269?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 03:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela receives $300M in proceeds from first US oil sale",
      "description": "Interim President Delcy Rodriguez said the money from US sales of Venezuelan oil will be used to prop up the currency.",
      "url": "https://www.dw.com/en/venezuela-receives-300m-in-proceeds-from-first-us-oil-sale/a-75585844?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 00:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'We'll work something out,' Trump says of Greenland row",
      "description": "While insisting the US needs control of Greenland, US President Trump was confident \"something is going to happen that is going to be good for everybody\" regarding tension between the US and Europe. Follow DW for more.",
      "url": "https://www.dw.com/en/we-ll-work-something-out-trump-says-of-greenland-row/live-75575266?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 21:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "🔴 Live: 'I won't use force' to take Greenland, Trump says in Davos speech",
      "description": "No description available.",
      "url": "https://www.france24.com/en/europe/20260121-live-trump-heads-for-davos-maelstrom-over-greenland",
      "published": "Wed, 21 Jan 2026 14:17:32 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU parliament votes to challenge Mercosur trade deal",
      "description": "Lawmakers in the EU parliament on Wednesday voted to refer to court a newly-signed trade deal with South America’s Mercosur for fear the agreement will penalise European farmers.",
      "url": "https://www.france24.com/en/europe/20260121-eu-parliament-votes-to-challenge-mercosur-trade-deal",
      "published": "Wed, 21 Jan 2026 11:59:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rifaat al-Assad, Syria’s ‘butcher of Hama’, dies at 88, family says",
      "description": "Rifaat al-Assad, the uncle of deposed Syrian ruler Bashar al-Assad and infamous for his brutal suppression of a Muslim Brotherhood uprising that earned him the nickname “the butcher of Hama”, has died aged 88 in the United Arab Emirates. Once one of the most powerful figures in Syria, Rifaat later vied for the presidency and was ultimately forced into exile.",
      "url": "https://www.france24.com/en/middle-east/20260121-rifaat-al-assad-syria-s-butcher-of-hama-dies-at-88-family-says",
      "published": "Wed, 21 Jan 2026 11:10:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why is Ryanair fighting with Elon Musk?",
      "description": "Elon Musk has said he could buy Ryanair amid an ongoing public spat with the budget airline's boss Michael O'Leary.",
      "url": "https://news.sky.com/story/elon-musk-vs-ryanair-could-tech-billionaire-actually-buy-budget-airline-and-what-started-online-spat-13497018",
      "published": "Wed, 21 Jan 2026 08:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea's former prime minister jailed over martial law declaration",
      "description": "South Korea's former prime minister has been sentenced to 23 years in prison on charges relating to the failed martial law declaration in 2024.",
      "url": "https://news.sky.com/story/south-koreas-former-prime-minister-han-duck-soo-jailed-for-23-years-over-martial-law-declaration-13497023",
      "published": "Wed, 21 Jan 2026 08:36:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'He was bleeding for 40 minutes, gasping for life'",
      "description": "\"The beat is pounding as he delivers a verse, in a home-made studio built in the closet. I'm not here on a trial run - I'm going to reach the peak - streets, nights, beats, they're my oxygen.\"",
      "url": "https://news.sky.com/story/he-was-bleeding-for-40-minutes-gasping-for-life-the-dying-moments-of-an-aspiring-iranian-rapper-13496885",
      "published": "Tue, 20 Jan 2026 22:04:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marine Le Pen admits 'mistake' in EU embezzlement trial as she fights to save political career",
      "description": "French far-right leader Marine Le Pen acknowledged a \"mistake\" at a key appeals trial in Paris",
      "url": "https://abcnews.go.com/International/wireStory/marine-le-pen-admits-mistake-eu-embezzlement-trial-129418407",
      "published": "Wed, 21 Jan 2026 09:15:02 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysia to charge 2 former generals in high-profile military corruption case",
      "description": "Malaysia's anti-corruption agency says two former top military commanders will appear in court this week in a high-profile corruption case",
      "url": "https://abcnews.go.com/International/wireStory/malaysia-charge-2-former-generals-high-profile-military-129413181",
      "published": "Wed, 21 Jan 2026 07:13:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Olympic visitors to Milan get a rare chance to glimpse restoration of a long-hidden Leonardo gem",
      "description": "Milan cultural officials are allowing visitors to view a long-hidden wall painting by Leonardo da Vinci while restoration work continues",
      "url": "https://abcnews.go.com/International/wireStory/olympic-visitors-milan-rare-chance-glimpse-restoration-long-129412878",
      "published": "Wed, 21 Jan 2026 06:41:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ally of S. Korea's Yoon given 23 years in prison for rebellion over martial law",
      "description": "A South Korean court has ruled the 2024 imposition of martial law by then President Yoon Suk Yeol constituted an act of rebellion as it sentenced his prime minister to 23 years in prison for his involvement",
      "url": "https://abcnews.go.com/International/wireStory/top-ally-south-koreas-yoon-23-years-prison-129410989",
      "published": "Wed, 21 Jan 2026 03:24:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Man who assassinated former Japanese prime minister gets life in prison",
      "description": "A Japanese court sentenced a man who admitted assassinating former Japanese Prime Minister Shinzo Abe to life imprisonment",
      "url": "https://abcnews.go.com/International/wireStory/man-assassinated-former-japanese-prime-minister-gets-life-129408247",
      "published": "Wed, 21 Jan 2026 03:13:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Colombia slashes wages for its legislators",
      "description": "Colombia’s president on Tuesday reduced wages for members of Congress by approximately 30%, as the South American nation faces a budget crunch and gets ready to hold elections in the first semester of this year",
      "url": "https://abcnews.go.com/International/wireStory/colombia-slashes-wages-legislators-public-spending-balloons-ahead-129401848",
      "published": "Wed, 21 Jan 2026 01:13:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pharrell opens Vuitton’s monogram anniversary year with cinematic menswear show",
      "description": "Pharrell Williams opened a celebration year for Louis Vuitton’s monogram — marking the house’s 130th anniversary of its most recognizable signature — with a Fall-Winter 2026 men’s show that was equal parts brand pageant and movie set",
      "url": "https://abcnews.go.com/International/wireStory/pharrell-opens-vuittons-monogram-anniversary-year-cinematic-menswear-129400730",
      "published": "Tue, 20 Jan 2026 23:05:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Colombia says former FARC rebels have not kept promises to surrender cash and gold",
      "description": "Officials in Colombia say that the former rebel group Revolutionary Armed Forces of Colombia, or FARC, is violating a 2016 peace deal with the Colombian government by failing to relinquish gold, land and other assets to fund reparations for the group’s...",
      "url": "https://abcnews.go.com/International/wireStory/colombia-former-farc-rebels-promises-surrender-cash-gold-129397345",
      "published": "Tue, 20 Jan 2026 17:53:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NASA astronaut who was stuck in space retires after 27-year career",
      "description": "NASA's Suni Williams, who spent over 280 days stranded in space during Boeing Starliner's failed test flight, announced her retirement from the agency.",
      "url": "https://www.foxnews.com/us/nasa-astronaut-who-stuck-space-retires-after-27-year-career",
      "published": "Wed, 21 Jan 2026 09:08:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Surgeon ex-husband extradited to Ohio in slaying of dentist and wife",
      "description": "Ex-husband allegedly behind Columbus double murder extradited to Ohio. McKee accused of killing dentist Spencer Tepe and wife Monique in shocking crime.",
      "url": "https://www.foxnews.com/us/surgeon-ex-husband-extradited-ohio-slaying-dentist-wife",
      "published": "Tue, 20 Jan 2026 17:48:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Native American group vows Supreme Court fight over woke New York mascot ban",
      "description": "Native American advocacy group prepares to take constitutional fight over school name bans to Supreme Court, arguing New York's rule violates 14th Amendment rights.",
      "url": "https://www.foxnews.com/us/native-american-group-vows-supreme-court-fight-woke-new-york-mascot-ban",
      "published": "Tue, 20 Jan 2026 17:24:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Anti-ICE agitator defends invading church, claims 'it's what needed to be done'",
      "description": "Anti-ICE agitators disrupted a Minnesota church service, with a Black Lives Matter leader claiming it \"needed to be done\" after a pastor was linked to ICE.",
      "url": "https://www.foxnews.com/us/anti-ice-agitator-defends-invading-church-claims-its-what-needed-done",
      "published": "Tue, 20 Jan 2026 13:19:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Video shows anti-ICE agitator berating Christians in Minnesota church service",
      "description": "An anti-U.S. Immigration and Customs Enforcement agitator berated churchgoers during a service at Cities Church in Minneapolis on Sunday.",
      "url": "https://www.foxnews.com/us/video-shows-anti-ice-agitator-berating-christians-minnesota-church-service",
      "published": "Tue, 20 Jan 2026 13:03:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu agrees to join Trump’s Gaza Board of Peace after initial pushback",
      "description": "Israeli Prime Minister Benjamin Netanyahu said he will join President Donald Trump’s newly formed Gaza Board of Peace after initially criticizing its structure.",
      "url": "https://www.foxnews.com/world/netanyahu-agrees-join-trumps-gaza-board-peace-after-initial-pushback",
      "published": "Wed, 21 Jan 2026 03:35:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces apprehend sanctioned vessel in Caribbean maritime operation targeting illicit oil transport",
      "description": "U.S. military forces apprehended Motor Vessel Sagitta in the Caribbean as part of Operation Southern Spear targeting sanctioned tanker vessels.",
      "url": "https://www.foxnews.com/world/us-forces-apprehend-sanctioned-vessel-caribbean-maritime-operation-targeting-illicit-oil-transport",
      "published": "Tue, 20 Jan 2026 16:40:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump confirms he invited Putin to join his Board of Peace: 'He's been invited'",
      "description": "U.S. President Donald Trump on Monday confirmed Russian President Vladimir Putin was invited to the Board of Peace for supervision of the Gaza plan.",
      "url": "https://www.foxnews.com/world/trump-confirms-he-invited-putin-join-his-board-peace-hes-been-invited",
      "published": "Tue, 20 Jan 2026 02:40:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark ramps up defenses in Greenland as Trump zeros in on control of territory",
      "description": "Denmark deploys additional troops to Greenland after President Donald Trump claims the island is not secure from Russia or China.",
      "url": "https://www.foxnews.com/world/denmark-ramps-up-defenses-greenland-trump-zeros-control-territory",
      "published": "Mon, 19 Jan 2026 20:09:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}