{
  "last_updated": "2026-01-27T14:31:48.112447Z",
  "event_count": 223,
  "events": [
    {
      "title": "Crocodile warnings as floods devastate southern Africa",
      "description": "More than 100 people killed and hundreds of thousands displaced in South Africa, Mozambique and Zimbabwe Devastating floods have killed more than 100 people in southern Africa since the beginning of the year and displaced hundreds of thousands, as authorities and aid workers warn of hunger, cholera and attacks by crocodiles that have spread with the waters. More than 70 people have died in Zimbabwe and 30 in South Africa, where hundreds of people were evacuated from Kruger national park earlier this month after a deluge of rain . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/crocodile-warnings-floods-devastate-southern-africa",
      "published": "Mon, 26 Jan 2026 13:44:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Trump administration's trust and credibility tested in wake of Pretti's death in Minneapolis",
      "description": "Lawmakers are demanding a full federal and state investigation into the Minneapolis shooting of Alex Pretti, saying the credibility of ICE and DHS is at risk amid conflicting accounts. Federal officials initially portrayed Pretti as a violent instigator with a gun, but video footage shows him being pushed and subdued while holding only a phone. The incident has fueled concerns about transparency and trust in the administration, and Trump is under mounting pressure even from parts of his MAGA base as the controversy deepens, as FRANCE 24's Fraser Jackson explains.",
      "url": "https://www.france24.com/en/trump-administration-s-trust-and-credibility-tested-in-wake-of-pretti-s-death-in-minneapolis",
      "published": "Tue, 27 Jan 2026 14:27:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns ‘law of the jungle’ is replacing rule of law",
      "description": "Warning that the “rule of law is being replaced by the law of the jungle,” the UN Secretary-General on Monday urged world powers to recommit to international law as the foundation of peace, justice and multilateral cooperation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166832",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of rising internet shutdowns as digital blackouts spread worldwide",
      "description": "A rising trend towards government-enforced internet shutdowns – with at least 300 incidents in more than 54 countries over the last two years – is prompting renewed warnings from the UN about the threat these digital blackouts pose to freedom of expression, access to information and human rights.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166813",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "DHS probes whether agents killed VA nurse following accidental discharge during Minneapolis ICE raid",
      "description": "DHS is investigating whether Border Patrol agents believed they were under fire when accidental gun discharge preceded fatal shooting of Alex Pretti.",
      "url": "https://www.foxnews.com/us/dhs-probes-whether-agents-killed-va-nurse-accidental-discharge-minneapolis-ice-raid",
      "published": "Mon, 26 Jan 2026 18:29:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Guardian Essential poll: One Nation’s primary vote soars to record high amid Coalition chaos",
      "description": "Pauline Hanson’s party polls a primary vote of 22%, while Labor’s response to the Bondi terror attack wins widespread support Get our breaking news email , free app or daily news podcast One Nation’s polling surge has continued with a record-high primary vote of 22% in the latest Guardian Essential poll off the back of ongoing Coalition chaos and rising social tensions. Meanwhile, there is widespread public support for the Labor government’s response to the Bondi beach terror attack, with a majority backing crackdowns on guns, hate speech and protests. However, most poll respondents say Anthony Albanese has poorly handled the fallout from the antisemitic shooting. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/28/guardian-essential-poll-one-nation-coalition-liberal-national-labor-anthony-albanese-bondi-attack-ntwnfb",
      "published": "Tue, 27 Jan 2026 14:00:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Putin's war on Ukraine 'going very badly for Russia, economy starting to hurt'",
      "description": "Gavin Lee is pleased to welcome John Lough, Head of Foreign Policy & International Partnerships at the New Eurasian Strategies Centre. He warns that Moscow sees negotiations, not as a genuine pathway to peace, but rather a continuation of Russia’s broader political calculus shaped by perceived leverage, battlefield realities, and long‑term objectives. He emphasises the psychological and material dimensions of the conflict, from territorial symbolism to economic strain, and traces the limits of Russian expectations against Ukrainian resolve.",
      "url": "https://www.france24.com/en/putin-s-war-on-ukraine-going-very-badly-for-russia-economy-starting-to-hurt",
      "published": "Tue, 27 Jan 2026 12:07:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Iran in the Human Rights Council, Myanmar election ‘fraud’, migration chief in Cyprus, Mozambique flood update",
      "description": "Disturbing details continued to emerge on Friday about Iran’s State-led crackdown against mass protests, while UN rights chief Volker Türk expressed deep concern that demonstrators could be executed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166819",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime reportedly issued nationwide shoot-to-kill orders as protest death toll surges",
      "description": "Iran protest death toll estimates range from several thousand to over 35,000 as brutal crackdown intensifies. Medical data reveals shocking scale of violence.",
      "url": "https://www.foxnews.com/world/iran-regime-reportedly-issued-nationwide-shoot-to-kill-orders-protest-death-toll-surges",
      "published": "Mon, 26 Jan 2026 13:10:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "How Israel’s West Bank security realities are reshaping the two-state debate",
      "description": "The West Bank remains central to Israel's security strategy as experts debate two-state solution viability following declining Palestinian terrorist incidents.",
      "url": "https://www.foxnews.com/world/how-israels-west-bank-security-realities-reshaping-two-state-debate",
      "published": "Tue, 27 Jan 2026 07:51:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian security forces gun down amateur boxer as father searches morgues for missing son: source",
      "description": "Iranian security forces allegedly killed amateur boxer Sepehr Ebrahimi during ongoing protests near Tehran. The death adds to Iran's rising protest toll of at least 6,126 people killed.",
      "url": "https://www.foxnews.com/world/iranian-security-forces-gun-down-amateur-boxer-father-searches-morgues-missing-son-source",
      "published": "Mon, 26 Jan 2026 21:34:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "US aircraft carrier has arrived in Middle East amid Iran crackdown",
      "description": "The USS Abraham Lincoln carrier strike group has arrived in the Middle East, significantly increasing US military presence amid Iran’s crackdown on mass protests. While President Trump has ruled out immediate military action, he warned that all options remain on the table and said Iran is seeking negotiations. The protests, sparked by economic grievances, have been met with a harsh government crackdown, with rights groups reporting thousands of deaths.",
      "url": "https://www.france24.com/en/us-aircraft-carrier-has-arrived-in-middle-east-amid-iran-crackdown",
      "published": "Tue, 27 Jan 2026 11:08:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "At least 6,126 people killed in Iran's crackdown on nationwide protests, activists say",
      "description": "Iran's bloody crackdown on nationwide protests killed at least 6,126 people while many others still are feared dead, activists said Tuesday, as a U.S. aircraft carrier group arrived in the Mideast to lead any American military response to the crisis.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5689793/6-126-iran-crackdown-protests-death-toll",
      "published": "Tue, 27 Jan 2026 01:49:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's crackdown on protests killed more than 6,000, human rights group says",
      "description": "At least 6,126 people were killed during the Iranian regime's crackdown on nationwide protests, and more than 41,800 were arrested, the US-based Human Rights Activists News Agency said on Tuesday. It added that the true death toll may be higher as monitors have struggled to assess the extent of the crackdown due to an internet blackout in Iran.",
      "url": "https://www.france24.com/en/middle-east/20260127-iran-crackdown-protests-killed-more-than-6000-human-rights-group-says",
      "published": "Tue, 27 Jan 2026 13:10:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "US withdrawal from WHO ‘risks global safety’, agency says in detailed rebuttal",
      "description": "The World Health Organization (WHO) has issued a detailed statement regretting the United States decision to leave the UN agency, and declaring that it will leave both the US and the world less safe as a result.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166828",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "'Trauma still felt': North African Jews and the Holocaust",
      "description": "The Nazi persecution of Jews in Europe during World War II also had its effects on North African Jews, who experienced death, forced labor, hunger and looting of their property by Nazi Germany and its allies.",
      "url": "https://www.dw.com/en/trauma-still-felt-north-african-jews-and-the-holocaust/a-75649383?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 05:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UK supermarkets push for Amazon soy safeguards after traders abandon ban",
      "description": "European retailers urge traders to adhere to commitments after Brazilian lawmakers wreck forest protection pact Leading British and European retailers are trying to salvage the core elements of the Amazon soy moratorium after the world’s most successful forest protection agreement was wrecked by Brazilian lawmakers and abandoned by international traders. In an open letter, high street brands including Tesco, Sainsbury’s and Asda say the breakdown this month of the 20-year-old agreement will damage consumer confidence unless new arrangements are put in place to ensure grain production is not linked to deforestation. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/26/uk-supermarkets-push-for-amazon-soy-safeguards-after-brazil-scraps-ban",
      "published": "Mon, 26 Jan 2026 17:43:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Trump rethinks immigration leadership after Pretti's death",
      "description": "Border Patrol commander Gregory Bovino is expected to leave Minneapolis after backlash over the fatal shooting of ICU nurse Alex Pretti. President Trump places border czar Tom Homan in direct control of the operation, signaling a shift to rein in the most controversial enforcement tactics. Here's FRANCE 24's Kethevane Gorjestani analysis of the move.",
      "url": "https://www.france24.com/en/trump-rethinks-immigration-leadership-after-pretti-s-death",
      "published": "Tue, 27 Jan 2026 10:13:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Russian drones kill 1 and injure children in Ukraine as Zelenskyy urges speedier diplomacy",
      "description": "A heavy Russian drone attack on Odesa has killed at least one person and injured 23, including children and a pregnant woman",
      "url": "https://abcnews.go.com/International/wireStory/russian-drones-kill-1-injure-children-ukraine-zelenskyy-129590788",
      "published": "Tue, 27 Jan 2026 06:57:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "World pauses to commemorate International Holocaust Remembrance Day",
      "description": "People across Europe and beyond are commemorating International Holocaust Remembrance Day",
      "url": "https://abcnews.go.com/International/wireStory/world-pauses-commemorate-international-holocaust-remembrance-day-129590602",
      "published": "Tue, 27 Jan 2026 08:49:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘We must stand up for our shared humanity - each and every day’: UN human rights chief",
      "description": "On the eve of International Holocaust Remembrance Day, UN High Commissioner for Human Rights Volker Türk called on the global community to “not only to look at our past, but to reflect on our present, and to safeguard our future.”",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166836",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: UN and rights experts warn against risk of mass violence in Jonglei",
      "description": "The UN Mission in South Sudan (UNMISS) is sounding the alarm over the threat of escalating violence in Jonglei state which is putting lives at risk and further weakening prospects for peace.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166831",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN rights chief decries US treatment of migrants, as deaths in ICE custody rise",
      "description": "The UN’s top human rights official has raised alarm over what he described as the growing dehumanisation of migrants in the United States, warning that current immigration enforcement practices are undermining due process, family unity and basic human dignity.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166816",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Winter storm grips much of US in snow, ice, Arctic cold",
      "description": "A powerful winter storm spread heavy snow, sleet, and freezing rain across much of the eastern US, while Arctic cold gripped areas east of the Rockies. Winter storm warnings covered 118 million people, and the deep freeze strained energy supplies and caused widespread travel disruptions. About 157 million Americans were urged to stay warm as temperatures plunged from below zero near the Canadian border to below freezing as far south as the Gulf of Mexico. FRANCE 24's Jessica Le Masurier reports from New York.",
      "url": "https://www.france24.com/en/winter-storm-grips-much-of-us-in-snow-ice-arctic-cold",
      "published": "Tue, 27 Jan 2026 14:19:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "FBI says woman threatened to murder agent and his family after stealing ID from car during Minneapolis riot",
      "description": "Federal authorities arrested a woman accused of making death threats against an FBI agent and his family following a January riot that destroyed FBI equipment in Minneapolis.",
      "url": "https://www.foxnews.com/us/fbi-says-woman-threatened-murder-agent-his-family-after-stealing-id-from-car-during-minneapolis-riot",
      "published": "Mon, 26 Jan 2026 18:17:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Is Trump’s ‘Board of Peace’ a threat to the United Nations?",
      "description": "Trump’s ‘Board of Peace’ was to focus on Gaza’s reconstruction but it's now being promoted as a global conflict-resolver",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/27/is-trumps-board-of-peace-a-threat-to-the-united-nations?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 14:29:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump warned off Iran strikes in 'you will reap the whirlwind' threat",
      "description": "A new mural warning the US not to launch a military strike on Iran has been unveiled in a square in central Tehran.",
      "url": "https://news.sky.com/story/iran-unveils-mural-warning-us-not-to-launch-military-strike-13498878",
      "published": "Sun, 25 Jan 2026 15:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian drone swarms pose 'credible threat' to USS Abraham Lincoln carrier group, defense expert says",
      "description": "USS Abraham Lincoln strike group approaches Middle East amid warnings that Iranian drone capabilities worth \"tens of millions of dollars\" threaten U.S. naval vessels.",
      "url": "https://www.foxnews.com/world/iranian-drone-swarms-pose-credible-threat-uss-abraham-lincoln-carrier-group-defense-expert-says",
      "published": "Sun, 25 Jan 2026 21:00:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How the Oct 7 Hamas terror attacks exposed long-running concerns about UNRWA, new film charges",
      "description": "Tracing UNRWA from 1949 to today, the film examines refugee policy, weak oversight and alleged links to Hamas control in Gaza, raising questions about the agency’s role and accountability.",
      "url": "https://www.foxnews.com/world/how-oct-7-hamas-terror-attacks-exposed-long-running-concerns-about-unrwa-new-film-charges",
      "published": "Sun, 25 Jan 2026 12:43:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Israel recovers last Gaza hostage remains, ceasefire moves to next phase",
      "description": "Israel recovered the remains of police officer Ran Gvili, the last hostage from the Oct. 7 Hamas attack, marking the end of the first phase of the Gaza ceasefire and allowing the truce to move forward. The next phase is expected to reopen the Rafah border crossing, increase aid and travel, and begin the more difficult tasks of disarming Hamas, withdrawing Israeli forces, and rebuilding Gaza. FRANCE 24's Noga Tarnopolsky has the details, pointing that 'this is a moment of inflexion for Israel'.",
      "url": "https://www.france24.com/en/israel-recovers-last-gaza-hostage-remains-ceasefire-moves-to-next-phase",
      "published": "Tue, 27 Jan 2026 11:19:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "'Mob mentality' endangers officers amid anti-ICE unrest and chaos in Minneapolis, retired cops warn",
      "description": "Veteran law enforcement leaders warn Minneapolis faces public safety breakdown as mob violence and fractured policing create chaos during ICE operations.",
      "url": "https://www.foxnews.com/us/mob-mentality-endangers-officers-amid-anti-ice-unrest-chaos-minneapolis-retired-cops-warn",
      "published": "Tue, 27 Jan 2026 06:00:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the sovereignty of the country’: Guinea-Bissau says US vaccine study suspended",
      "description": "Despite US pushback, officials in west Africa say controversial hepatitis B study on pause amid ethics concerns US health officials insisted it was still on. African health leaders said it was cancelled . At the heart of the controversy is the west African nation of Guinea-Bissau – one of the poorest countries in the world and the proposed site of a hotly debated US-funded study on vaccines. The study on hepatitis B vaccination, to be led by Danish researchers, became a flashpoint after major changes to the US vaccination schedule and prompted questions about how research is conducted ethically in other countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/guinea-bissau-hepatitis-b-vaccine-study",
      "published": "Fri, 23 Jan 2026 17:09:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "At least 18 people dead as Philippines ferry with 350 onboard sinks",
      "description": "Rescuers save at least 316 after inter-island ferry sank en route from city of Zamboanga to southern Jolo island A ferry with more than 350 people onboard sank early on Monday near an island in the southern Philippines, killing at least 18 people, officials said. Rescuers saved hundreds more, while a fleet of coastguard and naval ships searched for those still missing. Coastguard officials said the cargo and passenger ferry apparently encountered technical problems and sank after midnight. The steel-hulled vessel abruptly tilted to one side and took on water, hurling people into the sea in the darkness, according to a rescued passenger who lost his six-month-old baby. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/philippines-ferry-capsizes-sinks-death-toll",
      "published": "Mon, 26 Jan 2026 13:55:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Minnesota: Mayor says some federal agents to leave Minneapolis amid outrage over protester shootings",
      "description": "Minneapolis Mayor Jacob Frey said some federal immigration officers will leave the city after a call with Donald Trump. Earlier the president said he is deploying border czar Tom Homan to Minnesota.",
      "url": "https://www.dw.com/en/minnesota-mayor-says-some-federal-agents-to-leave-minneapolis-amid-outrage-over-protester-shootings/live-75666369?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 23:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "State of emergency declared as Russia brings its war into Ukrainian homes",
      "description": "The sound of deep, slow breaths echoes up a frozen staircase, followed by footsteps.",
      "url": "https://news.sky.com/story/how-ukrainians-are-coping-with-brutal-winter-as-russia-brings-war-into-peoples-homes-13499175",
      "published": "Mon, 26 Jan 2026 11:35:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "'Starry Night Murderer' allegedly terrorizing people after early prison release, parole violations",
      "description": "Larry Hurwitz, convicted in 1990 murder case, allegedly violated parole and faces new domestic violence charges in Clackamas County with $500,000 bail set.",
      "url": "https://www.foxnews.com/us/starry-night-murderer-allegedly-terrorizing-people-after-early-prison-release-parole-violations",
      "published": "Mon, 26 Jan 2026 16:08:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "China’s top general under investigation for alleged violations amid corruption crackdown",
      "description": "Zhang Youxia, long seen as Xi Jinping’s closest military ally, reportedly accused of leaking nuclear secrets to US China’s military leadership is in turmoil after its most senior general – a close ally of Xi Jinping – was placed under investigation for “suspected serious violations of discipline and law”. Zhang Youxia is the joint vice-chairperson of the Central Military Commission (CMC), the ruling body of China’s People’s Liberation Army (PLA). Second only to Xi in the military command structure, Zhang has long been seen as the Chinese president’s closest military ally. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/china-top-ranking-general-zhang-youxia-investigation",
      "published": "Mon, 26 Jan 2026 01:40:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis: Protesters celebrate departure of top Trump immigration enforcer",
      "description": "Following the outrage sparked by the shooting of protester Alex #Pretti by federal agents in #Minneapolis, the #Trump administration announced the departure of its top immigration enforcer, Gregory Bovino. In recent weeks, the Border Patrol commander became the controversial face of Trump's aggressive deportation campaign.",
      "url": "https://www.france24.com/en/video/20260127-minneapolis-protesters-celebrate-departure-of-top-trump-immigration-enforcer",
      "published": "Tue, 27 Jan 2026 12:01:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "At least 6,126 people killed in Iran’s crackdown on nationwide protests, activists say",
      "description": "Activists say that at least 6,126 people were killed in Iran’s crackdown on nationwide protests and many more are still feared dead",
      "url": "https://abcnews.go.com/International/wireStory/6126-people-killed-irans-crackdown-nationwide-protests-activists-129584747",
      "published": "Tue, 27 Jan 2026 02:49:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Chinese spies 'sham marriage' scandal exposes 'targeted' national security threat at major US base: expert",
      "description": "Former CIA operative warns alleged Navy sailor \"sham marriage\" scandal with Chinese nationals exposes serious national security threat.",
      "url": "https://www.foxnews.com/us/chinese-spies-sham-marriage-scandal-exposes-targeted-national-security-threat-major-us-base-expert",
      "published": "Tue, 27 Jan 2026 08:00:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Paris Agreement 10 years on: More wins than you may realize",
      "description": "Major emitter the US has officially left the Paris Agreement and global emissions keep rising a decade on from the deal. Yet renewables' growth shows climate action can work. Here's what's been done and what's missing.",
      "url": "https://www.dw.com/en/paris-agreement-10-years-on-more-wins-than-you-may-realize/a-74556928?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 07:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "What's in the India-EU trade deal?",
      "description": "After the presidents of the EU Commission and EU Council signed a free trade deal in New Delhi with India's Prime Minister this Tuesday, we take a look at what the pact actually entails. Tariffs will be reduced on a large number of goods going both ways, but some sectors will remain protected. Both sides are looking to further diversify their trade relationships as Donald Trump's global tariff war upends commercial flows.",
      "url": "https://www.france24.com/en/tv-shows/business/20260127-what-s-in-the-india-eu-trade-deal",
      "published": "Tue, 27 Jan 2026 12:37:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "USS Abraham Lincoln Aircraft Carrier Strike Group makes move amid threat from Iran",
      "description": "USS Abraham Lincoln entered CENTCOM waters Monday amid escalating threats from Iran and the potential for a \"credible\" drone attack on the U.S.",
      "url": "https://www.foxnews.com/world/uss-abraham-lincoln-aircraft-carrier-strike-group-makes-move-threat-iran",
      "published": "Mon, 26 Jan 2026 06:58:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Philippines' Duterte fit to face ICC proceedings, judges say",
      "description": "The 80-year-old is accused of crimes of humanity over his bloody war on drugs that left thousands killed.",
      "url": "https://www.bbc.com/news/articles/c0lx2pj84l4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 07:12:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US witnessed many ICE-related deaths in 2026. Here are their stories",
      "description": "Shootings of Alex Pretti and Renee Nicole Good are two of at least nine deaths related to immigration enforcement in US.",
      "url": "https://www.aljazeera.com/news/2026/1/27/us-witnessed-many-ice-related-deaths-in-2026-here-are-their-stories?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:25:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ukrainians are sharing hacks online on how to survive winter power cuts",
      "description": "After repeated Russian attacks on Ukraine's energy grid, Ukrainians face long outages during a cold winter at war. On social media, Ukrainians share tips for keeping warm at home.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5686455/ukraine-winter-power-outage",
      "published": "Mon, 26 Jan 2026 13:24:44 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UN envoy highlights ‘window to advance peace’ in Colombia",
      "description": "The new year provides an opportunity for Colombia to keep advancing towards lasting peace, a decade after a landmark accord that ended more than 50 years of conflict, the UN Special Representative told the Security Council on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166818",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE mobs bankrolled by 'shadowy interests' putting law enforcement in danger, CEO warns",
      "description": "Violent ICE protests in Minnesota allegedly driven by outside actors exploiting chaos, warns protest insider as confrontations escalate across the state.",
      "url": "https://www.foxnews.com/us/anti-ice-mobs-bankrolled-shadowy-interests-putting-law-enforcement-danger-ceo-warns",
      "published": "Mon, 26 Jan 2026 19:22:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Knife-wielding nut allegedly asked Christian his religion – then stabbed him and dog before police shot him",
      "description": "Armed Washington suspect died after police shooting following alleged stabbing attack on man and dog that occurred after asking victim about Christian faith in Parkland on Sunday.",
      "url": "https://www.foxnews.com/us/knife-wielding-nut-allegedly-asked-christian-his-religion-then-stabbed-him-dog-before-police-shot-him",
      "published": "Mon, 26 Jan 2026 17:29:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Italy’s Meloni rebukes Trump remarks on NATO’s role in Afghanistan",
      "description": "Italian PM Giorgia Meloni calls Trump's NATO comments about Afghanistan \"unacceptable,\" defending Italy's sacrifice of 53 soldiers killed in the conflict.",
      "url": "https://www.foxnews.com/world/italys-meloni-rebukes-trump-remarks-natos-role-afghanistan",
      "published": "Sun, 25 Jan 2026 14:10:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Israeli woman watches TV report of her death in Iran protests",
      "description": "An Israeli woman was shocked to discover that Israeli media was falsely reporting about her death during Iran protests.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/27/israeli-woman-watches-tv-report-of-her-death-in-iran-protests?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:37:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘Cycle of attacks must end’: Lead UN official in Ukraine",
      "description": "The senior UN official in Ukraine, Matthias Schmale, has issued a condemnation of the massive overnight Russian drone and missile strike on several major Ukrainian cities, killing and injuring civilians, and knocking out energy infrastructure amid sub-zero temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166825",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Chinese hackers reportedly breached phones at 'heart of Downing Street' in global spy campaign",
      "description": "Chinese state-linked hackers reportedly breached phones \"at the heart of Downing Street,\" and allegedly accessed the phone data of millions.",
      "url": "https://www.foxnews.com/world/chinese-hackers-reportedly-breached-phones-heart-downing-street-global-spy-campaign",
      "published": "Mon, 26 Jan 2026 18:53:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Gunmen storm Mexico football pitch and kill at least 11 people",
      "description": "The incident happened in Salamanca, a city particularly subject to gang-related violence.",
      "url": "https://www.bbc.com/news/articles/cp80419gggro?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 11:29:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "At least 15 dead and hundreds rescued after ferry sinks in southern Philippines",
      "description": "At least 15 people have died after a ferry sank in the southern Philippines overnight.",
      "url": "https://news.sky.com/story/at-least-15-dead-and-hundreds-rescued-after-ferry-sinks-in-southern-philippines-13499059",
      "published": "Mon, 26 Jan 2026 04:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Texas teen dies after Jeep-pulled sled strikes curb and tree during severe winter storm",
      "description": "Teen dies in sledding accident involving Jeep in Frisco, Texas, authorities said. Another 16-year-old remains critical after sled struck curb, hit tree.",
      "url": "https://www.foxnews.com/us/texas-teen-dies-after-jeep-pulled-sled-strikes-curb-tree-during-severe-winter-storm",
      "published": "Tue, 27 Jan 2026 08:16:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Firefighters battle 'emergency level' blazes in Australia heatwave",
      "description": "Firefighters in Victoria are battling at least six major fires amid a record-breaking heatwave.",
      "url": "https://www.bbc.com/news/articles/cpqyp9w84eeo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 07:30:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Heat records tumble in Victoria as authorities warn against complacency amid significant blazes",
      "description": "BoM to check if Walpeup and Hopetoun broke state’s official heat record - set during 2009’s Black Saturday What happens to the human body in 49C heat? Australians are finding out Get our breaking news email , free app or daily news podcast Victoria may have sweltered through its hottest temperatures on record, with preliminary readings of 48.9C at two locations in the state’s north-west both higher than that recorded during 2009’s Black Saturday . According to initial data recorded by the Bureau of Meteorology, the Mallee towns of Hopetoun and Walpeup reached 48.9C on Tuesday afternoon. This would exceed the previous highest temperature of 48.8C, recorded at Hopetoun on 7 February 2009. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/27/victoria-melbourne-weather-forecast-fire-danger-extreme-heatwave-bushfire-risk",
      "published": "Tue, 27 Jan 2026 08:52:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Workers from Bangladesh sought jobs in Russia but got sent to combat in Ukraine",
      "description": "An Associated Press investigation found that Bangladeshi workers were lured to Russia by the false promise of civilian jobs and thrust onto the battlefield in the Ukraine war",
      "url": "https://abcnews.go.com/International/wireStory/workers-bangladesh-sought-jobs-russia-combat-ukraine-129588588",
      "published": "Tue, 27 Jan 2026 03:53:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "From deepfakes to grooming: UN warns of escalating AI threats to children",
      "description": "The staggering amount of harmful AI-generated online content has prompted an urgent call from across the UN system for a raft of measures to protect children from abuse, exploitation and mental trauma.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166827",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Repeat offender street racing at 106 mph mows down EMT after previously killing someone in crash: police",
      "description": "Dayton Milligan of Wisconsin was arrested after EMT Meng Kue was killed this month in a Milwaukee hit-and-run street-racing crash, police say.",
      "url": "https://www.foxnews.com/us/repeat-offender-street-racing-106-mph-mows-down-emt-after-previously-killing-someone-crash-police",
      "published": "Mon, 26 Jan 2026 15:39:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Private jet carrying eight people crashes in Maine",
      "description": "Poor visibility was reported at the airport during a winter storm that has affected a large swathe of the US.",
      "url": "https://www.bbc.com/news/articles/cddgqqd0peno?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 16:51:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Gaza’s unequal dead: 10,000 Palestinians under rubble, one Israeli captive",
      "description": "Israel razes 200 graves for body of final captive while thousands of Palestinians killed are lost and unidentified.",
      "url": "https://www.aljazeera.com/news/2026/1/27/gazas-unequal-dead-10000-palestinians-under-rubble-one-israeli-captive?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 13:14:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Flooding hammers Mozambique, southern African neighbors",
      "description": "Weeks of heavy rainfall have caused severe floods across southern Africa, with Mozambique and South Africa among the hardest hit. Rising water has destroyed infrastructure, affecting 1.3 million people.",
      "url": "https://www.dw.com/en/flooding-hammers-mozambique-southern-african-neighbors/a-75673858?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 11:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Canada gives approval for Marineland to export remaining belugas to the US",
      "description": "Canada’s last captive whales have a received a reprieve from death after the Canadian government conditionally approved a plan to export them to the United States",
      "url": "https://abcnews.go.com/International/wireStory/canada-conditional-approval-marineland-export-remaining-belugas-us-129582288",
      "published": "Mon, 26 Jan 2026 19:15:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Deadly shipwrecks in the Mediterranean, Duterte trial update, final hostage remains recovered in Gaza, FAO boosts farming in Haiti",
      "description": "The UN migration agency, IOM, expressed deep concern on Monday over multiple deadly shipwrecks that are believed to have taken place over the past ten days across the Central Mediterranean.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166834",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Gaza reconstruction talks must not distract from massive needs, say UN aid agencies",
      "description": "Amid reconstruction talks on Gaza linked to President Trump's just-launched Board of Peace, UN aid agencies insisted on Friday that what Gazans need most is immediate relief from the ongoing humanitarian catastrophe there.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166815",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Feds charge 87 individuals in massive ATM 'jackpotting' operation linked to Tren de Aragua gang",
      "description": "Massive ATM theft ring exposed 87 members of Venezuelan gang Tren de Aragua accused of stealing millions through \"jackpotting\" scheme to fund terrorism.",
      "url": "https://www.foxnews.com/us/feds-charge-87-individuals-massive-atm-jackpotting-operation-linked-tren-de-aragua-gang",
      "published": "Mon, 26 Jan 2026 21:20:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Spain slashes speed limit on popular train route after fault found",
      "description": "The discovery of a crack on the Madrid-Barcelona line follows two recent deadly crashes in the country.",
      "url": "https://www.bbc.com/news/articles/ckgy049ypd5o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 15:17:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Kremlin says Abu Dhabi talks 'constructive'",
      "description": "Moscow says trilateral talks with the US and Ukraine are set to continue next week, but key issues remain open. Germany and Latvia called for more action against Russian hybrid attacks and shadow fleet.",
      "url": "https://www.dw.com/en/ukraine-updates-kremlin-says-abu-dhabi-talks-constructive/live-75667003?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 18:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "French firm supports ICE in tracking immigrants",
      "description": "French tech company Capgemini supports ICE by managing a victim hotline and building a $365 million 'skip tracing' system to locate undocumented immigrants. The company removed a post on its website describing the ICE contract after public scrutiny. Capgemini’s CEO says the US subsidiary operates independently and claims he was unaware of the contracts, but he will review the situation. Here's a FRANCE 2 report.",
      "url": "https://www.france24.com/en/french-firm-supports-ice-in-tracking-immigrants",
      "published": "Tue, 27 Jan 2026 10:38:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran’s currency, the rial, falls to 1.5 million to $1, a record low after nationwide protests sparked by economic woes",
      "description": "Iran’s currency, the rial, falls to 1.5 million to $1, a record low after nationwide protests sparked by economic woes",
      "url": "https://abcnews.go.com/International/wireStory/irans-currency-rial-falls-15-million-1-record-129590791",
      "published": "Tue, 27 Jan 2026 06:17:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "A ceasefire holds in Syria but civilians live with fear and resentment",
      "description": "A fragile ceasefire between Syria's government and Kurdish-led forces has temporarily eased tensions in the country's northeast",
      "url": "https://abcnews.go.com/International/wireStory/ceasefire-holds-syria-civilians-live-fear-resentment-129587814",
      "published": "Tue, 27 Jan 2026 02:29:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "FBI investigating Minnesota anti-ICE Signal group chats, Patel says",
      "description": "FBI Director Kash Patel announces investigation into alleged Signal group chats used by anti-ICE activists to track federal agents in Minneapolis.",
      "url": "https://www.foxnews.com/us/fbi-investigating-minnesota-anti-ice-signal-group-chats-patel-says",
      "published": "Tue, 27 Jan 2026 07:56:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Skier suffers brutal mauling after stepping within 10 feet of snow leopard for photo, video shows",
      "description": "Female skier survives snow leopard mauling in China's Fuyun County after authorities warned tourists about predator sightings near hotel, according to reports.",
      "url": "https://www.foxnews.com/world/skier-suffers-brutal-mauling-stepping-10-feet-snow-leopard-photo-video-shows",
      "published": "Mon, 26 Jan 2026 19:18:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "China experts raise alarms over Xi’s sweeping military purge",
      "description": "Military turmoil in China raises Taiwan invasion concerns as Xi Jinping removes senior officers. Analysts warn of growing instability despite control.",
      "url": "https://www.foxnews.com/world/china-experts-raise-alarms-over-xis-sweeping-military-purge",
      "published": "Mon, 26 Jan 2026 15:51:33 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Why Japan’s economic plans are sending jitters through global markets",
      "description": "Japanese prime minister's pledge to suspend consumption tax prompts turmoil in bond markets.",
      "url": "https://www.aljazeera.com/economy/2026/1/27/why-japans-economic-plans-are-sending-jitters-through-global-markets?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 14:03:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Spain to host 2030 World Cup final, its football federation president says",
      "description": "Spain, Portugal, Morocco are tournament cohosts, but FIFA, which has the final say, has not said who will get last game.",
      "url": "https://www.aljazeera.com/sports/2026/1/27/spanish-football-president-declares-it-will-host-2030-world-cup-final?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 13:24:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Gravely ill pro-Palestine activist ends hunger, thirst strike in UK prison",
      "description": "The months-long rolling protest joined by eight Palestine Action-linked activists concludes as Umer Khalid ends strike.",
      "url": "https://www.aljazeera.com/news/2026/1/27/gravely-ill-pro-palestine-activist-ends-hunger-thirst-strike-in-prison?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:12:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Guyanese businessman facing US extradition elected opposition leader",
      "description": "Azruddin Mohamed’s election comes six months after he formed political party that became country’s second largest A Guyanese businessman facing extradition to the US on gold-smuggling and money-laundering charges has been elected as the country’s opposition leader, six months after he formed a political party that quickly became the second largest in the South American country . Azruddin Mohamed, 38, was confirmed as Guyana’s opposition leader after 16 lawmakers from the We Invest in Nationhood party (Win) and another from a single-seat outfit voted in his favor. The tally made Win the second-largest party in parliament, securing Mohamed’s election even as a magistrate’s court hears state arguments for his extradition to the US. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/guyana-opposition-leader-us-extradition",
      "published": "Mon, 26 Jan 2026 18:26:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Police release new photos of vehicle as search for alleged Lake Cargelligo shooter continues – as it happened",
      "description": "This blog is now closed Heat records tumble in Victoria as authorities warn against complacency amid significant blazes Get our breaking news email , free app or daily news podcast Victoria to open nation’s first offshore wind auction this year Australia’s first offshore wind auction is set to kick off this year, with the Victorian Government announcing it would invite tenders for 2 gigawatts of capacity in August. We want to give industry the certainty it needs to invest and help us keep building the renewable energy Victoria needs to push down energy bills. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/27/australia-news-live-out-of-control-victorian-bushfire-threatens-towns-as-intense-heatwave-moves-east",
      "published": "Tue, 27 Jan 2026 07:43:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. strikes on alleged drug boats have done little to stop the flow of illegal drugs",
      "description": "Despite dozens of lethal U.S. military strikes on suspected narco-boats, drug flows continue, allies are alarmed, and Caribbean fishermen say their livelihoods are under threat.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5688765/u-s-strikes-on-alleged-drug-boats-have-done-little-to-stop-the-flow-of-illegal-drugs",
      "published": "Tue, 27 Jan 2026 04:44:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "German FA believe World Cup boycott would be 'misguided'",
      "description": "At the first DFL meeting of 2026, German FA boss Bernd Neuendorf spoke for the first time about a World Cup boycott.",
      "url": "https://www.dw.com/en/german-fa-believe-world-cup-boycott-would-be-misguided/a-75671261?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 09:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU, India clinch historic free trade deal",
      "description": "The deal aims to forge a market of two billion people and nearly a quarter of global GDP, according to the European Commission.",
      "url": "https://www.dw.com/en/eu-india-clinch-historic-free-trade-deal/live-75669574?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 02:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "When Sufi devotion meets the symphony: The Orchestral Qawwali Project",
      "description": "Born in lockdown and watched by millions, the Orchestral Qawwali Project is transforming a 700-year-old sacred tradition for a global stage. Led by singer Abi Sampa and composer Rushil Ranjan, the project fuses the ecstatic poetry and trance-like repetition of Sufi qawwali with the sweeping power of Western orchestral music.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260127-when-sufi-devotion-meets-the-symphony-the-orchestral-qawwali-project",
      "published": "Tue, 27 Jan 2026 14:22:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU and India sign trade deal, 15 years in the making, ushering in a 'multidimensional relationship'",
      "description": "Delano D'Souza welcomes Dr Chietigj Bajpaee, Senior Research fellow for South Asia in the Asia-Pacific Programme at Chatham House. The recently agreed EU–India trade deal represents a geopolitical and economic milestone. After 15 years of negotiations, the agreement aims to reduce tariffs on a wide array of goods, deepen economic ties, and broaden cooperation beyond trade into mobility and technology. All the while, politically sensitive sectors like agriculture were excluded and broader strategic tensions, especially India’s relationship with Russia, cast a dark shadow. At its core, this deal reflects longstanding partnership ambitions coupled with added pressures from global economic competition.",
      "url": "https://www.france24.com/en/video/20260127-eu-and-india-sign-trade-deal-15-years-in-the-making-ushering-in-a-multidimensional-relationship",
      "published": "Tue, 27 Jan 2026 14:08:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "What does China's purging of top military leader mean for Xi's power?",
      "description": "PRESS REVIEW – Tuesday, January 27: Chinese President Xi Jinping's purging of his top military leader is described as a \"seismic\" event for Xi and his iron-clad grip on power in China. Also, diplomatic tensions erupt between Italy and Switzerland over the ongoing investigation into the deadly Crans-Montana bar fire. Plus, after Dry January, it's time for the digital detox known as \"Off February\".",
      "url": "https://www.france24.com/en/tv-shows/press-review/20260127-what-does-china-s-purging-of-top-military-leader-mean-for-xi-s-power",
      "published": "Tue, 27 Jan 2026 13:12:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The Bright Side: Researchers glimpse early signs of human technology with oldest wooden tools",
      "description": "The world's oldest wooden tools – likely dating back 430,000 years and possibly used by Neanderthals or early human ancestors – have been uncovered in Greece's Megalopolis basin. Researchers say the spindly stick used for digging and a handheld chunk of wood, possibly used to shape stones, give a rare glimpse of early human technology.",
      "url": "https://www.france24.com/en/europe/20260127-bright-side-researchers-glimpse-early-human-technology-world-oldest-wooden-tools",
      "published": "Tue, 27 Jan 2026 11:05:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'Mother of all' trade deals signed between India and EU",
      "description": "India and the European Union announced a landmark trade deal after two decades of talks, creating a market of two billion people and aiming to strengthen ties against global economic pressures from the US and China. The agreement will cut or eliminate tariffs on nearly 97% of EU exports, potentially saving up to 4 billion euros annually. Leaders hailed the pact as a major opportunity for both economies, representing a significant share of global GDP and trade.",
      "url": "https://www.france24.com/en/mother-of-all-trade-deals-signed-between-india-and-eu",
      "published": "Tue, 27 Jan 2026 11:00:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Climber Alex Honnold scales Taipei 101 skyscraper without ropes",
      "description": "American climber Alex Honnold ascended one of the world's tallest buildings on Sunday without a rope or protective equipment.",
      "url": "https://news.sky.com/story/climber-alex-honnold-scales-taipei-101-skyscraper-without-ropes-13498734",
      "published": "Sun, 25 Jan 2026 08:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Child kidnapped for organ removal among 4,414 helped in trafficking crackdown",
      "description": "An eight-year-old boy kidnapped for organ removal is among 4,414 people police say have been safeguarded from human trafficking in a global operation.",
      "url": "https://news.sky.com/story/child-kidnapped-for-organ-removal-among-4414-helped-in-trafficking-crackdown-13499144",
      "published": "Mon, 26 Jan 2026 10:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The first refugee to lead the UN refugee agency calls this a 'very difficult moment in history'",
      "description": "The first refugee to lead the U_N_ refugee agency tells The Associated Press that the world faces a “very difficult moment in history.”",
      "url": "https://abcnews.go.com/International/wireStory/refugee-lead-refugee-agency-calls-difficult-moment-history-129577204",
      "published": "Mon, 26 Jan 2026 17:05:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Young people must be ‘truly involved’ in transforming education",
      "description": "With young people under 30 making up more than half of the global population and over 272 million children and youth still out of school, their participation in shaping education is becoming increasingly vital.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166820",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Eighty years at the heart of global development",
      "description": "From humanitarian crises and youth unemployment, to climate resilience and development financing, many of today’s global challenges pass through a single United Nations body that is quietly turning 80 this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166814",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Emory fires Iranian official's daughter after campus protests over controversial hiring decision",
      "description": "Fatemeh Ardeshir-Larijani, daughter of sanctioned Iranian official Ali Larijani, lost her position at Emory University as activists called for review of her immigration status.",
      "url": "https://www.foxnews.com/world/emory-university-dismisses-daughter-senior-iranian-official-ali-larijani-campus-demonstrations",
      "published": "Sun, 25 Jan 2026 20:25:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian militiaman shows off what he claims to be severed Kurdish fighter's braid as Damascus asserts control",
      "description": "A video of a Syrian fighter holding a braid he claims was taken from a Kurdish woman in Raqqa sparked outrage and protests as Damascus expands control amid a fragile ceasefire.",
      "url": "https://www.foxnews.com/world/syrian-militiaman-shows-off-what-he-claims-severed-kurdish-fighters-braid-damascus-asserts-control",
      "published": "Sun, 25 Jan 2026 16:42:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Deadly US winter storm leaves flights delayed and thousands without power",
      "description": "At least a dozen people have died in multiple US states possibly due to the storm, officials have said.",
      "url": "https://www.bbc.com/news/articles/cp3z8ek7eqyo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 10:20:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Video: Immigrant families held in Texas stage protest over detention of boy",
      "description": "Video shows dozens of immigrant families protesting at a detention facility in the US state of Texas.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/27/video-immigrant-families-held-in-texas-stage-protest-over-detention-of-boy?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:17:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds feared dead in attempt to cross Mediterranean during cyclone",
      "description": "Fifty killed in one incident as Italian authorities estimate 380 people may have drowned last week Up to 380 people may have drowned attempting to cross the Mediterranean last week as Cyclone Harry battered southern Italy and Malta, the Italian coastguard has said, as a shipwreck with the loss of 50 lives was confirmed by Maltese authorities. Just one person, who was hospitalised in Malta, survived the shipwreck, which happened on Friday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/hundreds-feared-dead-after-attempting-to-cross-mediterranean-amid-cyclone-harry",
      "published": "Mon, 26 Jan 2026 14:54:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘She doesn’t want to be here’: five-year-old US citizen and her mother deported to Honduras",
      "description": "Mother whose visa application was pending says she will send girl back to US soon accompanied by another relative Five-year-old Génesis Ester Gutiérrez Castellanos misses her cousins, classmates and kindergarten teachers in Austin, Texas. Despite being a US citizen, she was deported on 11 January alongside her mother, Karen Guadalupe Gutiérrez Castellanos, to Honduras, a country Génesis had never known. Immigration and Customs Enforcement (ICE) agents were acting on an administrative deportation order against Gutiérrez, 26, issued in 2019, before Génesis was born. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/27/five-year-old-girl-us-citizen-and-mother-deported-honduras",
      "published": "Tue, 27 Jan 2026 12:56:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel finds the last hostage body in Gaza, paving the way for next steps in Trump plan",
      "description": "The Israeli military says the body of Ran Gvili, a 24-year-old special forces policeman killed while fighting Hamas militants on Oct. 7, 2023, has been found.",
      "url": "https://www.npr.org/2026/01/26/g-s1-107340/israel-gaza-hostage-remains-hamas",
      "published": "Mon, 26 Jan 2026 09:17:36 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "France could become second country to ban social media for some teens",
      "description": "France is set to debate a proposed social media ban for those under 15 years old, as the country's president backs stricter rules and a high school phone ban.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5686578/france-could-become-second-country-to-ban-social-media-for-some-teens",
      "published": "Mon, 26 Jan 2026 04:48:37 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Holocaust survivor Leon Weintraub: \"We were dehumanized\"",
      "description": "The 100-year-old vividly recalls the hunger, death camps and cruelty of the guards. Thus, he tirelessly works to ensure that the Holocaust is never forgotten.",
      "url": "https://www.dw.com/en/holocaust-survivor-leon-weintraub-we-were-dehumanized/a-75663240?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 09:10:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Europe’s dependence on the US underlined by NATO Secretary General",
      "description": "NATO Secretary General Mark Rutte, often called the 'Trump whisperer', addressed the European Parliament emphasizing that Europe cannot defend itself without the United States, stressing mutual dependence within the alliance. As a Dutch leader balancing relations between Trump and Europe, Rutte has used a strategy of praising Trump and maintaining close contact, helping to ease transatlantic tensions and prevent potential crises such as Trump’s threats against Greenland and tariffs on Europe.",
      "url": "https://www.france24.com/en/europe-s-dependence-on-the-us-underlined-by-nato-secretary-general",
      "published": "Tue, 27 Jan 2026 11:03:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Philippines grounds company's fleet of passenger ships after at least 18 die in ferry sinking",
      "description": "Philippine officials have grounded the entire fleet of passenger ships belonging to a company that owned a ferry that sank in the south and left at least 18 people dead, with more than 300 others rescued",
      "url": "https://abcnews.go.com/International/wireStory/philippines-grounds-companys-fleet-passenger-ships-after-18-129589677",
      "published": "Tue, 27 Jan 2026 03:54:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea launches suspected ballistic missiles toward the sea, neighbors say",
      "description": "North Korea has launched short-range ballistic missiles into the sea",
      "url": "https://abcnews.go.com/International/wireStory/north-korea-launches-suspected-ballistic-missiles-sea-neighbors-129589070",
      "published": "Tue, 27 Jan 2026 08:33:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea says North Korea has launched an unidentified projectile toward the sea",
      "description": "South Korea says North Korea has launched an unidentified projectile toward the sea",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-north-korea-launched-unidentified-projectile-sea-129589072",
      "published": "Tue, 27 Jan 2026 03:45:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Between fear and survival: Women and girls flee violence in northern Syria",
      "description": "When fighting recently intensified near her neighbourhood in Aleppo, in northern Syria, Fatima and her family had to run.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166833",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Keeping people warm amid hostilities and harsh winter weather in Ukraine",
      "description": "As people in war-torn Ukraine face the coldest winter in more than a decade, authorities and humanitarians are working to help them stay warm, particularly the most vulnerable residents.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166822",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Through the heatwave haze, the hypocrisy of Australia’s fossil fuel policy shines bright | Clean Air",
      "description": "The heatwave in Melbourne and Adelaide this week is likely to become the norm. We should prepare now Want to get this in your inbox when it publishes? Sign up for the Clear Air Australia newsletter here On Tuesday, Australia’s second largest city baked through one of its hottest days since modern instrumental records began in 1910. Several Melbourne suburbs topped 45C. The country’s fifth largest city, Adelaide, reached that temperature on Monday. Its residents then suffered through their hottest night ever, with a minimum of about 34C. Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/27/through-the-heatwave-haze-the-hypocrisy-of-australias-fossil-fuel-policy-shines-bright",
      "published": "Tue, 27 Jan 2026 14:00:45 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "A new blow for UNRWA as headquarters in East Jerusalem 'set on fire'",
      "description": "The head of embattled UN relief agency for Palestinians, UNRWA, has condemned reports that its headquarters in East Jerusalem have been set alight deliberately.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166829",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "US to send ICE agents to Winter Olympics, prompting Italian anger",
      "description": "The US federal agency says it will not play an immigration role at February's event in Milan-Cortina.",
      "url": "https://www.bbc.com/news/articles/c5y29xzjdzvo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 12:59:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says he will impose new tariffs on South Korea as he criticises delays in trade deal",
      "description": "US president says tariffs on automobiles, lumber and pharmaceuticals will rise to 25%, accusing Seoul of not living up to a trade deal struck last year Donald Trump has said he is raising tariffs on South Korean goods including automobiles, lumber and pharmaceuticals, accusing the country of not living up to a trade deal struck last year and briefly sending shares in Korean carmakers tumbling. In a post on social media, the US president said the tariffs paid on South Korean exports into America would rise from 15% to 25% because the “Korean Legislature hasn’t enacted our Historic Trade Agreement, which is their prerogative”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/27/trump-raises-south-korea-tariffs-carmakers-shares-fall",
      "published": "Tue, 27 Jan 2026 05:51:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Sussan Ley has two factors working in her favour as rumours of a Liberal leadership mutiny swirl",
      "description": "As Andrew Hastie and Angus Taylor emerge as likely challengers, two things could buy Ley some time Get our breaking news email , free app or daily news podcast In the chaotic few hours after the Nationals leader, David Littleproud, blew up the Coalition, one thing appeared clear to many Liberal MPs. Sussan Ley’s leadership of the Liberal party was all but over. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/28/sussan-ley-liberal-leadership-two-factors-working-in-her-favour",
      "published": "Tue, 27 Jan 2026 14:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "In China, AI is no longer optional for some kids. It's part of the curriculum",
      "description": "While debate rages in the U.S. about the merits and risks of AI in schools, it's become a state-mandated part of the curriculum in China, as the authorities try to create a pool of AI-savvy professionals.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5683821/china-ai-schools-curriculum",
      "published": "Tue, 27 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Spain to grant legal status to thousands of immigrants lacking permission",
      "description": "Spain's government has announced it will grant legal status to potentially hundreds of thousands of immigrants living and working in the country without authorization",
      "url": "https://abcnews.go.com/International/wireStory/surprise-move-spain-grant-legal-status-thousands-immigrants-129593469",
      "published": "Tue, 27 Jan 2026 08:45:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Days after a disputed election, Uganda's army is on the hunt for opposition leader Bobi Wine",
      "description": "A military hunt is underway in Uganda opposition leader Bobi Wine, whom the country's army chief is calling a wanted fugitive",
      "url": "https://abcnews.go.com/International/wireStory/days-after-disputed-election-ugandas-army-hunt-opposition-129592334",
      "published": "Tue, 27 Jan 2026 07:37:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Federal appeals court sides with the Trump administration in Minnesota and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/federal-appeals-court-sides-trump-administration-minnesota-more-top-headlines",
      "published": "Tue, 27 Jan 2026 07:09:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Sewage spill sends E coli surging in the Potomac River near DC",
      "description": "Potomac River sewage spill creates E. coli contamination 12,000 times above safe limits near Washington, D.C., affecting local waterways and public health.",
      "url": "https://www.foxnews.com/us/sewage-spill-sends-e-coli-surging-potomac-river-near-dc",
      "published": "Mon, 26 Jan 2026 21:55:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Former Louisiana high school teacher indicted for allegedly trying to entice student into sex",
      "description": "Ex-Louisiana teacher Katherine Albarado accused of sending explicit messages to 16-year-old student faces federal charges and potential life sentence.",
      "url": "https://www.foxnews.com/us/former-louisiana-high-school-teacher-indicted-entice-student-sex",
      "published": "Mon, 26 Jan 2026 15:48:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Nipah virus outbreak in India triggers Asia airport screenings",
      "description": "Airports in Thailand and Nepal have begun screening passengers from West Bengal.",
      "url": "https://www.bbc.com/news/articles/cd7zp581q5do?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 08:02:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Nigerian officers to face trial over coup-plot allegations",
      "description": "Following an investigation some of the 16 detained last year are accused of planning to unseat President Bola Tinubu.",
      "url": "https://www.bbc.com/news/articles/c9dv4wlw3yzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 19:07:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US downplays China threat in new defence strategy",
      "description": "Al Jazeera’s Linh Nguyen breaks down the US's new defence strategy.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/27/us-downplays-china-threat-in-new-defence-strategy?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 13:05:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘I would keep my expectations low for a Gaza ceasefire phase two’",
      "description": "‘I would keep my expectations low for a Gaza ceasefire phase two’",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/27/i-would-keep-my-expectations-low-for-a-gaza-ceasefire-phase?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:52:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What’s in phase two of the Gaza ceasefire?",
      "description": "The Gaza ceasefire is moving to phase two after Israel announced that it had recovered the body of the last captive.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/27/whats-in-phase-two-of-the-gaza-ceasefire?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:04:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fate of China’s top general more likely to do with power struggle than corruption",
      "description": "Experts suggest Xi Jinping is asserting his authority by sidelining an officer who has significantly betrayed his trust Standing inches from Xi Jinping at a military ceremony in late December, China’s highest-ranking general, Zhang Youxia, may have had little inkling about the fate that was to befall him just a few weeks later when he was put under investigation. The 75-year-old’s physical proximity to China’s leader, who stands to his right, reflects the position he holds in China’s hierarchy. As vice-chair of the Central Military Commission (CMC), the ruling body of the People’s Liberation Army (PLA), he is the second-most powerful person in China’s military, after Xi, the commander-in-chief. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/china-top-general-zhang-youxia-power-struggle-corruption",
      "published": "Mon, 26 Jan 2026 19:09:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel says it has recovered the last remaining body of a hostage held in Gaza",
      "description": "The recovery is a major breakthrough in moving a three-month ceasefire in Gaza into its next phase.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5688794/israel-says-it-has-recovered-the-last-remaining-body-of-a-hostage-held-in-gaza",
      "published": "Mon, 26 Jan 2026 15:03:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Protests in Iran: Ali Karimi leads sports' call for support",
      "description": "Former Iran and Bayern Munich footballer Ali Karimi has signed an open letter, asking FIFA to act. He is not the only athlete to be vocal.",
      "url": "https://www.dw.com/en/protests-in-iran-ali-karimi-leads-sports-call-for-support/a-75673788?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 13:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "France, Germany, UK, US urge all parties to ‘strictly adhere’ to Syria ceasefire",
      "description": "France, Britain, Germany and the ​US on Tuesday welcomed the 15-day extension of ​the ceasefire between ‍the Syrian government and ​Kurdish forces, and urged all ​parties to strictly adhere to the agreement.",
      "url": "https://www.france24.com/en/middle-east/20260127-france-germany-uk-us-urge-all-parties-to-strictly-adhere-to-syria-ceasefire",
      "published": "Tue, 27 Jan 2026 14:21:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US: Who is Tom Homan, Trump’s hardline immigration adviser ?",
      "description": "Tom Homan, a trusted adviser of President Trump and former ICE director known as the “border czar,” has been sent to Minneapolis to work with local authorities on immigration issues. Homan, credited with enforcing Trump’s hardline border policies, including family separations in 2018, remains focused on border security. Trump praised him as “tough but fair” and has even cited him as a key figure in his immigration agenda. Homan is scheduled to meet Minneapolis Mayor Jacob Frey to discuss the next steps in the city.",
      "url": "https://www.france24.com/en/us-who-is-tom-homan-trump-s-hardline-immigration-adviser",
      "published": "Tue, 27 Jan 2026 11:35:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "EU opens investigation into Grok over sexual deepfakes",
      "description": "The European Union opened a formal investigation into Elon Musk's social media platform X on Monday after his artificial intelligence chatbot Grok spewed nonconsensual sexualized deepfake images on the platform.",
      "url": "https://www.france24.com/en/eu-opens-investigation-into-grok-over-sexual-deepfakes",
      "published": "Tue, 27 Jan 2026 11:33:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza ceasefire improves aid access, but children still face deadly conditions",
      "description": "The fragile ceasefire in the Gaza Strip is making a difference to the lives of over a million children, and improving overall access to food - but more aid still needs to enter.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166835",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anti-ICE agitators arrested outside Minnesota hotel as police declare unlawful assembly: 'No longer peaceful'",
      "description": "Police arrested anti-ICE protesters in Minnesota after they allegedly threw objects at officers outside a hotel where Border Patrol commander was suspect to be staying.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-arrested-outside-minnesota-hotel-police-declare-unlawful-assembly-no-longer-peaceful",
      "published": "Tue, 27 Jan 2026 03:13:21 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Shirtless Florida man who jumped through Taco Bell window, robbed it with 'large rock' sentenced to 4 years",
      "description": "A Florida man was sentenced to four years in prison after his shirtless Taco Bell robbery using a \"large rock\" to threaten workers and customers.",
      "url": "https://www.foxnews.com/us/shirtless-florida-man-who-jumped-through-taco-bell-window-robbed-large-rock-sentenced-4-years",
      "published": "Mon, 26 Jan 2026 23:04:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says Iran called 'numerous' times to make deal as carrier enters Middle East waters",
      "description": "President Donald Trump indicated Iran is seeking negotiations as the USS Abraham Lincoln carrier enters the region and protests continue inside Iran.",
      "url": "https://www.foxnews.com/world/trump-says-iran-called-numerous-times-make-deal-carrier-enters-middle-east-waters",
      "published": "Mon, 26 Jan 2026 19:55:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "UK's Starmer heads to China seeking a thaw in relations but risking a rift with Trump",
      "description": "U.K. Prime Minister Keir Starmer is heading to China, aiming to improve relations with Beijing amid tensions with the United States",
      "url": "https://abcnews.go.com/International/wireStory/uks-starmer-heads-china-seeking-thaw-relations-risking-129587744",
      "published": "Tue, 27 Jan 2026 02:45:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Activists fear U.S. visa restrictions for Palestinians will hurt diplomacy",
      "description": "Palestinians can no longer apply for a U.S. visa with documents issued by the Palestinian Authority -- another sign, they say, that the Trump administration is sidelining Palestinians.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5668158/activists-fear-u-s-visa-restrictions-for-palestinians-will-hurt-diplomacy",
      "published": "Tue, 27 Jan 2026 04:43:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "France's lawmakers vote to ban social media for under-15s",
      "description": "As social media usage has grown, it has heightened concerns about excessive screen time and its negative impact on child development and mental health.",
      "url": "https://www.dw.com/en/france-s-lawmakers-vote-to-ban-social-media-for-under-15s/a-75669653?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 02:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria: Military officers to face trial over coup plot",
      "description": "The alleged coup plot raises concerns in a region that has already witnessed a series of military takeovers in recent years.",
      "url": "https://www.dw.com/en/nigeria-military-officers-to-face-trial-over-coup-plot/a-75669470?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 00:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Limited access restored to Syria’s Al Hol camp amid security concerns",
      "description": "United Nations agencies have regained limited access to Syria’s Al Hol camp and resumed the delivery of essential supplies after days of disruption caused by a volatile security situation, the UN Deputy Spokesperson said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166824",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Russia reportedly slams Trump’s Golden Dome as 'provocative' as trillion-dollar shield takes shape",
      "description": "Russia reportedly called the U.S. Golden Dome missile defense project \"provocative\" as an expert says Russia's reaction shows the system's power as a bargaining chip.",
      "url": "https://www.foxnews.com/world/russia-reportedly-slams-trumps-golden-dome-provocative-trillion-dollar-shield-takes-shape",
      "published": "Mon, 26 Jan 2026 16:26:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Immigration chief at centre of Trump's crackdown set to leave Minneapolis",
      "description": "The US president is sending border tsar Tom Homan to the city in an apparent shift in tone from the White House.",
      "url": "https://www.bbc.com/news/articles/cgrdlr70qg4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 09:30:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Celebrations after Sudan military says broken siege of key town",
      "description": "Sudan’s military claimed to have broken a siege by the paramilitary Rapid Support Forces on a key town in South Kordofan",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/27/celebrations-after-sudan-military-says-broken-siege-of-key-town?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:34:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Sudan army says two-year RSF siege of key town broken",
      "description": "Dilling, a key route for supply lines, had been under the paramilitary group's control for nearly two years.",
      "url": "https://www.aljazeera.com/news/2026/1/27/sudan-army-says-nearly-two-year-rsf-siege-of-key-town-broken?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 11:34:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Toronto digs itself out after largest snowfall in city’s history",
      "description": "Some parts of city were buried under nearly 60cm of snow and over 500 flights were cancelled Sunday Toronto is beginning to dig itself out from the largest snowfall in the city’s history, a process which officials say is likely to take “several days”. Some parts of Canada’s largest city were buried under nearly 60cm (about 23in) of snow and more than 500 flights were cancelled Sunday after Toronto’s main airport was snowed in. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/toronto-snowstorm-record-snowfall-total",
      "published": "Mon, 26 Jan 2026 17:40:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "ICE agents to have role at Winter Olympics - but told they are 'not welcome'",
      "description": "ICE agents will have a security role at the Winter Olympics in Italy, it has been revealed, after the man who led the Trump administration's crackdown in Minneapolis was moved out of the city.",
      "url": "https://news.sky.com/story/public-face-of-trumps-minneapolis-crackdown-set-to-leave-city-as-presidents-tone-shifts-13499461",
      "published": "Mon, 26 Jan 2026 23:37:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Boat carrying 25 tourists capsizes, killing three",
      "description": "A boat carrying 25 French tourists has capsized off the coast of Oman, killing three, local police have said.",
      "url": "https://news.sky.com/story/boat-carrying-25-tourists-capsizes-off-coast-of-oman-killing-three-13496045",
      "published": "Thu, 22 Jan 2026 09:24:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Goma in eastern Congo is hanging by a thread a year after the city fell to Rwanda-backed rebels",
      "description": "The M23 rebel group still controls Goma, a year after taking the main city in eastern Congo",
      "url": "https://abcnews.go.com/International/wireStory/goma-eastern-congo-hanging-thread-year-after-city-129589827",
      "published": "Tue, 27 Jan 2026 04:10:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "India and EU announce 'mother of all trade deals'",
      "description": "The long-awaited deal comes as both Delhi and Brussels contend with economic and geopolitical pressure from the US.",
      "url": "https://www.bbc.com/news/articles/crrnee01r9jo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 12:23:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sweden aims to lower age of criminal responsibility to 13 as gangs recruit children",
      "description": "Critics say the proposal could see even younger children becoming offenders as well as breaching children's rights.",
      "url": "https://www.bbc.com/news/articles/c4gw49gk13xo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 12:26:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump raises US tariffs on South Korea imports to 25%",
      "description": "Trump has accused Seoul of \"not living up\" to a trade deal that was reached last year.",
      "url": "https://www.bbc.com/news/articles/cwyw3ynwe37o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 09:56:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan court orders compensation for migrants lured to North Korea",
      "description": "The plaintiffs said North Korea was marketed to them as \"paradise on Earth\".",
      "url": "https://www.bbc.com/news/articles/c23r2l81708o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 02:23:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Major step': French MPs vote in favour of bill to ban social media for under-15s",
      "description": "If the bill passes the upper house it could take effect by the start of France's new school year in September.",
      "url": "https://www.bbc.com/news/articles/c07x003vx0yo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 01:12:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sly Dunbar, prolific legend of reggae, dies aged 73",
      "description": "The drummer and producer played with everyone from Bob Marley to The Rolling Stones and Madonna.",
      "url": "https://www.bbc.com/news/articles/cn56300z220o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 22:35:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel says it has retrieved remains of final Gaza hostage",
      "description": "Israeli Prime Minister Benjamin Netanyahu called Ran Gvili’s return \"an extraordinary achievement\".",
      "url": "https://www.bbc.com/news/articles/c5ydvz7nz4mo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 18:37:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Instagram, Facebook and WhatsApp to trial premium subscriptions",
      "description": "Under the plan, access to the Meta platforms' core services would remain free.",
      "url": "https://www.bbc.com/news/articles/ce8rpdmm284o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 05:37:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Olympian Ryan Wedding pleads not guilty to drug kingpin charges",
      "description": "The ex-Olympic snowboarder and accused cartel leader was taken into custody in Mexico last week by the FBI.",
      "url": "https://www.bbc.com/news/articles/cedweq4lj25o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 22:46:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's military chief denies army assaulted Bobi Wine's wife",
      "description": "Barbara Kyagulanyi, married to the opposition leader, says she refused to reveal her husband's whereabouts.",
      "url": "https://www.bbc.com/news/articles/c20zdj8n7vgo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 10:31:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Meta, TikTok and YouTube face landmark trial over youth addiction claims",
      "description": "This marks the beginning of a legal onslaught that could erode Big Tech's longstanding defence.",
      "url": "https://www.aljazeera.com/news/2026/1/27/meta-tiktok-and-youtube-face-landmark-trial-over-youth-addiction-claims?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 14:15:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Have universities begun to favor ideology over truth?",
      "description": "Have universities begun to favor ideology over truth?",
      "url": "https://www.aljazeera.com/video/doha-debates/2026/1/27/have-universities-begun-to-favor-ideology-over-truth?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 14:08:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somalis in Minnesota",
      "description": "Maryam Mohamad is a Somali American who lives in Minnesota.",
      "url": "https://www.aljazeera.com/video/africa-now/2026/1/27/somalis-in-minnesota?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 13:21:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alcaraz crushes de Minaur to reach Australian semis; Svitolina beats Gauff",
      "description": "Carlos Alcaraz defeats Alex de Minaur to reach last four at Australian Open while Elina Svitolina sends Coco Gauff home.",
      "url": "https://www.aljazeera.com/sports/2026/1/27/alcaraz-crushes-de-minaur-to-reach-australian-semis-svitolina-beats-gauff?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:52:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Milan mayor blasts ICE as ‘militia that kills’ before Winter Olympics role",
      "description": "Milano Cortina Games are to open on February 6, but the event is already being overshadowed by the US agency's role.",
      "url": "https://www.aljazeera.com/sports/2026/1/27/ice-winter-olympics-move-sparks-anger-including-host-city-mayor-in-milan?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 12:00:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Not an easy process’: How is Ukraine, and Zelenskyy, tackling corruption?",
      "description": "A Ukrainian lawyer specialising in graft says criminal justice is a drawn-out process but hopes change is on the way.",
      "url": "https://www.aljazeera.com/news/2026/1/27/1865?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 11:27:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why neoliberalism can’t build peace",
      "description": "Neoliberal proposals for peace in Gaza, Ukraine’s Donbas and Syria’s Golan Heights are doomed to failure.",
      "url": "https://www.aljazeera.com/opinions/2026/1/27/why-neoliberalism-cant-build-peace?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 10:49:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian ex-Olympian pleads not guilty to 17 felonies including drug trafficking",
      "description": "Authorities allege Ryan Wedding, 44, ‘turned to a life of crime’ after his snowboarding career ended Ryan Wedding, the Canadian former Olympic snowboarder accused of cocaine distribution and orchestrating several murders, appeared on Monday in a southern California courtroom for arraignment. The 44-year-old has been charged with drug trafficking, conspiracy to murder, witness tampering and money laundering, among other charges. Authorities allege that after his snowboarding career, Wedding “turned to a life of crime” as a narcotics trafficker and led an organization that moved cocaine from South America to the US and Canada. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/26/canadian-ryan-wedding-ex-olympian-drug-trafficking",
      "published": "Mon, 26 Jan 2026 23:08:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alex Honnold free solos Taipei 101 skyscraper in live Netflix climb",
      "description": "US climber takes an hour and half to scale one of Asia’s tallest buildings without ropes or a harness The US rock climber Alex Honnold climbed one of Asia’s tallest skyscrapers without ropes or a harness on Sunday, fulfilling an ambition that began more than a decade ago and which he hoped would inspire people to pursue their own challenges because “time is finite”. Honnold, who starred in the 2019 Oscar-winning documentary Free Solo, ascended the 508-metre (1,667ft) Taipei 101 using the skyscraper’s horizontal metal beams to pull himself up with his bare hands. The challenge had originally been scheduled to take place on Saturday but was postponed because of rain. Continue reading...",
      "url": "https://www.theguardian.com/sport/2026/jan/24/alex-honnold-free-solo-taipei-101-netflix",
      "published": "Sun, 25 Jan 2026 13:05:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 5.5 - 9 km ESE of Dianga, China",
      "description": "PAGER - YELLOW ShakeMap - VII DYFI? - IV Time 2026-01-26 06:56:02 UTC 2026-01-26 06:56:02 UTC at epicenter Location 34.028°N 103.305°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rs2q",
      "published": "2026-01-27T07:23:20.332Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-26T22:26:52.574Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-25T08:09:13.060Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India and the EU clinch the 'mother of all deals' in a historic trade agreement",
      "description": "India and the European Union have reached a free trade agreement, at a time when Washington targets them both with steep import tariffs, pushing major economies to seek alternate partnerships.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5689875/india-eu-trade-agreement",
      "published": "Tue, 27 Jan 2026 08:11:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NATO chief wishes 'good luck' to those who think Europe can defend itself without U.S. help",
      "description": "NATO Secretary-General Mark Rutte insisted Monday that Europe is incapable of defending itself without U.S. military support and would have to more than double current military spending targets to be able to do so.",
      "url": "https://www.npr.org/2026/01/27/nx-s1-5689791/nato-chief-europe-defense-us",
      "published": "Tue, 27 Jan 2026 01:32:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea's 'fake news' law tests press autonomy",
      "description": "Critics accuse lawmakers of pushing measures that could stifle a free press, while Seoul says the changes are needed to manage the rapidly evolving media landscape.",
      "url": "https://www.dw.com/en/south-korea-s-fake-news-law-tests-press-autonomy/a-75677742?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Plastic emissions could double health damage by 2040",
      "description": "Plastic pollution could double its harm to human health in the coming decades if current production trends continue, according to a new study that links rising risks directly to the manufacture of new plastics.",
      "url": "https://www.dw.com/en/plastic-emissions-could-double-health-damage-by-2040/a-75677138?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 12:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "IOC rejects extra Winter Olympics spot for skeleton's Uhlaender",
      "description": "IOC President Kirsty Coventry had been asked to intervene after Katie Uhlaender was the victim of alleged competition manipulation, causing her to miss out on February's Winter Olympics.",
      "url": "https://www.dw.com/en/ioc-rejects-extra-winter-olympics-spot-for-skeleton-s-uhlaender/a-75639366?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 10:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Shadow economy grows to over $500B",
      "description": "A new study has said the German shadow economy has grown to its highest level in over decade. Meanwhile, Germany has welcomed a new trade agreement between the EU and India. DW has the latest.",
      "url": "https://www.dw.com/en/germany-news-shadow-economy-grows-to-over-500b/live-75671587?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 10:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Holocaust Remembrance Day: Europe remembers Nazi genocide",
      "description": "Auschwitz survivor Tatiana Bucci has addressed MEPs in a special session. An event will be held at the Auschwitz-Birkenau memorial in Poland to commemorate the concentration camp's liberation 81 years ago. DW has more.",
      "url": "https://www.dw.com/en/holocaust-remembrance-day-europe-remembers-nazi-genocide/live-75670801?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 09:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian Open tennis encounters extreme heat",
      "description": "Tournament organizers have instituted their extreme heat protocols amid blistering temperatures in the region.",
      "url": "https://www.dw.com/en/australian-open-tennis-encounters-extreme-heat/a-75669794?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 05:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ye aka Kanye West apologizes for antisemitic remarks",
      "description": "The artist previously known as Kanye West blamed his behavior on bipolar disorder, saying he \"lost touch with reality.\"",
      "url": "https://www.dw.com/en/ye-aka-kanye-west-apologizes-for-antisemitic-remarks/a-75669379?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 22:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Berlin's young Jews reveal complex experiences with antisemitism",
      "description": "Jewish people in Berlin have had varying experiences since October 7, 2023, but several DW spoke to say they have seen more antisemitism and have become increasingly cautious.",
      "url": "https://www.dw.com/en/berlin-s-young-jews-reveal-complex-experiences-with-antisemitism/a-75665838?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 20:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany, France, others rebuke Trump's NATO troop disrespect",
      "description": "German Defense Minister Boris Pistorius said it would show \"decency\" for Donald Trump to apologize for comments on NATO troops in Afghanistan. \"But we all know how the US president operates,\" Pistorius added.",
      "url": "https://www.dw.com/en/germany-france-others-rebuke-trump-s-nato-troop-disrespect/a-75666924?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 18:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French lawmakers approve bill banning social media for children under 15",
      "description": "French lawmakers approved a bill banning social media for children under 15, paving the way for the measure to enter into force at the start of the next school year in September, as the idea of setting a minimum age for use of the platforms gains momentum across Europe.",
      "url": "https://www.france24.com/en/french-lawmakers-approve-bill-banning-social-media-for-children-under-15",
      "published": "Tue, 27 Jan 2026 12:08:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK authorities help to seize 'narco sub' and record cocaine haul in Atlantic Ocean",
      "description": "British police have helped in seizing a record nine-tonne haul of cocaine from a 'narco sub' in the Atlantic Ocean.",
      "url": "https://news.sky.com/story/uk-authorities-help-to-seize-narco-sub-and-record-cocaine-haul-in-atlantic-ocean-13499583",
      "published": "Tue, 27 Jan 2026 11:42:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australia swelters in record heatwave as temperatures soar to nearly 50C",
      "description": "A major heatwave gripping southeast Australia has brought record-breaking temperatures of close to 50C.",
      "url": "https://news.sky.com/story/australia-swelters-in-record-heatwave-as-temperatures-soar-to-nearly-50c-13499553",
      "published": "Tue, 27 Jan 2026 10:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Remains of last Israeli hostage found in Gaza",
      "description": "The remains of the last Israeli hostage in Gaza have been found.",
      "url": "https://news.sky.com/story/remains-of-last-israeli-hostage-found-in-gaza-13499223",
      "published": "Mon, 26 Jan 2026 13:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India's prime minister says it has reached a free trade agreement with the European Union",
      "description": "India's prime minister says it has reached a free trade agreement with the European Union",
      "url": "https://abcnews.go.com/International/wireStory/indias-prime-minister-reached-free-trade-agreement-european-129588691",
      "published": "Tue, 27 Jan 2026 02:01:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A Holocaust survivor born in a concentration camp shares her story",
      "description": "Ilana Kantorowicz Shalem was born in the Bergen-Belsen concentration camp in March 1945, and is one of the youngest Holocaust survivors",
      "url": "https://abcnews.go.com/International/wireStory/holocaust-survivor-born-concentration-camp-shares-story-129588686",
      "published": "Tue, 27 Jan 2026 03:53:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russia offers cash bonuses, frees prisoners and lures foreigners to replenish its troops in Ukraine",
      "description": "Russian authorities use various strategies to recruit new troops to replenish its supply of soldiers for its nearly 4-year-old full-scale invasion of Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/russia-offers-cash-bonuses-frees-prisoners-lures-foreigners-129588455",
      "published": "Tue, 27 Jan 2026 03:29:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal's aquagym classes offer hope and healing for people with reduced mobility",
      "description": "Senegal’s first aquagym program has drawn praise from health professionals for helping people with reduced mobility caused by noncommunicable diseases",
      "url": "https://abcnews.go.com/International/wireStory/senegals-aquagym-classes-offer-hope-healing-people-reduced-129587838",
      "published": "Tue, 27 Jan 2026 00:17:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela releases dozens of prisoners in 2 days, hundreds more still detained",
      "description": "Venezuela’s leading prisoner rights organization says that dozens of prisoners were released over the weekend",
      "url": "https://abcnews.go.com/International/wireStory/venezuela-releases-dozens-prisoners-2-days-hundreds-detained-129578400",
      "published": "Mon, 26 Jan 2026 17:43:12 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From family farm to climate tech: How one Kenyan woman is helping farmers outsmart drought",
      "description": "“Giving up is not an option - so many people depend on you,” the words of Maryanne Gichanga, a participant in a UN supported initiative, which aims to help farmers in Kenya find solutions to alleviate the pressures of climate change on agriculture production.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166823",
      "published": "Sun, 25 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "California toddler falls out of moving car, mother charged",
      "description": "Police in California, arrested a mother on felony child abuse charges after viral video showed a 19-month-old child falling from a moving SUV.",
      "url": "https://www.foxnews.com/us/california-toddler-falls-out-moving-car-mother-charged",
      "published": "Tue, 27 Jan 2026 07:38:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Unsealed records in Idaho student murders detail victims' injuries, final movements",
      "description": "A forensic account of the 2022 University of Idaho slayings revealed specific injury counts and new analysis regarding the students' final movements.",
      "url": "https://www.foxnews.com/us/unsealed-records-idaho-student-murders-detail-injuries-final-movements",
      "published": "Mon, 26 Jan 2026 18:42:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Columbia University anti-Israel group slams new president as 'fascist' over previous encampment bust-up",
      "description": "Anti-Israel groups are criticizing Columbia University's new president Jennifer Mnookin over her previous actions against student encampments.",
      "url": "https://www.foxnews.com/us/columbia-university-anti-israel-group-slams-new-president-fascist-over-previous-encampment-bust-up",
      "published": "Mon, 26 Jan 2026 18:01:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "West Virginia librarian arrested for allegedly recruiting people on social media to assassinate Trump",
      "description": "A Jackson County, West Virginia librarian is accused of posting a video on social media that seemed to seek a \"sniper\" to target President Donald Trump.",
      "url": "https://www.foxnews.com/us/west-virginia-librarian-arrested-recruiting-people-social-media-assassinate-trump",
      "published": "Mon, 26 Jan 2026 16:50:02 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "North Korea launches short-range ballistic missiles into sea, show of force ahead of political meetings",
      "description": "North Korean leader Kim Jong Un's regime tests ballistic missiles as tensions rise in the region ahead of a massive political party gathering.",
      "url": "https://www.foxnews.com/world/north-korea-launches-short-range-ballistic-missiles-sea-show-force-ahead-political-meetings",
      "published": "Tue, 27 Jan 2026 08:07:30 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan opposition leader says democratic transition would be 'fall of the Berlin Wall' for Americas",
      "description": "Opposition leader María Corina Machado said she intends to return to Venezuela soon to help drive a democratic transition.",
      "url": "https://www.foxnews.com/world/venezuelan-opposition-leader-says-democratic-transition-would-be-fall-berlin-wall-americas",
      "published": "Mon, 26 Jan 2026 13:36:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel confirms recovery of last hostage's remains from Gaza",
      "description": "The remains of Ran Gvili, the final Israeli hostage held by Hamas, have been recovered from Gaza. The police officer died defending Israel on Oct. 7.",
      "url": "https://www.foxnews.com/world/israel-confirms-recovery-last-hostages-remains-from-gaza",
      "published": "Mon, 26 Jan 2026 09:11:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy says US security guarantees document is '100% ready' for signing",
      "description": "Ukraine's Zelenskyy says U.S. security guarantees document is \"100% ready\" for signing as trilateral peace talks with Russia expected to continue in Abu Dhabi.",
      "url": "https://www.foxnews.com/world/zelenskyy-says-us-security-guarantees-document-100-ready-signing",
      "published": "Mon, 26 Jan 2026 08:11:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel announces limited reopening of Rafah Crossing under Trump’s 20-point plan",
      "description": "Netanyahu agrees to reopen Gaza's Rafah crossing under President Trump's 20-point peace plan, pending the recovery of the final Israeli hostage.",
      "url": "https://www.foxnews.com/world/israel-announces-limited-reopening-rafah-crossing-under-trumps-20-point-plan",
      "published": "Sun, 25 Jan 2026 17:45:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Macron says children's brains are 'not for sale,' urges fast-track to ban social media for kids under 15",
      "description": "French President Emmanuel Macron pushes lawmakers to ban social media for kids under 15, saying children's emotions won't be manipulated by \"American Platforms\" or \"Chinese algorithms.\"",
      "url": "https://www.foxnews.com/world/macron-says-childrens-brains-not-sale-urges-fast-track-ban-social-media-kids-under-15",
      "published": "Sun, 25 Jan 2026 13:35:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}