{
  "last_updated": "2026-01-15T19:25:59.912174Z",
  "event_count": 221,
  "events": [
    {
      "title": "Quarter of developing countries poorer than in 2019, World Bank finds",
      "description": "Global growth ‘downshifted’ since Covid pandemic and sub-Saharan Africa particularly affected, report says Business live – latest updates A quarter of countries in the developing world are poorer than they were in 2019 before the Covid pandemic, the World Bank has found. The Washington-based organisation said a large group of low-income countries, many in sub-Saharan Africa, had suffered a negative shock in the six years to the end of last year. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/13/developing-countries-poorer-world-bank-report",
      "published": "Tue, 13 Jan 2026 14:30:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Security and ethnic dimensions of Iran crisis spark warnings across the region",
      "description": "Saudi Arabia, Qatar and Oman have led efforts to talk President Donald Trump out of a US attack on Iran, according to news reports. Turkey is also concerned about a collapse of central authority in Iran. FRANCE 24’s Leela Jacinto explains the ethnic dimension of security concerns in Middle East capitals.",
      "url": "https://www.france24.com/en/security-and-ethnic-dimensions-of-iran-crisis-spark-warnings-across-the-region",
      "published": "Thu, 15 Jan 2026 16:34:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Will the US use cyberwarfare to ‘help’ Iranian protesters?",
      "description": "The United States has repeatedly said that it will send \"help\" to Iranian protesters as demonstrations across the country have led to the death of at least 3,428 people. As Iranian authorities use internet blackouts to quell dissent, the US may resort to cyberwarfare instead of physical strikes.",
      "url": "https://www.france24.com/en/asia-pacific/20260115-will-the-us-use-cyberwarfare-help-iranian-protesters",
      "published": "Thu, 15 Jan 2026 17:31:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Global employment stable but decent jobs in short supply",
      "description": "Global unemployment remains stable, but progress toward decent work has stalled, according to a new report from the International Labour Organization (ILO), which warns that young people continue to struggle in a job market which risks being further undermined by AI and trade policy uncertainty.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166751",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "At least 32 killed as crane collapses on train in Thailand",
      "description": "Crane in use on high-speed rail project hits passing train, causing it to derail At least 32 people in Thailand have been killed and scores injured after a crane collapsed on to a passenger train and derailed it, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars and smoke rising from the wreckage of the train below. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths",
      "published": "Wed, 14 Jan 2026 15:44:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Floods in South Africa force evacuations from famed Kruger National Park; 19 dead in other regions",
      "description": "Flooding caused by weeks of torrential rains in northern South Africa has forced the famed Kruger National Park to suspend visits and evacuate some guests and staff members",
      "url": "https://abcnews.go.com/International/wireStory/floods-south-africa-force-evacuations-famed-kruger-national-129243140",
      "published": "Thu, 15 Jan 2026 10:25:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "G7 threatens Iran with new sanctions over nationwide protest crackdown killing thousands",
      "description": "Iran protests death toll reaches over 2,400, according to Human Rights Activist News Agency as G7 foreign ministers warn of new sanctions over regime's violent response.",
      "url": "https://www.foxnews.com/world/g7-threatens-iran-new-sanctions-nationwide-protest-crackdown-killing-thousands",
      "published": "Wed, 14 Jan 2026 15:22:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "'I carried my wife's body for an hour and a half' - BBC hears stories of protesters killed in Iran",
      "description": "BBC Persian has received dozens of accounts from inside Iran, with witnesses saying they want to ensure the world knew of the violence against protesters.",
      "url": "https://www.bbc.com/news/articles/c8e54zp5j6no?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 20:35:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "'What will Trump and Board of Peace do to empower Palestinian technocratic committee?'",
      "description": "The announcement of the ceasefire's second phase marked a significant step forward but left many questions unanswered. Those include the makeup of a proposed, apolitical governing committee of Palestinian experts and an international “Board of Peace.\" For in-depth analysis and deeper perspective, Nadia Massih welcomes Yezid Sayigh, Senior Fellow at the Malcolm H. Kerr Carnegie Middle East Center in Beirut. He challenges the Board of Peace to 'put its politics where its mouth is' and reminds us that phase 1 has yet to be fully implemented.",
      "url": "https://www.france24.com/en/what-will-trump-and-board-of-peace-do-to-empower-palestinian-technocratic-committee",
      "published": "Thu, 15 Jan 2026 17:05:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Large fire breaks out in Dutch city of Utrecht following explosion",
      "description": "At least four people are injured and there are also reports of extensive damage to nearby buildings, he local safety body says.",
      "url": "https://www.bbc.com/news/articles/cm2xv0w07dgo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:35:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "US launches wave of strikes in Somalia targeting ISIS, al-Shabab terror threats",
      "description": "U.S. Africa Command General Michael E. Langley warns of jihadi threat to homeland as airstrikes against al-Shabab and ISIS-Somalia intensify under Trump administration.",
      "url": "https://www.foxnews.com/world/us-launches-wave-strikes-somalia-targeting-isis-al-shabab-terror-threats",
      "published": "Tue, 13 Jan 2026 20:56:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "ICE agent shoots Venezuelan national in Minneapolis after shovel attack during ambush: DHS",
      "description": "A shooting involving an ICE agent unfolded in Minneapolis late Wednesday after a suspect allegedly assaulted a federal officer with a shovel, authorities said.",
      "url": "https://www.foxnews.com/us/ice-agent-shoots-venezuelan-national-minneapolis-shovel-attack-ambush-dhs",
      "published": "Wed, 14 Jan 2026 22:00:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Minnesota governor calls on Trump to ‘turn the temperature down’ after Trump threatens to invoke Insurrection Act – live",
      "description": "Tim Walz urges US president to ‘stop this campaign of retribution’ as thousands of federal agents remain in Minneapolis after the fatal shooting of Renee Good Trump threatens to use Insurrection Act in Minnesota People affected by the US visa freeze: share your experience Donald Trump is in Washington today. He’s due to meet with Mariá Corina Machado – Venezuela’s opposition leader – at 12:3opm ET. At the moment that’s closed to the press but we’ll let you know if that changes and bring you the latest. Later, Trump is set to host the champions of the 2025 Stanley Cup, the Florida Panthers, at the White House. We’ll be watching to get his reaction to the news of the day. Continue reading...",
      "url": "https://www.theguardian.com/us-news/live/2026/jan/15/us-politics-latest-news-updates-donald-trump-venezuela-maria-corina-machado",
      "published": "Thu, 15 Jan 2026 19:06:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘A torture that never stops’: Sri Lanka failing survivors of conflict sexual violence, UN says",
      "description": "Conflict-related sexual violence in Sri Lanka remains largely unaddressed more than 15 years after the end of the civil war, with survivors still denied justice, recognition and reparations, according to a new report by the UN human rights office, OHCHR, on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166755",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Trump administration ends temporary protected status for Somalis in US",
      "description": "Critics condemn ‘bigoted attack’ as Trump bids to revoke citizenship of naturalized immigrants convicted of fraud The Trump administration is terminating temporary protected status (TPS) for Somalis living in the United States, giving hundreds of people two months to leave the country or face deportation. The homeland security secretary, Kristi Noem , said in a statement that conditions in the east African country had improved sufficiently and that Somalis no longer qualified for the designation under federal law. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/13/trump-administration-ends-tps-somalia",
      "published": "Tue, 13 Jan 2026 22:59:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's protests appear increasingly smothered after a deadly crackdown",
      "description": "The nationwide protests challenging Iran's theocracy appear increasingly smothered a week after authorities shut the country off from the world and escalated a bloody crackdown.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5678539/iran-protests-trump",
      "published": "Thu, 15 Jan 2026 11:56:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "ISS crew returns to Earth in first-ever medical evacuation",
      "description": "For the first time in the International Space Station's history, NASA safely returned a crew of four astronauts to Earth ahead of schedule due to medical issues affecting one of the group.",
      "url": "https://www.dw.com/en/iss-crew-returns-to-earth-in-first-ever-medical-evacuation/a-75517587?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 11:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "WFP warns Sudan food aid could run out in March",
      "description": "The World Food Programme (WFP) said on Thursday that it is struggling to keep emergency operations running in Sudan, where more than 1,000 days of war have pushed families to the brink.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166766",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: A ceasefire that still kills children is not enough, says UNICEF",
      "description": "Airstrikes, drone attacks and hypothermia continue in Gaza despite the ceasefire, with more than 100 youngsters killed since early October, the UN Children’s Fund (UNICEF) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166750",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Storms worsen already dire humanitarian situation, UN warns",
      "description": "The humanitarian crisis across the Gaza Strip remains extremely serious, with harsh winter weather threatening to reverse recent gains in aid delivery, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166747",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "NASA brings astronauts home early after health issue in first-ever evacuation",
      "description": "NASA completed its first-ever medical evacuation from space, bringing four astronauts back to Earth early after a health issue aboard the International Space Station.",
      "url": "https://www.foxnews.com/us/nasa-brings-astronauts-home-early-after-health-issue-first-ever-evacuation",
      "published": "Thu, 15 Jan 2026 04:27:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Ukrainians facing bitter cold of -15C after Russia's repeated strikes on energy supplies",
      "description": "Ukrainians are facing -15C with no power to warm them as President Volodymyr Zelenskyy said he would declare a state of emergency in the energy sector.",
      "url": "https://news.sky.com/story/ukrainians-facing-bitter-cold-of-15c-after-russias-repeated-strikes-on-energy-supplies-13494568",
      "published": "Thu, 15 Jan 2026 10:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN World Court begins landmark hearings on Rohingya genocide case against Myanmar",
      "description": "Public hearings opened on Monday at the International Court of Justice (ICJ) in a landmark case brought by the Gambia against Myanmar, alleging violations of the Genocide Convention over the military’s treatment of the Rohingya minority.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166746",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Multiple people killed after construction crane falls, derails train in Thailand",
      "description": "A deadly construction accident unfolded in northeastern Thailand when a crane collapsed onto a moving passenger train, officials said.",
      "url": "https://www.foxnews.com/world/multiple-people-killed-after-construction-crane-falls-derails-train-thailand",
      "published": "Wed, 14 Jan 2026 03:07:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Federal agent shoots Minneapolis man in leg after shovel attack, officials say",
      "description": "The incident comes as President Donald Trump threatens to use the Insurrection Act on protesters.",
      "url": "https://www.bbc.com/news/articles/c205677pxvxo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:22:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Watch: Astronauts return to Earth after medical evacuation",
      "description": "Four astronauts who left the International Space Station (ISS) a month early due to one of the crew members falling ill have returned to Earth on Thursday.",
      "url": "https://www.bbc.com/news/videos/c89q0y5xd79o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 10:38:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump threatens to use Insurrection Act to end Minneapolis protests",
      "description": "President considers using federal law to deploy military as protests are ongoing after two shootings by federal agents.",
      "url": "https://www.aljazeera.com/news/2026/1/15/trump-threatens-to-use-insurrection-act-to-end-minneapolis?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 15:45:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "What is HRANA, the US-based group behind Iran’s death toll figures?",
      "description": "Amid recent mass protests and an internet blackout, there have been conflicting death toll reports from Iran.",
      "url": "https://www.aljazeera.com/news/2026/1/15/what-is-hrana-the-us-based-group-behind-irans-death-toll-figures?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 14:24:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "NASA sends fours astronauts back to Earth in first-ever medical evacuation",
      "description": "For the first time in history, four astronauts aboard the International Space Station had to leave orbit early, because of an undisclosed medical condition of one of the crew members. Their capsule has landed safely in the Pacific. Story by Solange Mougin.",
      "url": "https://www.france24.com/en/video/20260115-nasa-sends-fours-astronauts-back-to-earth-in-first-ever-medical-evacuation",
      "published": "Thu, 15 Jan 2026 14:40:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "International Space Station astronauts back on Earth after first ever emergency return",
      "description": "An astronaut who had a \"serious medical condition\" onboard the International Space Station is safely back on Earth, after the first-ever emergency return space flight.",
      "url": "https://news.sky.com/story/international-space-station-astronauts-back-after-first-ever-emergency-return-13494628",
      "published": "Thu, 15 Jan 2026 12:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Security Council LIVE: Ambassadors due to meet in emergency session on Iran",
      "description": "The UN Security Council is scheduled to meet at 3 PM in New York on Thursday to discuss the situation in Iran, where hundreds of people reportedly have been killed in recent anti-government protests.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Escalating fighting in Sudan, displacement in Syria’s Aleppo, $1.5 billion appeal for South Sudan",
      "description": "More civilians in Sudan continue to be killed and displaced as fighting escalates in multiple parts of the country, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166756",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: ‘The killing of peaceful demonstrators must stop,’ UN rights chief says",
      "description": "As anti-government demonstrations continue across Iran, the UN human rights chief said on Tuesday that he was horrified at the mounting violence directed by security forces against protestors, with reports of hundreds killed and thousands arrested.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166752",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Armed Kurdish fighters try to breach Iran border as regional threat grows amid protests: reports",
      "description": "Turkey's intelligence agency, MIT, warned Iran's Revolutionary Guard about Kurdish fighters trying to cross the Iran-Iraq border during ongoing government crackdowns.",
      "url": "https://www.foxnews.com/world/kurdish-fighters-try-exploit-iran-chaos-regional-threat-grows-amid-nationwide-protests",
      "published": "Wed, 14 Jan 2026 20:44:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran shuts down airspace; foreign officials warn against travel to Israel",
      "description": "Iran closes airspace to most flights amid rising U.S. tensions. Trump says Iranian protest killings have stopped, but military officials reportedly warned an attack was imminent.",
      "url": "https://www.foxnews.com/world/iran-shuts-down-airspace-foreign-officials-warn-against-travel-israel",
      "published": "Wed, 14 Jan 2026 18:54:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime opened fire with live ammunition on protesters, doctor says: ‘Shoot-to-kill’",
      "description": "Iranian protests that began Dec. 28 saw security forces shift to live ammunition by Jan. 8, with over 3,000 deaths estimated nationwide.",
      "url": "https://www.foxnews.com/world/iran-regime-opened-fire-live-ammunition-protesters-doctor-says-shoot-to-kill",
      "published": "Tue, 13 Jan 2026 18:57:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Blankets, batteries, fires: How Kyiv is surviving icy winter",
      "description": "Russia has deliberately attacked Ukraine's energy grid, as sub-zero temperatures take hold. Many are without power, heating or water so locals in Kyiv have been sharing their solutions for staying warm.",
      "url": "https://www.dw.com/en/blankets-batteries-fires-how-kyiv-is-surviving-icy-winter/a-75525775?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 18:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine war: UN appeals for $2.3 billion to support aid teams’ ‘heroic work’",
      "description": "Amid ongoing and intensifying Russian attacks across Ukraine, the UN on Tuesday launched a $2.3 billion humanitarian appeal for 2026 to support 4.1 million of the country’s most vulnerable people.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166749",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Deadly Russian strikes push civilians deeper into winter crisis",
      "description": "Ukraine has entered the new year under intensifying and deadly Russian attacks which have crippled energy systems and left millions without heating, electricity or water amid freezing temperatures, senior UN officials told the Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166748",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Agitators attack federal agents in Minneapolis after second ICE-involved shooting and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/agitators-attack-federal-agents-minneapolis-after-second-ice-involved-shooting-more-top-headlines",
      "published": "Thu, 15 Jan 2026 06:57:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's regime crushing protests in bloody crackdown",
      "description": "Protesters are putting their lives on the line in Iran as the state mounts a coordinated and brutal response to the unrest. As the death toll grows, hopes of outside help seem faint.",
      "url": "https://www.dw.com/en/iran-s-regime-crushing-protests-in-bloody-crackdown/a-75524677?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 16:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Pope consoles families of young Italian victims of New Year's Swiss Alps bar fire",
      "description": "Pope Leo XIV has consoled families of Italian teenagers killed or injured in the Swiss bar fire at a New Year's party",
      "url": "https://abcnews.go.com/International/wireStory/pope-seeks-console-families-young-italian-victims-new-129238234",
      "published": "Thu, 15 Jan 2026 08:52:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Bodies of 32 Cuban officers killed during US strike on Venezuela repatriated",
      "description": "The bodies of 32 Cuban officers killed during a stunning U.S. attack on Venezuela have been repatriated o their homeland",
      "url": "https://abcnews.go.com/International/wireStory/bodies-32-cuban-officers-killed-us-strike-venezuela-129238243",
      "published": "Thu, 15 Jan 2026 08:50:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Renee Nicole Good's family hires George Floyd legal team for civil investigation after fatal ICE shooting",
      "description": "The family of the woman fatally shot by an ICE agent hired George Floyd's lawyers from the Romanucci & Blandin law firm for a new civil investigation, according to the firm.",
      "url": "https://www.foxnews.com/us/renee-nicole-goods-family-hires-george-floyd-legal-team-civil-investigation-fatal-ice-shooting",
      "published": "Wed, 14 Jan 2026 19:47:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gazans sceptical of phase 2 of truce as strikes continue",
      "description": "Donald Trump has announced that the second phase of the plan to end the war in Gaza has started. With key elements of phase one still unfulfilled - like a complete ceasefire - the announcement of the second phase was met with a lot of scepticism, and some hope too, by Palestinians in Gaza. Story by Solange Mougin.",
      "url": "https://www.france24.com/en/gazans-sceptical-of-phase-2-of-truce-as-strikes-continue",
      "published": "Thu, 15 Jan 2026 14:43:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE threat spray-painted on vehicle believed to be used by federal officers during Minneapolis unrest",
      "description": "Minneapolis rioters vandalized vehicles with anti-ICE messages and threats after a federal agent shot an illegal immigrant during an alleged ambush.",
      "url": "https://www.foxnews.com/us/anti-ice-threat-spray-painted-vehicle-believed-used-federal-officers-during-minneapolis-unrest",
      "published": "Thu, 15 Jan 2026 12:02:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Agitators clash with federal officers after another ICE shooting in Minneapolis",
      "description": "Rioters clashed with federal agents in Minneapolis after a second ICE shooting, with tear gas and pepper balls deployed as demonstrators demand the agency leave the city.",
      "url": "https://www.foxnews.com/us/protesters-clash-federal-officers-after-another-ice-shooting-minneapolis",
      "published": "Thu, 15 Jan 2026 03:01:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran pushes for fast trials and executions of suspects detained in protests despite Trump's warning: report",
      "description": "Iran chief justice Gholamhossein Mohseni-Ejei calls for fast trials and executions of suspects in ongoing anti-government demonstrations, a report said.",
      "url": "https://www.foxnews.com/world/iran-pushes-fast-trials-executions-suspects-detained-protests-despite-trumps-warning-report",
      "published": "Wed, 14 Jan 2026 11:05:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "How Trump's 'America First' is upending the world order",
      "description": "President Trump is dismantling the global system the U.S. built in the 20th century. Foreign policy experts say he wants a world that looks more like the 19th century.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5667212/how-trumps-america-first-is-upending-the-world-order",
      "published": "Wed, 14 Jan 2026 16:54:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump to meet Venezuela opposition leader Machado at White House",
      "description": "President Donald Trump is set to meet Thursday at the White House with Venezuelan opposition leader María Corina Machado, whose political party is widely considered to have won 2024 elections rejected by then-President Nicolás Maduro before the United States captured him in an audacious military raid this month. Details and analysis by Kethevane Gorjestani, FRANCE 24 international affairs editor.",
      "url": "https://www.france24.com/en/trump-to-meet-venezuela-opposition-leader-machado-at-white-house",
      "published": "Thu, 15 Jan 2026 16:19:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump’s bluffs: Why US strike on Iran remains real threat",
      "description": "From Venezuela and Iran, Trump has attacked countries in the past when diplomacy appeared to be working.",
      "url": "https://www.aljazeera.com/news/2026/1/15/trumps-bluffs-why-us-strike-on-iran-remains-real-threat?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 15:28:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "South Africa braces for more rain as Kruger National Park is evacuated due to deadly flooding",
      "description": "South Africa's most renowned national reserve has shut its gates amid escalating floodwaters and heavy rainfall, which has already claimed at least 19 lives.",
      "url": "https://www.dw.com/en/south-africa-braces-for-more-rain-as-kruger-national-park-is-evacuated-due-to-deadly-flooding/a-75525640?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 18:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Syria: The man behind the mission to heal decade-old wounds in the Sunni majority",
      "description": "Since Bashar al-Assad was toppled in December 2024, one of the huge challenges the new government has faced is that of division. Syrian society is made up of different sectarian and ethnic groups -- the Alawites, the Kurds, the Druze... -- but division also exists within the country’s biggest group: the Sunni Muslim majority. Our terrorism expert, Wassim Nasr, travelled to Syria last month and tells us what he learnt about this nascent new government led by ex-jihadist Ahmad al-Sharaa.",
      "url": "https://www.france24.com/en/syria-the-man-behind-the-mission-to-heal-decade-old-wounds-in-the-sunni-majority",
      "published": "Thu, 15 Jan 2026 16:34:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "11-year streak of record global warming continues, UN weather agency warns",
      "description": "The past 11 years have been the warmest in the modern era, while oceans continue to heat up, too, says the UN weather agency.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166758",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Increase taxes on sugary drinks and alcohol to save lives, urges WHO",
      "description": "Beverages like sugary drinks and alcohol are too accessible and cost too little in most of the world – helping fuel obesity, diabetes, cancer and injury, the World Health Organization (WHO) warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166754",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Ethiopia says seized ammunition sent by Eritrea to rebels as tensions rise",
      "description": "Eritrea denies the claim and accuses Ethiopia of seeking a pretext to attack, amid fears of renewed conflict.",
      "url": "https://www.bbc.com/news/articles/czr46ypzl4yo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:57:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "A timeline of events in Iran: From cost-of-living protests to political revolt",
      "description": "Iranians began taking to the streets in late December. What initially began with protests against the spiralling cost of living has grown into a nationwide protest movement against the country's theocracy led by Ayatollah Ali Khamenei. In response, authorities have cracked down hard. Will these protests lead to the end of the regime that has ruled Iran for 45 years? Our France 2 colleagues chronicle the events of the last two weeks, with FRANCE 24's Lauren Bain.",
      "url": "https://www.france24.com/en/tv-shows/focus/20260115-a-timeline-of-events-in-iran-from-cost-of-living-protests-to-political-revolt",
      "published": "Thu, 15 Jan 2026 15:20:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Civilians flee on foot as Syrian military offensive looms east of Aleppo",
      "description": "A trickle of civilians has left a contested area east of Aleppo after a Syrian military warning to evacuate",
      "url": "https://abcnews.go.com/International/wireStory/civilians-flee-foot-syrian-military-offensive-looms-east-129243691",
      "published": "Thu, 15 Jan 2026 10:35:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Rights group warns on failure to deliver justice after sectarian killings in Syria's Sweida",
      "description": "Human Rights Watch criticizes the Syrian government for lacking accountability in sectarian violence",
      "url": "https://abcnews.go.com/International/wireStory/rights-group-warns-failure-deliver-justice-after-sectarian-129234740",
      "published": "Thu, 15 Jan 2026 06:58:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Brazilian police kill 4 in Rio favela in operation to contain Red Command criminal gang",
      "description": "Police in Rio de Janeiro say they killed four people who attacked security forces during an operation against the Red Command gang",
      "url": "https://abcnews.go.com/International/wireStory/brazilian-police-kill-4-rio-favela-operation-red-129221985",
      "published": "Wed, 14 Jan 2026 17:45:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar’s Rohingya people called ‘Muslim dogs’ before attacks, ICJ hears",
      "description": "Hearings continued on Thursday at the UN’s top court into the Gambia’s claim that Myanmar committed genocide against the Rohingya people, with allegations that military officials incited violence by calling the ethnic minority “Muslim dogs” who should be made “extinct”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166764",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Video shows police officer ambushed in patrol car in explosion of gunfire; suspect found dead after shootout",
      "description": "Video shows a gunman wounding a police officer in an alleged ambush, then fleeing and leading a deadly chase through Greenville County streets.",
      "url": "https://www.foxnews.com/us/video-shows-police-officer-ambushed-patrol-car-explosion-gunfire-suspect-found-dead-after-shootout",
      "published": "Wed, 14 Jan 2026 19:23:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iran appears to reopen airspace after Trump says killing is 'stopping'",
      "description": "Iran appeared to reopen its airspace after a sudden overnight closure disrupted regional flights amid ongoing security warnings and mounting regional tensions.",
      "url": "https://www.foxnews.com/world/iran-appears-reopen-airspace-after-trump-says-killing-stopping",
      "published": "Thu, 15 Jan 2026 08:19:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia losing 'massive' 25,000 troops monthly in Ukraine as war grinds on, NATO chief says",
      "description": "Russia's \"massive\" military losses in Ukraine are unsustainable, NATO's secretary general warned with the conflict about to enter its fourth year with no clear end in sight.",
      "url": "https://www.foxnews.com/world/russia-losing-massive-25000-troops-monthly-ukraine-war-grinds-on-nato-chief-mark-rutte-says",
      "published": "Wed, 14 Jan 2026 14:38:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iran judiciary denies plan to execute detained protester Erfan Soltani",
      "description": "The judiciary says Soltani is not facing charges carrying the death penalty, while a rights group reports that the execution has been \"postponed\".",
      "url": "https://www.bbc.com/news/articles/cp80zjx091yo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 19:15:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Watch: Aerial footage shows cars swept away by flash floods in Australia",
      "description": "Australia's Great Ocean Road closed on Thursday after flash floods hit the state of Victoria.",
      "url": "https://www.bbc.com/news/videos/c1wz807vpglo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 09:30:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela regime claims release of political prisoners is sign of new era",
      "description": "NGOs estimate that there are still close to 1,000 political prisoners in Venezuela despite claims by new leaders Venezuela’s acting president has claimed that the regime’s release of political prisoners sent a “very clear message” that the country was “opening up to a new political moment”, days after the seizure and rendition of the dictator Nicolás Maduro. Delcy Rodríguez also vowed to continue the releases and accused NGOs that have described the process as slow and opaque of “lying to the world and trying to sell falsehoods about Venezuela”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/venezuelan-political-prisoners-released",
      "published": "Wed, 14 Jan 2026 19:25:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Korean prosecutors demand death penalty for former president Yoon Suk Yeol",
      "description": "Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol",
      "published": "Wed, 14 Jan 2026 00:43:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Are the French rich? Exploring wealth inequality in France",
      "description": "This week in French Connections, we focus on wealth in France. According to traditional macroeconomic measures, France is a rich country. It has the world's seventh-largest economy by nominal GDP, high levels of human development, broad infrastructure and a robust social welfare system. Yet beneath that headline prosperity lies a growing gap between perception and reality, as poverty and inequality are on the rise. So what does it mean to be rich in France? Is the redistribution system aimed at ironing out inequality broken? We take a closer look.",
      "url": "https://www.france24.com/en/tv-shows/french-connections/20260115-are-the-french-rich-exploring-wealth-inequality-in-france",
      "published": "Thu, 15 Jan 2026 14:03:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "East Jerusalem: Forced shutdown of UN clinic signals escalating disregard for international law",
      "description": "The temporary closure of a UN-run health centre in East Jerusalem is the latest phase in “a pattern of deliberate disregard” for international law, the head of the UN agency that assists Palestine refugees, UNRWA, said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166760",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Network linked to Israel pushes to shape external Iran protest narrative",
      "description": "Al Jazeera data analysis shows Israel-linked bots and officials try to hijack how Iran protest is viewed globally.",
      "url": "https://www.aljazeera.com/features/2026/1/15/network-linked-to-israel-pushes-to-shape-external-iran-protest-narrative?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 15:09:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Israeli military attacks village in Lebanon’s Bekaa Valley",
      "description": "Tensions are rising as Israel's army carries out near-daily attacks on Lebanon in violation of 2024 Hezbollah ceasefire.",
      "url": "https://www.aljazeera.com/news/2026/1/15/israeli-military-attacks-village-in-lebanons-bekaa-valley?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 14:47:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Workers at Chinese factory that produces Labubu toys are being exploited, says NGO",
      "description": "Exclusive: China Labor Watch says people aged 16-18 employed without required special protections A labour rights NGO says it has found evidence of worker exploitation in the supply chain of Labubus, the furry toys that took the world by storm last year and which are expected to continue to grow in popularity in 2026. Labubus, toothy gremlins made by the Chinese toy company Pop Mart, have become one of China’s hottest cultural exports. In the first half of 2025 alone, “the Monsters” line of toys, which includes Labubus, generated 4.8bn yuan (£511m) in sales for the Hong Kong-listed company. In August, Pop Mart’s chief executive, Wang Ning, said the company was on track to reach 20bn yuan in revenues in 2025. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/workers-at-chinese-factory-that-produces-labubu-toys-are-being-exploited-says-ngo",
      "published": "Tue, 13 Jan 2026 09:55:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Taxpayer-funded Minnesota charter school shuts down in-person learning amid ICE raids",
      "description": "Minnesota charter school moves classes online citing safety concerns as community warns of reported ICE activity affecting local families and students.",
      "url": "https://www.foxnews.com/us/taxpayer-funded-minnesota-charter-school-shuts-down-person-learning-ice-raids",
      "published": "Wed, 14 Jan 2026 21:43:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Rift at top of the Taliban: BBC reveals clash of wills behind internet shutdown",
      "description": "The Taliban leader once warned of a split: A BBC investigation reveals how attitudes to women, the internet and religion are dividing the group at the very top.",
      "url": "https://www.bbc.com/news/articles/cg7vdpy1l2vo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 06:05:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'It was terrifying': Residents describe carnage after Thai train crash kills 32",
      "description": "The BBC arrived at a grim scene in the evening, with rescuers still pulling bodies out of the mangled train.",
      "url": "https://www.bbc.com/news/articles/cm2yvnen1qyo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 06:46:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "British indie band Pulp agree to play Adelaide festival after boycott U-turn",
      "description": "The band pulled out over treatment of Randa Abdel-Fattah but delayed revealing their decision before confirming 27 February gig Get our breaking news email , free app or daily news podcast The British indie band Pulp will play at the Adelaide festival in February after initially pulling out of the event in protest at the cancellation of Palestinian writer Randa Abdel-Fattah. The band issued a statement on social media on Thursday night announcing that they would “honour our invitation to perform in Adelaide on 27 February” after the festival organisers performed a U-turn, apologised to Abdel-Fattah for her treatment, and invited her to speak at next year’s event. Continue reading...",
      "url": "https://www.theguardian.com/culture/2026/jan/15/british-indie-band-pulp-agree-to-play-adelaide-festival-after-boycott-u-turn",
      "published": "Thu, 15 Jan 2026 12:36:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Zelenskyy declares energy emergency in cold snap",
      "description": "Ukraine's president declared an emergency in the energy sector amid freezing weather and Russian strikes on infrastructure. Meanwhile, Donald Trump blamed Kyiv for the lack of peace talk progress. Follow DW for more.",
      "url": "https://www.dw.com/en/ukraine-zelenskyy-declares-energy-emergency-in-cold-snap/live-75517611?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 12:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'US can't politically engineer a new status quo inside Iran, it must be self-sustaining'",
      "description": "Saudi Arabia, Qatar, and Oman led a diplomatic effort to dissuade Donald Trump from launching a high-risk military strike on Iran. For in-depth analysis, Genie Godula welcomes Jon Hoffman, Research Fellow at the Cato Institute. Mr. Hoffman describes Iran as “a brutal dictatorship, involved in a host of malign activities across the region,” yet warns that US military intervention would be “incredibly risky”: it could provoke retaliation, entangle the US in a prolonged campaign, and cause irreversible harm to Iran's nascent grassroots movement.",
      "url": "https://www.france24.com/en/us-can-t-politically-engineer-a-new-status-quo-inside-iran-it-must-be-self-sustaining",
      "published": "Thu, 15 Jan 2026 16:01:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Denmark warns of 'fundamental disagreements' over Greenland after White House talks",
      "description": "The UK has deployed a military officer to Greenland as Denmark and its European allies seek to counter Donald Trump's threats to take the territory, after talks at the White House ended with \"fundamental disagreement\".",
      "url": "https://news.sky.com/story/denmark-says-fundamental-disagreement-remains-with-trump-but-agrees-to-high-level-talks-over-greenland-13494401",
      "published": "Wed, 14 Jan 2026 22:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand suffers another construction accident just a day after rail tragedy that killed 32",
      "description": "A new construction accident near Bangkok has occurred just 24 hours after a deadly train accident in another part of Thailand",
      "url": "https://abcnews.go.com/International/wireStory/thailand-suffers-construction-accident-day-after-rail-tragedy-129230897",
      "published": "Thu, 15 Jan 2026 01:05:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "UCLA DEI director says he was fired over controversial Charlie Kirk posts: 'Glad when bigots die'",
      "description": "UCLA fires DEI director after controversial social media posts about Charlie Kirk's death, former employee says. Johnathan Perkins claims First Amendment violation, plans lawsuit.",
      "url": "https://www.foxnews.com/us/ucla-dei-director-says-he-fired-over-controversial-charlie-kirk-posts-glad-when-bigots-die",
      "published": "Thu, 15 Jan 2026 12:17:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump envoy reportedly meets with exiled Iranian prince as regime faces protests",
      "description": "The Trump administration allegedly made the first high-level contact with the Iranian opposition amid intensifying nationwide anti-regime protests.",
      "url": "https://www.foxnews.com/world/trump-envoy-reportedly-meets-exiled-iranian-prince-regime-faces-protests",
      "published": "Tue, 13 Jan 2026 18:32:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The UK is taking political prisoners to evade accountability for genocide",
      "description": "The use of anti-terror law against Palestine Action aims to block scrutiny of the UK’s role in Gaza's devastation.",
      "url": "https://www.aljazeera.com/opinions/2026/1/15/the-uk-is-taking-political-prisoners-to-evade-accountability-for-genocide?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:39:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Reza Pahlavi vows to recognise Israel, end nuclear programme if he led Iran",
      "description": "Reza Pahlavi, the son of Iran’s deposed Shah, set out key policies he would put in place if he ever returned to rule.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/reza-pahlavi-vows-to-recognise-israel-end-nuclear-programme-if-he-led-iran?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 15:36:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Illegal immigrant indicted in assault on ICE agents in Texas",
      "description": "A Honduran national in the U.S. illegally is accused of assaulting federal immigration agents in Texas traffic stop before fleeing on foot.",
      "url": "https://www.foxnews.com/us/illegal-immigrant-indicted-assault-ice-agents-texas",
      "published": "Thu, 15 Jan 2026 12:36:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "BTS announces return with new world tour in 2026 and 2027",
      "description": "K-pop band to start tour in April after nearly four-year hiatus due to all seven members needing to complete South Korea’s mandatory military service The BTS comeback is upon us: the K-pop septet has announced a 2026-2027 world tour, kicking off in South Korea in April and running through to March 2027 with more than 70 dates across Asia, North America, South America, Australia and Europe. The tour marks the group’s first headline performances since their 2021–22 Permission to Dance on Stage tour. 9 April and 11-12 April – Goyang, South Korea 17-18 April – Tokyo 25-26 April – Tampa, Florida 2-3 May – El Paso, Texas 7 May and 9-10 May – Mexico City 16-17 May – Stanford, California 23-24 and 27 May – Las Vegas 12-13 June – Busan, South Korea 26-27 June – Madrid 1-2 July – Brussels 6-7 July – London 11-12 July – Munich 17-18 July – Paris 1-2 Aug – East Rutherford, New Jersey 5-6 Aug – Foxborough, Massachusetts 10-11 Aug – Baltimore 15-16 Aug – Arlington, Texas 22-23 Aug – Toronto 27-28 Aug – Chicago 1-2 Sept and 5-6 Sept – Los Angeles 2-3 Oct – Bogotá, Colombia 9-10 Oct – Lima, Peru 16-17 Oct – Santiago, Chile 23-24 Oct – Buenos Aires, Argentina 28 Oct and 30-31 Oct – São Paulo 19 Nov and 21-22 Nov – Kaohsiung, Taiwan 3 Dec and 5-6 Dec – Bangkok 12-13 Dec – Kuala Lumpur, Malaysia 17 Dec, 19-20 Dec and 22 Dec – Singapore 26-27 Dec – Jakarta 12-13 Feb – Melbourne, Australia 20-21 Feb – Sydney 4 March and 6-7 March – Hong Kong 13-14 March – Manila, Philippines Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/14/bts-announces-return-with-new-world-tourm-includin-in-2026-and-2027",
      "published": "Wed, 14 Jan 2026 00:40:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens to invoke the Insurrection Act in Minnesota",
      "description": "US President Donald Trump threatens to deploy military forces to quell protests in Minnesota, as tensions run high over the role of ICE officers in the city.",
      "url": "https://www.dw.com/en/trump-threatens-to-invoke-the-insurrection-act-in-minnesota/a-75522140?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 14:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran's regime could fall, says Trump - as US president considers intervention",
      "description": "Donald Trump has said he believes Iran's regime could fall following weeks of unrest across the country, as the US president considers whether to intervene.",
      "url": "https://news.sky.com/story/irans-regime-could-fall-says-trump-as-us-president-considers-intervention-13494415",
      "published": "Wed, 14 Jan 2026 22:24:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "UN chief’s last annual speech slams world leaders for lack of cooperation",
      "description": "Antonio Guterres appears to take aim at the US, which recently slashed its contribution, telling UN to 'adapt or die'.",
      "url": "https://www.aljazeera.com/news/2026/1/15/uns-guterres-slams-world-leaders-putting-intl-cooperation-on-deathwatch?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:45:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Why are Bangladesh’s cricketers boycotting games before the T20 World Cup?",
      "description": "Top Bangladesh cricket official is sacked after players refused to turn up for a T20 league game amid a row with India.",
      "url": "https://www.aljazeera.com/sports/2026/1/15/why-are-bangladeshs-cricketers-boycotting-games-before-the-t20-world-cup?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 15:05:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "More than 4.7m social media accounts blocked after Australia’s under-16 ban came into force, PM says",
      "description": "Accounts removed or restricted on Twitch, Kick, YouTube, Threads, Facebook, Instagram, Snap, X, TikTok and Reddit in world-leading ban Get our breaking news email , free app or daily news podcast More than 4.7m social media accounts held by Australians who platforms have judged to be under 16 years of age were deactivated, removed or restricted in the first days after the ban came into effect in December, the prime minister has said. After the social media ban came into effect on 10 December, the eSafety commissioner sent questions to each of the platforms covered by the ban asking how many accounts had been removed in order to comply with the law. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/australia-u16-social-media-ban-millions-accounts-blocked",
      "published": "Thu, 15 Jan 2026 11:30:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Does Moldovan President Maia Sandu really want unification with Romania?",
      "description": "Moldova's president Maia Sandu recently stated in a podcast that she would vote in favor of her country joining Romania in the event of a referendum. Her comments have caused outrage.",
      "url": "https://www.dw.com/en/does-moldovan-president-maia-sandu-really-want-unification-with-romania/a-75523793?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 19:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Musk's xAI curbs sexually explicit image generation in Grok",
      "description": "xAI has announced measures to rein in Grok's 'Spicy Mode' after global backlash over AI-edited images undressing women and children.",
      "url": "https://www.dw.com/en/musk-s-xai-curbs-sexually-explicit-image-generation-in-grok/a-75511331?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 05:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran's foreign minister speaks to Donald Trump through Fox News",
      "description": "US president Donald Trump appears to have dialed back threats of an imminent strike on Iran. Despite the shift in rhetoric, the airspace over the Islamic Republic has closed to commercial flights. Story by Delano D'Souza.",
      "url": "https://www.france24.com/en/iran-s-foreign-minister-speaks-to-donald-trump-through-fox-news",
      "published": "Thu, 15 Jan 2026 14:02:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'It's like a road closure' - Uganda's president on shutting down the internet as his country votes",
      "description": "A church service at Nakasero State House marks the end of a frenetic election cycle.",
      "url": "https://news.sky.com/story/its-like-a-road-closure-ugandas-president-on-shutting-down-the-internet-as-his-country-votes-in-election-13494517",
      "published": "Thu, 15 Jan 2026 08:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Is America surrendering Antarctica to its rivals?",
      "description": "As Donald Trump fights for control of arctic Greenland, is he losing at the other end of the world and leaving it open for rivals like China?",
      "url": "https://news.sky.com/story/is-america-surrendering-antarctica-to-its-rivals-13494444",
      "published": "Wed, 14 Jan 2026 23:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Watchdog highlights nations where Christians face persecution around the globe",
      "description": "Open Doors' World Watch List 2026 discusses Christian persecution in nations around the globe, including North Korea, Somalia, Yemen, Sudan and others.",
      "url": "https://www.foxnews.com/world/watchdog-highlights-nations-where-christians-face-persecution-around-globe",
      "published": "Wed, 14 Jan 2026 13:53:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Astronauts splash down to Earth after medical evacuation from space station",
      "description": "The four members of Crew-11 beamed as they stepped out of their spacecraft after a safe landing.",
      "url": "https://www.bbc.com/news/articles/c205r8n0276o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 12:06:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pitfalls loom as Trump's Gaza peace plan enters second phase",
      "description": "As the US announces the next of its plan to end the war, serious obstacles mean implementation will be difficult.",
      "url": "https://www.bbc.com/news/articles/cp3z7441nz7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 12:31:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky declares energy emergency as biting cold persists",
      "description": "The move comes as US President Donald Trump said Ukraine is \"less ready\" than the Russian president to make a peace deal.",
      "url": "https://www.bbc.com/news/articles/cq6vm677z76o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 10:41:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death",
      "description": "Lawyers for Adichie and her husband serve Euracare hospital with legal notice after death of 21-month-old The Nigerian author Chimamanda Ngozi Adichie has accused a Lagos hospital of negligence after the death of one of her 21-month-old twin boys. Nkanu Nnamdi died on 6 January after a brief illness. He was one of twin boys born to Adichie and Ivara Esege, a doctor, in 2024 by surrogacy, eight years after the birth of their first child, a girl. Continue reading...",
      "url": "https://www.theguardian.com/books/2026/jan/12/chimamanda-ngozi-adichie-accuses-lagos-hospital-negligence-son-death",
      "published": "Mon, 12 Jan 2026 14:26:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Person taken to hospital after ingesting hand sanitiser supplied by Australia’s largest privately owned hotel chain",
      "description": "The ACCC recalls Dr Schwartz Hand Sanitiser after it was identified as containing a high concentration of methanol Get our breaking news email , free app or daily news podcast A person was hospitalised with acute methanol poisoning after ingesting a now-recalled hand sanitiser while staying at Australia’s largest privately owned hotel chain, Queensland health authorities say. The Dr Schwartz Hand Sanitiser was recalled on Wednesday by the Australian Competition and Consumer Commission (ACCC) after it was identified to contain a high concentration of methanol. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/hand-sanitiser-recall-dr-schwartz-hotel-chain-accc",
      "published": "Thu, 15 Jan 2026 08:10:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "How the Trump administration's threats to Iran are stoking tensions in the region",
      "description": "NPR's Michel Martin talks to Vali Nasr, a professor of Middle East studies at Johns Hopkins University, about how President Trump's threats against Iran are escalating regional tensions.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677278/how-the-trump-administrations-threats-to-iran-are-stoking-tensions-in-the-region",
      "published": "Thu, 15 Jan 2026 04:45:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: The harsh reality of cutting development aid",
      "description": "Germany is cutting its development aid budget. But since development policy is also part of national security, alongside diplomacy and defense, these budget cuts may cause problems.",
      "url": "https://www.dw.com/en/germany-the-harsh-reality-of-cutting-development-aid/a-75516453?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 15:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Seoul, Tokyo watch US foreign policy twists with rising fear",
      "description": "Donald Trump's hostile signals over Greenland and the aftermath of the Venezuela attack have raised fears in Japan and South Korea that Washington is no longer committed to its allies in East Asia.",
      "url": "https://www.dw.com/en/seoul-tokyo-watch-us-foreign-policy-twists-with-rising-fear/a-75516264?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 13:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Greenlanders hope for peace after talks in Washington",
      "description": "In Nuuk, all eyes were on the meeting between US, Danish and Greenlander officials in the White House on January 14 to address US President Donald Trump's desire to take over the Danish territory. Greenland's deputy prime minister announced afterwards NATO troops would be arriving for training \"in the coming days\". #greenland #trump #nato",
      "url": "https://www.france24.com/en/video/20260115-greenlanders-hope-for-peace-after-talks-in-washington",
      "published": "Thu, 15 Jan 2026 15:21:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US launches phase two of plan to end Gaza conflict, including creation of transitional authority",
      "description": "Donald Trump's special envoy Steve Witkoff has announced the launch of phase two ​of ​the plan to end the conflict in Gaza.",
      "url": "https://news.sky.com/story/us-launches-phase-two-of-plan-to-end-gaza-conflict-including-creation-of-transitional-authority-13494283",
      "published": "Wed, 14 Jan 2026 16:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'It was war': Iranian woman who fled Tehran describes killings",
      "description": "\"It was war.\"",
      "url": "https://news.sky.com/story/everyone-was-being-shot-in-the-head-iranian-woman-who-fled-tehran-describes-killings-and-crackdown-13494160",
      "published": "Wed, 14 Jan 2026 11:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel to honor Charlie Kirk with award for fighting antisemitism",
      "description": "Israel plans to honor the late Charlie Kirk for his efforts against antisemitism",
      "url": "https://abcnews.go.com/International/wireStory/israel-honor-charlie-kirk-award-fighting-antisemitism-129233134",
      "published": "Thu, 15 Jan 2026 06:18:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Texas police officer gunned down by wanted fugitive in violent arrest attempt: officials",
      "description": "Texas police officer Elijah Garretson, a 27-year-old Army veteran, was shot and killed while trying to arrest a wanted fugitive in Copperas Cove.",
      "url": "https://www.foxnews.com/us/texas-police-officer-gunned-down-wanted-fugitive-violent-arrest-attempt-officials",
      "published": "Thu, 15 Jan 2026 12:42:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Man runs into Florida street to save two young children who wandered away from rental home",
      "description": "Hero driver saves two toddlers who wandered into busy Florida roadway. John Brittingham stopped traffic on A1A to rescue the children in just six seconds.",
      "url": "https://www.foxnews.com/us/man-runs-florida-street-save-two-young-children-who-wandered-away-from-rental-home",
      "published": "Thu, 15 Jan 2026 07:47:02 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Virginia nanny’s jailhouse letters reveal conflicting loyalties in love triangle murder trial",
      "description": "Au pair Juliana Peres Magalhães reads emotional jailhouse letters professing love for Brendan Banfield, charged with murdering his wife Christine Banfield and Joseph Ryan in 2023.",
      "url": "https://www.foxnews.com/us/virginia-nannys-jailhouse-letters-reveal-conflicting-loyalties-love-triangle-murder-trial",
      "published": "Thu, 15 Jan 2026 06:00:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "ICE detainer issued for El Salvadoran national charged with killing two North Carolina teens",
      "description": "North Carolina sanctuary policies face renewed criticism after an illegal alien was charged in the murders of two teenagers, ages 16 and 18, in Charlotte.",
      "url": "https://www.foxnews.com/us/ice-detainer-issued-el-salvadoran-national-charged-killing-two-north-carolina-teens",
      "published": "Wed, 14 Jan 2026 18:37:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korean prosecutor seeks death penalty for ex-President Yoon over martial law declaration: 'Self-coup'",
      "description": "An independent counsel demanded a death sentence for former South Korean President Yoon Suk Yeol on rebellion charges over his controversial martial law decree.",
      "url": "https://www.foxnews.com/world/south-korean-prosecutor-seeks-death-penalty-ex-president-yoon-over-martial-law-declaration-self-coup",
      "published": "Wed, 14 Jan 2026 03:29:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boeing knew of flaw in part linked to UPS plane crash, US safety board report says",
      "description": "An aircraft that crashed in November had a structural flaw that had been identified by Boeing 15 years ago, investigators say.",
      "url": "https://www.bbc.com/news/articles/cly56w0p9e1o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 12:49:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Why big oil giants may not rush to buy into Donald Trump’s Venezuelan vision",
      "description": "It may well be safer, easier and cheaper for US companies to procure whatever oil the US economy needs at home There are a few reasons that Donald Trump – now self-anointed acting president of Venezuela , as well as the United States – might be so excited about appropriating Venezuela’s oil . Trump may be counting on some boost from cheap oil to the US economy: he is obsessed with the price of gas . As the midterm elections approach, he has become concerned about unemployment . Deeply imprinted memories of scarcity during the oil crises of the 1970s may prime his belief that cheap oil cures it all. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/15/trump-big-oil-venezuela",
      "published": "Thu, 15 Jan 2026 11:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Netanyahu says the announced start of Gaza ceasefire's next phase is a 'declarative move'",
      "description": "Israeli Prime Minister Benjamin Netanyahu has cast the U.S. announcement that the fragile ceasefire in Gaza would advance to its second phase as largely symbolic, raising questions about how its more challenging elements will be carried out. Details by FRANCE 24 correspondent in Jerusalem, Noga Tarnopolsky.",
      "url": "https://www.france24.com/en/netanyahu-says-the-announced-start-of-gaza-ceasefire-s-next-phase-is-a-declarative-move",
      "published": "Thu, 15 Jan 2026 16:17:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "France to send extra 'land, air, and sea' forces to Greenland in coming days, says Macron",
      "description": "President Emmanuel Macron Thursday said France would soon send more \"land, air, and sea\" forces to join a European military exercise in Greenland, after Washington threatened to seize the autonomous Danish territory. Analysis by France 24 reporter Olivia Bizot.",
      "url": "https://www.france24.com/en/france-to-send-extra-land-air-and-sea-forces-to-greenland-in-coming-days-says-macron",
      "published": "Thu, 15 Jan 2026 14:04:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Teal MPs call out Coalition over stance on hate speech laws – as it happened",
      "description": "This blog is now closed Labor’s hate speech and gun laws set to fail as Coalition and Greens rule out support Get our breaking news email , free app or daily news podcast Iranian Australians left distraught with no confirmation their family is safe Almost a week into Iran’s communication blackout, Iranian Australian activist Mohammad Hashemi received a call from his home country. When I heard the stories, what happened to people, I was crying about the situation and what’s going on in our country. We continue to advise do not travel to Iran. If you choose to remain in Iran, you’re responsible for your own safety. Be prepared to shelter in place for an extended period. Make sure you have supplies of water, food and medication. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/15/victoria-bushfires-school-data-hack-adelaide-writers-week-peter-malinauskas-labor-hate-speech-laws-political-reaction-anthony-albanese-sussan-ley-coalition-ntwnfb",
      "published": "Thu, 15 Jan 2026 06:25:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuelan opposition member Freddy Guevara talks about the future of his country",
      "description": "Freddy Guevara, former vice president of the Venezuelan Parliament and a member of the Venezuelan opposition, talks about what's next for his country.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5672484/venezuelan-opposition-member-freddy-guevara-talks-about-the-future-of-his-country",
      "published": "Thu, 15 Jan 2026 04:46:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Hong Kong: Life sentence looms for media tycoon Jimmy Lai",
      "description": "With the last stage of Jimmy Lai's national security trial drawing to a close, Hong Kong's High Court is set to decide on the sentence for the pro-democracy tycoon. Will Lai get life in prison?",
      "url": "https://www.dw.com/en/hong-kong-life-sentence-looms-for-media-tycoon-jimmy-lai/a-75516554?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 13:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Voting begins in Uganda’s presidential election during internet shutdown",
      "description": "Uganda’s presidential election was plagued by widespread delays Thursday in addition to a days-long internet shutdown that has been criticized as an anti-democratic tactic in a country where the president has held office since 1986. Story by Liza Kaminov.",
      "url": "https://www.france24.com/en/voting-begins-in-uganda-s-presidential-election-during-internet-shutdown",
      "published": "Thu, 15 Jan 2026 14:00:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Russia expels British diplomat from Moscow embassy over spying claims",
      "description": "Russian authorities have ordered a British diplomat to leave the country, accusing the official of spying",
      "url": "https://abcnews.go.com/International/wireStory/russia-expels-british-diplomat-moscow-embassy-spying-claims-129233338",
      "published": "Thu, 15 Jan 2026 06:17:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Japan's Prime Minister Takaichi plans to dissolve Parliament and call early election to strengthen coalition",
      "description": "Japan's first female Prime Minister, Sanae Takaichi, plans a snap election to capitalize on 70% approval ratings and strengthen her coalition majority.",
      "url": "https://www.foxnews.com/world/japans-prime-minister-takaichi-plans-dissolve-parliament-call-early-election-strengthen-coalition",
      "published": "Wed, 14 Jan 2026 19:56:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Iran’s key leaders",
      "description": "A look at who leads Iran as they confront protesters",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/irans-key-leaders?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 18:52:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US sanctions Khamenei aide, other Iranian officials over protest crackdown",
      "description": "New penalties come as Trump welcomes purported Iranian decision to halt execution of antigovernment demonstrators.",
      "url": "https://www.aljazeera.com/news/2026/1/15/us-sanctions-khamenei-aide-other-iranian-officials-over-protest-crackdown?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:34:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Timeline of Israel’s genocide on Gaza",
      "description": "The Trump administration has announced its ceasefire plan for Gaza is now in ‘Phase Two’.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/timeline-of-israels-genocide-on-gaza?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:46:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Quebec premier François Legault resigns from post in surprise move",
      "description": "Legault’s abrupt resignation follows months of chaos that has rocked the governing Coalition Avenir Québec party Quebec ’s premier, François Legault, has announced his resignation as leader of the province, in an abrupt departure for the polarizing figure whose embattled government faces the prospects of an electoral wipeout in the coming months. Speaking at a hastily arranged press conference in Quebec City on Wednesday, Legault said he was proud to have founded the Coalition Avenir Québec (CAQ) party and won consecutive majority governments beginning in 2018 . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/quebec-premier-francois-legault-resigns",
      "published": "Wed, 14 Jan 2026 17:22:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. says second phase of Gaza ceasefire has begun, but major challenges remain",
      "description": "The White House says the ceasefire deal between Israel and Hamas is moving into its second phase, which includes the demilitarization of Gaza, a key point in President Trump's peace plan.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677315/u-s-says-second-phase-of-gaza-ceasefire-has-begun-but-major-challenges-remain",
      "published": "Thu, 15 Jan 2026 04:45:47 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Port Assab becomes flashpoint for Ethiopia–Eritrea relations",
      "description": "Addis Ababa's renewed calls for sea access threaten an already fragile relationship with Eritrea, drawing anger from Asmara.",
      "url": "https://www.dw.com/en/port-assab-becomes-flashpoint-for-ethiopia-eritrea-relations/a-75453946?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 16:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Charlie Hebdo' cartoon on Swiss fire tragedy sparks outrage",
      "description": "A cartoon by the French satirical weekly portraying the deadly fire in Crans-Montana as the \"comedy of the year\" provokes disgust.",
      "url": "https://www.dw.com/en/charlie-hebdo-cartoon-on-swiss-fire-tragedy-sparks-outrage/a-75513790?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 11:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "German military personnel set to arrive in Greenland",
      "description": "Germany said that the European mission in Greenland was there to counter \"threats\" from Russia and China. The German team is among the groups of European military personnel who are scheduled to arrive in Greenland.",
      "url": "https://www.dw.com/en/german-military-personnel-set-to-arrive-in-greenland/a-75514480?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran updates: Trump holds off on strikes after assurances",
      "description": "US President Donald Trump says Iran has halted killings and executions, citing assurances he received. Tehran denies plans for hangings as tensions remain high and airspace closures disrupt flights. Follow DW for more.",
      "url": "https://www.dw.com/en/iran-updates-trump-holds-off-on-strikes-after-assurances/live-75511404?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 07:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "In Haiti’s storm-hit south, food vouchers restore choice and dignity for families",
      "description": "Standing outside a colourfully painted building in southeastern Haiti, at the entrance to a bustling shop called Gods Will Depot where bags of food are stacked to the ceiling, Ketia surveys the large pile of groceries she has selected for her family: a big sack of flour, packages of spaghetti, boxed milk, some bars of soap.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166757",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Driver of U-Haul truck that entered Iran protest crowd speaks out: 'All I want is peace'",
      "description": "The U-Haul driver claims LAPD waved him into Iranian protesters in Los Angeles, leading to arrest on suspicion of reckless driving after going through crowd.",
      "url": "https://www.foxnews.com/us/driver-u-haul-truck-entered-iran-protest-crowd-speaks-out-all-i-want-peace",
      "published": "Thu, 15 Jan 2026 10:12:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran allegedly airs 97 'coercive confessions' amid record-breaking North Korea-style internet blackout",
      "description": "The Iranian regime aired alleged forced confessions from handcuffed protesters during a record-breaking internet blackout lasting over 144 hours.",
      "url": "https://www.foxnews.com/world/iran-allegedly-airs-97-coercive-confessions-amid-record-breaking-north-korea-style-internet-blackout",
      "published": "Wed, 14 Jan 2026 18:30:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "France condemns Iran protest crackdown, weighs satellite internet aid amid blackout",
      "description": "France condemns Iran's violent crackdown on protests as Paris considers satellite communications support to help Iranians bypass internet blackout.",
      "url": "https://www.foxnews.com/world/france-condemns-iran-protest-crackdown-weighs-satellite-internet-aid-amid-blackout",
      "published": "Wed, 14 Jan 2026 15:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China reports record trillion-dollar trade surplus despite Trump tariffs",
      "description": "Results for 2025 risk further unsettling economies about China’s trade practices and overcapacity, and their own over-reliance on Chinese products China has reported a strong export run in 2025 with a record trillion-dollar surplus, as its producers brace for three more years of a Trump administration set on slowing the manufacturing powerhouse by shifting US orders to other markets. Beijing’s resilience to renewed tariff tensions since Donald Trump returned to the US presidency last January has emboldened Chinese firms to shift their focus to south-east Asia, Africa and Latin America to offset US duties. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/china-reports-record-trillion-dollar-trade-surplus-despite-trump-tariffs",
      "published": "Wed, 14 Jan 2026 04:50:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland for training after fraught US talks",
      "description": "European troops are arriving in Greenland for training in the territory following fraught talks in Washington between the territory, Denmark and the US. US President Donald Trump has repeatedly said he wants the mineral-rich, strategic territory to be taken over by the United States. #greenland #trump #nato",
      "url": "https://www.france24.com/en/video/20260115-european-troops-arrive-in-greenland-for-training-amid-tension-with-the-us",
      "published": "Thu, 15 Jan 2026 17:20:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US to suspend immigrant visa processing for 75 countries",
      "description": "The US is suspending the process for immigrant visas from 75 countries, the Department of State said on Wednesday.",
      "url": "https://news.sky.com/story/us-to-suspend-immigrant-visa-processing-for-75-countries-13494347",
      "published": "Wed, 14 Jan 2026 20:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "British Columbia ending its 3-year drug decriminalization pilot project",
      "description": "Canada’s Pacific coast province of British Columbia is ending its three-year experiment in decriminalizing possession of small amounts of drugs",
      "url": "https://abcnews.go.com/International/wireStory/british-columbia-ending-3-year-drug-decriminalization-pilot-129222631",
      "published": "Wed, 14 Jan 2026 18:09:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: UN independent investigators call for immediate release of all political prisoners",
      "description": "More than 100 political prisoners have been released in Venezuela, the Government announced on Monday, just over a week after the seizure and rendition of President Nicolás Maduro in Caracas by the United States.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166745",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Second-largest Minnesota school district to offer temporary virtual learning amid ICE operations",
      "description": "Saint Paul Public Schools launches temporary virtual learning option amid Immigration and Customs Enforcement operations in Minnesota.",
      "url": "https://www.foxnews.com/us/second-largest-minnesota-school-district-offer-temporary-virtual-learning-amid-ice-operations",
      "published": "Thu, 15 Jan 2026 11:06:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ICE deputy director resigns from agency to run for Congress",
      "description": "Madison Sheahan, the deputy director of U.S. Immigration and Customs Enforcement, has resigned to run for Congress in Ohio's 9th Congressional District.",
      "url": "https://www.foxnews.com/us/ice-deputy-director-resigns-agency-run-congress",
      "published": "Thu, 15 Jan 2026 10:00:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Parents erupt into massive brawl during Catholic youth basketball game in Staten Island",
      "description": "Shocking footage shows parents erupting into violent brawl during Catholic youth basketball game in Staten Island, prompting new spectator rules.",
      "url": "https://www.foxnews.com/us/parents-erupt-massive-brawl-catholic-youth-basketball-game-staten-island",
      "published": "Wed, 14 Jan 2026 22:06:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Opposition candidate Bobi Wine claims ‘massive ballot stuffing’ as Uganda goes to polls",
      "description": "Wine calls for voters to ‘reject the criminal regime’ on tense day of voting as some poll stations remain closed for hours Uganda’s most prominent opposition presidential candidate has accused the government of ballot stuffing and arresting and abducting his party’s officials during Thursday’s general election, which took place against against the backdrop of an internet shutdown. The pop star turned politician Bobi Wine wrote on X : “Internet switched off. Massive ballot stuffing reported everywhere. Our leaders … arrested. Many of our polling agents and supervisors abducted, and others chased off polling stations. RISE TO THE OCCASION AND REJECT THE CRIMINAL REGIME.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/15/uganda-vote-election-yoweri-museveni-bobi-wine",
      "published": "Thu, 15 Jan 2026 16:36:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Denmark and U.S. to form working group to talk about U.S. security concerns",
      "description": "After meeting with President Trump's top aides, Danish officials say they will form a working group to talk through U.S. security concerns about control of Greenland.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677517/denmark-and-u-s-to-form-working-group-to-talk-about-u-s-security-concerns",
      "published": "Thu, 15 Jan 2026 04:46:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Louvre and Versailles hike prices for foreign visitors: Who should pay for France’s heritage?",
      "description": "Should access to culture come at a higher price for some visitors? This week on arts24, we examine the growing controversy over rising entrance fees at Europe's most iconic cultural sites, as France moves to charge non-European visitors more at the Louvre and Versailles – a decision that has sparked debate over fairness, funding and universal access to art.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260115-louvre-and-versailles-hike-prices-for-foreign-visitors-who-should-pay-for-france-s-heritage",
      "published": "Thu, 15 Jan 2026 14:52:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Greenland, Denmark and the US \"agree to disagree\" after talks at the White House",
      "description": "Greenland and Denmark on Wednesday said they \"agree to disagree\" with US diplomats, following what they described as a \"frank and constructive\" discussion at the White House over President Donald Trump's desire to acquire the autonomous territory. Story by August Hakansson.",
      "url": "https://www.france24.com/en/video/20260115-greenland-denmark-and-the-us-agree-to-disagree-after-talks-at-the-white-house",
      "published": "Thu, 15 Jan 2026 14:06:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Uganda’s presidential election experiences hours of delays at some polling stations",
      "description": "Voting delays have been reported in Uganda’s presidential election",
      "url": "https://abcnews.go.com/International/wireStory/voting-begins-ugandas-presidential-election-internet-shutdown-polling-129231347",
      "published": "Thu, 15 Jan 2026 14:12:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting president touts ‘new political moment,’ hints at further release of political prisoners",
      "description": "Venezuela's new leadership hints at additional prisoner releases amid political transition, with hundreds of detainees reportedly still in custody.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-president-touts-new-political-moment-hints-further-release-political-prisoners",
      "published": "Wed, 14 Jan 2026 19:12:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Secret room to be built at Chinese embassy near cable lines, sparking widespread espionage fears",
      "description": "Unredacted plans for China's new London embassy reveal secret underground chamber near cables, sparking espionage concerns among UK security experts.",
      "url": "https://www.foxnews.com/world/secret-room-built-chinese-embassy-near-cable-lines-sparking-widespread-espionage-fears",
      "published": "Tue, 13 Jan 2026 19:21:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump to discuss Venezuela’s future with Machado after Maduro’s capture",
      "description": "Venezuelan opposition leader and Nobel prize winner had been sidelined by White House after US seized Maduro Donald Trump will host María Corina Machado , the Venezuelan opposition leader and 2025 Nobel peace prize winner, at the White House on Thursday for high-stakes talks on the oil-rich nation’s future following the US capture of Nicolás Maduro . Many in Venezuela and abroad had expected Machado to take charge after an elite US military team seized Maduro in a pre-dawn raid on 3 January and transported him to a New York City jail . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/trump-maria-corina-machado-venezuela",
      "published": "Thu, 15 Jan 2026 11:07:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "European military personnel arrive in Greenland as Trump says US needs island",
      "description": "France says a small military contingent has arrived and more forces will be there in the coming days.",
      "url": "https://www.bbc.com/news/articles/cd0ydjvxpejo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 16:12:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces seize a sixth Venezuela-linked oil tanker in Caribbean Sea",
      "description": "The tanker, Veronica, was seized in a predawn operation \"without incident\", the US military's Southern Command says.",
      "url": "https://www.bbc.com/news/articles/cy4qdnj5vl9o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:39:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Votes being counted in Uganda election as opposition alleges rigging",
      "description": "The election is a rematch between Bobi Wine and Yoweri Museveni, who has been president for 40 years.",
      "url": "https://www.bbc.com/news/articles/cx2xn1yvgr4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 17:48:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Singapore's opposition leader stripped of title after conviction for lying",
      "description": "Singh, who was convicted for lying to MPs, has always maintained his innocence.",
      "url": "https://www.bbc.com/news/articles/cp80217r1kpo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 08:59:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From behind bars, Aung San Suu Kyi casts a long shadow over Myanmar",
      "description": "The democracy campaigner has spent 20 years in total in detention, five of them since being overthrown by a coup.",
      "url": "https://www.bbc.com/news/articles/c3r197we875o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 23:01:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "She's offered to share her Nobel with Trump. But what might Machado ask for in return?",
      "description": "Venezuela's opposition leader will meet with US President Donald Trump at the White House on Thursday.",
      "url": "https://www.bbc.com/news/articles/c801p8jppv5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 12:32:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why the UAE has incurred the wrath of Somalia",
      "description": "The government in Mogadishu has accused the UAE of undermining its sovereignty.",
      "url": "https://www.bbc.com/news/articles/c99k4jxz0ndo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 00:27:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Polls close in Uganda presidential election as internet blackout continues",
      "description": "Poll workers are counting ballots cast in Uganda’s contentious general election. Al Jazeera’s Catherine Soi has more.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/polls-close-in-uganda-presidential-election-as-internet-blackout-continues?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:58:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada’s Carney hails improving ties with China",
      "description": "Carney is on a four-day trip to China, the first by a Canadian PM since 2017, in a move to thaw tense relations.",
      "url": "https://www.aljazeera.com/economy/2026/1/15/canadas-carney-hails-improving-ties-with-china?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 17:17:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US seizes another Venezuela-linked oil tanker",
      "description": "Video released by the US military shows troops boarding an oil tanker, said to have links to Venezuela.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/us-seizes-another-venezuela-linked-oil-tanker-2?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:53:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fifteen former NCAA players charged in US-China basketball rigging case",
      "description": "Former players among those charged in alleged scheme to rig basketball games in US and China.",
      "url": "https://www.aljazeera.com/sports/2026/1/15/prosecutors-charge-15-former-ncaa-players-in-latest-basketball-rigging-case?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:50:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What lies ahead for Venezuelan opposition leader Maria Corina Machado?",
      "description": "Machado has argued that the opposition has a 'mandate' to succeed Venezuelan President Nicolas Maduro.",
      "url": "https://www.aljazeera.com/news/longform/2026/1/15/what-lies-ahead-for-venezuelan-opposition-leader-maria-corina-machado?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:43:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: US seizes oil tanker in Caribbean Sea ahead of Trump, Machado meeting",
      "description": "US President Donald Trump meets with Venezuelan opposition leader at the White House, their first in-person meeting.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/15/live-us-seizes-oil-tanker-in-caribbean-sea-ahead-of-trump-machado-meeting?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 16:01:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US court hands Trump victory against pro-Palestine activist Mahmoud Khalil",
      "description": "Appeals court justice dismiss order that released Khalil from immigration detention, potentially enabling his re-arrest.",
      "url": "https://www.aljazeera.com/news/2026/1/15/us-court-hands-trump-victory-against-pro-palestine-activist-mahmoud-khalil?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 15:55:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French double Olympic champion Agnel faces rape trial after appeal rejected",
      "description": "Yannick Agnel won two Olympic golds in swimming for France at the 2012 Summer Games in London.",
      "url": "https://www.aljazeera.com/sports/2026/1/15/french-double-olympic-champion-agnel-faces-rape-trial-after-appeal-rejected?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 15:00:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Controversial US study on hepatitis B vaccines in Africa is cancelled",
      "description": "$1.6m project drew outrage over ethical questions about withholding vaccines proven to prevent disease The controversial US-funded study on hepatitis B vaccines among newborns in Guinea-Bissau has been halted, according to Yap Boum, a senior official at the Africa Centres for Disease Control and Prevention (CDC). “The study has been cancelled,” Boum told journalists at a press conference on Thursday morning. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/hepatitis-b-vaccines-study-africa-cancel",
      "published": "Thu, 15 Jan 2026 18:11:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jewish American columnist Thomas Friedman says he was uninvited from 2024 Adelaide writers’ week over ‘timing’",
      "description": "Claim comes after former festival board member Tony Berg accused Louise Adler and Randa Abdel-Fattah of ‘hypocrisy’ in their accusations of repressing freedom of speech Get our breaking news email , free app or daily news podcast A New York Times columnist at the centre of a second controversy engulfing Adelaide writers’ week has said he was uninvited from the event in 2024. Thomas Friedman, who is Jewish, confirmed to Nine newspapers on Thursday that after he agreed to appear in a video link session, he was subsequently notified “that the timing would not work out”. Continue reading...",
      "url": "https://www.theguardian.com/culture/2026/jan/15/jewish-american-columnist-thomas-friedman-says-he-was-uninvited-from-2024-adelaide-writers-week-ntwnfb",
      "published": "Thu, 15 Jan 2026 06:36:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland to boost the Arctic island's security",
      "description": "Troops from several European countries, including France, Germany, Norway and Sweden, are arriving in Greenland after talks between Denmark, Greenland and the U.S. on Wednesday highlighted disagreement.",
      "url": "https://www.npr.org/2026/01/15/g-s1-106113/european-troops-arrive-greenland",
      "published": "Thu, 15 Jan 2026 05:26:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What Teddy Roosevelt has to do with Trump's moves in Venezuela and Greenland",
      "description": "Presidents James Monroe and Theodore Roosevelt helped shape a policy that rationalizes U.S. intervention in Latin America and elsewhere. But Trump has brought that idea to a whole new level.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5675874/trump-monroe-doctrine-roosevelt-latin-america-intervention",
      "published": "Thu, 15 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda goes to the polls amid heavy security and internet blackout",
      "description": "Ugandans are voting in a tense presidential election as 81-year-old President Yoweri Museveni seeks to extend his four-decade rule amid an internet shutdown and heavy military deployment.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5675906/uganda-election-museveni-bobi-wine",
      "published": "Thu, 15 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Julio Iglesias accused of sexual assault as Spanish prosecutors study the allegations",
      "description": "Spanish prosecutors are studying allegations that Grammy-winning singer Julio Iglesias sexually assaulted two former employees at his residences in the Dominican Republic and the Bahamas.",
      "url": "https://www.npr.org/2026/01/15/g-s1-106108/julio-iglesias-accused-sexual-assault",
      "published": "Thu, 15 Jan 2026 02:46:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: Trump meets Machado as US seizes oil tanker",
      "description": "US forces in the Caribbean have seized a 6th sacntioned oil tanker with ties to Venezuela as sidelined opposition leader Maria Corina Machado is visiting the White House.",
      "url": "https://www.dw.com/en/venezuela-trump-meets-machado-as-us-seizes-oil-tanker/a-75526772?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 18:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US visa suspensions: What you need to know",
      "description": "The US is suspending visa processing for 75 countries. What does this mean, when will it start and who does it affect?",
      "url": "https://www.dw.com/en/us-visa-suspensions-what-you-need-to-know/a-75522177?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 17:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Women poised to take India sports to the next level",
      "description": "India has been experiencing major growth in women's sports in recent years. This is being fuelled by investment from both the public and private sector – as well as many role models.",
      "url": "https://www.dw.com/en/women-poised-to-take-india-sports-to-the-next-level/a-75506901?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Economy narrowly avoids 3rd year of recession",
      "description": "Germany's GDP grew 0.2% in 2025, ending a run of two consecutive years of recession, new figures show. The justice minister wants to combat the misuse of AI to create sexualized images. DW has more",
      "url": "https://www.dw.com/en/germany-news-economy-narrowly-avoids-3rd-year-of-recession/live-75513024?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tense Uganda goes to vote amid internet blackout",
      "description": "Ugandans lined up outside polling stations and encountered delays amid technical difficulties, after a repressive campaign saw hundreds of supporters of President Museveni's opponent arrested.",
      "url": "https://www.dw.com/en/tense-uganda-goes-to-vote-amid-internet-blackout/a-75511408?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 06:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US military seizes sixth oil tanker it says has links to Venezuela",
      "description": "The US military said on Thursday it had seized another oil tanker that it said was contravening US sanctions on Venezuelan oil exports. The Veronica tanker, which was captured in the Caribbean Sea, is the sixth such vessel to be seized by the US since the ouster of Venezuelan leader Nicolas Maduro on January 3.",
      "url": "https://www.france24.com/en/americas/20260115-us-military-seizes-sixth-oil-tanker-says-links-venezuela",
      "published": "Thu, 15 Jan 2026 15:33:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Is the EU-Mercosur trade agreement more than a 'cows for cars' deal?",
      "description": "A qualified majority of EU countries have finally approved the EU-Mercosur trade agreement, over 25 years after talks between the two blocs started. Opposition is still fierce, especially from the European agricultural sector. Charles Pellegrin talks to Maria Concepcion Latorre, a professor of applied economics at Universidad Complutense in Madrid, who argues the benefits of the pact outweigh the disadvantages.",
      "url": "https://www.france24.com/en/tv-shows/people-profit/20260115-is-the-eu-mercosur-trade-agreement-more-than-a-cows-for-cars-deal",
      "published": "Thu, 15 Jan 2026 14:38:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "British activists banned from France over 'destruction' of small boats",
      "description": "Ten British \"far-right activists\" have been banned from France for \"reconnaissance and destruction activities\" against small boats used in migrant crossings.",
      "url": "https://news.sky.com/story/ten-british-far-right-activists-banned-from-france-over-reconnaissance-and-destruction-against-small-boats-13494191",
      "published": "Wed, 14 Jan 2026 16:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's Macron laughs off 'harmless' eye condition as he addresses troops",
      "description": "French President Emmanuel Macron joked about an unintentional “Eye of the Tiger” during his New Year address to France's armed forces",
      "url": "https://abcnews.go.com/International/wireStory/frances-macron-laughs-off-harmless-eye-condition-addresses-129240895",
      "published": "Thu, 15 Jan 2026 09:30:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What's next for Greenland and Denmark after difficult meeting with Trump administration",
      "description": "U.S., Danish and Greenlandic officials have met face to face to discuss President Donald Trump’s ambitions to take control of Greenland, a semiautonomous territory of Denmark",
      "url": "https://abcnews.go.com/International/wireStory/greenland-denmark-after-difficult-meeting-trump-administration-129236119",
      "published": "Thu, 15 Jan 2026 08:01:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK's Conservative Party leader sacks chief rival after apparent plot to defect",
      "description": "Britain's Conservative Party faces fresh turmoil as leader Kemi Badenoch sacks justice spokesperson Robert Jenrick",
      "url": "https://abcnews.go.com/International/wireStory/uks-conservative-party-leader-sacks-chief-rival-after-129234909",
      "published": "Thu, 15 Jan 2026 08:01:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland as talks with US highlight 'disagreement'",
      "description": "Troops from NATO countries, including France and Germany, are arriving in Greenland to boost security",
      "url": "https://abcnews.go.com/International/wireStory/european-troops-arrive-greenland-talks-us-highlight-disagreement-129233667",
      "published": "Thu, 15 Jan 2026 07:36:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A new era for Canada-China relations? Prime Minister Carney signals change in Beijing",
      "description": "Prime Minister Mark Carney says Canada and China are entering a new era of relations",
      "url": "https://abcnews.go.com/International/wireStory/new-era-canada-china-relations-prime-minister-carney-129232756",
      "published": "Thu, 15 Jan 2026 06:57:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Voting begins in Uganda’s presidential election during internet shutdown and delays",
      "description": "Voting begins in Uganda’s presidential election during internet shutdown and delays",
      "url": "https://abcnews.go.com/International/wireStory/voting-begins-ugandas-presidential-election-internet-shutdown-delays-129230986",
      "published": "Thu, 15 Jan 2026 01:49:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan and the Philippines sign a new defense pact as they face Chinese aggression",
      "description": "Japan and the Philippines have signed a defense pact that will allow the tax-free provision of ammunition, fuel, food and other necessities when their forces stage joint training to boost deterrence against China’s growing aggression in the region and ...",
      "url": "https://abcnews.go.com/International/wireStory/japan-philippines-sign-new-defense-pact-face-growing-129228533",
      "published": "Thu, 15 Jan 2026 02:43:20 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Activist in Costa Rica denies plotting to assassinate the president",
      "description": "A Costa Rican activist and government critic accused of plotting to kill President Rodrigo Chaves says that the allegations were ridiculous and politically motivated",
      "url": "https://abcnews.go.com/International/wireStory/activist-costa-rica-denies-plotting-assassinate-president-129218200",
      "published": "Wed, 14 Jan 2026 15:53:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela's acting president vows to continue releasing prisoners detained under Maduro",
      "description": "Venezuela’s acting President Delcy Rodríguez vows to continue releasing prisoners detained under former President Nicolás Maduro",
      "url": "https://abcnews.go.com/International/wireStory/venezuelas-acting-president-vows-continue-releasing-prisoners-detained-129211691",
      "published": "Wed, 14 Jan 2026 21:30:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Private jet skids 300 yards off Colorado runway, sustains severe damage in violent crosswind",
      "description": "A private jet was violently thrown off a Colorado runway by brutal crosswinds, skidding 300 yards with damage. All three aboard escaped injury in Telluride.",
      "url": "https://www.foxnews.com/us/private-jet-skids-300-yards-colorado-runway-sustains-severe-damage-violent-crosswind",
      "published": "Wed, 14 Jan 2026 21:01:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "University researcher accused of calling for assassination of conservative voices in social media post",
      "description": "University of Washington is investigating a researcher who allegedly posted comments calling for the assassination of conservative voices, sparking controversy.",
      "url": "https://www.foxnews.com/us/university-researcher-accused-calling-assassination-conservative-voices-social-media-post",
      "published": "Wed, 14 Jan 2026 18:39:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Troops from Europe deploy to Greenland in rapid 2-day mission as Trump eyes US takeover",
      "description": "European countries are deploying military personnel to Greenland for a quick mission as the Trump administration is pushing to acquire the Danish territory.",
      "url": "https://www.foxnews.com/world/troops-from-europe-deploy-greenland-rapid-2-day-mission-trump-eyes-us-takeover",
      "published": "Thu, 15 Jan 2026 10:52:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Some US military personnel told to leave Middle East bases, US official confirms",
      "description": "The U.S. has ordered some of its military personnel to depart from bases in the Middle East on Tuesday as tensions with Iran escalate.",
      "url": "https://www.foxnews.com/world/some-us-military-personnel-told-leave-middle-east-bases-us-official-confirms",
      "published": "Wed, 14 Jan 2026 09:31:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Passengers baffled and confused after screams burst from beneath taxiing Air Canada plane",
      "description": "Passengers aboard a taxiing Air Canada flight were left shaken after muffled screams and banging were suddenly heard from beneath the cabin.",
      "url": "https://www.foxnews.com/world/passengers-baffled-confused-screams-burst-taxiing-air-canada-plane",
      "published": "Tue, 13 Jan 2026 22:03:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}