{
  "last_updated": "2026-01-01T16:28:53.594353Z",
  "event_count": 224,
  "events": [
    {
      "title": "US military confirms 5 killed in Dec 31 kinetic strike on reported narco-terror vessels",
      "description": "A military operation targeted drug trafficking vessels on Dec. 31, resulting in five deaths during a kinetic strike against reported narco-terrorists.",
      "url": "https://www.foxnews.com/us/us-military-confirms-5-killed-dec-31-kinetic-strike-reported-narco-terror-vessels",
      "published": "Wed, 31 Dec 2025 20:59:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s shadow war in Venezuela grows, but country’s strongman leader still clings to power",
      "description": "Report of a drone attack on a port facility signals new phase in US military campaign against Nicolás Maduro US wargames played out scenarios for Maduro’s fall. None of them ended well for Venezuela Nearly a week after Donald Trump first announced what he said was the first US ground strike in a four-month-long military pressure campaign against Venezuela , details remain very thin on the ground. CNN and the New York Times reported late on Monday that they had confirmed the CIA had used a drone to target a “port facility” allegedly used by the Tren de Aragua street gang. No casualties were reported, but the date, time and location of the attack remain unknown. Venezuela’s strongman leader, Nicolás Maduro , and his government have remained silent. If confirmed, the first strike on land would mark a new phase in a campaign that since August has involved the deployment of a massive US naval fleet, airstrikes that have so far killed 107 people, a “total blockade” of sanctioned oil tankers, the seizure of two vessels and the pursuit of a third. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/military-drone-strike-venezuela-trump-maduro",
      "published": "Tue, 30 Dec 2025 19:34:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "US military destroys narco-terror convoy of three vessels at sea in kinetic strikes",
      "description": "U.S. military strikes reportedly kill three people in overnight operation against alleged narco-terrorist drug trafficking convoy in international waters.",
      "url": "https://www.foxnews.com/us/us-military-destroys-narco-terror-convoy-three-vessels-sea-kinetic-strikes",
      "published": "Wed, 31 Dec 2025 17:14:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s camp confirm two of his close friends died in Nigeria car crash",
      "description": "British former boxing champion sustained minor injuries Sina Ghami and Kevin ‘Lateef’ Ayodel killed in accident The British heavyweight boxer Anthony Joshua has issued a statement after he was injured in a car crash in Nigeria on Monday morning which killed two of his close friends. The former world heavyweight boxing champion was taken to an undisclosed hospital after his car hit a stationary vehicle at about 11am on the Lagos-Ibadan Expressway, the Ogun state police commissioner, Lanre Ogunlowo, said. The driver of Joshua’s vehicle was also injured, he added. Continue reading...",
      "url": "https://www.theguardian.com/sport/2025/dec/29/anthony-joshua-injured-car-crash-nigeria",
      "published": "Tue, 30 Dec 2025 00:17:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protests turn deadly: Government has offered dialogue in face of demonstrations",
      "description": "A member of Iran’s security forces was killed, marking the first reported death after several days of demonstrations over soaring inflation, in what has been the most significant unrest in the country since nationwide protests three years ago. Adjunct Senior Lecturer at Lund University, Rouzbeh Parsi, shares his insights.",
      "url": "https://www.france24.com/en/video/20260101-iran-protests-turn-deadly-government-has-offered-dialogue-in-face-of-demonstrations",
      "published": "Thu, 01 Jan 2026 13:26:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "UN, US sign $2 billion humanitarian funding agreement for 17 crisis-hit countries",
      "description": "The United Nations and the United States on Monday formalized an agreement under which the US committed $2 billion in humanitarian assistance for global relief programmes, a move the UN’s top relief official hailed as a landmark commitment to saving lives amid escalating humanitarian needs worldwide.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166678",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Hamas confirms five leaders killed, including 'masked spokesperson' in major blow to terror group",
      "description": "Five Hamas military commanders confirmed dead by terrorist group's armed wing, marking significant blow to Palestinian militant organization's leadership structure in Gaza conflict.",
      "url": "https://www.foxnews.com/world/hamas-confirms-five-leaders-killed-including-masked-spokesperson-major-blow-terror-group",
      "published": "Mon, 29 Dec 2025 20:15:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan civil war: Health system ‘on the verge of collapse’",
      "description": "The war in Sudan has been tearing the country apart for almost 1,000 days, putting the country’s health system under intolerable pressure. The World Health Organization (WHO) is reporting widespread disease outbreaks, severe shortages, malnutrition and rising deaths.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166673",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Putin, Xi Jinping ring in New Year",
      "description": "World leaders have been exchanging New Year’s greetings, including Chinese President Xi Jinping and Russian President Vladimir Putin, with Xi using his address to express a desire to strengthen ties with Moscow while reiterating a warning against what Beijing sees as pro-independence forces in Taiwan, on the same day China’s military announced the end of live-fire drills around the island, while Putin said he was confident Russia would ultimately prevail in the war in Ukraine, despite a recent surge in diplomatic efforts that have yet to produce an end to the conflict. Charlotte Hughes reports.",
      "url": "https://www.france24.com/en/video/20260101-putin-xi-jinping-ring-in-new-year",
      "published": "Thu, 01 Jan 2026 09:40:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: Guterres deplores deadly mosque blast in Homs",
      "description": "UN Secretary-General António Guterres “unequivocally condemns” the deadly terrorist attack on a mosque in Homs, Syria during Friday prayers, his spokesperson said in a statement",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166674",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Switzerland: New Year catastrophe in Swiss ski resort",
      "description": "Several dozen people are presumed dead and roughly 100 more injured after a fire ripped through a bar during New Year's Eve celebrations in a luxury resort town in southern Switzerland, police said Thursday. The cause of the fire remains unknown, but Swiss authorities have said the incident is not being treated as an attack of any kind. France24 correspondent John Zarocostas reports.",
      "url": "https://www.france24.com/en/video/20260101-switzerland-new-year-catastrophe-in-swiss-ski-resort",
      "published": "Thu, 01 Jan 2026 14:45:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Dozens killed, some 100 injured after fire ravages NYE party in Switzerland",
      "description": "Dozens of people were killed and some 100 were injured after a fire ripped through a bar during New Year's Eve celebrations in a luxury resort town in southern Switzerland, police said Thursday. The Italian foreign ministry cited police as saying there were about 40 deaths in the overnight blaze in the ski resort town of Crans-Montana.",
      "url": "https://www.france24.com/en/live-news/20260101-deadly-fire-ravages-new-year-celebration-in-bar-at-luxury-swiss-ski-resort",
      "published": "Thu, 01 Jan 2026 09:01:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly fire at Swiss ski resort: Many killed during New Year's celebrations",
      "description": "A fire at a bar in the upscale Alpine ski resort of Crans-Montana just north of the Matterhorn, in Switzerland, has killed dozens of people and injured nearly 100 after breaking out around 1:30 a.m. at the Constellation bar, with investigators now working to determine the cause as authorities say there is no indication the blaze was terror-related. France24 correspondent, John Zarocostas, reports the latest.",
      "url": "https://www.france24.com/en/video/20260101-deadly-fire-ad-swiss-ski-resort-many-killed-during-new-year-s-celebrations",
      "published": "Thu, 01 Jan 2026 09:46:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Switzerland: Dozens killed in fire at Swiss ski resort",
      "description": "Several dozen people are presumed dead and roughly 100 more injured after a fire ripped through a bar during New Year's Eve celebrations in a luxury resort town in southern Switzerland, police said Thursday. The cause of the fire remains unknown, but Swiss authorities have said the incident is not being treated as an attack of any kind. France24 correspondent John Zarocostas reports the latest.",
      "url": "https://www.france24.com/en/video/20260101-switzerland-dozens-killed-in-fire-at-swiss-ski-resort",
      "published": "Thu, 01 Jan 2026 12:07:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Dispatch records from Brown University shooting capture chaos of deadly campus attack",
      "description": "Newly obtained police records reveal chaotic emergency response to Brown University shooting that left two students dead and multiple wounded on Dec. 13.",
      "url": "https://www.foxnews.com/us/dispatch-records-brown-university-shooting-capture-chaos-deadly-campus-attack",
      "published": "Wed, 31 Dec 2025 11:45:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Kyiv argues alleged attack on Putin’s home was Russian false-flag operation",
      "description": "The CIA has concluded that Ukraine did not attempt to target Russian President Vladimir Putin or any of his residences in an attack earlier this week, an allegation Kyiv has firmly denied, saying the Kremlin is using the claim to harden its stance in peace negotiations aimed at ending the war in Ukraine. France24 International Affairs commentator Douglas Herbert shares his insights.",
      "url": "https://www.france24.com/en/video/20260101-kyiv-argues-alleged-attack-on-putin-s-home-was-russian-false-flag-operation",
      "published": "Thu, 01 Jan 2026 10:21:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "At least 13 people killed and 98 injured in train derailment in Mexico",
      "description": "Train accident in Oaxaca is likely to raise criticisms about public works projects from the previous administration At least 13 people were killed when a train derailed in the Mexican state of Oaxaca, in an accident which is likely to revive opposition criticisms of the speed and dealings with which the country’s government builds its flagship public works projects. The incident took place on the Interoceanic Train, which was built to link the Atlantic and Pacific oceans across the narrowest part of the Isthmus of Tehuantepec, creating an alternative rail cargo route to the Panama canal intended to drive development in the region. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/mexico-train-derailment-oaxaca",
      "published": "Mon, 29 Dec 2025 18:48:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "WHO research shows COVID vaccines still crucial in preventing severe illness",
      "description": "Up-to-date vaccination remains the most effective way to prevent severe COVID-19 illness, new research from the World Health Organization (WHO) shows, even as the pandemic has officially ended.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166689",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Perth teenager charged after allegedly throwing firecracker that sparked New Year’s Eve bushfire",
      "description": "Blaze on city’s eastern fringe contained but not controlled on Thursday with firefighters warning of risk to lives and homes Get our breaking news email , free app or daily news podcast A teenager accused of tossing a firecracker into Perth bushland on New Year’s Eve has been charged after it sparked a bushfire that threatened homes on the city’s eastern fringe. More than 2,000 homes and businesses lost power as the fire, east of Perth airport in Western Australia, approached properties near Maida Vale, Forrestfield and Kalamunda, police said in a statement on Thursday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/01/perth-teenager-charged-after-allegedly-throwing-firecracker-that-sparked-new-years-eve-bushfire",
      "published": "Thu, 01 Jan 2026 05:08:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief urges world leaders to ‘get priorities straight’ as New Year message calls for peace over war",
      "description": "As the world enters 2026 amid mounting crises, the UN Secretary-General António Guterres has issued a stark but hopeful New Year appeal, urging global leaders to shift resources away from destruction and towards development, peace and people.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166677",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Sri Lanka cyclone: More than a million still need aid weeks after Ditwah floods",
      "description": "Nearly a month after Cyclone Ditwah tore across Sri Lanka, more than a million people – including over half a million children – remain in urgent need of humanitarian assistance, as floods, landslides and renewed rainfall continue to compound one of the country’s worst disasters in decades.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166671",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iran in shutdown as protesters storm governor's office, crowds chant 'Death to Khamenei'",
      "description": "Iran security forces clashed with protesters in Tehran, Shiraz and Kermanshah as opposition groups report gunfire and demonstrators chant \"Death to Khamenei\" during unrest.",
      "url": "https://www.foxnews.com/world/iran-shutdown-protests-intensify-amid-leadership-shake-up-deepening-crisis",
      "published": "Wed, 31 Dec 2025 20:28:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "At least 3 people killed as protests spread across Iran",
      "description": "A volunteer security official was reportedly among the people killed in the response to protests. As Iran slips deeper into economic crisis, the unrest, which began Sunday in Tehran, has spread to other cities.",
      "url": "https://www.dw.com/en/at-least-3-people-killed-as-protests-spread-across-iran/a-75361629?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 15:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua discharged from hospital after Nigeria car crash",
      "description": "Two of the former world champion's closest friends were killed in the accident on Monday.",
      "url": "https://www.bbc.com/news/articles/c5yvdw77j04o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 00:32:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Israel says it will 'enforce' ban on 37 NGOs in Gaza as humanitarian crisis deepens",
      "description": "Dozens of international humanitarian organisations will be banned from operating in the devastated Gaza Strip after Israel said the groups had not complied with a deadline to meet \"security and transparency standards\". A number of aid groups have refused to submit a list of their Palestinian staff over fears they will be targeted by Israel.",
      "url": "https://www.france24.com/en/middle-east/20260101-israel-says-will-enforce-ban-37-ngos-gaza-humanitarian-crisis-deepens",
      "published": "Thu, 01 Jan 2026 09:27:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Health advances marked 2025 as wars and funding cuts strained systems",
      "description": "From eliminating deadly infections to expanding access to lifesaving vaccines, 2025 delivered meaningful progress for global health, according to the UN World Health Organization (WHO), offering cautious optimism at the close of a year marked by both breakthroughs and strain.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166690",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Iran security force member killed during protests, officials say",
      "description": "A currency collapse has led to protests breaking out across the country, with unrest reported in several cities.",
      "url": "https://www.bbc.com/news/articles/c2d7g8krj2po?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 12:54:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Afghanistan to remain major crisis in 2026, UN, partners warn",
      "description": "Afghanistan is expected to remain one of the world’s largest humanitarian crises in 2026, UN agencies and humanitarian partners warned on Tuesday, launching a $1.7 billion appeal to assist nearly 18 million people in urgent need.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166684",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Disney World cast member injured after massive boulder prop veers off track at Indiana Jones stunt show",
      "description": "A Disney World cast member heroically stopped a runaway boulder during an \"Indiana Jones\" stunt show malfunction that went viral. The dramatic rescue was caught on video.",
      "url": "https://www.foxnews.com/us/disney-world-cast-member-injured-massive-boulder-prop-veers-track-indiana-jones-stunt-show",
      "published": "Wed, 31 Dec 2025 20:25:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "At least 10 killed in an explosion at Swiss ski resort town",
      "description": "An explosion ripped through a popular bar in the Swiss ski resort of Crans-Montana during New Year’s celebrations.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/1/at-least-10-killed-in-an-explosion-at-swiss-ski-resort-town?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 09:00:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Greetings from Vienna, where an imperial palace hosts a holiday market for all",
      "description": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "url": "https://www.npr.org/2025/12/31/g-s1-103737/vienna-christmas-market-austria",
      "published": "Wed, 31 Dec 2025 08:09:22 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Pope opens 2026 with plea for peace in countries bloodied by war, families wounded by violence",
      "description": "Pope Leo XIV has opened 2026 with a plea for peace",
      "url": "https://abcnews.go.com/International/wireStory/pope-opens-2026-plea-peace-countries-bloodied-war-128827322",
      "published": "Thu, 01 Jan 2026 07:30:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN peacekeeper injured in gunfire near ‘Blue Line’ in south Lebanon",
      "description": "One United Nations peacekeeper was injured on Friday after heavy machine gunfire from Israel Defense Forces (IDF) positions south of the Blue Line, following a nearby grenade explosion, impacted close to a UN patrol in southern Lebanon.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166676",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Flash floods triggered by heavy rains in Afghanistan kill at least 17 people",
      "description": "Afghanistan's disaster management agency says the season’s first heavy rain and snowfall has ended a prolonged dry spell but triggered flash floods, killing at least 17 people and injuring 11 others",
      "url": "https://abcnews.go.com/International/wireStory/flash-floods-triggered-heavy-rains-afghanistan-kill-17-128829124",
      "published": "Thu, 01 Jan 2026 08:41:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "SECURITY COUNCIL LIVE: Briefing on threats to international peace and security",
      "description": "The UN Security Council meets today to hear a briefing on threats to international peace and security following Israel’s recent recognition of the northern region of Somalia as an independent and sovereign state. Follow live below and UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166679",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Irish man found dead at famous Whitehaven beach among four deaths on Australia’s east coast",
      "description": "A woman has also died after being swept into the ocean in Sydney on New Year’s Day, while the body of a man was found near Palm beach Get our breaking news email , free app or daily news podcast An Irish man has died at Whitehaven beach near the Great Barrier Reef, with three other people found dead and grave fears for two more after separate incidents in waters off Sydney during a horror New Year period. Queensland police said that emergency services received reports that a 35-year-old Irish man had been found dead in the water at the popular beach in the state’s north at about 11am on Wednesday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/01/woman-dies-after-being-swept-into-ocean-from-sydney-beach-in-early-hours-of-new-years-day",
      "published": "Thu, 01 Jan 2026 07:42:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Russia says Ukrainian drone strike kills 24 in occupied Ukraine as tensions grow amid peace talks",
      "description": "Russian officials say that a Ukrainian attack killed 24 people in a Russian-occupied village in Ukraine’s Kherson region, as tensions between the two nations continue to spike despite diplomats hailing productive peace talks",
      "url": "https://abcnews.go.com/International/wireStory/russia-ukrainian-drone-strike-kills-24-occupied-ukraine-128826934",
      "published": "Thu, 01 Jan 2026 07:13:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian protesters clash with security forces as tear gas fills Tehran streets amid nationwide unrest",
      "description": "Iran protests escalated as demonstrators clashed with security forces in Tehran and Mashhad, with tear gas deployed amid nationwide strikes, reports say.",
      "url": "https://www.foxnews.com/world/iranian-protesters-clash-security-forces-tear-gas-fills-tehran-streets-amid-nationwide-unrest",
      "published": "Mon, 29 Dec 2025 20:05:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Netherlands police face 'unprecedented' New Year's  violence",
      "description": "Reports of fireworks and other explosives being thrown are widespread across the country.",
      "url": "https://www.bbc.com/news/articles/c3r1lx75nl8o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 13:30:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘Dozens’ killed in Swiss ski resort blaze: What we know",
      "description": "New Year's Eve fire in a Swiss resort in Crans-Montana has injured more than 100 people.",
      "url": "https://www.aljazeera.com/news/2026/1/1/dozens-killed-in-swiss-ski-resort-explosion-what-we-know?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 10:46:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "French firefighters launch nationwide calendar competition to support Injured crews",
      "description": "Every winter in France, firefighters sell calendars to raise funds for a nonprofit organization that supports injured firefighters and the families of those who have died in the line of duty, and this year the tradition includes the fourth edition of a nationwide calendar competition, with 128 fire stations inviting the public to vote for the best design, as our colleagues at France Télévisions, Alexis Fischer, Mathieu Dreujou, and Claire Combaluzier, along with France 24’s Florent Marchais, report.",
      "url": "https://www.france24.com/en/video/20260101-french-firefighters-launch-nationwide-calendar-competition-to-support-injured-crews",
      "published": "Thu, 01 Jan 2026 11:58:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "UN renews ceasefire push in Sudan",
      "description": "The UN has urged Sudan’s warring parties to pursue compromise and an immediate ceasefire, even as drone attacks, displacement and the killing of peacekeepers underscore the growing risks to civilians and humanitarians.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166675",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Anti-Iran regime protests grow across country as Trump admin boosts demonstrators offering support",
      "description": "U.S. officials voice support for Iranian demonstrators as protests intensify following currency crisis, with reports of tear gas and security crackdowns.",
      "url": "https://www.foxnews.com/world/anti-iran-regime-protests-grow-across-country-trump-admin-boosts-demonstrators-offering-support",
      "published": "Tue, 30 Dec 2025 12:47:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Russia claims Ukrainian drone attack killed 24 people in Kherson",
      "description": "Russia says those killed were celebrating in a cafe located in an area of southern Ukraine controlled by Moscow.",
      "url": "https://www.aljazeera.com/news/2026/1/1/russia-claims-ukrainian-drone-attack-killed-24-people-in-kherson?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 13:59:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Several dozen dead after explosion hits Swiss ski resort bar",
      "description": "Emergency services have been responding overnight after a powerful blast tore through a crowded bar in the Alpine resort of Crans-Montana as New Year celebrations were underway.",
      "url": "https://www.dw.com/en/several-dozen-dead-after-explosion-hits-swiss-ski-resort-bar/a-75357616?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 09:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Netanyahu warns of ‘eighth front’ ideological battle for American hearts and minds with Christian leaders",
      "description": "Israeli Prime Minister Benjamin Netanyahu warns of 'eighth front' in ideological battle, telling Christian leaders that faith must confront terrorism in defense of civilization.",
      "url": "https://www.foxnews.com/world/netanyahu-warns-eighth-front-ideological-battle-american-hearts-minds-christian-leaders",
      "published": "Wed, 31 Dec 2025 16:23:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "The 'thorny' issues that threaten to derail a Russia-Ukraine peace deal",
      "description": "Two of the main sticking points involve territory and the fate of Europe's biggest nuclear plant, which is currently occupied by Russia.",
      "url": "https://www.bbc.com/news/articles/c78v5dj3x39o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 17:33:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Australia says ‘deeply concerning, destabilising’ Chinese exercises near Taiwan risk inflaming regional tension",
      "description": "Foreign affairs department statement says Australia opposes any actions that ‘increase the risk of accident, miscalculation or escalation’ Get our breaking news email , free app or daily news podcast Australia says it is deeply concerned about Chinese military exercises near Taiwan, and has raised the issue with Chinese officials. In a statement released on Wednesday , the Department of Foreign Affairs and Trade (Dfat) said the large-scale simulations risked destabilising the region and could result in an accident or escalation. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/australia-says-deeply-concerning-destabilising-chinese-exercises-near-taiwan-risk-inflaming-regional-tension",
      "published": "Wed, 31 Dec 2025 07:28:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Australian man reportedly killed fighting with Ukrainian forces against Russia",
      "description": "Australia’s foreign affairs department seeking to verify reported death of Russell Allan Wilson on 12 December Get our breaking news email , free app or daily news podcast The department of foreign affairs is trying to confirm the death of an Australian man who was reportedly killed while fighting with Ukrainian forces against Russia last month. According to multiple posts on social media, Russell Allan Wilson was killed on 12 December in the Donetsk region. The ABC reported that a friend of Wilson said he was killed during his final mission, and had been due to be married the week after his death. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/01/australian-reportedly-killed-fighting-with-ukrainian-forces-against-russia-ntwnfb",
      "published": "Thu, 01 Jan 2026 05:02:54 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Germany news: Two teens killed in NYE fireworks accidents",
      "description": "Despite being a calmer New Year's Eve in Germany than previous years, two 18-year-olds died after suffering facial injuries in separate accidents involving homemade fireworks a western German city. DW has more.",
      "url": "https://www.dw.com/en/germany-news-two-teens-killed-in-nye-fireworks-accidents/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 10:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Attacks disrupt heating as temperatures plunge",
      "description": "Recent attacks across Ukraine have killed civilians, damaged critical infrastructure and cut heating and power supplies for millions, UN humanitarians report, as temperatures drop below freezing.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166687",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Homeless drifter accused of killing Barnes & Noble Christmas shopper blamed ‘fight or flight’ outburst: report",
      "description": "Man accused of fatally stabbing woman at Palm Beach Gardens Barnes & Noble allegedly had no prior relationship with victim in random attack, police say.",
      "url": "https://www.foxnews.com/us/homeless-drifter-accused-killing-barnes-noble-christmas-shopper-blamed-fight-flight-outburst-report",
      "published": "Thu, 01 Jan 2026 10:00:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran's economic crisis, political discontent threaten regime",
      "description": "Protests triggered by soaring inflation and a collapsing currency have highlighted widespread political discontent. Analysts say the deep economic woes are a major challenge to the regime's authority.",
      "url": "https://www.dw.com/en/iran-s-economic-crisis-political-discontent-threaten-regime/a-75350062?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 14:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "New Year's Eve live: World ushers in 2026",
      "description": "DW has all the updates as the world celebrates the end of 2025 and looks forward to 2026.",
      "url": "https://www.dw.com/en/new-year-s-eve-live-world-ushers-in-2026/live-75348280?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 13:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Tensions between Saudis and Emiratis over future of Yemen reach boiling point",
      "description": "Dispute has potential to create civil war in south of Yemen and spill over into neighbouring countries Tensions between the United Arab Emirates and Saudi Arabia over the future of Yemen and the imminent possibility of the declaration of an independent southern state have reached boiling point with Saudi Arabia in effect accusing the UAE of threatening its future security. The dispute has the potential to create a civil war within the south of Yemen and also spill over into other disputes including in Sudan and the Horn of Africa where the two countries often find themselves backing opposite sides. Yemen could yet become only one theatre in which the two vastly wealthy Gulf states vie for political influence, control of shipping lanes and commercial access. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/saudi-arabia-uae-tension-future-yemen-boiling-point",
      "published": "Tue, 30 Dec 2025 17:19:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Australian house prices expected to rise at least 5% in 2026 after jump last year",
      "description": "While last year’s 8.6% increase isn’t likely to be repeated, economists expect growth across the country as demand continues to outstrip supply Get our breaking news email , free app or daily news podcast Australian residential property values are expected to rise by at least 5% over the next 12 months – on top of the 8.6% increase seen in 2025 – exacerbating a housing affordability crunch across the country. Every state and territory capital city recorded increases last year, according to Cotality data, led by a dramatic 18.9% rise in Darwin, 15.9% in Perth and 14.5% in Brisbane. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/02/australian-house-prices-expected-to-rise-at-least-5-in-2026-after-jump-last-year",
      "published": "Thu, 01 Jan 2026 13:01:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iranian protesters attempt to break in to government building as demonstrations escalate",
      "description": "Iranian protesters attempted to storm a local government building on Wednesday, state media reported, as demonstrations over the cost of living reached their fourth day.",
      "url": "https://news.sky.com/story/iranian-protesters-attempt-to-break-in-to-government-building-13489061",
      "published": "Wed, 31 Dec 2025 14:38:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Indonesia raises alert for the Mount Bur Ni Telong volcano",
      "description": "Authorities in Indonesia have raised the alert level for the Mount Bur Ni Telong volcano to its second highest following a series of increased activity and volcanic earthquakes",
      "url": "https://abcnews.go.com/International/wireStory/indonesia-raises-alert-mount-bur-ni-telong-volcano-128797820",
      "published": "Wed, 31 Dec 2025 08:57:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sexual violence against children ‘entrenched, systemic and widespread’ across DR Congo, UNICEF warns",
      "description": "Sexual violence against children has become entrenched, systemic and increasingly widespread across the Democratic Republic of the Congo (DRC), with new data showing a sharp rise in cases since 2022, according to the UN Children’s Fund (UNICEF).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166683",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Putin residence attack video slammed; US officials say Ukraine did not target leader",
      "description": "Defense experts questioned Russia's drone attack claims against President Vladimir Putin's residence after Moscow provides conflicting accounts of intercepted Ukrainian drones.",
      "url": "https://www.foxnews.com/world/putin-residence-attack-video-slammed-us-officials-say-ukraine-target-leader",
      "published": "Wed, 31 Dec 2025 18:22:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Israel’s NGO ban forces dozens of aid groups to suspend work in Gaza",
      "description": "Israel is revoking the licenses of 37 international organisations, forcing them to stop operations in Gaza.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/1/israels-ngo-ban-forces-dozens-of-aid-groups-to-suspend-work-in-gaza?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 11:37:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela says it released 99 people detained for 2024 election protests",
      "description": "Government said the move was due to its ‘unrestricted respect for human rights’ in the face of US aggression Venezuela has said it has carried out its largest release of political prisoners this year, claiming to have freed 99 people detained for taking part in protests after the 2024 election, widely believed to have been stolen by the dictator Nicolás Maduro , as it comes under increasing military pressure from the US. Civil society organisations have treated the news with caution and stressed that the releases were insufficient, noting that at least 900 political prisoners remain in the country. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/venezuela-political-prisoner-release",
      "published": "Fri, 26 Dec 2025 14:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Israel bans dozens of aid groups from Gaza, despite immense needs",
      "description": "Dozens of international aid groups, like Doctors Without Borders, are now banned from entering Gaza under new rules set by Israel.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5662408/israel-bans-dozens-of-aid-groups-from-gaza-despite-immense-needs",
      "published": "Wed, 31 Dec 2025 07:34:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "French president Macron outlines roadmap for 2026",
      "description": "In France, President Emmanuel Macron delivered his second-to-last end-of-year address, outlining a roadmap for the year ahead and adopting an optimistic tone, saying that despite ongoing global political turmoil there are still reasons for hope, while also setting out his plans for the country in the coming year. Eliza Herbert has that recap.",
      "url": "https://www.france24.com/en/video/20260101-french-president-macron-outlines-roadmap-for-2026",
      "published": "Thu, 01 Jan 2026 09:32:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Somali daycare in Minnesota broken into, key documents stolen in overnight burglary",
      "description": "A Somali-run daycare in Minneapolis was allegedly broken into amid ongoing fraud investigations. Important employee and child documents reportedly missing.",
      "url": "https://www.foxnews.com/us/somali-daycare-minnesota-broken-key-documents-stolen-overnight-burglary",
      "published": "Wed, 31 Dec 2025 15:41:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran launches satellites on Russian rockets as Moscow-Tehran ties deepen",
      "description": "Iran launches three satellites with Russian assistance, showcasing deepening cooperation as they resist Western sanctions and international pressure.",
      "url": "https://www.foxnews.com/world/iran-launches-satellites-russian-rockets-moscow-tehran-ties-deepen",
      "published": "Wed, 31 Dec 2025 11:26:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "In pictures: New Year welcomed around the world",
      "description": "From spectacular firework displays to chilly sea dips, nations celebrate the start of 2026.",
      "url": "https://www.bbc.com/news/articles/c050j896q2do?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 05:48:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Hundreds of thousands march in Istanbul in solidarity with Gaza",
      "description": "Demonstrators in Turkiye demand global pressure on Israel, calling the so-called ceasefire 'a slow-motion genocide'.",
      "url": "https://www.aljazeera.com/news/2026/1/1/hundreds-of-thousands-march-in-istanbul-in-solidarity-with-gaza?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 12:17:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Photos: The world welcomes the new year",
      "description": "As fireworks light the sky and crowds count down together, communities around the globe welcome 2026.",
      "url": "https://www.npr.org/sections/the-picture-show/2025/12/31/nx-s1-5662712/photos-world-new-years-eve",
      "published": "Wed, 31 Dec 2025 18:27:21 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Kohberger plea, Cincinnati beating, Read verdict fuel 2025’s most viral, controversial moments",
      "description": "Viral video of Cincinnati racial beating sparks national outrage as Charlie Kirk's assassination and Shamsud-Din Jabbar's New Orleans attack dominate 2025 headlines.",
      "url": "https://www.foxnews.com/us/kohberger-plea-cincinnati-beating-read-verdict-fuel-2025-most-viral-controversial-moments",
      "published": "Wed, 31 Dec 2025 08:00:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Several dozen feared dead in Swiss ski resort bar fire",
      "description": "Around 100 are also injured in fire at Crans-Montana Swiss ski resort bar Le Constellation.",
      "url": "https://www.bbc.com/news/articles/cx2pmyyeg78o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 15:25:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US military says five killed in latest strike on alleged drug boats",
      "description": "The latest strike comes as the US Coast Guard searches for survivors of another that happened a day earlier.",
      "url": "https://www.bbc.com/news/articles/czdq1ple2l4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 10:19:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Sydney sends message of peace for New Year's after Bondi attack",
      "description": "The words peace and unity were projected onto the Sydney Harbour Bridge as thousands gathered to watch the annual fireworks.",
      "url": "https://www.bbc.com/news/articles/clye3xz52e5o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 15:24:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Photos: Thousands march in Turkiye in support of Gaza on New Year’s Day",
      "description": "Protesters in Istanbul march after morning prayers, calling for an end to Israel's genocidal war in Gaza.",
      "url": "https://www.aljazeera.com/gallery/2026/1/1/photos-thousands-march-in-turkiye-in-support-of-gaza-on-new-years-day?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 11:11:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s separatist STC refuses to withdraw from provinces near Saudi Arabia",
      "description": "STC to maintain presence, but agrees to deployment of Riyadh-backed National Shield government forces in the areas.",
      "url": "https://www.aljazeera.com/news/2026/1/1/yemens-separatist-stc-refuses-to-withdraw-from-provinces-near-saudi-arabia?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 10:51:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Dozens killed in fire at Swiss Alps bar during New Year's celebration",
      "description": "Swiss authorities say dozens of people were killed in an overnight fire at the Le Constellation bar at the Crans-Montana ski resort.",
      "url": "https://www.npr.org/2026/01/01/nx-s1-5663527/dozens-killed-in-fire-at-swiss-alps-bar-during-new-years-celebration",
      "published": "Thu, 01 Jan 2026 07:51:28 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Dozens presumed dead in fire at Swiss Alps bar during New Year's celebration",
      "description": "Dozens of people are presumed dead and about 100 injured, most of them seriously, following a fire at a Swiss Alps bar during a New Year's celebration, police said Thursday.",
      "url": "https://www.npr.org/2026/01/01/g-s1-104209/fire-swiss-alps-new-years-celebration",
      "published": "Thu, 01 Jan 2026 05:27:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Switzerland: Deadly bar fire hits Alps resort at New Year",
      "description": "Emergency services are looking into the powerful blaze at a crowded bar in the Alpine resort of Crans-Montana as New Year celebrations were underway. DW has the latest.",
      "url": "https://www.dw.com/en/switzerland-deadly-bar-fire-hits-alps-resort-at-new-year/live-75359447?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 10:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Anthony Joshua discharged from hospital after Nigeria crash",
      "description": "The British heavyweight sustained injuries in a car crash that killed two of his friends.",
      "url": "https://www.dw.com/en/anthony-joshua-discharged-from-hospital-after-nigeria-crash/a-75359296?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 09:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Finland seizes vessel suspected of damaging undersea cable",
      "description": "European countries are on high alert following a series of suspected sabotage attacks on underwater cables and pipelines.",
      "url": "https://www.dw.com/en/finland-seizes-vessel-suspected-of-damaging-undersea-cable/a-75349419?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 12:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "How a New Year's party 'turned into a nightmare': What we know about Swiss ski resort fire",
      "description": "Dozens of people are presumed dead and around 100 others have been injured after a fire during New Year's Eve celebrations at a bar in the Swiss Alps.",
      "url": "https://news.sky.com/story/what-we-know-about-deadly-new-years-fire-at-swiss-ski-resort-13489204",
      "published": "Thu, 01 Jan 2026 08:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Anthony Joshua pays respects to friends killed in road crash",
      "description": "Anthony Joshua has been discharged from hospital days after a car crash in Nigeria that killed two of his close friends.",
      "url": "https://news.sky.com/story/anthony-joshua-discharged-from-hospital-after-fatal-road-crash-13489140",
      "published": "Wed, 31 Dec 2025 23:15:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand releases 18 Cambodian prisoners of war as part of ceasefire agreement",
      "description": "Thailand has repatriated 18 Cambodian prisoners of war",
      "url": "https://abcnews.go.com/International/wireStory/thailand-releases-18-cambodian-prisoners-war-part-ceasefire-128798649",
      "published": "Wed, 31 Dec 2025 08:01:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains 125 more Islamic State suspects as nationwide sweep continues",
      "description": "Turkish authorities have detained 125 suspected Islamic State members in raids across 25 provinces",
      "url": "https://abcnews.go.com/International/wireStory/turkey-detains-125-islamic-state-suspects-nationwide-sweep-128800259",
      "published": "Wed, 31 Dec 2025 07:13:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Fire at a bar in the Swiss Alps leaves people dead during New Year's celebrations",
      "description": "A fire at a bar in the Swiss Alps has left people dead and injured during New Year’s celebrations",
      "url": "https://abcnews.go.com/International/wireStory/fire-bar-swiss-alps-left-people-dead-injured-128825713",
      "published": "Thu, 01 Jan 2026 02:06:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "A look at some of the worst fires in bars, nightclubs and music venues",
      "description": "A fire at a bar in the Swiss ski resort of Crans-Montana in the early hours of New Year’s Day has left dozens of people presumed dead and around 100 injured, according to authorities",
      "url": "https://abcnews.go.com/International/wireStory/worst-fires-bars-nightclubs-music-venues-128826435",
      "published": "Thu, 01 Jan 2026 06:01:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "France reportedly planning to ban children under 15 from social media starting 2026",
      "description": "France planning social media ban for children under 15, following Australia's lead. Macron pushes new digital restrictions amid youth violence concerns.",
      "url": "https://www.foxnews.com/world/france-reportedly-targeting-kids-under-15-sweeping-social-media-ban-cellphone-restrictions-next-year",
      "published": "Wed, 31 Dec 2025 22:51:05 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "China launches largest military drills off Taiwan in 8 months with live-fire exercises caught on camera",
      "description": "China launches biggest military encirclement of Taiwan in 8 months with live-fire drills, rockets and warships in massive 'Justice Mission 2025' exercise.",
      "url": "https://www.foxnews.com/world/china-launches-largest-military-drills-taiwan-8-months-live-fire-exercises-caught-camera",
      "published": "Tue, 30 Dec 2025 17:50:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "U.S. announces more military actions against ISIS: 'We will not relent'",
      "description": "CENTCOM declared that the U.S. and partner forces in Syria killed and captured ISIS figures in the time since a December 19 strike in Syria.",
      "url": "https://www.foxnews.com/world/u-s-announces-more-military-actions-against-isis-we-not-relent",
      "published": "Tue, 30 Dec 2025 10:17:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Indonesia floods leave families fighting to survive",
      "description": "More than a month after floods hit Indonesia, survivors are still living in ruins and desperately trying to get by.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/1/indonesia-floods-leave-families-fighting-to-survive?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 13:12:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "France plans social media ban for children under 15: reports",
      "description": "After Australia's world-first social-media ban for minors, France has drafted a similar law to block under-15s from major platforms, which could take effect from September.",
      "url": "https://www.dw.com/en/france-plans-social-media-ban-for-children-under-15-reports/a-75352145?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 18:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Another child dies in extreme conditions in Gaza: UNICEF",
      "description": "A sixth child has died in Gaza this month as the enclave’s people continue to endure dire living conditions linked to freezing rains and the Israel-Hamas war, the UN Children’s Fund (UNICEF) has announced. The development comes as aid agencies urged Israeli authorities to reconsider revoking the licences of dozens of humanitarian partners that provide assistance across the devastated enclave from 1 January.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166686",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Unseen Walmart video shows Bryan Kohberger acting differently after Idaho student murders",
      "description": "New video reveals Bryan Kohberger made 13 Walmart trips during Idaho semester, with suspicious behavior changes after November 2022 student massacre.",
      "url": "https://www.foxnews.com/us/unseen-walmart-video-shows-bryan-kohberger-acting-differently-after-idaho-student-murders",
      "published": "Wed, 31 Dec 2025 10:09:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UK PM Starmer–praised Egyptian extremist faces counter-terror probe over resurfaced tweets",
      "description": "U.K. counterterrorism police assess controversial social media posts by Egyptian-British activist after his return to Britain sparked political backlash.",
      "url": "https://www.foxnews.com/world/uk-pm-starmer-praised-egyptian-extremist-faces-counter-terror-probe-over-resurfaced-tweets",
      "published": "Tue, 30 Dec 2025 17:48:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Why flu cases are surging this season. And, protests erupt in Iran over the economy",
      "description": "The flu is spreading rapidly across the U.S. this season, and it is expected to get worse. And, protests have erupted across Iran over the country's troubled economy.",
      "url": "https://www.npr.org/2025/12/31/g-s1-104088/up-first-newsletter-flu-cases-surge-venezuela-iran-protests",
      "published": "Wed, 31 Dec 2025 07:30:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Togo releases Frenchman detained since June over anti-government protests",
      "description": "A French national detained in Togo last year over his alleged involvement in anti-government protests returned to France on Thursday after his release, the French foreign ministry said. The prosecutor's office in Lome said Steeve Rouyar was one of around 50 protesters arrested on June 6 during a demonstration.",
      "url": "https://www.france24.com/en/africa/20260101-togo-releases-frenchman-detained-since-june-over-anti-government-protests",
      "published": "Thu, 01 Jan 2026 14:52:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Finland seizes ship from Russia",
      "description": "Finnish police have detained a cargo ship named the Fitburg on suspicion of sabotaging an undersea telecommunications cable linking Helsinki and the Estonian capital, with authorities saying the vessel had been traveling from Russia’s port of St. Petersburg to Israel, in a region already on high alert after repeated incidents, as the eight NATO countries bordering the Baltic Sea respond to a series of disruptions involving seabed power cables and gas pipelines. Charlotte Hughes has the details.",
      "url": "https://www.france24.com/en/video/20260101-finland-seizes-ship-from-russia",
      "published": "Thu, 01 Jan 2026 10:14:32 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "British nationals involved in Machu Picchu train crash",
      "description": "British nationals have been involved in a train collision near Machu Picchu in Peru, the Foreign Office said.",
      "url": "https://news.sky.com/story/two-trains-carrying-tourists-to-machu-picchu-crash-as-one-person-killed-13488953",
      "published": "Tue, 30 Dec 2025 23:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Sudan: UN warns of unprecedented child hunger in Darfur as fighting fuels refugee exodus",
      "description": "Sudan’s deepening war is driving unprecedented levels of hunger, child malnutrition and displacement, UN agencies report, as new data from Darfur and a renewed refugee influx into Chad underscore the rapidly deteriorating situation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166682",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Gaza battered by heavy rains as humanitarian response continues",
      "description": "Severe weather conditions have led to further casualties and heightened health risks in Gaza over the past 24 hours, the UN aid coordination office (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166680",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Girl begged for help months before alleged killing by father, girlfriend — earlier abuse case closed: report",
      "description": "Newly released police records reveal 10-year-old Rebekah Baptiste pleaded for help months before allegedly being killed by her father and girlfriend.",
      "url": "https://www.foxnews.com/us/girl-begged-help-months-before-alleged-killing-father-girlfriend-earlier-abuse-case-closed-report",
      "published": "Wed, 31 Dec 2025 12:13:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine updates: Zelenskyy says Russia fired 200 drones overnight",
      "description": "President Zelenskyy says Russia's strikes show the urgent need for air defense in Ukraine. Meanwhile, the Kremlin blames Kyiv for a deadly drone strike on a hotel in the occupied Kherson region. Follow DW for more.",
      "url": "https://www.dw.com/en/ukraine-updates-zelenskyy-says-russia-fired-200-drones-overnight/live-75360544?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 13:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Taiwan president vows to defend sovereignty after China drills",
      "description": "President Lai Ching-te said the world is ⁠watching to see ‍whether the Taiwanese people possess the resolve to defend themselves. Meanwhile, Beijing said the eventual annexation of Taiwan is \"unstoppable.\"",
      "url": "https://www.dw.com/en/taiwan-president-vows-to-defend-sovereignty-after-china-drills/a-75355978?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 05:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World welcomes 2026, from Australia to New Zealand",
      "description": "Tour around the globe to see some of the most spectacular celebrations, from Australia and New Zealand across Asia and through Europe, as the world rings in the New Year 2026. Ellen Gainsford tells us more.",
      "url": "https://www.france24.com/en/video/20260101-world-welcomes-2026-from-australia-to-new-zealand",
      "published": "Thu, 01 Jan 2026 09:37:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "New Year's Eve across the world - in pictures",
      "description": "All the world's countries have now welcomed in 2026.",
      "url": "https://news.sky.com/story/new-years-eve-across-the-world-in-pictures-13489183",
      "published": "Thu, 01 Jan 2026 07:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "China’s Xi hails nation's technological progress, renews Taiwan promise",
      "description": "Chinese President Xi Jinping has hailed his country’s technological progress in areas such as artificial intelligence and semiconductors",
      "url": "https://abcnews.go.com/International/wireStory/chinas-xi-hails-nations-technological-progress-renews-promise-128803644",
      "published": "Wed, 31 Dec 2025 08:57:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "China’s ‘condom tax’ sparks backlash as Beijing struggles to reverse population collapse",
      "description": "China introduced a 13% tax on contraceptives while exempting childcare services as the global superpower battles sustained population decline and aging demographics.",
      "url": "https://www.foxnews.com/world/chinas-condom-tax-sparks-backlash-beijing-struggles-reverse-population-collapse",
      "published": "Wed, 31 Dec 2025 21:39:21 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "ISIS exploiting Syria’s chaos as US strikes expose growing threat",
      "description": "Despite years of defeat claims, ISIS adapts and persists in Syria's chaos, prompting major U.S. military response and raising containment questions.",
      "url": "https://www.foxnews.com/world/isis-exploiting-syrias-chaos-us-strikes-expose-growing-threat",
      "published": "Wed, 31 Dec 2025 06:00:48 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Bulgaria joins the euro after rocky path to new currency",
      "description": "The move is dividing the nation - some welcome it as a bold leap forwards, but others fear it will lead to economic stagnation.",
      "url": "https://www.bbc.com/news/articles/crlere3x28lo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 22:05:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Teen who died after falling 150 metres from California's Mt Baldy identified",
      "description": "Marcus Alexander Muench Casanova, 19, who fatally fell 500 feet (150m) from a trail, was an \"avid sailor and outdoorsman\", his family says.",
      "url": "https://www.bbc.com/news/articles/crrnlw4rxeyo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 00:40:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Passenger describes 'chaos' after head-on Machu Picchu train collision",
      "description": "Tourist Niels Honkoop says shattered glass littered the carriage floor and injured people were lying in the aisles.",
      "url": "https://www.bbc.com/news/articles/c4gweww8rjro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 16:42:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Bangladesh mourns death of first female Prime Minister Khaleda Zia",
      "description": "Bangladesh is mourning the death of its first female Prime Minister, Khaleda Zia, who died Tuesday.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5661552/bangladesh-mourns-death-of-first-female-prime-minister-khaleda-zia",
      "published": "Wed, 31 Dec 2025 04:47:05 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: Merz says 2026 can be a 'year of new beginnings'",
      "description": "Chancellor Friedrich Merz touched on war in Ukraine, increased defense spending, changing ties to the US, technological upheaval, industrial stagnation, sluggish reforms, migration and more in his New Year's address.",
      "url": "https://www.dw.com/en/germany-merz-says-2026-can-be-a-year-of-new-beginnings/a-75344460?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 19:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Women get drunk faster than men due to biology not tolerance",
      "description": "At the same table, with the same drinks, women often get drunk faster than men — and alcohol can affect women's brains differently, making its effects stronger, sometimes more rewarding. But also more addictive.",
      "url": "https://www.dw.com/en/women-get-drunk-faster-than-men-due-to-biology-not-tolerance/a-75223854?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 17:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Latest deep-sea search for missing Malaysia Airlines Flight 370 gets underway",
      "description": "A deep-sea search for Malaysia Airlines Flight 370 has begun in the Indian Ocean, reviving efforts to solve one of aviation’s greatest mysteries",
      "url": "https://abcnews.go.com/International/wireStory/latest-deep-sea-search-missing-malaysia-airlines-flight-128801273",
      "published": "Wed, 31 Dec 2025 08:37:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Queen Camilla recalls assault in 1960s as she campaigns against domestic violence",
      "description": "Britain’s Queen Camilla has spoken publicly for the first time about her personal experience of indecent assault",
      "url": "https://abcnews.go.com/International/wireStory/uks-queen-camilla-recalls-assault-1960s-campaigns-domestic-128803866",
      "published": "Thu, 01 Jan 2026 08:44:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pakistan's polio cases fell by half in 2025 despite attacks on vaccination teams",
      "description": "Officials say Pakistan has seen polio cases fall by more than half in 2025",
      "url": "https://abcnews.go.com/International/wireStory/pakistans-polio-cases-fell-half-2025-despite-attacks-128799396",
      "published": "Wed, 31 Dec 2025 04:09:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russian drone attack on Ukraine's Odesa injures 6, including children",
      "description": "A Russian drone attack hit apartment buildings and the power grid in Odesa, Ukraine, injuring six people, including children",
      "url": "https://abcnews.go.com/International/wireStory/russian-drones-blast-ukraines-odesa-injure-6-including-128800255",
      "published": "Wed, 31 Dec 2025 08:57:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "San Antonio teen who vanished Christmas Eve found dead by suicide in nearby field after days-long search",
      "description": "Authorities confirmed missing San Antonio teen Camila Mendoza Olmos, 19, who vanished Christmas Eve, died by suicide after her body was found near her house.",
      "url": "https://www.foxnews.com/us/san-antonio-teen-vanished-christmas-eve-found-dead-suicide-nearby-field-days-long-search",
      "published": "Wed, 31 Dec 2025 17:51:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ex-police officer given prison time in case prosecuted under Soros DA sees conviction overturned a year later",
      "description": "A court has overturned the conviction of a former Austin Police Officer Christopher Taylor, acquitting him of all charges in connection to a 2019 shooting.",
      "url": "https://www.foxnews.com/us/ex-police-officer-given-prison-time-case-prosecuted-soros-da-conviction-overturned-year-later",
      "published": "Wed, 31 Dec 2025 15:07:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Texas sheriff 'strongly' believes remains found belong to missing teen Camila Mendoza Olmos",
      "description": "Texas sheriff believes remains found in field belong to missing teen Camila Mendoza Olmos, who vanished from hone on Christmas Eve near San Antonio.",
      "url": "https://www.foxnews.com/us/texas-sheriff-strongly-believes-remains-found-belong-missing-teen-camila-mendoza-olmos",
      "published": "Wed, 31 Dec 2025 13:36:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Body found during search for missing Texas teen as another girl disappears and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/body-found-during-search-missing-texas-teen-another-girl-disappears-more-top-headlines",
      "published": "Wed, 31 Dec 2025 07:07:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Putin vows victory in Ukraine in New Year’s address amid Trump-backed peace talks",
      "description": "Russian President Vladimir Putin's defiant New Year's message contrasts sharply with President Donald Trump's diplomatic push as Ukraine-Russia war approaches fourth year.",
      "url": "https://www.foxnews.com/world/putin-vows-victory-ukraine-new-years-address-amid-trump-backed-peace-talks",
      "published": "Wed, 31 Dec 2025 13:18:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Putin residence drone attack dismissed as implausible as Ukraine accusations mount",
      "description": "Russian President Vladimir Putin's residence allegedly targeted by Ukrainian drones, but drone expert Cameron Chell says the claims lack credibility due to tactical impossibilities.",
      "url": "https://www.foxnews.com/world/putin-residence-drone-attack-dismissed-hard-fathom-ukraine-accusations-mount",
      "published": "Tue, 30 Dec 2025 21:59:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "BBC reports from the scene of Swiss resort bar fire",
      "description": "Dozens of people are believed to have died after a fire broke out during New Year's Eve celebrations.",
      "url": "https://www.bbc.com/news/videos/cq84xxxk840o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 09:24:11 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "In India, youths are quiet as Gen Z protests rock South Asia",
      "description": "Gen Z protests have shaken Sri Lanka, Bangladesh and Nepal in recent years — but not India. Why? In a Delhi coffee-house chat with DW, young Indians debate power, politics and the future.",
      "url": "https://www.dw.com/en/in-india-youths-are-quiet-as-gen-z-protests-rock-south-asia/a-75349517?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 14:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Zohran Mamdani becomes New York City mayor",
      "description": "Zohran Mamdani became mayor of New York City just after midnight on Thursday, marking a historic moment with a low-key swearing-in ceremony held deep beneath Manhattan. The Democrat, who at 34 is the city’s youngest mayor in generations, takes office as one of the most closely watched political figures in the United States. Ellen Gainsford reports.",
      "url": "https://www.france24.com/en/video/20260101-zohran-mamdani-becomes-new-york-city-mayor",
      "published": "Thu, 01 Jan 2026 13:28:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea’s junta chief elected president after opposition boycott",
      "description": "Mamady Doumbouya reneged on promise not to stand and hand west African country back to civilian rule The head of Guinea’s junta, Mamady Doumbouya, who had pledged not to run for office after seizing power four years ago, has been elected president after the country’s electoral commission said he had secured a sweeping majority of the vote. Doumbouya, 41, faced eight rivals for the presidency but the main opposition leaders were barred from running and had urged a boycott of the vote held over the weekend. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/guinea-junta-chief-mamady-doumbouya-elected-president-after-opposition-boycott",
      "published": "Wed, 31 Dec 2025 07:54:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Italy makes tiny tweak to its anthem, deleting just one word",
      "description": "Italy has quietly made a small change to its national anthem, removing a single word.",
      "url": "https://www.npr.org/2026/01/01/nx-s1-5655913/italy-makes-tiny-tweak-to-its-anthem-deleting-just-one-word",
      "published": "Thu, 01 Jan 2026 04:50:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about 2026 European Capitals of Culture",
      "description": "This year, Oulu, Finland, and Trencin, Slovakia, will become Europe's cultural flagships. Learn more about how Europe's Capitals of Culture program brings lasting change to cities.",
      "url": "https://www.dw.com/en/what-to-know-about-2026-european-capitals-of-culture/a-75164544?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 08:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Top Paris exhibits of 2026 – from Matisse and Renoir to Martin Parr",
      "description": "The coming year brings a host of new exhibitions to the French capital, including blockbuster shows from modern masters Matisse and Renoir, to photographer Martin Parr’s witty observations on environmental destruction, and an exploration of the history of video game music.",
      "url": "https://www.france24.com/en/culture/20260101-top-paris-exhibits-in-2026-%E2%80%93-from-matisse-and-renoir-to-martin-parr",
      "published": "Thu, 01 Jan 2026 15:44:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mali and Burkina Faso impose retaliatory travel ban on US nationals",
      "description": "Mali and Burkina Faso have banned U.S. citizens from entering their countries",
      "url": "https://abcnews.go.com/International/wireStory/mali-burkina-faso-impose-retaliatory-travel-ban-us-128795911",
      "published": "Tue, 30 Dec 2025 22:15:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Authorities investigating damage to undersea telecom cable in Gulf of Finland",
      "description": "Authorities are investigating damage to an undersea telecommunications cable in the Gulf of Finland that occurred between the capitals of Finland and Estonia",
      "url": "https://abcnews.go.com/International/wireStory/authorities-investigating-damage-undersea-telecom-cable-gulf-finland-128801568",
      "published": "Wed, 31 Dec 2025 07:43:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela arrests more Americans as Trump ramps up pressure on Maduro: report",
      "description": "Secretary of State Marco Rubio confirmed 10 Americans were freed from Venezuela in a July prisoner swap. President Donald Trump sent an envoy to Caracas.",
      "url": "https://www.foxnews.com/world/venezuela-arrests-more-americans-trump-ramps-pressure-maduro-report",
      "published": "Wed, 31 Dec 2025 16:55:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "What we know about the Switzerland ski resort fire",
      "description": "Several dozen people are presumed to have died in the fire at a New Year party in the resort of Crans-Montana.",
      "url": "https://www.bbc.com/news/articles/c9dvyyjyj18o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 15:50:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Who are the Palestine Action hunger strikers?",
      "description": "Four activists from the proscribed Palestine Action group in the UK are still on hunger strikes in prison.",
      "url": "https://www.aljazeera.com/news/2026/1/1/who-are-the-palestine-action-hunger-strikers?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 13:25:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Search for survivors after US military strike on alleged drug convoy",
      "description": "The US says a search is underway for survivors after it bombed what it said was a suspected drug trafficking convoy.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/1/search-for-survivors-after-us-military-strike-on-alleged-drug-convoy?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 09:25:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US ‘adapt, shrink or die’ terms for $2bn aid pot will mean UN bowing down to Washington, say experts",
      "description": "Afghanistan and Yemen excluded from list of 17 priority countries chosen by Trump administration to receive aid laden with demands The $2bn (£1.5bn) of aid the US pledged this week may have been hailed as “bold and ambitious” by the UN but could be the “nail in the coffin” in changing to a shrunken, less flexible aid system dominated by Washington’s political priorities, aid experts fear. After a year of deep cuts in aid budgets by the US and European countries, the announcement of new money for the humanitarian system is a source of some relief, but experts are deeply concerned about demands that the US has imposed on how the money should be managed and where it can go. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/01/us-aid-cuts-conditions-un-humanitarian-pledge-ocha",
      "published": "Thu, 01 Jan 2026 13:00:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US struck ‘big facility’ in Venezuela, Trump claimed without offering details",
      "description": "Trump alleged that US forces hit ‘very hard’ in what would mark his team’s first land strike on Venezuela if confirmed Donald Trump has claimed that US forces struck a “big facility” in Venezuela last week – but the president did not specify what it was, or where, and the White House has not commented further. “We just knocked out – I don’t know if you read or you saw – they have a big plant, or a big facility, where the ships come from. Two nights ago, we knocked that out. So we hit them very hard,” Trump told Republican donor and New York supermarket owner John Catsimatidis on Friday. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/29/trump-venezuela-facility-strike",
      "published": "Mon, 29 Dec 2025 17:30:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Several tens' presumed dead after deadly fire ravages Swiss resort bar's New Year celebration",
      "description": "No description available.",
      "url": "https://www.france24.com/en/live-news/20260101-deadly-fire-ravages-new-year-celebration-in-bar-at-luxury-swiss-ski-resort",
      "published": "Thu, 01 Jan 2026 09:49:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Major fire breaks out in historic church in Amsterdam",
      "description": "In Amsterdam, during New Years celebrations a large fire broke out in a historic church. Much like the Notre Dame cathedral in Paris, the Dutch church had a wooden structure, making fighting the fire that much more difficult. Solange Mougin has more.",
      "url": "https://www.france24.com/en/video/20260101-major-fire-breaks-out-in-historic-church-in-amsterdam",
      "published": "Thu, 01 Jan 2026 09:42:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Witness saw people 'walking on top of others' as they tried to escape fire in packed bar",
      "description": "A man who witnessed a bar fire in Switzerland has told Sky News he saw patrons walking over people as they tried to escape the packed venue.",
      "url": "https://news.sky.com/story/witness-saw-people-walking-on-top-of-others-as-they-tried-to-escape-packed-bar-during-fire-13489268",
      "published": "Thu, 01 Jan 2026 12:49:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Dead birds on Florida beaches have experts worried about avian flu",
      "description": "Dead birds along Florida's Space Coast spark fears of a possible avian flu outbreak. Samples were sent for testing as wildlife officials monitor the situation.",
      "url": "https://www.foxnews.com/us/dead-birds-florida-beaches-have-experts-worried-about-avian-flu",
      "published": "Wed, 31 Dec 2025 14:20:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Dozens feared dead in fire at Swiss Alps bar during New Year’s celebrations",
      "description": "An explosive fire broke out during a New Year’s Eve celebration at a crowded bar in the Swiss Alps, killing multiple people and injuring others, according to Swiss police.",
      "url": "https://www.foxnews.com/world/explosive-fire-kills-multiple-people-swiss-alps-bar-during-new-years-celebrations",
      "published": "Thu, 01 Jan 2026 03:54:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "UAE won’t lose “influence in Yemen” after withdrawal",
      "description": "Luciano Zaccara on the UAE’s decision to withdraw its forces from Yemen, which could alter its regional influence.",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/1/uae-wont-lose-influence-in-yemen-after-withdrawal?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 10:36:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "NewJeans member Danielle sued for millions after bitter feud with K-pop record label",
      "description": "Ador terminated the Australian-born singer’s contract on Monday and is now suing her, a family member and the band’s former producer The K-pop record label Ador is suing a former member of megaband NewJeans for millions in damages, it has announced, a day after removing her from the group following a year-long dispute that saw the band allege mistreatment and attempt to leave their contract. The compensation suit against Danielle Marsh, a 20-year-old Australian-born singer, comes months after a Seoul district court ruled that NewJeans’ five members must honour their contracts with Ador, whose parent company Hybe is also behind the K-pop sensation BTS. The band’s contract runs until 2029. Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/01/newjeans-member-danielle-sued-for-millions-after-bitter-feud-with-k-pop-record-label",
      "published": "Thu, 01 Jan 2026 06:19:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Former U.S. ambassador to China discusses the relationship between the two countries",
      "description": "NPR's A Martinez speaks to Nicholas Burns, former U.S. ambassador to China, about the current state of relations between the U.S. and China.",
      "url": "https://www.npr.org/2026/01/01/nx-s1-5660938/former-u-s-ambassador-to-china-discusses-the-relationship-between-the-two-countries",
      "published": "Thu, 01 Jan 2026 04:51:16 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany facing many domestic challenges in 2026",
      "description": "Pensions, migration and conscription will continue to dominate domestic politics in Germany this year. Above all, the focus will be on how the far-right AfD fares in upcoming state elections in the former East Germany.",
      "url": "https://www.dw.com/en/germany-facing-many-domestic-challenges-in-2026/a-75115805?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 07:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Results expected 5 January after landmark elections in Central African Republic",
      "description": "Voting proceeded largely as planned in the Central African Republic’s first-ever combined presidential, legislative, regional and municipal elections, and ballot counting is now complete, the UN peacekeeping mission (MINUSCA) said on Wednesday, with results expected to be announced on 5 January.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166688",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2026-01-01T16:28:30.119307Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "University of Alabama student suffers 'severe head injury' while on family vacation in Caribbean",
      "description": "University of Alabama student Matthew Polaski reportedly suffered multiple skull fractures after falling during a family vacation in the Dominican Republic.",
      "url": "https://www.foxnews.com/world/university-alabama-student-suffers-severe-head-injury-while-family-vacation-caribbean",
      "published": "Thu, 01 Jan 2026 10:12:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Two African nations ban American citizens in diplomatic tit-for-tat following Trump admin move",
      "description": "Two West African nations issue travel bans on American citizens in retaliatory diplomatic move, following expansion of Trump administration travel restrictions list.",
      "url": "https://www.foxnews.com/world/two-african-nations-ban-american-citizens-diplomatic-tit-for-tat-following-trump-admin-move",
      "published": "Wed, 31 Dec 2025 05:18:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar to resume services to and from London after 'major disruption' in Channel Tunnel forced cancellations",
      "description": "Eurostar suspends all London services due to major power supply issues in Channel Tunnel and failed LeShuttle train, forcing passengers to rebook journeys.",
      "url": "https://www.foxnews.com/world/eurostar-forced-cancel-all-services-from-london-after-major-disruption-channel-tunnel",
      "published": "Tue, 30 Dec 2025 10:25:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "New discovery may challenge theory Vikings built first Irish towns - researcher",
      "description": "Dr Dirk Brandherm and his colleagues have identified more than 600 suspected house platforms in the Brusselstown Ring.",
      "url": "https://www.bbc.com/news/articles/clyw59v8978o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 13:58:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "UK says small boat migrant arrivals approached record levels in 2025",
      "description": "The number of migrants reaching the UK in small boats in 2025 climbed to its second-highest level since records began, official figures showed on Thursday, piling pressure on Prime Minister Keir Starmer as anti-immigration sentiments gain ground ahead of key local elections in May.",
      "url": "https://www.france24.com/en/europe/20260101-uk-says-small-boat-migrant-arrivals-approached-record-levels-2025",
      "published": "Thu, 01 Jan 2026 13:58:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Zohran Mamdani sworn in as New York City mayor",
      "description": "Zohran Mamdani has officially taken office as New York City’s mayor after a surprise victory last year in which the 34-year-old Democratic Socialist defeated former governor Andrew Cuomo, making history as the first Muslim and first Asian American to lead the nation’s largest city. Dean of the Finance department at INSEEC Business School, Ellen Kountz, shares her insights.",
      "url": "https://www.france24.com/en/video/20260101-zohran-mamdani-sworn-in-as-new-york-city-mayor",
      "published": "Thu, 01 Jan 2026 09:30:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Pope asks that Rome welcome foreigners as he closes out 2025",
      "description": "Pope Leo XIV has closed out 2025 with a prayer that the city of Rome might be a welcoming place for foreigners and fragile people young and old",
      "url": "https://abcnews.go.com/International/wireStory/pope-asks-rome-foreigners-closes-2025-128810683",
      "published": "Wed, 31 Dec 2025 12:26:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Zelensky says peace deal is 90% ready in New Year address",
      "description": "Russian President Vladimir Putin used his New Year speech to tell troops that he \"believed in you and our victory\" in Ukraine.",
      "url": "https://www.bbc.com/news/articles/cddg7100ym2o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 05:22:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Stranger Things draws to an epic and emotional close",
      "description": "Fans gathered at premieres in cities across the US and Canada to watch the finale on the big screen.",
      "url": "https://www.bbc.com/news/articles/ckgl2je05j0o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 10:13:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil legend Roberto Carlos recovering in hospital",
      "description": "Brazil and Real Madrid legend Roberto Carlos is \"recovering well\" after undergoing what he describes as \"a preventative medical procedure\".",
      "url": "https://www.bbc.com/sport/football/articles/cqxyrj9dv5go?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 08:12:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Condom tax and cheaper childcare: China's plan to boost birth rates",
      "description": "Chinese people pay a 13% sales tax on contraceptives from 1 January, while childcare services are exempt.",
      "url": "https://www.bbc.com/news/articles/czxpk7r8w9yo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 23:07:11 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Disney worker hurt stopping 180-kg fake boulder from hitting audience",
      "description": "The worker is \"recovering\" after he was seen on video being knocked off his feet by the 400-lb (180kg) rubber Indiana Jones prop.",
      "url": "https://www.bbc.com/news/articles/cn8jlm07nz4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 01:49:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Social media fuelled Mamdani's rise. Can he keep the momentum as New York mayor?",
      "description": "To succeed in office he will need to keep his supporters engaged with day-to-day governing, experts say.",
      "url": "https://www.bbc.com/news/articles/c4gvg46dy7vo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 01 Jan 2026 13:57:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somali president: Israel deal with Somaliland tied to hosting Palestinians",
      "description": "Somalia’s president says Somaliland has agreed to accept displaced Palestinians in exchange of Israel's recognition.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/1/somali-president-israel-deal-with-somaliland-tied-to-hosting-palestinians?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 15:07:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Enzo Maresca leaves Chelsea after just 18 months as manager",
      "description": "Maresca exits the club midway through a turbulent season with the team winning just one Premier League game in December.",
      "url": "https://www.aljazeera.com/sports/2026/1/1/chelsea-part-ways-with-manager-maresca?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 14:00:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bulgaria adopts euro amid celebration and anxiety over inflation",
      "description": "Move comes nearly two decades after it entered the EU as hope for stability clashes with fear of rising prices.",
      "url": "https://www.aljazeera.com/economy/2026/1/1/bulgaria-adopts-euro-amid-celebration-and-anxiety-over-inflation?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 13:33:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ICE operations and their impact on US residents",
      "description": "ICE operations and their impact on US residents",
      "url": "https://www.aljazeera.com/video/centre-stage/2026/1/1/ice-operations-and-their-impact-on-us-residents?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 13:21:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somaliland denies agreeing to host Israeli bases, resettle Palestinians",
      "description": "Breakaway region dismisses Somalia's allegations as attempt to undermine diplomatic progress.",
      "url": "https://www.aljazeera.com/news/2026/1/1/somaliland-denies-agreeing-to-host-israeli-bases-resettle-palestinians?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 12:57:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel’s new rules for non-profits violate “duty of care”",
      "description": "“They're [Israel] asking us to accept political and ideological conditions that are unrelated to our humanitarian work.”",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/1/israels-new-rules-for-non-profits-violate-duty-of?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 12:09:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Who is playing in the round of 16? All to know",
      "description": "As the Africa Cup of Nations enters the knockout phase, Al Jazeera previews the last-16 matchups in Morocco.",
      "url": "https://www.aljazeera.com/sports/2026/1/1/afcon-2025-who-is-playing-in-the-round-of-16-preview-nigeria-algeria-senegal-egypt?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 12:03:54 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel looking to reopen Rafah crossing after US pressure: Israeli media",
      "description": "Israel currently occupies the Palestinian side of the crossing, choking Gaza of a vital humanitarian entry point.",
      "url": "https://www.aljazeera.com/news/2026/1/1/israel-looking-to-reopen-rafah-crossing-after-us-pressure-israeli-media?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 11:11:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Can Syria’s new banknotes help rebuild the economy?",
      "description": "Can Syria’s new banknotes rebuild the economy?",
      "url": "https://www.aljazeera.com/video/money-works/2026/1/1/can-syrias-new-banknotes-help-rebuild-the-economy?traffic_source=rss",
      "published": "Thu, 01 Jan 2026 10:23:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "More than 3,000 migrants died trying to reach Spain in 2025",
      "description": "Tighter border controls caused arrivals to decline sharply but forced people on to more dangerous routes, activists say More than 3,000 people died trying to reach Spain by sea over the past year, a sharp fall from the previous 12 months. However, activists cautioned that the drop reflected tighter border controls that have forced migrants to take increasingly dangerous routes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/more-than-3000-migrants-died-spain-figure-down",
      "published": "Mon, 29 Dec 2025 17:31:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jair Bolsonaro undergoes second procedure to treat persistent hiccups",
      "description": "Former Brazilian president underwent a phrenic nerve block while temporarily released from prison for surgery Jair Bolsonaro underwent a second “phrenic nerve block procedure” on Monday to treat persistent hiccups. The treatment went well and the former Brazilian president’s condition is stable, according to his medical team. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/brazil-ex-president-jair-bolsonaro-hiccups-treatment",
      "published": "Mon, 29 Dec 2025 22:07:50 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Xi Jinping vows to reunify China and Taiwan in New Year’s Eve speech",
      "description": "Reunification ‘is unstoppable’, says Chinese president, a day after the conclusion of intense military drills China’s president, Xi Jinping, has vowed to reunify China and Taiwan in his annual New Year’s Eve speech in Beijing. Speaking the day after the conclusion of intense Chinese military drills around Taiwan, Xi said: “The reunification of our motherland, a trend of the times, is unstoppable.” Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/xi-jinping-vows-reunification-china-taiwan-new-years-eve-speech",
      "published": "Wed, 31 Dec 2025 13:47:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China forecast to have sold one in every 10 new cars in UK in 2025",
      "description": "Carmakers such as MG, BYD and Chery are set to pass 200,000 mark in sales, analysis suggests, double 2024’s total Chinese brands are on course to account for one in every 10 new cars sold in Britain during 2025, a marked increase on last year as sales increase across Europe. Manufacturers led by MG, BYD, and Chery are on track to break the 200,000 mark in UK new car sales in 2025, meaning they are very likely to account for 10% of the market, according to Matthias Schmidt, an analyst tracking electric cars across Europe. Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/31/china-forecast-to-have-sold-one-in-every-10-new-cars-in-uk-in-2025",
      "published": "Wed, 31 Dec 2025 09:42:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "​Two cubicles, 73 women, one long queue: Japan’s female MPs fight for more loos",
      "description": "PM Sanae Takaichi joins petition asking for better facilities for women to match improved representation Nearly 60 female lawmakers in Japan, including the prime minister, Sanae Takaichi, have submitted a petition calling for more toilets in the parliament building for women to match their improved representation. Japanese politics remains hugely male-dominated, although the number of women in the parliament rose at the last election – and Takaichi became the first female prime minister in October. This is reflected by there being only one lavatory containing two cubicles for the lower house’s 73 women to use near the Diet’s main plenary session hall in central Tokyo. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/female-lawmakers-in-japan-lobby-for-more-toilets-in-parliament",
      "published": "Wed, 31 Dec 2025 08:29:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian beef industry ‘extremely disappointed’ after China hits imports with 55% tariff",
      "description": "Levy on beef exceeding quotas to begin immediately as Beijing seeks to protect domestic industry Get our breaking news email , free app or daily news podcast Australian beef producers said they were “extremely disappointed” after China announced a 55% tariff on imports that exceed quota levels in a move to protect a domestic cattle industry slowly emerging from oversupply. China’s commerce ministry said on Wednesday the total import quota for 2026 for Australia and other countries such as Brazil and the US covered under its new “safeguard measures” is 2.7m metric tons, roughly in line with the record 2.87m tons it imported overall in 2024. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/australian-beef-industry-extremely-disappointed-after-china-hits-imports-with-55-tariff",
      "published": "Thu, 01 Jan 2026 04:48:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 15 km NNW of Susanville, CA",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VII Time 2025-12-31 05:49:32 UTC 2025-12-31 05:49:32 UTC at epicenter Location 40.544°N 120.692°W Depth 5.32 km (3.31 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75288851",
      "published": "2026-01-01T16:26:55.026Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.2 - 36 km W of Puerto Santa, Peru",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-28 02:51:50 UTC 2025-12-28 02:51:50 UTC at epicenter Location 8.960°S 78.974°W Depth 66.41 km (41.27 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl57",
      "published": "2025-12-31T01:12:43.205Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.6 - 31 km ESE of Yilan, Taiwan",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-27 15:05:56 UTC 2025-12-27 15:05:56 UTC at epicenter Location 24.657°N 122.041°E Depth 67.53 km (41.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl2n",
      "published": "2025-12-30T03:24:14.885Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Out with the mayo: How Ukrainians reclaim holiday food",
      "description": "For many people from former Soviet countries, New Year's is a big holiday feast time. A Ukrainian restaurant in Washington gives NPR a taste of what's on the menu.",
      "url": "https://www.npr.org/2025/12/31/nx-s1-5660765/ukrainian-food-holidays",
      "published": "Wed, 31 Dec 2025 07:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea's Lee abandons hardline course on Pyongyang",
      "description": "With ties between the two Koreas at rock bottom, South Korea's Lee Jae Myung is advancing several initiatives aimed to build bridges with the Kim Jong Un regime — including one focusing on the martial art of taekwondo.",
      "url": "https://www.dw.com/en/south-korea-s-lee-abandons-hardline-course-on-pyongyang/a-75360538?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 13:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bulgaria joins Eurozone despite opposition",
      "description": "Bulgaria became the 21st member of the currency union, bringing the number of people using the single European currency to more than 350 million.",
      "url": "https://www.dw.com/en/bulgaria-joins-eurozone-despite-opposition/a-75359463?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 1 Jan 2026 10:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine updates: Kyiv says it struck Russia's oil facilities",
      "description": "According to officials in Kyiv, Ukrainian long-range drones struck an oil depot north of Moscow, as well as an oil refinery and an oil terminal in Russia's southern Krasnodar region.",
      "url": "https://www.dw.com/en/ukraine-updates-kyiv-says-it-struck-russia-s-oil-facilities/live-75346952?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 17:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A German tip for your New Year's resolutions",
      "description": "Starting off the year with ambitious plans to become a better person is a widespread Western tradition. What are the most popular resolutions in Germany? And here's how the German language can help you deal with yours.",
      "url": "https://www.dw.com/en/a-german-tip-for-your-new-year-s-resolutions/a-46737262?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 16:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Stranger things' ends after 10 years",
      "description": "Netflix has released the final episode of one of its biggest original hits, with the season five finale of Stranger Things going live on the platform at 1 a.m. GMT; the 1980s-set sci-fi adventure series has captured the cultural zeitgeist and become Netflix’s longest-running cash cow, as Carys Garland explores.",
      "url": "https://www.france24.com/en/video/20260101-stranger-things-ends-after-10-years",
      "published": "Thu, 01 Jan 2026 14:48:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Democratic socialist sworn in as New York mayor in old subway stop",
      "description": "New York's new mayor Zohran Mamdani has made history and been inaugurated in a disused subway station.",
      "url": "https://news.sky.com/story/democratic-socialist-zohran-mamdani-sworn-in-as-new-york-city-mayor-ahead-of-public-ceremony-13489259",
      "published": "Thu, 01 Jan 2026 12:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Millions are being 'slowly poisoned' - and pleas for change are being ignored",
      "description": "\"The air is absolutely poison, in the last two years we've not had even one single good a day in spite of the monsoon rain,\" says Bhavreen Kandhari, an activist spearheading a public movement on clean air.",
      "url": "https://news.sky.com/story/why-theres-no-escape-from-delhis-biggest-killer-13489079",
      "published": "Wed, 31 Dec 2025 16:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finland police seize vessel suspected of damaging Baltic Sea cable",
      "description": "Finnish police have seized a cargo vessel suspected of damaging an undersea cable.",
      "url": "https://news.sky.com/story/finland-police-seize-vessel-suspected-of-damaging-baltic-sea-cable-13489056",
      "published": "Wed, 31 Dec 2025 14:13:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Passenger describes being stranded on Eurostar train overnight - as disruption continues",
      "description": "Passengers have been stuck on a Eurostar train for hours overnight, after the train network was forced to cancel large parts of its London-Europe service on Tuesday.",
      "url": "https://news.sky.com/story/eurostar-passengers-brace-for-further-disruption-after-day-of-cancellations-13488920",
      "published": "Tue, 30 Dec 2025 22:39:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China announces it 'successfully completed' Taiwan military maneuvers",
      "description": "China’s People’s Liberation Army says it has “successfully completed” two days of military exercises in the waters off Taiwan",
      "url": "https://abcnews.go.com/International/wireStory/china-announces-successfully-completed-taiwan-military-maneuvers-128801777",
      "published": "Wed, 31 Dec 2025 08:17:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Taiwan’s president pledges to defend sovereignty after China’s military drills",
      "description": "Taiwan’s president pledges to defend sovereignty after China’s military drills",
      "url": "https://abcnews.go.com/International/wireStory/taiwans-president-pledges-defend-islands-sovereignty-after-chinas-128824066",
      "published": "Thu, 01 Jan 2026 04:09:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A Kenyan barber who wields a sharpened shovel thrives on Africa's social media craze",
      "description": "Safari Martins may be Kenya’s most famous barber",
      "url": "https://abcnews.go.com/International/wireStory/kenyan-barber-wields-sharpened-shovel-thrives-africas-social-128824623",
      "published": "Thu, 01 Jan 2026 02:46:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bulgaria is joining the euro. Here's what it means for consumers and businesses",
      "description": "Bulgaria is welcoming a new year and a new currency",
      "url": "https://abcnews.go.com/International/wireStory/bulgaria-joining-euro-means-consumers-businesses-128826242",
      "published": "Thu, 01 Jan 2026 05:41:17 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN chief condemns Israeli amendments targeting UNRWA operations",
      "description": "The UN Secretary-General has condemned amendments adopted by Israel’s Knesset to a law aimed at ceasing the operations of the UN agency assisting Palestine refugees (UNRWA), saying the measures must be immediately repealed.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166691",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "General Assembly approves $3.45 billion UN regular budget for 2026",
      "description": "The General Assembly has approved a $3.45 billion regular budget for the United Nations for 2026, following weeks of intensive negotiations and one of the Organization’s most important reform initiatives, UN80.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166685",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: General Assembly decides on 2026 UN budget",
      "description": "Follow our live coverage as the General Assembly and its Fifth Committee meet today to finalize negotiations and vote on the United Nations’ regular budget for 2026. The Fifth Committee is responsible for administrative and budgetary matters, including the Organization’s finances and staffing. UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166681",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Repeat offender truck driver charged with bank robbery after claiming C-4 explosives, firing on officers: feds",
      "description": "North Carolina truck driver allegedly robs bank claiming explosives, then engages in shootout with police after fleeing the scene in his semi-truck.",
      "url": "https://www.foxnews.com/us/repeat-offender-truck-driver-charged-bank-robbery-after-claiming-c-4-explosives-firing-officers-feds",
      "published": "Thu, 01 Jan 2026 09:00:02 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mangione, Robinson, Reiner and more: Major court cases set to dominate 2026",
      "description": "Court calendars packed with major criminal cases as accused murderers, including Luigi Mangione and Rex Heuermann, await their upcoming trial dates in 2026.",
      "url": "https://www.foxnews.com/us/mangione-robinson-reiner-more-major-court-cases-dominate-2026",
      "published": "Thu, 01 Jan 2026 06:00:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Deported illegal immigrant caught by GPS tracker pleads guilty to robbing 7 convenience stores in California",
      "description": "Previously deported man from El Salvador pleads guilty to armed robberies across eight California cities, facing up to 20 years per count in prison.",
      "url": "https://www.foxnews.com/us/deported-illegal-immigrant-caught-gps-tracker-pleads-guilty-robbing-7-convenience-stores-california",
      "published": "Wed, 31 Dec 2025 17:38:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Texas woman tries to flee to Mexico across Rio Grande with infant after human smuggling bust, authorities say",
      "description": "A Texas woman accused of human smuggling allegedly tried to flee across Rio Grande with infant after high-speed chase near the Mexico border.",
      "url": "https://www.foxnews.com/us/texas-woman-tries-flee-mexico-across-rio-grande-infant-after-human-smuggling-bust-authorities-say",
      "published": "Wed, 31 Dec 2025 13:49:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "40-year Harvard professor pens scathing piece on school's 'exclusion of white males,' anti-Western trends",
      "description": "Harvard professor leaves after 40 years, alleges woke policies destroyed academic standards and excellence in scathing \"Why I'm Leaving Harvard\" critique.",
      "url": "https://www.foxnews.com/us/40-year-harvard-professor-pens-scathing-piece-schools-exclusion-white-males-anti-western-trends",
      "published": "Wed, 31 Dec 2025 07:00:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Minnesota's new Medicaid fraud prevention fix won't make 'any difference,' former FBI agent says",
      "description": "Minnesota adds new Medicaid fraud verification after alleged $9B+ taxpayer losses since 2018, but former FBI agent says one layer won't stop fraud.",
      "url": "https://www.foxnews.com/us/minnesota-new-medicaid-fraud-prevention-fix-wont-make-any-difference-former-fbi-agent-says",
      "published": "Wed, 31 Dec 2025 06:00:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}