{
  "last_updated": "2026-01-07T01:49:50.726503Z",
  "event_count": 222,
  "events": [
    {
      "title": "Pakistan warns that Afghanistan is becoming 'hub for terrorists' and poses regional threat",
      "description": "Pakistan's military is warning that Afghanistan is becoming a “hub for terrorists.”",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-warns-afghanistan-becoming-hub-terrorists-poses-regional-128948682",
      "published": "Tue, 06 Jan 2026 11:21:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Security Council LIVE: ‘The power of the law must prevail’ amid Venezuela crisis, says Guterres",
      "description": "The Security Council met in emergency session in New York to address the US rendition of Venezuela’s President Nicolás Maduro from Caracas, a move that has sent shockwaves through the region and beyond. The UN chief António Guterres told ambassadors there must be respect for national sovereignty, “political independence and territorial integrity,” after warning on Saturday that the US had set a “dangerous precedent” for the world order. Follow the historic meeting live below from the UN Meetings Coverage team, and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166700",
      "published": "Mon, 05 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "6.2-magnitude earthquake jolts western Japan",
      "description": "The initial quake was followed by a sizable number of aftershocks. There was no tsunami warning issued and no immediate reports of injuries or major damage.",
      "url": "https://www.dw.com/en/6-2-magnitude-earthquake-jolts-western-japan/a-75401318?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 02:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "The rise and fall of Venezuela's Nicolás Maduro in photos",
      "description": "Nicolás Maduro rose from a unionized bus driver in Caracas to the presidency of Venezuela, inheriting power after the death of Hugo Chávez and consolidating it over a turbulent decade in office. Under his leadership, the nation spiraled into crisis, pushing millions into poverty and driving one of the world’s largest migration waves. International isolation and U.S.-led sanctions intensified as Maduro clung to power. ___ This is a photo gallery curated by AP photo editors.",
      "url": "https://abcnews.go.com/International/wireStory/rise-fall-venezuelas-nicols-maduro-photos-128880425",
      "published": "Sat, 03 Jan 2026 21:21:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s driver charged with dangerous driving after fatal crash in Nigeria",
      "description": "British boxer was injured in collision that killed his personal trainer Latif Ayodele and strength coach Sina Ghami Nigerian police have charged Anthony Joshua’s driver with causing death by dangerous driving after a fatal crash that killed two people. Adeniyi Mobolaji Kayode, 46, was also charged with driving without a valid driving licence and “driving without due care and attention, causing bodily harm and damage to property”. He is due to appear in court on 20 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/anthony-joshuas-driver-charged-with-dangerous-driving-after-fatal-crash-in-nigeria",
      "published": "Fri, 02 Jan 2026 17:54:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Drop draft proposals on death penalty for Palestinians, UN rights chief urges Israel",
      "description": "The UN’s top human rights official on Friday called on Israeli authorities to abandon plans for new legislation that would impose mandatory death sentences exclusively on Palestinians, warning the proposals violate international law and fundamental human rights standards.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166693",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Iran on the brink as protesters move to take two cities, appeal to Trump",
      "description": "Iranian security forces attack hospital in Ilam province and fire tear gas at wounded protesters as nationwide demonstrations escalate across multiple cities.",
      "url": "https://www.foxnews.com/world/iran-brink-protesters-move-take-two-cities-appeal-trump",
      "published": "Tue, 06 Jan 2026 20:17:48 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Venezuela crisis: UN aid effort continues amid political upheaval",
      "description": "Venezuela’s political shock has sharpened global attention on a country already facing one of the world’s largest humanitarian and displacement crises. For the United Nations, the priority remains unchanged: protecting lives, sustaining basic services and supporting Venezuelans at home and across the region.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166708",
      "published": "Tue, 06 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Australia news live: inflation falls to 3.4%; Sussan Ley clarifies claim about ‘far-left neo-Nazis’",
      "description": "Markets bet February interest rate rise is now less likely. Follow today’s news live Get our breaking news email , free app or daily news podcast Minister says many in flood-hit areas in Queensland ‘in shock’ after losses Kristy McBain , the federal minister for emergency management, said it would take some time to determinate the full impact of widespread flooding in parts of Queensland , noting for many primary producers, it will be the second time they’ve suffered losses after similar flooding in 2019 . You know, there are some significant losses, and I think the big concern is that we still don’t know the total number of losses because, at this stage, we’ve still got water flowing. And with the forecast looking like there’ll be further rain, those numbers could increase. So it’s quite precarious here. And obviously, speaking to a number of those producers, they’re quite in shock, I think. And they thought 2019 was kind of a once-in-a-lifetime event where there were a number of losses. And unfortunately, for a number of them, it looks like there’ll be similar losses or more. So that’s quite concerning. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/07/australia-news-live-heatwave-weather-bushfire-warning-anthony-albanese-antisemitism-bondi-royal-commission-inflation-abs-rba-interest-rates-ntwnfb",
      "published": "Wed, 07 Jan 2026 01:32:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Severe heatwave hits southern Australian states with firefighters warning many areas ‘ready to burn’",
      "description": "Melbourne and Adelaide swelter through extreme heat with temperatures above 40C in the South Australian capital Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Large parts of South Australia and Victoria are expecting extreme fire conditions today as a dangerous heatwave moves east, pushing temperatures well into the 40s. By midday on Wednesday the mercury had hit 37C in Melbourne and 41C in Adelaide. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/07/severe-heatwave-hits-southern-australian-states-with-firefighters-warning-many-areas-ready-to-burn",
      "published": "Wed, 07 Jan 2026 00:02:52 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Brown University shooter confessed in videos to planning attack for long time, showed no remorse: DOJ",
      "description": "Federal prosecutors release video transcripts allegedly recorded by Brown University gunman who killed 2 students, showing no remorse for shooting.",
      "url": "https://www.foxnews.com/us/brown-university-shooter-confessed-videos-planning-attack-long-time-showed-no-remorse-doj",
      "published": "Tue, 06 Jan 2026 18:15:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Trump says US companies will invest billions in Venezuelan oil production. Experts aren’t so sure",
      "description": "Industry insiders say US oil firms want to ‘avoid getting screwed’ and will proceed with extreme caution in region Analysis: Trump’s focus on Venezuelan oil reinforces claim action was never about ‘war on drugs’ Industry experts have expressed skepticism over Donald Trump ’s bullish prediction that US big oil firms will rapidly invest tens of billions of dollars to fix Venezuelan infrastructure and ramp up production after the rendition of the country’s president, Nicolás Maduro . Without an “iron-clad guarantee” that the US federal government will fully reimburse them for the cost of rebuilding the country’s oil market, analysts expect global energy giants to proceed with extreme caution. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/06/trump-oil-companies-venezuela",
      "published": "Tue, 06 Jan 2026 18:19:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protests: UN warns against further bloodshed",
      "description": "As protests in the Iranian capital, Tehran – sparked by increasing economic hardship and a cost-of-living crisis – continued for a ninth day, the UN Secretary-General said he was “deeply saddened by the reported loss of life and injuries,” resulting from clashes between security forces and protesters.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166705",
      "published": "Mon, 05 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Colombian President Petro threatens military response after Trump warns Colombia may be next target",
      "description": "Colombian President Gustavo Petro said Monday he would \"take up arms\" against the U.S. if it attacks his country. This after President Trump suggested Petro could be his next target.",
      "url": "https://www.foxnews.com/world/colombian-president-petro-threatens-military-response-after-trump-warns-colombia-may-next-target",
      "published": "Mon, 05 Jan 2026 17:58:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Number of police officers killed in line of duty hits level not seen in 80 years",
      "description": "U.S. law enforcement officers killed in the line of duty plummeted to historic lows in 2025, reaching levels not seen since the World War II era, according to new data.",
      "url": "https://www.foxnews.com/us/number-police-officers-killed-line-duty-hits-level-not-seen-80-years",
      "published": "Tue, 06 Jan 2026 12:02:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Allies agree 'robust' security guarantees for Ukraine",
      "description": "European and US allies of Ukraine on Tuesday agreed \"robust\" security guarantees for Kyiv to come into force after an eventual ceasefire in Russia's war against the pro-Western country that would see the United States lead a truce monitoring mechanism, French President Emmanuel Macron said. FRANCE 24's Clovis Casali reports from the Elysée Palace.",
      "url": "https://www.france24.com/en/allies-agree-robust-security-guarantees-for-ukraine",
      "published": "Tue, 06 Jan 2026 19:45:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Trump administration's capture of Maduro raises unease about the international legal framework",
      "description": "The capture of Nicolás Maduro by U.S. forces has sparked global controversy",
      "url": "https://abcnews.go.com/International/wireStory/trump-administrations-capture-maduro-raises-unease-international-legal-128936742",
      "published": "Tue, 06 Jan 2026 06:01:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Flash floods in Indonesia kill at least 16 people and sweep away homes",
      "description": "Flash floods triggered by torrential rain have killed at least 16 people in Indonesia’s North Sulawesi province",
      "url": "https://abcnews.go.com/International/wireStory/flash-floods-indonesia-kill-16-people-sweep-homes-128938051",
      "published": "Tue, 06 Jan 2026 05:53:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s attack leaves China worried about its interests in Venezuela | Amy Hawkins",
      "description": "Maduro had just affirmed ‘strong bonds of brotherhood’ with Beijing when US made its shocking intervention Venezuela crisis – latest updates Hours before his life and the fate of his country was changed dramatically, Venezuela’s leader, Nicolás Maduro, was exchanging smiles and handshakes with a Chinese delegation in the presidential palace in Caracas. On Friday evening, shortly before he was seized by US forces , Maduro wrote on Telegram of his meeting with China’s special envoy for Latin American affairs, Qiu Xiaoqi: “A fraternal meeting that reaffirms the strong bonds of brotherhood and friendship between China and Venezuela. Through thick and thin!” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/05/venezuela-trump-attack-china-interests-analysis",
      "published": "Mon, 05 Jan 2026 15:51:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Swiss NYE fire: Bar had not been inspected for 5 years",
      "description": "A fire at the Le Constellation bar in the ski resort town of Crans-Montana killed 40 and injured 116 people on New Year's Eve. Swiss authorities have launched a criminal probe into the bar managers.",
      "url": "https://www.dw.com/en/swiss-nye-fire-bar-had-not-been-inspected-for-5-years/a-75403571?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 09:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Swiss bar where fatal New Year's fire broke out had last safety inspection in 2019",
      "description": "Local authorities say fire safety inspections hadn’t been carried out since 2019 at the Swiss bar where a fire at a New Year’s party left 40 people dead and over 100 injured",
      "url": "https://abcnews.go.com/International/wireStory/swiss-bar-fatal-new-years-fire-broke-safety-128938236",
      "published": "Tue, 06 Jan 2026 07:53:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Swiss ski bar not inspected for five years before deadly fire, mayor says",
      "description": "The New Year's Eve fire at a bar in Crans-Montana killed 40 people and injured 116.",
      "url": "https://www.bbc.com/news/articles/cdx4zxk1np0o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 16:16:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "The U.K. and France would install 'military hubs' in Ukraine as part of a peace plan",
      "description": "Ukraine's allies said they had agreed to provide the country with multilayered international defense guarantees as part of a proposal to end Russia's nearly 4-year-old invasion of its neighbor.",
      "url": "https://www.npr.org/2026/01/06/g-s1-104730/progress-ukraine-talks-paris-uncertain",
      "published": "Tue, 06 Jan 2026 02:28:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran offers citizens $7 monthly payments as protests spiral over economic crisis: report",
      "description": "Iran shifts from import subsidies to direct $7 monthly payments for citizens as the currency loses its value and protests intensify nationwide, according to reports.",
      "url": "https://www.foxnews.com/world/iran-offers-citizens-7-monthly-payments-protests-spiral-over-economic-crisis-report",
      "published": "Mon, 05 Jan 2026 21:53:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Protests grow as Iran’s government makes meager offer amid tanking economy",
      "description": "Amnesty International says security forces' raid on hospital in Ilam to seize protesters violates international law.",
      "url": "https://www.aljazeera.com/news/2026/1/6/protests-grow-as-irans-government-makes-meager-offer-amid-tanking-economy?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 22:47:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Truck crash in Ethiopia kills 22 people, dozens hurt",
      "description": "Road accident injured 65 people after the truck carrying migrants overturned in Semera town, local authorities say.",
      "url": "https://www.aljazeera.com/news/2026/1/6/truck-crash-in-ethiopia-kills-22-people-dozens-hurt?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 22:31:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Nicolás Maduro ‘tries to imitate my dance’, says Trump in latest accusation",
      "description": "More seriously, US president claims ousted Venezuelan leader has ‘killed millions of people’ in remarks to congressional Republicans As if his humiliation was not complete, Nicolás Maduro is facing a new charge: copying Donald Trump’s dance moves. The US president on Tuesday accused the ousted Venezuelan leader, who faces terrorism and drug trafficking charges, of imitating Trump’s signature hip-swaying and stiff arm-waving. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/06/nicolas-maduro-tries-to-imitate-my-dance-says-donald-trump",
      "published": "Tue, 06 Jan 2026 19:24:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "German prosecutors open terror probe into Berlin blackout",
      "description": "Prosecutors cited sabotage and arson among the possible crimes in a suspected far-left attack on Berlin's power supply. A group claiming the attack said it was targeting \"the fossil fuel economy.\"",
      "url": "https://www.dw.com/en/german-prosecutors-open-terror-probe-into-berlin-blackout/a-75413616?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 20:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Berlin households grapple with prolonged blackout as a cold snap grips Europe",
      "description": "A severe cold snap has gripped Europe, causing deadly accidents and travel chaos. In the German capital Berlin, freezing temperatures have made the situation even worse for tens of thousands of households that have been affected by a widespread power outage since Saturday. A suspected arson attack claimed by a left-wing group is thought to have knocked electricity offline, sparking questions over the vulnerability of Germany's wider infrastructure.",
      "url": "https://www.france24.com/en/tv-shows/business/20260106-berlin-households-grapple-with-prolonged-blackout-as-a-cold-snap-grips-europe",
      "published": "Tue, 06 Jan 2026 19:38:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Trial underway for former Uvalde school police officer accused of slow response to shooting",
      "description": "The trial of former Uvalde school police officer Adrian Gonzales, who is accused of not doing more to save lives in the 2022 massacre, is underway Tuesday.",
      "url": "https://www.foxnews.com/us/trial-underway-former-uvalde-school-police-officer-accused-slow-response-shooting",
      "published": "Tue, 06 Jan 2026 09:33:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Trump considering military options to acquire Greenland",
      "description": "President Donald Trump is exploring how to take control of Greenland and using the US military is \"always an option,\" the White House said Tuesday, further upping tensions with NATO ally Denmark. Washington's stark warning came despite Greenland and Denmark both calling for a speedy meeting with the United States to clear up \"misunderstandings.\" FRANCE 24's Fraser Jackson reports from Washington.",
      "url": "https://www.france24.com/en/trump-considering-military-options-to-acquire-greenland",
      "published": "Tue, 06 Jan 2026 22:11:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "US makes big commitment to Ukraine peace deal &#8211; but one man is missing from talks",
      "description": "Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table.",
      "url": "https://news.sky.com/story/us-makes-big-commitment-to-ukraine-peace-deal-8211-but-one-man-is-missing-from-talks-13491316",
      "published": "Tue, 06 Jan 2026 21:59:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Thirteen more lives lost in Sudan as 1,000th day of war looms",
      "description": "Thirteen more lives – including children – were reportedly lost on Tuesday in another drone attack on Sudan’s North Kordofan region.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166712",
      "published": "Tue, 06 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Maduro seized, norms tested: Security Council divided as Venezuela crisis deepens",
      "description": "The UN Security Council met on Monday against a sharply altered diplomatic backdrop, following US strikes on the Venezuelan capital and seizure of President Nicolás Maduro.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166706",
      "published": "Mon, 05 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Price hikes, queues and tension: Venezuela shoppers uneasy after US bombing",
      "description": "Residents of the capital Caracas remain rattled after the US abduction of Maduro, leading some to stock up on supplies.",
      "url": "https://www.aljazeera.com/news/2026/1/6/price-hikes-queues-and-tension-venezuela-shoppers-uneasy-after-us-bombing?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 23:53:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Venezuelan authorities detain more than a dozen international journalists",
      "description": "Venezuelan authorities detained more than a dozen international journalists Monday, a media advocacy group says. Most of them have since been released, but the move has members of the press concerned.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5667589/venezuelan-authorities-detain-more-than-a-dozen-international-journalists",
      "published": "Tue, 06 Jan 2026 06:48:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Escalating violence in Sudan, civilian danger grows in Ukraine, Ethiopia aid cuts",
      "description": "In Sudan, civilians continue to bear the brunt of escalating violence, particularly in the Darfur and Kordofan regions.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166703",
      "published": "Mon, 05 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Security Council: New faces, old tensions as five nations take their seats",
      "description": "From deploying peacekeepers to conducting quiet – but at times heated – diplomacy, the UN Security Council sits at the heart of global decision-making on war and peace. As of January, five new countries will have a seat around the iconic horseshoe table.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166697",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Top Canadian officials to visit Greenland amid international fears as Trump eyes NATO-linked territory",
      "description": "Canadian leaders reportedly plan Greenland visit in February amid growing international tensions over President Donald Trump's annexation comments.",
      "url": "https://www.foxnews.com/world/top-canadian-officials-visit-greenland-amid-international-fears-trump-eyes-nato-linked-territory",
      "published": "Tue, 06 Jan 2026 14:58:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iran protests prompt new Trump warning over deadly government crackdowns",
      "description": "Nine days of anti-government protests engulf Iran as Trump warns of consequences. Iranian Americans praise president's support for demonstrators.",
      "url": "https://www.foxnews.com/world/iran-protests-prompt-new-trump-warning-over-deadly-government-crackdowns",
      "published": "Mon, 05 Jan 2026 13:08:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Tensions between Saudis and Emiratis over future of Yemen reach boiling point",
      "description": "Dispute has potential to create civil war in south of Yemen and spill over into neighbouring countries Tensions between the United Arab Emirates and Saudi Arabia over the future of Yemen and the imminent possibility of the declaration of an independent southern state have reached boiling point with Saudi Arabia in effect accusing the UAE of threatening its future security. The dispute has the potential to create a civil war within the south of Yemen and also spill over into other disputes including in Sudan and the Horn of Africa where the two countries often find themselves backing opposite sides. Yemen could yet become only one theatre in which the two vastly wealthy Gulf states vie for political influence, control of shipping lanes and commercial access. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/saudi-arabia-uae-tension-future-yemen-boiling-point",
      "published": "Tue, 30 Dec 2025 17:19:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "U.S. faces broad condemnation for actions in Venezuela during U.N. emergency meeting",
      "description": "During a U.N. Security Council emergency meeting, the U.S. called its intervention in Venezuela a law enforcement operation. Venezuela disagreed, calling the raid an illegitimate armed attack.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5667052/u-s-faces-broad-condemnation-for-actions-in-venezuela-during-u-n-emergency-meeting",
      "published": "Tue, 06 Jan 2026 04:45:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Saudi Arabia, the UAE and a new 'Cold War' in the Middle East",
      "description": "A recent Saudi air strike on UAE weapons in Yemen exposed major differences between the two important Gulf states' foreign policy plans. But which plan is most likely to succeed?",
      "url": "https://www.dw.com/en/saudi-arabia-the-uae-and-a-new-cold-war-in-the-middle-east/a-75409779?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 17:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Five years after Jan. 6, Capitol attack continues to divide America",
      "description": "Five years after supporters of Donald Trump stormed the US Capitol as Congress certified Joe Biden’s 2020 election win, the United States held no official commemoration. Political divisions endure, and a plaque honouring police who defended the Capitol remains uninstalled.",
      "url": "https://www.france24.com/en/americas/20260107-five-years-jan-6-capitol-attack-america",
      "published": "Wed, 07 Jan 2026 00:24:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "What would be the consequences of a Greenland invasion?",
      "description": "European leaders have issued a joint statement on Greenland, after the US president said the United States needed the semi-autonomous region from a national security standpoint. Greenlandic leaders say the people will determine their own future, but Denmark's Prime Minister is more bleak in her assesment. FRANCE 24's Delano D'Souza reports.",
      "url": "https://www.france24.com/en/what-would-be-the-consequences-of-a-greenland-invasion",
      "published": "Tue, 06 Jan 2026 21:23:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "After Maduro, Venezuela power vacuum exposes brutal insiders and enforcers",
      "description": "Venezuela faces deeper chaos after Maduro's fall as experts warn fractured regime could unleash more brutal violence and repression than under former president's rule.",
      "url": "https://www.foxnews.com/world/after-maduro-venezuela-power-vacuum-exposes-brutal-insiders-enforcers",
      "published": "Tue, 06 Jan 2026 12:09:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "What the U.S. raid in Venezuela means for countries like China and Russia",
      "description": "NPR's Steve Inskeep asks Sarah Lenti, a former National Security Council director, what U.S. engagement in Venezuela means to other global players like China and Russia.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5667051/what-the-u-s-raid-in-venezuela-means-for-countries-like-china-and-russia",
      "published": "Tue, 06 Jan 2026 04:45:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Somalia condemns Israeli minister's Somaliland visit",
      "description": "Israeli Foreign Minister Gideon Saar’s visit to the breakaway region comes two weeks after Israel recognized its independence despite vocal international criticism.",
      "url": "https://www.dw.com/en/somalia-condemns-israeli-minister-s-somaliland-visit/a-75410068?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 18:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "US intervention in Venezuela violated international law, say legal experts",
      "description": "International law experts see the US abduction of Venezuelan President Nicolas Maduro as a dangerous precedent.",
      "url": "https://www.dw.com/en/us-intervention-in-venezuela-violated-international-law-say-legal-experts/a-75412120?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 16:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran anti-government protests spread to majority of provinces, videos show",
      "description": "Videos show that unrest has spread to more than 50 towns and cities, including pro-government heartlands.",
      "url": "https://www.bbc.com/news/articles/cre28d2j2zxo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 15:35:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Children killed after drone hits home in Sudan, medics say",
      "description": "At least 13 people, including eight children, have been killed in the strike in el-Obeid city, medics say.",
      "url": "https://www.bbc.com/news/articles/c74w54783zeo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 12:42:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Armed militias deployed in Venezuela as regime attempts to impose authority",
      "description": "Paramilitary groups known as colectivos patrol streets with assault rifles, stop and search cars and people’s phones US politics live – latest updates Venezuela ’s rulers have deployed armed militias to patrol streets, operate checkpoints and check people’s phones in a crackdown to consolidate authority after the US attack on Caracas . Paramilitary groups known as colectivos criss-crossed the capital with motorbikes and assault rifles on Tuesday in a show of force to stifle any dissent or perception of a power vacuum. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/07/caracas-venezuela-paramilitary-groups",
      "published": "Tue, 06 Jan 2026 18:58:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "What does the US raid in Venezuela mean for China’s designs on Taiwan?",
      "description": "Perception that Chinese-made weapons could not stop a ‘decapitation strike’ may give Beijing pause for thought The sight of a hostile regional superpower launching an overnight raid to depose the leader of a smaller neighbouring country could easily have sent pulses in Taiwan racing. The US on Saturday revealed the details of a surprise raid to capture Venezuela’s leader, Nicolás Maduro , who was whisked away to the US, where he was frogmarched into a court in New York on Monday . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/06/what-us-action-in-venezuela-means-for-taiwan",
      "published": "Tue, 06 Jan 2026 01:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Protester detained in Sydney for wearing ‘globalise the intifada’ jacket says she should never have been arrested",
      "description": "Woman, 53, claims police told her slogan was unlawful despite being unable to point to legislation banning its use Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A protester detained in Sydney’s CBD while wearing a jacket that said “globalise the intifada” says she should “never have been arrested” and claims police told her the slogan was unlawful, despite them being unable to point to legislation banning its use. The 53-year-old woman was arrested on Sunday during a protest against the US military intervention in Venezuela for wearing a shirt “displaying offensive messaging”, police alleged. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/06/protester-detained-in-sydney-for-wearing-globalise-the-intifada-jacket-says-she-should-never-have-been-arrested-ntwnfb",
      "published": "Tue, 06 Jan 2026 14:00:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "NATO could end if US takes over Greenland — Danish PM",
      "description": "Denmark's Mette Frederiksen said \"everything would stop\" in the event of a US attack on another NATO country. European leaders have backed Frederiksen while saying the US \"is an essential partner.\"",
      "url": "https://www.dw.com/en/nato-could-end-if-us-takes-over-greenland-danish-pm/a-75401270?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 12:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump administration sets meetings with oil companies over Venezuela: reports",
      "description": "US President Donald Trump said this Tuesday that he would be meeting with American oil executives, after last weekend’s stunning series of events in Venezuela. Meanwhile the Organization of American States held an emergency meeting where Brazil, Mexico and Colombia condemned the US military action in Venezuela over the weekend. FRANCE 24's Monte Francis reports.",
      "url": "https://www.france24.com/en/trump-administration-sets-meetings-with-oil-companies-over-venezuela-reports",
      "published": "Tue, 06 Jan 2026 19:57:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Yemen aid response buckling under funding cuts as needs keep rising",
      "description": "Yemen’s already fragile humanitarian response is being pushed to breaking point by deep funding shortfalls, the UN warned in an update Sunday highlighting mounting risks for millions across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166699",
      "published": "Sun, 04 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "‘Do not give up on children’: Displaced by violence, a Haitian girl finds hope at school",
      "description": "A teenage Haitian girl who was forced to flee her home in Haiti’s capital, Port-au-Prince, due to gang violence has urged adults not to “give up on children.”",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166695",
      "published": "Sat, 03 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Venezuela orders nationwide manhunt for supporters after Maduro's arrest by US forces",
      "description": "Nicolas Maduro was arrested by U.S. forces on drug trafficking charges as Venezuela declares emergency, ordering arrests of supporters. Rodriguez sworn in.",
      "url": "https://www.foxnews.com/world/venezuela-orders-nationwide-manhunt-supporters-after-maduros-arrest-us-forces",
      "published": "Mon, 05 Jan 2026 13:10:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Macron hosts Ukraine and allies to try to cement security guarantees",
      "description": "The talks are held as Russia continues attacking Ukraine's energy sector and under the shadow of US threats to annex Greenland.",
      "url": "https://www.bbc.com/news/articles/c74vx4n003xo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 10:59:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Birzeit University raid seen as warning against Palestinian defiance",
      "description": "Israeli forces raided Birzeit University in the occupied West Bank during a solidarity event for Palestinian prisoners.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/6/birzeit-university-raid-seen-as-warning-against-palestinian-defiance?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 19:39:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'Breakthrough' blood test at home could help more people spot Alzheimer's, says study",
      "description": "A new \"breakthrough\" blood test can help spot the key warning signs of Alzheimer's, latest research suggests.",
      "url": "https://news.sky.com/story/breakthrough-blood-test-at-home-could-help-more-people-spot-alzheimers-say-scientists-13491064",
      "published": "Tue, 06 Jan 2026 10:05:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Why are people protesting in Iran - and how are the US involved?",
      "description": "Protests sparked by a widening economic crisis have swept across Iran for more than a week.",
      "url": "https://news.sky.com/story/why-are-people-protesting-in-iran-everything-you-need-to-know-13490639",
      "published": "Tue, 06 Jan 2026 17:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Sparkler candles banned by Swiss mayor after New Year's bar fire killed 40",
      "description": "The Swiss bar that caught fire during a New Year's celebration and killed 40 people had not been inspected since 2019, officials have said.",
      "url": "https://news.sky.com/story/sparkler-candles-banned-by-swiss-mayor-after-new-years-bar-fire-killed-40-13491030",
      "published": "Tue, 06 Jan 2026 09:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump is likely gambling he could get away with Greenland grab as NATO needs US more than he needs it",
      "description": "It is becoming increasingly clear that Donald Trump is serious about taking Greenland from Denmark, a NATO ally, despite warnings that such a move would destroy the alliance.",
      "url": "https://news.sky.com/story/trump-is-likely-gambling-he-could-get-away-with-greenland-grab-as-nato-needs-us-more-than-he-needs-it-13491116",
      "published": "Tue, 06 Jan 2026 13:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran protesters emboldened by Trump admin’s Persian messaging after Obama-Biden inaction, activists say",
      "description": "U.S. shifts Iran policy as Trump administration revives aggressive messaging toward Tehran, contrasting sharply with previous diplomatic approaches.",
      "url": "https://www.foxnews.com/world/iran-protesters-emboldened-trump-admins-persian-messaging-after-obama-biden-inaction-activists-say",
      "published": "Tue, 06 Jan 2026 14:36:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump Greenland takeover would end NATO, Denmark asserts",
      "description": "Danish Prime Minister Mette Frederiksen warns that President Donald Trump's Greenland annexation threats could end NATO, saying military action against ally would stop security alliance formed after WWII.",
      "url": "https://www.foxnews.com/world/trump-greenland-takeover-would-end-nato-denmark-asserts",
      "published": "Tue, 06 Jan 2026 07:37:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Nestle issues global recall of some baby formula products over toxin fears",
      "description": "The food giant discovered some batches of SMA infant and follow-on formula could lead to vomiting",
      "url": "https://www.bbc.com/news/articles/cx2yvx8gnnpo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 08:43:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Rodriguez says ‘no foreign agent’ running Venezuela, US role still unclear",
      "description": "Venezuela's prosecutor general decries Maduro's arrest as 'terrorism' as the US offers little clarity on its next steps.",
      "url": "https://www.aljazeera.com/news/2026/1/6/rodriguez-says-no-foreign-agent-running-venezuela-us-role-still-unclear?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 23:37:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Maduro abduction shows influence, limits of US Secretary of State Rubio",
      "description": "Top diplomat has long pushed toppling of Maduro, with eye towards Cuba, but remains constrained by competing ambitions.",
      "url": "https://www.aljazeera.com/news/2026/1/6/maduro-abduction-shows-influence-limits-of-us-secretary-of-state-rubio?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 20:40:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Venezuela ‘turning over’ up to 50m barrels of oil to the US, Trump says",
      "description": "The president’s announcement comes as Venezuela seeks to avoid deep cuts in output amid an ongoing blockade on exports imposed by the US Donald Trump has said Venezuela will be “turning over” 30 to 50m barrels of sanctioned oil to the US, as the South American country seeks to avoid deep cuts in output amid an ongoing blockade on exports imposed by Washington since mid-December. “This Oil will be sold at its Market Price, and that money will be controlled by me, as President of the United States of America, to ensure it is used to benefit the people of Venezuela and the United States!” Trump said in a post online . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/07/venezuela-oil-trump-us-latest",
      "published": "Wed, 07 Jan 2026 00:16:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Anger in Papua New Guinea after Starlink ordered to shut down internet services",
      "description": "In mid-December PNG said the company did not have a licence to operate in the country and ordered it to halt operations Frustration is growing in Papua New Guinea weeks after the government ordered Starlink to shut down operations in the country as businesses, health providers and communities struggle without access to internet services. Starlink, owned by Elon Musk’s SpaceX, is a satellite internet company that provides internet to remote places. In mid-December, the National Information and Communications Technology Authority (Nicta) ordered the company to halt operations because it was not licensed in PNG. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/06/papua-new-guinea-internet-starlink-shut-down",
      "published": "Tue, 06 Jan 2026 02:50:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Trump says the US 'needs' Greenland for Arctic security. Here's why",
      "description": "Greenland's strategic location above the Arctic Circle makes it a focal point in global security and trade debates",
      "url": "https://abcnews.go.com/International/wireStory/trump-us-greenland-arctic-security-128939917",
      "published": "Tue, 06 Jan 2026 07:05:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "A woman dies from cervical cancer every two minutes, UN says",
      "description": "A flood of questions drowned Jeanette in thought after she was diagnosed with cervical cancer. Would she be unable to conceive a child? Would she have to enter menopause at the early age of 31?",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166696",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Man with machete shot and killed by police, who then find 3 more dead inside home: officials",
      "description": "Police shot and killed a man armed with a knife in the Garden State on Monday, the New Jersey state attorney general's office announced.",
      "url": "https://www.foxnews.com/us/man-machete-shot-killed-police-find-3-more-dead-inside-home-officials",
      "published": "Tue, 06 Jan 2026 14:22:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "US may intercept and seize oil tanker heading for Europe, reports say",
      "description": "US officials have a warrant to seize the Russian-flagged ship accused of breaking sanctions.",
      "url": "https://www.bbc.com/news/articles/c7v0deypjl4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 19:47:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump’s attacks on Venezuela put Mexico on edge",
      "description": "President Claudia Sheinbaum has sought to safeguard Mexican sovereignty while cooperating with the US on key issues.",
      "url": "https://www.aljazeera.com/news/2026/1/7/trumps-attacks-on-venezuela-put-the-us-neighbour-mexico-on-edge?traffic_source=rss",
      "published": "Wed, 07 Jan 2026 01:10:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Macron, Starmer, Zelenskyy sign Ukraine troop deployment pact",
      "description": "France, the UK and Ukraine signed a declaration of intent on deploying a multinational force after any ceasefire.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/6/macron-starmer-zelenskyy-sign-ukraine-troop-deployment-pact?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 20:34:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Cold snap hits Europe, disrupting travel",
      "description": "Freezing temperatures and snow are gripping much of the continent, disrupting flights and causing traffic accidents. Canals froze in London, cross country skiers took to Hamburg cycle paths, and snow even fell in Madrid.",
      "url": "https://www.dw.com/en/cold-snap-hits-europe-disrupting-travel/a-75410227?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 17:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Ukraine’s allies sign declaration on troop deployment after ceasefire",
      "description": "Ukraine’s key European allies on Tuesday signed security ​guarantees for ‍Ukraine, including the ​deployment of a multinational military ​force in the event of a peace deal with Russia. French President Emmanuel Macron said the agreement was a \"significant step” that would dissuade further aggressions on Ukraine.",
      "url": "https://www.france24.com/en/europe/20260106-watch-live-leaders-of-ukraine-s-coalition-of-the-willing-speak-from-paris",
      "published": "Tue, 06 Jan 2026 17:39:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "California mom says ChatGPT coached teen son on drug use before his fatal overdose: report",
      "description": "A California mother says her teen son used a chatbot for drug-related questions over several months before dying from an overdose.",
      "url": "https://www.foxnews.com/us/california-mom-chatgpt-coached-teen-son-drug-use-fatal-overdose",
      "published": "Tue, 06 Jan 2026 17:05:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cremation pyre in Africa thought to be world’s oldest containing adult remains",
      "description": "9,500-year-old pyre uncovered in Malawi offers rare insight into rituals of ancient African hunter-gatherer groups A cremation pyre built about 9,500 years ago has been discovered in Africa, offering a fresh glimpse into the complexity of ancient hunter-gatherer communities. Researchers say the pyre, discovered in a rock shelter at the foot of Mount Hora in northern Malawi, is thought to be the oldest in the world to contain adult remains, the oldest confirmed intentional cremation in Africa, and the first pyre to be associated with African hunter-gatherers. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/01/cremation-pyre-in-africa-thought-to-be-worlds-oldest-containing-adult-remains",
      "published": "Thu, 01 Jan 2026 19:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "T20 World Cup cricket: Why Bangladesh won't travel to India",
      "description": "A month before the tournament begins, Bangladesh have said they will not play T20 World Cup matches in India. The decision comes on the back of political and sporting tensions between the countries.",
      "url": "https://www.dw.com/en/t20-world-cup-cricket-why-bangladesh-won-t-travel-to-india/a-75397516?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 09:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US Congressman Doug LaMalfa dies unexpectedly at 65",
      "description": "The death of LaMalfa, a Trump ally, shaves the Republican majority in the US House of Representatives to just a few seats.",
      "url": "https://www.bbc.com/news/articles/cgl8y4gx9lyo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 17:05:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nvidia unveils self-driving car tech as it seeks to power more products with AI",
      "description": "The chip giant is looking for ways to move the AI revolution beyond software and into physical products.",
      "url": "https://www.bbc.com/news/articles/c0jv1vd571wo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 10:30:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump’s claims about Greenland are misinformation, Danish official says amid latest US push to acquire territory – live",
      "description": "White House said military action remains an option, though Marco Rubio reportedly told lawmakers that was a tactic to get Denmark to sell Trump says using US military is ‘always an option’ for acquiring Greenland My colleague Sibylla Brodzinsky has reported on the relationship between the US and Colombia, home to significant oil reserves. Here is an extract from her story : Colombia has long been a close partner of the US in the fight against drug trafficking and enjoyed bipartisan support in Washington but relations have soured dramatically since Trump came to offic e. Colombia’s narcotics trade is largely controlled by illegal armed groups such as the Gulf Clan, the National Liberation Army (ELN) and dissident factions of the Revolutionary Armed Forces of Colombia (Farc) guerrilla group, the majority of whose members demobilised after a 2016 peace deal … Continue reading...",
      "url": "https://www.theguardian.com/world/live/2026/jan/06/venezuela-live-updates-maduro-trump-us-attack-opposition-machado-return",
      "published": "Wed, 07 Jan 2026 01:33:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "AFCON 2025: Ivory Coast and Algeria book last quarter-final spots",
      "description": "The Elephants trampled over Burkina Faso with a controlled 3-0 display in Marrakesh, setting up a quarter-final clash against Egypt. Meanwhile Algeria have Adil Boulbina to thank for after the young forward found the net in the 119th minute to avoid a penalty shootout against DR Congo. With most of the favourites having booked their spots for the quarter finals, we discuss whether a new tier has been formed in African football and whether this is a positive change for the continent.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20260106-afcon-2025-ivory-coast-and-algeria-book-last-quarter-final-spots",
      "published": "Tue, 06 Jan 2026 23:26:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ramaphosa opposes US military operation against deposed Venezuelan leader Nicholas Maduro",
      "description": "In tonight's edition, South Africa forces an emergency UN session to slam the US military's toppling of Venezuala's leader Nicolas Maduro. Also, Somalia's furious over the Israeli foreign minister's visit to Somaliland. And the desert foxes are through to the quarter finals but the leopards will now have to lie low: Algeria beat DRC at AFCON to access quarter-finals.",
      "url": "https://www.france24.com/en/ramaphosa-opposes-us-military-operation-against-deposed-venezuelan-leader-nicholas-maduro",
      "published": "Tue, 06 Jan 2026 21:45:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump 'sees that there's money to be made' out of a Ukraine ceasefire, analyst says",
      "description": "Speaking with FRANCE 24's Mark Owen, James J. Townsend Jr, Senior Advisor at the Atlantic Council, says that the presence of US envoys Steve Witkoff and Jared Kushner at the Ukraine peace talks in Paris was 'very important' in light of developments in Venezuela, to assuage allies' concerns about the US' commitment to Ukraine, by highlighting 'the prosperity aspect' of a ceasefire for both American companies and the Ukrainian people.",
      "url": "https://www.france24.com/en/trump-sees-that-there-s-money-to-be-made-out-of-a-ukraine-ceasefire-analyst-says",
      "published": "Tue, 06 Jan 2026 20:32:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Member of US military shot multiple times during operation to capture Maduro",
      "description": "Donald Trump has revealed new details of the operation to capture Nicolas Maduro which saw \"many\" killed, as supporters of the deposed Venezuelan president took to the streets.",
      "url": "https://news.sky.com/story/donald-trump-says-many-killed-in-tactically-brilliant-venezuela-operation-but-mostly-cubans-13491212",
      "published": "Tue, 06 Jan 2026 16:07:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why does Trump want to take over Greenland - and could he actually do it?",
      "description": "Donald Trump has warned he is \"very serious\" about annexing Greenland – and has not ruled out taking the territory by force.",
      "url": "https://news.sky.com/story/why-does-trump-want-to-take-over-greenland-and-could-he-actually-do-it-13285350",
      "published": "Mon, 24 Mar 2025 11:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN agency rolls out three-year plan to safeguard Ukraine’s bread basket",
      "description": "Ukraine’s agricultural sector remains under intense pressure as the war continues to disrupt food production and endanger civilians, the UN food security agency warned on Tuesday, as it unveiled a new three-year plan to help farmers survive and protect their livelihoods.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166710",
      "published": "Tue, 06 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "New year dawns amid rubble and resolve in Gaza",
      "description": "As 2026 begins, residents of the Gaza Strip are confronting life in displacement camps and among the ruins of destroyed neighbourhoods – facing deep uncertainty after months of war and devastation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166692",
      "published": "Thu, 01 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Massive luxury handbag heist caught on camera as heavily armed police swarm California store",
      "description": "California police arrest two suspects allegedly caught on surveillance camera stealing $100,000 in luxury handbags from Irvine store in early morning raid.",
      "url": "https://www.foxnews.com/us/massive-luxury-handbag-heist-caught-camera-heavily-armed-police-swarm-california-store",
      "published": "Tue, 06 Jan 2026 19:53:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Father arrested on drug, weapons charges as 4-year-old son found dead after New Year's disappearance",
      "description": "Father arrested on felony charges during search for missing 4-year-old son who died after disappearing in Alabama. Jameson Boley allegedly exposed kids to drugs.",
      "url": "https://www.foxnews.com/us/father-arrested-drug-weapons-charges-4-year-old-son-found-dead-after-new-years-disappearance",
      "published": "Tue, 06 Jan 2026 16:12:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Missing South Carolina teen Mackenzie Dalton found safe after monthlong search leads to arrest",
      "description": "Teen Mackenzie Dalton was located safely and an 18-year-old man was arrested and accused of lying to investigators about her whereabouts during a search effort.",
      "url": "https://www.foxnews.com/us/missing-south-carolina-teen-mackenzie-dalton-found-safe-after-monthlong-search-leads-arrest",
      "published": "Tue, 06 Jan 2026 14:02:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Cuba identifies 32 military personnel killed in US operation against Maduro regime in Venezuela",
      "description": "Havana says 32 members of its armed forces died during a U.S. military operation to capture Nicolás Maduro, calling it an act of aggression.",
      "url": "https://www.foxnews.com/world/cuba-identifies-32-military-personnel-killed-us-operation-maduro-regime-venezuela",
      "published": "Tue, 06 Jan 2026 20:04:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela's new interim leader Delcy Rodríguez 'hates the West,' ex official warns",
      "description": "Venezuela's new interim president Delcy Rodríguez represents continuity of Maduro's regime, according to a former official as the 56-year-old faces U.S. sanctions.",
      "url": "https://www.foxnews.com/world/venezuelas-new-interim-leader-delcy-rodriguez-hates-west-former-official-warns",
      "published": "Mon, 05 Jan 2026 21:04:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Cuba's shadow in Venezuela: Havana’s intelligence and military ties exposed after Maduro raid",
      "description": "Cuba confirms 32 intelligence personnel killed in U.S. operation that seized Maduro, exposing extensive Cuban involvement in Venezuela's military systems.",
      "url": "https://www.foxnews.com/world/cubas-shadow-venezuela-havanas-intelligence-military-ties-exposed-after-maduro-raid",
      "published": "Mon, 05 Jan 2026 10:30:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iran protests: Reports of clashes at Tehran bazaar",
      "description": "Security forces reportedly used tear gas on demonstrators at the Tehran Grand Bazaar as they held a sit-in. The protests, triggered by rising cost of living, are now into their 10th day.",
      "url": "https://www.dw.com/en/iran-protests-reports-of-clashes-at-tehran-bazaar/a-75409139?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 15:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Israel, Syria agree to share intelligence, seek military de-escalation after Paris talks",
      "description": "Syria’s new government and Israel agreed to form a joint, US-supervised group to share intelligence and pursue military de-escalation, Washington said after talks in Paris. The rare meeting comes amid Israeli strikes and US concern over pressure on Syria’s fragile leadership.",
      "url": "https://www.france24.com/en/middle-east/20260106-israel-syria-intelligence-military-de-escalation-paris",
      "published": "Tue, 06 Jan 2026 22:32:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky replaces Ukraine's powerful security service chief",
      "description": "The Ukrainian president has come under heavy criticism for his reshuffling of one the country's most successful security agencies.",
      "url": "https://www.bbc.com/news/articles/cpv7myg2nw4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 14:26:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea’s junta chief elected president after opposition boycott",
      "description": "Mamady Doumbouya reneged on promise not to stand and hand west African country back to civilian rule The head of Guinea’s junta, Mamady Doumbouya, who had pledged not to run for office after seizing power four years ago, has been elected president after the country’s electoral commission said he had secured a sweeping majority of the vote. Doumbouya, 41, faced eight rivals for the presidency but the main opposition leaders were barred from running and had urged a boycott of the vote held over the weekend. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/guinea-junta-chief-mamady-doumbouya-elected-president-after-opposition-boycott",
      "published": "Wed, 31 Dec 2025 07:54:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuelan expats celebrate Maduro's arrest, but question their country's future",
      "description": "In Florida, members of the Venezuelan community celebrate -- and question -- the U.S. detention of Venezuelan President Nicolas Maduro.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5667077/venezuelan-expats-celebrate-maduros-arrest-but-question-their-countrys-future",
      "published": "Tue, 06 Jan 2026 04:45:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "An inside look at Venezuela's critical gold trade",
      "description": "Gold -- like oil -- is crucial for Venezuela's government. NPR's Leila Fadel speaks with CNN journalist Isa Soares, who won an Emmy for her coverage of the gold trade in the country.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5667058/an-inside-look-at-venezuelas-critical-gold-trade",
      "published": "Tue, 06 Jan 2026 04:45:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela: Trump announces plan to get up to 50M oil barrels",
      "description": "The US president announced plan to acquire and sell between 30 and 50 million barrels of oil from Venezuela. Venezuela's acting leader Delcy Rodriguez said her government, not a \"foreign agent,\" controls the country.",
      "url": "https://www.dw.com/en/venezuela-trump-announces-plan-to-get-up-to-50m-oil-barrels/live-75401237?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 7 Jan 2026 00:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Malaysia pledges anti-corruption campaign amid 1MDB anger",
      "description": "Malaysia is gearing up for major reforms following the latest verdict against ex-PM Najib Razak over the 1MDB corruption scandal. Aggressive anti-graft moves, however, could also sink the country's current government.",
      "url": "https://www.dw.com/en/malaysia-pledges-anti-corruption-campaign-amid-1mdb-anger/a-75404237?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 13:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Germany news: Merz issues business SOS in letter to allies",
      "description": "Chancellor Merz has told coalition politicians the situation in several key German businesses is \"very critical.\" He said the government must prioritize improving areas like energy and labor costs in 2026. Follow DW.",
      "url": "https://www.dw.com/en/germany-news-merz-issues-business-sos-in-letter-to-allies/live-75403582?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 12:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Unpacking Czechia's devotion to cash and its currency",
      "description": "The new government in Prague wants to change the constitution to anchor the Czech crown as the country's legal tender and guarantee the right to use cash, not just cards. Why has it made this pledge, and will it happen?",
      "url": "https://www.dw.com/en/unpacking-czechia-s-devotion-to-cash-and-its-currency/a-75403939?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 12:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Curfew imposed in southern Nepal border city after mosque vandalism sparks protests",
      "description": "Authorities have imposed a curfew on a key border city in southern Nepal after Hindu and Muslim groups began protesting against each other",
      "url": "https://abcnews.go.com/International/wireStory/curfew-imposed-southern-nepal-border-city-after-mosque-128939827",
      "published": "Tue, 06 Jan 2026 07:13:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela’s people must be heard, insists UN human rights chief",
      "description": "Responding to the seizure of Venezuela President Nicolás Maduro by the United States, UN human rights chief Volker Türk on Tuesday reiterated deep concerns that the military operation undermined fundamental protections for sovereign countries.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166707",
      "published": "Tue, 06 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "UN chief deeply concerned over ‘possible intensification of instability’ in Venezuela",
      "description": "Invoking the bedrock principle prohibiting the use of force against the territory and independence of any State, the UN Secretary-General told the Security Council on Monday there must be “full respect” for the UN Charter, in the face of the United States military intervention in Venezuela and seizure of President Nicolás Maduro.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166701",
      "published": "Mon, 05 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuelan ‘dark fleet’ tanker evades US Coast Guard as Russia sends submarine to escort vessel: reports",
      "description": "Russia formally asked the United States to halt pursuit of Venezuelan oil tanker Marinera after the vessel escaped U.S. Coast Guard interception in the Caribbean.",
      "url": "https://www.foxnews.com/world/venezuela-oil-tanker-marinera-evades-us-interception-adopting-russian-identity-fleeing-atlantic",
      "published": "Tue, 06 Jan 2026 19:46:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Israel and Syria resume diplomatic dialogue after months of silence under US mediation",
      "description": "Israel and Syria reportedly resume diplomatic talks with U.S. backing under Trump's Middle East peace vision, focusing on border security and regional stability.",
      "url": "https://www.foxnews.com/world/israel-syria-resume-diplomatic-dialogue-after-months-silence-under-us-mediation",
      "published": "Tue, 06 Jan 2026 14:51:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mexican president rejects US sending troops to her country: 'I don't believe in an invasion'",
      "description": "Mexican President Claudia Sheinbaum condemns U.S. intervention in Venezuela, defends sovereignty amid Trump pressure over cartels and potential military action.",
      "url": "https://www.foxnews.com/world/mexican-president-rejects-us-sending-troops-her-country-i-dont-believe-invasion",
      "published": "Mon, 05 Jan 2026 12:37:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea test-launches hypersonic missile system in front of Kim, nation says",
      "description": "Kim Jong Un oversaw hypersonic missile tests as North Korea ramped up weapons displays ahead of a major political conference, state media reported.",
      "url": "https://www.foxnews.com/world/north-korea-test-launches-hypersonic-missile-system-front-kim-nation-says",
      "published": "Mon, 05 Jan 2026 08:17:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "European allies back Denmark over Trump's threat to annex Greenland",
      "description": "Donald Trump has refused to rule out using force to annex Greenland - a scenario that would spell the end of Nato, according to Denmark.",
      "url": "https://www.bbc.com/news/articles/c07xkeee2k3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 14:56:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "The painful questions for Nato and the EU as Trump threatens Greenland",
      "description": "The White House has said that 'utilising the ‌US military is ‍always an option at the commander-in-chief's disposal'",
      "url": "https://www.bbc.com/news/articles/cpwn2wjzwndo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 23:59:30 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US says military ‘always an option’ in Greenland as Europe rejects threats",
      "description": "White House says Trump is discussing options to acquire Greenland, including the potential use of the US military.",
      "url": "https://www.aljazeera.com/news/2026/1/7/us-says-military-always-an-option-in-greenland-as-europe-rejects-threats?traffic_source=rss",
      "published": "Wed, 07 Jan 2026 01:07:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "UK, France pledge ‘reassurance force’ for Ukraine after Russia ceasefire",
      "description": "The UK and France will establish 'military hubs' in Ukraine in the event of a peace deal with Russia.",
      "url": "https://www.aljazeera.com/news/2026/1/6/ukraine-talks-in-paris-yield-significant-progress-on-security-pledges?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 19:11:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US ‘adapt, shrink or die’ terms for $2bn aid pot will mean UN bowing down to Washington, say experts",
      "description": "Afghanistan and Yemen excluded from list of 17 priority countries chosen by Trump administration to receive aid laden with demands The $2bn (£1.5bn) of aid the US pledged this week may have been hailed as “bold and ambitious” by the UN but could be the “nail in the coffin” in changing to a shrunken, less flexible aid system dominated by Washington’s political priorities, aid experts fear. After a year of deep cuts in aid budgets by the US and European countries, the announcement of new money for the humanitarian system is a source of some relief, but experts are deeply concerned about demands that the US has imposed on how the money should be managed and where it can go. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/01/us-aid-cuts-conditions-un-humanitarian-pledge-ocha",
      "published": "Thu, 01 Jan 2026 13:00:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Allies endorse 'robust' security guarantees",
      "description": "France's Emmanuel Macron said allies had agreed on \"robust\" security guarantees for Kyiv after an eventual ceasefire. That came as more than 30 allies met in Paris. Follow DW for the latest.",
      "url": "https://www.dw.com/en/ukraine-allies-endorse-robust-security-guarantees/live-75402633?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 19:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fact check: These fakes are circulating about Venezuela",
      "description": "Several viral videos claim to show people in Venezuela allegedly celebrating or protesting after Maduro's arrest. The DW fact check team explains why these recordings are misleading or even fake.",
      "url": "https://www.dw.com/en/fact-check-these-fakes-are-circulating-about-venezuela/a-75409981?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 18:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland welcomes European solidarity amid Trump's threats",
      "description": "Greenland’s prime minister has thanked European allies for their backing after renewed claims on the island by US President Donald Trump. Jens-Frederik Nielsen urged Washington to engage in “respectful dialogue.\"",
      "url": "https://www.dw.com/en/greenland-welcomes-european-solidarity-amid-trump-s-threats/a-75412938?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 18:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "There's a sense in Greenland that Trump may now take over territory",
      "description": "Greenland is in the eye of an intense diplomatic storm, not that you would know it being here.",
      "url": "https://news.sky.com/story/greenlanders-dont-appreciate-trumps-advances-but-there-is-little-here-to-stop-us-troops-13491258",
      "published": "Tue, 06 Jan 2026 17:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Snow and ice wreak havoc across Europe, causing deadly accidents and travel chaos",
      "description": "Snow, ice and freezing temperatures have hit parts of Europe, causing chaos",
      "url": "https://abcnews.go.com/International/wireStory/snow-ice-wreak-havoc-europe-causing-deadly-accidents-128940183",
      "published": "Tue, 06 Jan 2026 08:22:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Canada's Indigenous governor general to visit Greenland as Trump renews talk of annexing it",
      "description": "Prime Minister Mark Carney says his foreign minister and the governor general will visit Greenland in early February in the wake of renewed threats by U.S. President Donald Trump to annex the Danish territory",
      "url": "https://abcnews.go.com/International/wireStory/canadas-indigenous-governor-general-visit-greenland-trump-renews-128950737",
      "published": "Tue, 06 Jan 2026 12:17:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Winter storms upended thousands in Gaza",
      "description": "Some 65,000 households in the Gaza Strip were affected by the severe winter storms that whipped through the enclave last month, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166711",
      "published": "Tue, 06 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza aid lifelines under strain as winter worsens",
      "description": "Humanitarian partners in the Gaza Strip are struggling to reach hundreds of thousands of vulnerable people as winter storms batter damaged homes and temporary shelters.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166694",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Ding-dong ditch' prank erupts in gunfire, leaving juvenile shot and homeowner under arrest: police",
      "description": "North Carolina man Craig Steven Mason allegedly fired multiple rounds at vehicle carrying juveniles playing 'ding-dong ditch,' striking one in leg, police say.",
      "url": "https://www.foxnews.com/us/ding-dong-ditch-prank-erupts-gunfire-leaving-juvenile-shot-homeowner-under-arrest-police",
      "published": "Tue, 06 Jan 2026 14:00:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Texas woman charged for apartment fire after allegedly burning boyfriend’s clothes in BBQ pit",
      "description": "Texas woman allegedly burned boyfriend's clothes in barbecue pit, sparking fire that damaged 13 apartment units. Crystal Randall charged with reckless arson.",
      "url": "https://www.foxnews.com/us/texas-woman-charged-apartment-fire-after-allegedly-burning-boyfriends-clothes-bbq-pit",
      "published": "Tue, 06 Jan 2026 13:20:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel's foreign minister on historic visit to Somaliland",
      "description": "In a controversial move, Israel became the first nation to acknowledge Somaliland as an independent state.",
      "url": "https://www.bbc.com/news/articles/cwyrexdgzn9o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 16:23:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "What does Israel’s recognition of Somaliland mean for the region?",
      "description": "Israel’s recognition of Somaliland pulls the breakaway territory into a larger regional power struggle.",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/6/aje-onl-tt_som_somaliland_av_v3-060125?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 20:23:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Somalia condemns Israel’s visit to Somaliland",
      "description": "Israel’s foreign minister visited Somaliland after Israel recognised the self-declared republic as a sovereign state.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/6/somalia-condemns-israels-visit-to-somaliland?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 19:21:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Weather tracker: Arctic air grips Europe as severe winds batter Corsica",
      "description": "Subzero temperatures, heavy snowfall and powerful gusts mark a harsh start to 2026 for many It has been a cold start to the year across much of Europe, particularly in central regions, where temperatures dropped to double-digit negatives. Heavy snowfall hit parts of eastern and central Europe on New Year’s Eve, notably in Poland and Ukraine, with similar conditions across the Alps on the first few days of the year. The cold is likely to continue this week as an Arctic air mass sinks south across Europe, pulling temperatures well below the seasonal average outside south-east Europe. Temperatures are expected to fall widely by about 5C (41F) below average, with some areas – such as parts of central and north-eastern Europe – up to 10C lower than the norm. When wind chill is taken into account, it will feel even colder. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/05/weather-tracker-arctic-air-grips-europe-winds-corsica",
      "published": "Mon, 05 Jan 2026 09:15:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "‘Won’t go down without a fight’: Moira Deeming among Victorian Liberal MPs facing preselection challenge",
      "description": "Exclusive: Western metropolitan region MP to battle Dinesh Gourisetty before November state election as Ann-Marie Hermans also challenged Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Victorian Liberal upper house MPs Moira Deeming and Ann-Marie Hermans are to face preselection challenges, as senior party members sound out a former journalist to run against Renee Heath. Guardian Australia has confirmed from three sources not authorised to comment publicly that Dinesh Gourisetty, a prominent figure in Melbourne’s fast-growing Indian community, will nominate for preselection in the western metropolitan region against Deeming. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/06/moira-deeming-victorian-liberal-mps-preselection-challenge-ntwnfb",
      "published": "Tue, 06 Jan 2026 14:00:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US military ‘always an option’ to secure Greenland, says Donald Trump",
      "description": "President Donald Trump is exploring ways for the United States to take control of Greenland, with military force “always an option,” the White House said on Tuesday, raising tensions with NATO ally Denmark.",
      "url": "https://www.france24.com/en/americas/20260106-trump-military-options-greenland",
      "published": "Tue, 06 Jan 2026 23:11:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US actions in Venezuela ‘constitute a dangerous precedent’: Guterres",
      "description": "The UN Secretary-General António Guterres has said he is “deeply alarmed” over the standoff between the United States and Venezuela in recent months, which culminated on Saturday morning in the capture of President Nicolás Maduro by US special forces.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166698",
      "published": "Sat, 03 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Latin America fractures over Trump’s Maduro capture as regional allies shift right",
      "description": "Latin American nations split over Venezuela's Maduro capture as regional summit fails to reach consensus, exposing a new shift to the right across the Western Hemisphere.",
      "url": "https://www.foxnews.com/world/latin-america-fractures-over-trumps-maduro-capture-regional-allies-shift-right",
      "published": "Tue, 06 Jan 2026 06:37:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "UK and France to send troops to Ukraine if peace deal agreed",
      "description": "The announcement was made by UK PM Sir Keir Starmer after a meeting of Ukraine's allies in Paris.",
      "url": "https://www.bbc.com/news/articles/c17zee20qpzo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 22:30:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US Supreme Court expected to rule on tariffs on Friday",
      "description": "Both conservative and liberal justices voiced concerns about the legality of the tariffs during arguments in November.",
      "url": "https://www.aljazeera.com/economy/2026/1/6/us-supreme-court-expected-to-rule-on-tariffs-on-friday?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 21:22:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Armed police patrol streets of Caracas as CIA reportedly advises to keep Maduro loyalists in power",
      "description": "US President Donald Trump has been told by the CIA that Venezuelan now interim president Delcy Rodriguez and other senior officials from Maduro's government are the best bet to maintain stability, sources said. Interior Minister Diosdado Cabello has been on the streets patrolling with security forces. Authorities have ordered the arrest of anyone who collaborated with the seizure of Maduro. Fourteen media workers were briefly detained covering events in Caracas on Monday.",
      "url": "https://www.france24.com/en/armed-police-patrol-streets-of-caracas-as-cia-reportedly-advises-to-keep-maduro-loyalists-in-power",
      "published": "Tue, 06 Jan 2026 21:21:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "911 call at Ohio dentist's home reported 'domestic dispute' months before he and wife found shot dead: records",
      "description": "Ohio dentist and wife found dead months after mysterious 911 call from same home about domestic dispute. Columbus police seek person of interest.",
      "url": "https://www.foxnews.com/us/911-call-ohio-dentists-home-reported-domestic-dispute-months-before-he-wife-found-shot-dead-records",
      "published": "Tue, 06 Jan 2026 16:39:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Attorney for suspect in Vance home vandalism rules out possible motivation",
      "description": "A defense attorney for the suspect accused of vandalizing JD Vance's Cincinnati home claims there was no political motivation, citing mental health issues.",
      "url": "https://www.foxnews.com/us/attorney-suspect-vance-home-vandalism-rules-out-possible-motivation",
      "published": "Tue, 06 Jan 2026 14:04:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Suspect in Vance home vandalism has had multiple run-ins with the law, demanded to be called Julia",
      "description": "A man accused of vandalizing Vice President JD Vance's Cincinnati home demanded to be called \"Julia\" when arrested. The suspect has a history of mental health issues.",
      "url": "https://www.foxnews.com/us/suspect-vance-home-vandalism-has-had-multiple-run-ins-law-demanded-called-julia",
      "published": "Tue, 06 Jan 2026 07:41:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Harvard president criticizes faculty activism, claims university bringing objectivity back to classroom",
      "description": "Harvard president criticizes faculty activism in classrooms, saying it creates fear among students to speak freely on controversial issues and topics.",
      "url": "https://www.foxnews.com/us/harvard-president-criticizes-faculty-activism-claims-university-bringing-objectivity-back-classroom",
      "published": "Tue, 06 Jan 2026 07:00:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Mobs of motorcycle-riding armed militia hunt Venezuelan streets for Trump supporters as crackdown intensifies",
      "description": "Venezuela crackdown intensifies as Diosdado Cabello leads paramilitary groups following Nicolás Maduro's reported capture, with armed colectivos conducting searches.",
      "url": "https://www.foxnews.com/world/mobs-motorcycle-riding-armed-militia-hunt-venezuelan-streets-trump-supporters-crackdown-intensifies",
      "published": "Tue, 06 Jan 2026 17:37:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Photos show Carnival celebrations in the Colombian city of Pasto",
      "description": "Revelers took to the streets with parade floats and costumes to celebrate the Black and White Carnival, recognized by UNESCO as Intangible Cultural Heritage, in Pasto, Colombia. ___ This is a photo gallery curated by AP photo editors.",
      "url": "https://abcnews.go.com/International/wireStory/photos-show-carnival-celebrations-colombian-city-pasto-128965060",
      "published": "Tue, 06 Jan 2026 20:14:11 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan security forces detain journalists from foreign news organisations",
      "description": "Venezuelans describe their fear of speaking out as 14 media workers are detained and police check people's social media.",
      "url": "https://www.bbc.com/news/articles/cd6w4y0eq70o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 13:24:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Six dead and hundreds of flights cancelled as snow causes chaos across Europe",
      "description": "Hundreds of flights have been cancelled in Amsterdam and Paris, with thousands of people stranded.",
      "url": "https://www.bbc.com/news/articles/czjg37p34r3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 18:14:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Dance music festival Tomorrowland to hold three-day event in Thailand",
      "description": "Founded 20 years ago, Tomorrowland has grown into one of the most iconic celebrations of electronic music.",
      "url": "https://www.bbc.com/news/articles/cql45lykx5eo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 10:31:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Indian gang rape survivor back home after a week in hospital",
      "description": "The 26-year-old was taken to hospital with serious head and facial injuries and several fractures.",
      "url": "https://www.bbc.com/news/articles/c87r891gv1ro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 09:08:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netflix pulls Chinese drama after Vietnam's outcry over disputed map",
      "description": "An episode in the drama Shine on Me features a map depicting contested claims in the South China Sea.",
      "url": "https://www.bbc.com/news/articles/c301n41518do?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 07:56:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Selfies and smiles: South Korea seeks 'new phase' in ties with China",
      "description": "South Korea's Lee Jae Myung snapped selfies with China's Xi Jinping as he pursues better ties with China in a four-day visit.",
      "url": "https://www.bbc.com/news/articles/c70lw9x581no?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 06 Jan 2026 02:44:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cuba defiant as it braces for post-Maduro era",
      "description": "The prospects for Cuba - a close ally of Nicolás Maduro's Venezuela - are now bleak, writes the BBC's Will Grant.",
      "url": "https://www.bbc.com/news/articles/cz9vg0w9w28o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 05 Jan 2026 21:41:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says Venezuela to hand over up to 50 million barrels of oil to US",
      "description": "US president says oil will be sold at market prices and that he will control the resulting revenues.",
      "url": "https://www.aljazeera.com/economy/2026/1/7/trump-says-venezuela-to-hand-over-up-to-50-million-barrels-of-oil-to-us?traffic_source=rss",
      "published": "Wed, 07 Jan 2026 00:11:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil’s Bolsonaro denied hospital visit after hitting head in prison fall",
      "description": "The ex-president's wife says he fell out of his prison bed while sleeping and hit his head.",
      "url": "https://www.aljazeera.com/news/2026/1/6/brazils-bolsonaro-taken-to-hospital-for-tests-after-prison-fall?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 22:48:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Success in Saudi-hosted Spanish Super Cup will give Barcelona ‘energy’",
      "description": "Barcelona begin the defence of their Spanish Super Cup crown against Athletic Bilbao on Wednesday in Saudi Arabia.",
      "url": "https://www.aljazeera.com/sports/2026/1/6/success-in-saudi-hosted-spanish-super-cup-win-will-give-barcelona-energy?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 22:03:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ivory Coast meet Egypt in 2025 AFCON quarters after easing by Burkina Faso",
      "description": "Holders Ivory Coast beat Burkina Faso 3-0 in last 16 of the Africa Cup of Nations and now face Egypt in quarterfinals.",
      "url": "https://www.aljazeera.com/sports/2026/1/6/ivory-coast-meet-egypt-in-2025-afcon-quarters-after-easing-by-burkina-faso?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 22:03:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Deadly clashes between Syrian troops and Kurdish-led fighters in Aleppo",
      "description": "Syrian government forces faced off with the Kurdish-led, US-backed Syrian Democratic Forces (SDF) in northern Aleppo.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/6/deadly-clashes-between-syrian-troops-and-kurdish-led-fighters-in-aleppo?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 20:19:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Dramatic late Algeria winner sets up Nigeria quarterfinal at 2025 AFCON",
      "description": "Algeria beat DR Congo in extra time and will face Nigeria on Saturday in the quarterfinals of the Africa Cup of Nations.",
      "url": "https://www.aljazeera.com/sports/2026/1/6/dramatic-late-algeria-winner-sets-up-nigeria-quarterfinal-at-2025-afcon?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 19:33:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel, Syria agree to dedicated communication line in US-brokered talks",
      "description": "Joint mechanism will be used to de-escalate militarily and may pave the road for an eventual security agreement.",
      "url": "https://www.aljazeera.com/news/2026/1/6/israel-syria-agree-to-dedicated-communication-line-in-us-brokered-talks?traffic_source=rss",
      "published": "Tue, 06 Jan 2026 19:22:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Tuna King' pays record £2.4m for giant bluefin at Tokyo auction",
      "description": "Kiyoshi Kimura will turn prized 243kg fish into sushi rolls selling for £2.4o at his restaurant chain A sushi entrepreneur has paid a record 510.3m yen (£2.4m) for a giant bluefin tuna at a prestigious auction in Tokyo’s main fish market. Kiyoshi Kimura, who styles himself the “Tuna King”, paid the top price for the 243kg (536lbs) specimen, which was caught off Japan’s northern coast. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/05/giant-bluefin-tuna-sold-record-amount-tokyo-auction-kiyoshi-kimura",
      "published": "Mon, 05 Jan 2026 13:52:50 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Professor who claimed ‘Blak’ activists were leading University of Melbourne law school to ‘destruction’ settles discrimination case",
      "description": "Exclusive: Dr Eric Descheemaeker sued the university over his attempted sacking after an email he sent was leaked and posted around campus Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A professor facing attempted termination after claiming in a publicly leaked email that “‘Blak’ activists” were aiming to lead the University of Melbourne’s prestigious law school to “destruction” has reached a settlement with the institution. The university tried to sack Dr Eric Descheemaeker after a 2023 email to the then-dean of Melbourne law school (MLS), in which he claimed it was turning into an “ideological re-education camp”, was leaked and posted around the Parkville campus last year. Descheemaeker then sued the university for discrimination , alleging the attempt to expel him in July was because of his political opinion. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/07/university-melbourne-law-school-professor-settlement-blak-activists-ntwnfb",
      "published": "Tue, 06 Jan 2026 23:54:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 4 km NNW of Rancho Viejo, Mexico",
      "description": "PAGER - YELLOW ShakeMap - VI DYFI? - VII Time 2026-01-02 13:58:18 UTC 2026-01-02 13:58:18 UTC at epicenter Location 16.902°N 99.303°W Depth 35.00 km (21.75 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rm3k",
      "published": "2026-01-06T21:07:09.025Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 15 km NNW of Susanville, CA",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VII Time 2025-12-31 05:49:32 UTC 2025-12-31 05:49:32 UTC at epicenter Location 40.544°N 120.692°W Depth 5.32 km (3.31 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75288851",
      "published": "2026-01-06T05:59:34.788Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungarian filmmaker Béla Tarr — known for bleak, existential movies — has died",
      "description": "Tarr's films were long, dark, and often abstract explorations of everyday life and politics.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5668240/bela-tarr-filmmaker-dead",
      "published": "Tue, 06 Jan 2026 14:49:21 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Lawmakers split over Maduro's seizure. And, CDC cuts childhood vaccine schedule",
      "description": "Ousted Venezuelan leader Nicolás Maduro and his wife pleaded not guilty in New York yesterday. And, the CDC scales back routine childhood vaccine recommendations at President Trump's direction.",
      "url": "https://www.npr.org/2026/01/06/g-s1-104740/up-first-newsletter-nicolas-maduro-court-venezuela-congress-vaccine-schedule",
      "published": "Tue, 06 Jan 2026 07:42:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The criminal prosecution of Nicolás Maduro is underway. Here's what to expect",
      "description": "Now begins what could be a lengthy legal process of pretrial motions, potential plea negotiations and possibly a jury trial of the authoritarian leader who ruled Venezuela for more than a decade.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5666370/nicolas-maduro-trial-legal-case-prosecution-explainer",
      "published": "Tue, 06 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European leaders push back on Trump's comments about a U.S. takeover of Greenland",
      "description": "The leaders of France, Germany, Italy, Poland, Spain and the United Kingdom joined Danish Prime Minister Mette Frederiksen in defending Greenland's sovereignty in the wake of President Trump's comments. Greenland is a self-governing territory of the kingdom of Denmark.",
      "url": "https://www.npr.org/2026/01/06/nx-s1-5668080/danish-prime-minister-us-takeover-greenland-end-of-nato",
      "published": "Tue, 06 Jan 2026 02:26:02 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda 2026 election: What you need to know",
      "description": "Voters in Uganda go to the polls on January 15 to elect a new president and members of parliament. DW breaks down the key facts you need to know ahead of the crucial vote.",
      "url": "https://www.dw.com/en/uganda-2026-election-what-you-need-to-know/a-75369002?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 13:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Central African Republic: Touadera secures third term",
      "description": "President Faustin Archange Touadera has secured a third term, though the main opposition coalition boycotted the presidential election. Touadera is one of Russia's closest allies in Africa.",
      "url": "https://www.dw.com/en/central-african-republic-touadera-secures-third-term/a-75401315?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 6 Jan 2026 03:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany: Alcohol prices well below EU average",
      "description": "Alcohol is cheaper in Germany than many other EU countries, with consumption still relatively high. However, there has been a fall in the amount that people, particularly young people and men, are drinking.",
      "url": "https://www.dw.com/en/germany-alcohol-prices-well-below-eu-average/a-75401091?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 5 Jan 2026 22:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Ivory Coast control the pace as they trash Burkina Faso",
      "description": "The defending champions wasted no time to book their spot for the quarter finals, thrashing Burkina Faso 3-0 in the last of the Round of 16 games. With young blood finding the target, has manager Emerse Faé found a new recipe for success?",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20260106-afcon-2025-ivory-coast-control-the-pace-as-they-trash-burkina-faso",
      "published": "Tue, 06 Jan 2026 23:47:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Brahim Diaz tops goalscoring list at AFCON so far",
      "description": "With four goals for Morocco, Brahim Diaz is currently the best goalscorer at the Africa Cup of Nations. Beneath him is Ademola Lookman, who on top of scoring three goals for Nigeria has also provided four assists. Who could top the list at the end of the tournament?",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20260106-afcon-2025-brahim-diaz-tops-goalscoring-list-at-afcon-so-far",
      "published": "Tue, 06 Jan 2026 23:44:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Has a new tier emerged in African football?",
      "description": "With no \"surprise teams\" left in the Africa Cup of Nations, have certain countries taken football to another level on the continent? Is this a good thing for African football?",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20260106-has-a-new-tier-emerged-in-african-football",
      "published": "Tue, 06 Jan 2026 23:37:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Before returning to Venezuela US oil companies will want to be given assurances' , analyst says",
      "description": "Speaking with FRANCE 24's Sharon Gaffney, Colin Harding, a consultant on Latin America and the Caribbean and former Latin America Editor of the Independent, says that Trump's push to get US oil majors in Venezuela may encounter some resistance as companies 'will want to be given assurances about the legal framework, about security and about conditions'.",
      "url": "https://www.france24.com/en/tv-shows/a-propos/20260106-before-returning-to-venezuela-us-oil-companies-will-want-to-be-given-assurances-analyst-says",
      "published": "Tue, 06 Jan 2026 22:09:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Thank you, Trump’: video of crying Venezuelans thanking the US is AI-generated",
      "description": "A video showing emotional Venezuelans celebrating the capture of Nicolas Maduro - and thanking Donald Trump - was widely shared on social media, and even reposted by Elon Musk. The clip however, is AI generated. It joins several other false videos claiming to show joy and celebrations in Venezuela, either via dated or out of context clips. Vedika Bahl explains in Truth or Fake.",
      "url": "https://www.france24.com/en/tv-shows/truth-or-fake/20260106-thank-you-trump-video-of-crying-venezuelans-thanking-the-us-is-ai-generated",
      "published": "Tue, 06 Jan 2026 20:39:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Watch live: Leaders of Ukraine’s 'Coalition of the Willing' speak from Paris",
      "description": "No description available.",
      "url": "https://www.france24.com/en/europe/20260106-watch-live-leaders-of-ukraine-s-coalition-of-the-willing-speak-from-paris",
      "published": "Tue, 06 Jan 2026 18:31:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How AI-generated images contributed to the disinformation about Maduro's capture",
      "description": "Several images said to show the capture of Venezuelan leader Nicolas Maduro have been widely circulated on social media. They are, in fact, fake and were generated by artificial intelligence. It shows how AI is contributing to the spread of disinformation, especially as AI depictions become more realistic.",
      "url": "https://www.france24.com/en/americas/20260106-ai-generated-images-contributed-disinformation-spreading-maduro-capture",
      "published": "Tue, 06 Jan 2026 18:18:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US prepared to take Greenland by force, White House suggests",
      "description": "Using the military to take Greenland is \"always an option\" the White House says, amid mounting tension over Donald Trump's plans for the territory.",
      "url": "https://news.sky.com/story/military-action-in-greenland-always-an-option-says-white-house-13491330",
      "published": "Tue, 06 Jan 2026 22:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump announces 'high quality' oil deal with Venezuela",
      "description": "Donald Trump has announced Venezuela's interim government will be \"turning over\" between 30 and 50 million barrels of \"high quality\" oil to the US.",
      "url": "https://news.sky.com/story/trump-announces-high-quality-oil-deal-with-venezuela-13491348",
      "published": "Wed, 07 Jan 2026 01:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope closes 2025 Holy Year and signals his pontificate can now begin in earnest",
      "description": "Pope Leo XIV has closed the Vatican’s 2025 Holy Year, denouncing consumerism and anti-foreigner sentiment",
      "url": "https://abcnews.go.com/International/wireStory/pope-closes-2025-holy-year-signals-pontificate-now-128937390",
      "published": "Tue, 06 Jan 2026 08:17:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European leaders push back on Trump's comments about a US takeover of Greenland",
      "description": "Several European leaders have pushed back on U.S. President Donald Trump’s comments seeking an American takeover of Greenland",
      "url": "https://abcnews.go.com/International/wireStory/european-leaders-push-back-trumps-comments-us-takeover-128940089",
      "published": "Tue, 06 Jan 2026 08:17:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Progress for Ukraine talks in Paris is uncertain with US focus on Venezuela and Greenland tension",
      "description": "Ukraine's allies are meeting in Paris to discuss security guarantees after any potential peace deal with Russia",
      "url": "https://abcnews.go.com/International/wireStory/progress-ukraine-talks-paris-uncertain-us-focus-shifting-128935236",
      "published": "Tue, 06 Jan 2026 08:17:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Provisional election results show Central Africa Republic President Faustin Archange Touadéra won a third term",
      "description": "Provisional election results show Central Africa Republic President Faustin Archange Touadéra won a third term",
      "url": "https://abcnews.go.com/International/wireStory/provisional-election-results-show-central-africa-republic-president-128930514",
      "published": "Mon, 05 Jan 2026 20:17:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Indonesia's panda cub Rio thriving 40 days after birth",
      "description": "Indonesia’s conservation park has shared a video of a giant panda cub named Rio, 40 days after his birth",
      "url": "https://abcnews.go.com/International/wireStory/indonesias-panda-cub-rio-thriving-40-days-after-128941638",
      "published": "Tue, 06 Jan 2026 08:21:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Slovenia will hold parliamentary election on March 22",
      "description": "Slovenia's president has set a parliamentary election for March 22",
      "url": "https://abcnews.go.com/International/wireStory/slovenia-hold-parliamentary-election-march-22-128939631",
      "published": "Tue, 06 Jan 2026 07:05:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China bans exports to Japan of dual-use goods that could enhance Tokyo's power",
      "description": "China has banned exports to Japan of dual-use goods for military purposes",
      "url": "https://abcnews.go.com/International/wireStory/china-bans-exports-japan-dual-goods-enhance-tokyos-128937954",
      "published": "Tue, 06 Jan 2026 05:45:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Central African Republic President Faustin Archange Touadéra reelected, provisional results show",
      "description": "Provisional results have shown Central African Republic President Faustin Archange Touadéra won a third term in last month’s election",
      "url": "https://abcnews.go.com/International/wireStory/central-africa-republic-president-faustin-archange-touadra-reelected-128931037",
      "published": "Tue, 06 Jan 2026 07:53:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New deadly clashes between Syrian forces and Kurdish fighters erupt in Aleppo",
      "description": "Renewed clashes have erupted between Syrian government forces and Kurdish fighters in Aleppo",
      "url": "https://abcnews.go.com/International/wireStory/new-deadly-clashes-syrian-forces-kurdish-fighters-erupt-128942255",
      "published": "Tue, 06 Jan 2026 12:17:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finland's battle against fake news starts in preschool classrooms",
      "description": "Finland has been fighting fake news by teaching media literacy to children as young as 3",
      "url": "https://abcnews.go.com/International/wireStory/finlands-battle-fake-news-starts-preschool-classrooms-128902330",
      "published": "Mon, 05 Jan 2026 13:45:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza: 100 per cent of basic food needs met for first time since 2023",
      "description": "For the first time since 2023, humanitarian assistance will provide Gazans with enough food to fulfil minimum nutritional needs.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166704",
      "published": "Mon, 05 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN chief condemns Israeli amendments targeting UNRWA operations",
      "description": "The UN Secretary-General has condemned amendments adopted by Israel’s Knesset to a law aimed at ceasing the operations of the UN agency assisting Palestine refugees (UNRWA), saying the measures must be immediately repealed.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166691",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Reagan, elder son of former President Ronald Reagan, dies at 80",
      "description": "Conservative author and radio host Michael Reagan, who promoted his father Ronald Reagan's legacy through the Reagan Foundation, has died at age 80.",
      "url": "https://www.foxnews.com/us/michael-reagan-eldest-son-former-president-ronald-reagan-dies-80",
      "published": "Tue, 06 Jan 2026 18:05:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Harvard dean removed after anti-White, anti-police social media posts resurfaced",
      "description": "Gregory Davis, former Harvard Dunster House dean, no longer serves in role following revelation of posts calling police \"racist and evil\" and defending looting as democracy.",
      "url": "https://www.foxnews.com/us/harvard-dean-removed-after-anti-white-anti-police-social-media-posts-resurfaced",
      "published": "Tue, 06 Jan 2026 14:30:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ICE launches 'largest immigration operation ever' in Minneapolis, acting director says",
      "description": "Acting ICE director says agency conducting \"largest immigration operation ever\" in Minneapolis, targeting fraud and criminal illegal aliens in DHS crackdown.",
      "url": "https://www.foxnews.com/us/ice-launches-largest-immigration-operation-ever-minneapolis-acting-director-says",
      "published": "Tue, 06 Jan 2026 13:34:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Frantic 911 calls detail moments before Columbus dentist and wife found dead: 'There's a body'",
      "description": "Frantic 911 calls reveal moments before Columbus dentist Spencer Tepe and wife Monique were found dead with gunshot wounds, two children unharmed.",
      "url": "https://www.foxnews.com/us/frantic-911-calls-detail-moments-before-columbus-dentist-wife-found-dead-theres-body",
      "published": "Tue, 06 Jan 2026 09:00:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Seattle leaders slammed for police order to stop prosecuting drug users",
      "description": "Seattle's new mayor faces growing backlash over drug enforcement approach as internal police email reveals most possession cases diverted from prosecution.",
      "url": "https://www.foxnews.com/us/seattle-leaders-slammed-police-order-stop-prosecuting-drug-users",
      "published": "Tue, 06 Jan 2026 08:00:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AG Bondi says 'nothing is off the table' as dictator Maduro, wife appear in court and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/ag-bondi-says-nothing-off-table-dictator-maduro-wife-appear-court-more-top-headlines",
      "published": "Tue, 06 Jan 2026 06:53:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro's son gives 'unconditional support' to newly sworn in interim Venezuela president",
      "description": "Nicolás Maduro's son pledges continued support to interim President Delcy Rodríguez after his father's capture by U.S. forces and extradition to New York.",
      "url": "https://www.foxnews.com/world/maduros-son-gives-unconditional-support-newly-sworn-interim-venezuela-president",
      "published": "Tue, 06 Jan 2026 08:20:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nobel Peace Prize recipient Machado pledges to return to Venezuela, sees 'alarming' internal crackdown",
      "description": "Venezuelan opposition leader Maria Corina Machado vows to return home as regime allegedly escalates widespread crackdown on dissent and journalists.",
      "url": "https://www.foxnews.com/world/nobel-peace-prize-recipient-machado-pledges-return-venezuela-sees-alarming-internal-crackdown",
      "published": "Tue, 06 Jan 2026 07:21:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}