{
  "last_updated": "2025-12-22T10:24:45.830102Z",
  "event_count": 223,
  "events": [
    {
      "title": "South Africa: At least 9 killed, 10 wounded in shooting",
      "description": "In South Africa, at least 9 people have died and 10 others injured after a group of gunmen carried out a shooting at a pub in the early hours on Sunday, according to authorities. The shooting comes after at least 11 people, including a child were shot dead at a hostel near Pretoria earlier this month. The country has one of the highest murder rates in the world, with firearms the leading cause of death in homicides. Rachael Griffiths has more.",
      "url": "https://www.france24.com/en/video/20251221-south-africa-at-least-9-killed-10-wounded-in-shooting",
      "published": "Sun, 21 Dec 2025 16:28:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 56,
      "severity_level": "Critical"
    },
    {
      "title": "Fundraiser for 'Australian hero' who disarmed terrorist during Bondi Beach mass shooting surpasses $2.6M",
      "description": "Australian hero who tackled Bondi Beach gunman receives $2.6M in donations in response to brave actions during deadly attack that left him wounded but praised globally.",
      "url": "https://www.foxnews.com/world/fundraiser-australian-hero-disarmed-terrorist-bondi-beach-mass-shooting-surpasses-2-6m",
      "published": "Sun, 21 Dec 2025 04:42:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 50,
      "severity_level": "Critical"
    },
    {
      "title": "Jeju Air crash: South Korea sets up independent inquiry into disaster that killed 179 amid delays and acrimony",
      "description": "MPs vote to investigate crash amid accusations from victims’ relatives of cover-ups and delays South Korea’s parliament has launched an independent inquiry into the deadliest air disaster on its soil amid accusations of investigation delays and cover-ups of last year’s Jeju Air crash. On 29 December 2024 all but two of the 181 people onboard a Jeju Air Boeing 737-800 died when it crashed at Muan international airport, 288km south of Seoul, after reporting a bird strike during landing. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/jeju-air-crash-independent-inquiry-south-korea",
      "published": "Mon, 22 Dec 2025 06:33:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "At least four people killed in mass stabbing in Taipei",
      "description": "Man, 27, from northern Taiwan reported to have fallen to his death in police chase after rampage through capital At least four people have died in a rare mass stabbing incident in central Taipei after an attacker used smoke grenades to cause chaos as he went on a violent rampage through Taiwan’s capital. Several people were also injured. The suspected assailant is among the dead after he fell from a building during a police chase through a busy shopping district on Friday evening. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/mass-stabbing-tapei",
      "published": "Fri, 19 Dec 2025 16:32:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Protesters outside Sydney’s town hall chant phrase that NSW premier wants to ban – as it happened",
      "description": "This blog is now closed Police allege Bondi shooters had ‘tennis ball bomb’ and made IS-inspired video manifesto, court documents reveal Get our breaking news email , free app or daily news podcast Albanese orders review of AFP and Asio processes in lead-up to Bondi attack While he has resisted calls for a federal royal commission, the prime minister, Anthony Albanese, has announced a major review into intelligence and law enforcement processes in the lead-up to the Bondi beach attack. We need our police around Bondi and Sydney’s east at the moment. People, again, should feel free to express their opinions – they can do it in an ongoing fashion after that terrorist designation. I would like to see a royal commission. I’d like to see that led by the commonwealth. New South Wales can’t go it alone in this. Terrorism doesn’t know borders. So, yes, I support a royal commission. We need understand exactly what happened – not just on the day, not just in the weeks and months leading up to it, but the broader buildup – what has contributed. Australia needs answers on what was the root cause of this terrible attack and what we can do to ensure that we never see this on our beaches, on our cities and our soil again. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2025/dec/22/australia-news-live-bondi-beach-terror-attack-chris-minns-nsw-gun-reforms-anthony-albanese-coalition-sussan-ley-antisemitism-royal-commission-ntwnfb",
      "published": "Mon, 22 Dec 2025 08:14:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "Australian state weighs ban on 'globalize the intifada' chants, masked protesters in wake of Hanukkah attack",
      "description": "Australia's New South Wales is proposing a ban on \"globalize the intifada\" chants after 15 people were killed in the ISIS-inspired Bondi Beach Hanukkah shooting.",
      "url": "https://www.foxnews.com/world/australian-state-weighs-ban-globalize-intifada-chants-masked-protesters-wake-hanukkah-attack",
      "published": "Sat, 20 Dec 2025 13:32:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Victoria to follow NSW in giving police new powers to stop protests in wake of Bondi terror attack",
      "description": "Police with semi-automatic rifles will be deployed at Boxing Day Test but commissioner says this move is not based on a ‘specific new threat’ Get our breaking news email , free app or daily news podcast Victoria’s police chief will be given sweeping powers to shut down or move on protests in the aftermath of terrorist events, while officers carrying rifles will be deployed to the Boxing Day Test following the Bondi terror attack. Jacinta Allan on Monday announced Victoria will follow New South Wales by introducing legislation to parliament next year granting the police commissioner the power to “stop or move on a public protest within a certain time following a designated terrorist event”. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/22/victoria-police-boxing-day-test-protest-laws-bondi-terror-attack",
      "published": "Mon, 22 Dec 2025 05:54:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Former Australian minister says ‘radical Islam pulled the trigger’ in nation's worst terror attack",
      "description": "Josh Frydenberg slams Anthony Albanese's government over rising antisemitic violence in Australia, warning years of inaction enabled extremism to flourish.",
      "url": "https://www.foxnews.com/world/former-australian-minister-says-radical-islam-pulled-trigger-australias-worst-terror-attack",
      "published": "Sat, 20 Dec 2025 16:38:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Japan set to restart world’s biggest nuclear power plant",
      "description": "Kashiwazaki-Kariwa will be latest plant to restart 15 years after Fukushima disaster shut down country's nuclear energy.",
      "url": "https://www.aljazeera.com/news/2025/12/22/japan-set-to-restart-worlds-biggest-nuclear-power-plant?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 08:02:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "9 killed, 10 wounded in South African pub shooting",
      "description": "Authorities report that nine people have died and at least 10 others are injured after a shooting at a South African pub. The incident occurred early Sunday in Bekkersdal, west of Johannesburg.",
      "url": "https://www.npr.org/2025/12/21/g-s1-103241/9-killed-10-wounded-in-south-african-pub-shooting",
      "published": "Sun, 21 Dec 2025 05:57:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "At least 9 killed, 10 wounded in South African pub shooting",
      "description": "Authorities report that nine people have died and at least 10 others are injured after a shooting at a South African pub",
      "url": "https://abcnews.go.com/International/wireStory/9-killed-10-wounded-south-african-pub-shooting-128593602",
      "published": "Sun, 21 Dec 2025 03:49:02 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: More UN staff detentions in Yemen, peacekeepers killed in Sudan sent home, attacks in Ukraine",
      "description": "The UN Secretary-General on Friday condemned the arbitrary detention of 10 more UN personnel by Houthi de facto authorities in Yemen, warning that the growing crackdown is crippling humanitarian operations and putting millions of lives at risk.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166644",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: UN to evacuate Kadugli base in Sudan, celebrating migrant contributions, ending colonialism",
      "description": "The United Nations Interim Security Force for Abyei (UNISFA) will evacuate its logistics base in Kadugli, Sudan, in the wake of the “heinous attack” this past weekend that killed six Bangladeshi peacekeepers and seriously injured eight others.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166631",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Coalition attacks Penny Wong for not shedding ‘a single tear’ after Bondi shooting, says ‘multicultural nirvana’ has failed",
      "description": "Coalition MPs also, without evidence, link government’s decision to recognise Palestinian state to Bondi terror attack at extraordinary press conference Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Sussan Ley and other senior Coalition politicians have linked the Labor government’s recognition of Palestine to the antisemitic Bondi terror attack and attacked Penny Wong for not shedding tears in public at an extraordinary press conference on Monday. The spray from Coalition MPs came amid growing demands for prime minister Anthony Albanese to call a royal commission into the Bondi attack, with criticism from the Coalition, Jewish groups and even some Labor MPs that the government’s review of the intelligence community is too narrow. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/22/coalition-attacks-penny-wong-bondi-beach-shooting-terror-attack-sussan-ley-press-conference-ntwnfb",
      "published": "Mon, 22 Dec 2025 06:07:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "ISIS, Iran escalating global campaign against Jews, Israel spy chief says",
      "description": "Mossad Director David Barnea said Israel will pursue the Bondi attackers and those who sent them, warning Iran and ISIS are accelerating global plots against Jews.",
      "url": "https://www.foxnews.com/world/isis-iran-escalating-global-campaign-against-jews-israel-spy-chief-says",
      "published": "Sun, 21 Dec 2025 13:04:30 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Bondi Beach shooting suspects conducted 'tactical' training in Australian countryside, police say",
      "description": "The two suspects behind the Bondi Beach shooting reportedly conducted \"firearms training\" in rural New South Wales before launching their December 14 attack on a Hanukkah celebration which left 15 people dead. Prime Minister Anthony Albanese apologised to Australia's Jewish community for the nation's worst mass shooting in nearly three decades.",
      "url": "https://www.france24.com/en/live-news/20251222-alleged-bondi-shooters-conducted-tactical-training-in-countryside-australian-police-say",
      "published": "Mon, 22 Dec 2025 06:43:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan war: World urged not to ignore ‘gruesome sexual violence’",
      "description": "Harrowing new details emerged on Thursday in a UN report detailing targeted sexual violence and summary executions in Sudan’s North Darfur region, attributed to paramilitary fighters who overran the city of El Fasher in late October.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166624",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "‘Dan taught me to live for every moment’: French Bondi shooting victim, 27, honoured at Sydney memorial",
      "description": "Rabbi calls for good deeds in memory of Dan Elkayam and other victims of attack at Jewish event ‘Left an immeasurable void’: Holocaust survivors, community heroes and ‘spirited child’ among victims of Bondi terror attack Like many friendships, Jesse Singer and Dan Elkayam’s had its own rituals. “Whenever it was a sunny day, we’d message each other throughout the day to see if we could finish work as early as possible and get down to the beach to play football.” Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/22/dan-elkayam-bondi-terror-attack-victim-memorial-sydney-ntwnfb",
      "published": "Mon, 22 Dec 2025 07:42:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "A sunrise crowd gathers at Bondi Beach in solace and defiance after a massacre",
      "description": "Thousands of people have returned to Australia's Bondi Beach in the first full day of opening since a mass shooting killed 15 people",
      "url": "https://abcnews.go.com/International/wireStory/sunrise-crowd-gathers-bondi-beach-solace-defiance-after-128548303",
      "published": "Fri, 19 Dec 2025 10:03:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Russian general killed in Moscow car bombing",
      "description": "With senior Russian general Fanil Sarvarov dying in a Moscow car blast, Russia's federal investigators are looking into possible involvement of Ukrainian intelligence services.",
      "url": "https://www.dw.com/en/russian-general-killed-in-moscow-car-bombing/a-75262488?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 07:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "South Africa shooting: 'Unknown gunmen' kill 9 people",
      "description": "Gunmen are said to have opened fire in a township near Johannesburg. At least 9 are dead and several others injured, local media have reported.",
      "url": "https://www.dw.com/en/south-africa-shooting-unknown-gunmen-kill-9-people/a-75255779?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 04:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN urges calm in Bangladesh after killing of protest leader sparks unrest",
      "description": "The United Nations has urged calm in Bangladesh after the killing of a prominent youth protest leader sparked fresh unrest, raising concerns about political violence and the safety of civic space as the country prepares for elections early next year.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166642",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Civilians at risk amid escalating Thailand-Cambodia conflict: UN rights chief",
      "description": "Intensifying air strikes and heavy artillery fire across Thailand and Cambodia have left civilians increasingly at risk, UN High Commissioner for Human Rights Volker Türk warned on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166626",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "2025 in Gaza: 12 months, 12 pictures",
      "description": "Israel’s genocidal war on Gaza has killed at least 70,669 Palestinians and wounded 171,165 since October 2023.",
      "url": "https://www.aljazeera.com/gallery/2025/12/22/2025-in-gaza-12-months-12-pictures?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 09:31:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US plan for $1.6m hepatitis B vaccine study in Africa called ‘highly unethical’",
      "description": "Experts decry ‘neocolonialist’ Guinea-Bissau study after Trump administration changed advice for US babies The Trump administration has indicated that it will fund a $1.6m study on hepatitis B vaccination of newborns in the west African country of Guinea-Bissau, where nearly one in five adults live with the virus – a move that researchers call “highly unethical” and “extremely risky”. The news follows an official change in recommendations on hepatitis B vaccines at birth from the US Centers for Disease Control and Prevention (CDC), which called the shots an “individual” decision, despite decades of safe and effective vaccination and no evidence of harm. It is part of sweeping changes to childhood immunizations by the US health secretary, Robert F Kennedy Jr, which have global repercussions – including cutting funding for programs that bring vaccines to countries around the world. Continue reading...",
      "url": "https://www.theguardian.com/society/2025/dec/19/hepatitis-b-vaccine-study-guinea-bissau-rfk",
      "published": "Fri, 19 Dec 2025 16:34:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Colombian mercenaries in Sudan ‘recruited by UK-registered firms’",
      "description": "Exclusive Guardian investigation finds companies set up by people sanctioned by US hired Colombian fighters for Rapid Support Forces, widely suspected of war crimes in Sudan Close to Tottenham Hotspur’s shiny football stadium in London is a squat, nondescript block of flats. It holds a grim secret beyond the unremarkable beige brickwork – a cramped, second-floor apartment in the British capital, linked to murderous atrocities unfolding 3,000 miles south. The one-bedroom flat off north London’s Creighton Road is, according to UK government records, tied to a transnational network of companies involved in the mass recruitment of mercenaries to fight in Sudan alongside paramilitaries accused of myriad war crimes and genocide. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/19/colombian-mercenaries-sudan-rsf-us-sanctions-recruited-uk-registered-firms-investigation",
      "published": "Fri, 19 Dec 2025 06:00:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Fisherman survives near-fatal shark attack with own lifesaving care, instincts that kept him alive",
      "description": "Hawaii fisherman survives brutal shark attack after trying to help tangled predator, performs lifesaving first aid on himself in dramatic ocean rescue.",
      "url": "https://www.foxnews.com/us/fisherman-survives-near-fatal-shark-attack-own-lifesaving-care-instincts-that-kept-him-alive",
      "published": "Sun, 21 Dec 2025 14:00:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Brown University, MIT shootings: Are elite US universities prepared for targeted violence?",
      "description": "Campus shootings at Brown University and MIT linked to single suspect with ties to both elite schools. Two killed at Brown, MIT professor murdered.",
      "url": "https://www.foxnews.com/us/brown-university-mit-shootings-elite-us-universities-prepared-targeted-violence",
      "published": "Sat, 20 Dec 2025 08:00:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Australian PM Albanese gets booed during Bondi Beach vigil honoring Hanukkah attack victims",
      "description": "Prime Minister Anthony Albanese faced boos at a vigil for Bondi Beach shooting victims Sunday, as some 10,000 mourners gathered to honor those killed.",
      "url": "https://www.foxnews.com/world/australian-pm-albanese-gets-booed-during-bondi-beach-vigil-honoring-hanukkah-attack-victims",
      "published": "Sun, 21 Dec 2025 11:07:04 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Former Hamas hostage warned Australian leaders about dangers of antisemitism months before Bondi Beach attack",
      "description": "Former Hamas hostage Eli Sharabi had warned Australian leaders about rising antisemitism months before the deadly Bondi Beach Hanukkah shooting attack.",
      "url": "https://www.foxnews.com/world/former-hamas-hostage-warned-australian-leaders-about-dangers-antisemitism-months-before-bondi-beach-attack",
      "published": "Sat, 20 Dec 2025 08:16:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Sweden and Germany slash aid budgets to focus on Ukraine and defence spending",
      "description": "Echoing the dismantling of USAID, other countries are changing funding priorities and health and hunger programmes in Africa will lose out The notion of humanitarian aid being used to combat poverty and hunger is being replaced in Europe with geopolitical “games” as states redirect aid to Ukraine and to defence spending, analysts warn after recent announcements by Sweden and Germany. Earlier this year, humanitarian groups called for European donors to fill the gap as President Donald Trump dismantled the USAID programme, but instead other nations are further pulling back from their commitments around the world. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/21/sweden-and-germany-slash-aid-budgets-to-focus-on-ukraine-and-defence-spending",
      "published": "Sun, 21 Dec 2025 14:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Aid agencies warn Gaza response at breaking point as Israel urged to lift new restrictions",
      "description": "Humanitarian agencies working in the Occupied Palestinian Territory (OPT) have warned that life-saving aid operations risk collapse unless Israel immediately lifts new barriers that are blocking access and forcing international charities to shut down.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166622",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Live: Russian general dies in Moscow car bomb attack",
      "description": "A senior Russian general was killed Monday morning after an explosive device detonated underneath his car in southern Moscow, according to investigators. The possibility that the attack on Lt. Gen. Fanil Sarvarov, who led the Operational Training Directorate of the Russian Armed Forces General Staff, was \"linked\" to \"Ukrainian special forces\" was among their lines of inquiry, the investigators’ statement said. Follow our liveblog for all the latest.",
      "url": "https://www.france24.com/en/europe/20251222-live-us-ukraine-hail-productive-miami-talks-but-no-breakthrough",
      "published": "Mon, 22 Dec 2025 05:57:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "'Extremely cunning' suspect in deadly Taiwan knife attack planned it for over a year",
      "description": "Police say the suspect in a deadly knife and grenade attack that left three dead and 11 wounded in Taiwan’s capital had been meticulously planning the assault for more than a year",
      "url": "https://abcnews.go.com/International/wireStory/extremely-cunning-suspect-deadly-taiwan-knife-attack-planned-128612935",
      "published": "Mon, 22 Dec 2025 05:17:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Thousands gather as Bondi Beach reopens, commemorating victims of Hanukkah attack",
      "description": "Police reopened parts of Bondi Beach with thousands forming solidarity circle after mass shooting targeting Jewish community left 15 dead.",
      "url": "https://www.foxnews.com/world/thousands-gather-bondi-beach-reopens-commemorating-victims-hanukkah-attack",
      "published": "Fri, 19 Dec 2025 09:02:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Gunmen kill nine in South Africa tavern attack",
      "description": "A further 10 people were injured in Bekkersdal after the perpetrators opened fire and \"continued to shoot randomly\".",
      "url": "https://www.bbc.com/news/articles/c79xyxdpzrxo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 15:25:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "US intercepts second merchant vessel off coast of Venezuela in international waters",
      "description": "Vessel does not appear to be on list of US-sanctioned vessels, which would represent escalation in blockade US forces on Saturday apprehended a second merchant vessel carrying oil off the coast of Venezuela in international waters in the midst of an American blockade against the country’s oil, according to the US homeland security department. The stoppage follows the seizure by US forces of another oil tanker off Venezuela’s coast on 10 December. Both vessels were headed to Asia. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/20/us-second-merchant-vessel-venezuela",
      "published": "Sat, 20 Dec 2025 20:15:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "ASEAN meets to seek ceasefire amid Thailand-Cambodia conflict",
      "description": "Southeast Asian foreign ministers me in Malaysia to try to restore a ceasefire between Thailand and Cambodia after two weeks of fierce fighting that has killed at least 60 people and displaced more than half a million. The ministers of the Association of Southeast Asian Nations ​will seek to salvage a truce first brokered by ASEAN chair Malaysia and U.S. President Donald Trump after a previous round of ‍border clashes in July, their worst conflict in recent history. Story by Morgan Ayre.",
      "url": "https://www.france24.com/en/video/20251222-asean-meets-to-seek-ceasefire-amid-thailand-cambodia-conflict",
      "published": "Mon, 22 Dec 2025 09:40:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Bondi Beach shooting suspect trained with father before attack, police say",
      "description": "A man suspected of killing 15 people during a shooting in Bondi Beach \"conducted firearms training\" with his father before the attack on a Jewish event, Australian police have said.",
      "url": "https://news.sky.com/story/bondi-beach-shooting-suspect-trained-with-father-before-attack-police-say-13486555",
      "published": "Mon, 22 Dec 2025 04:30:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Syria’s humanitarian needs remain high despite reduced violence, UN warns",
      "description": "Humanitarian needs in Syria remain immense despite a year of reduced violence and political change, with millions still displaced, basic services strained and funding shortfalls threatening aid operations, senior UN officials said on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166629",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "On Maduro’s ‘terror island,’ Hezbollah operatives move in as tourists drift out",
      "description": "Israel's strikes on Hezbollah are driving the terror group to expand operations in Venezuela, creating new security threats closer to U.S. borders.",
      "url": "https://www.foxnews.com/world/hezbollah-shifts-operations-closer-us-border-israel-strikes-force-strategic-retreat-venezuela",
      "published": "Sat, 20 Dec 2025 07:00:21 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "'I knew something was seriously wrong - again': Bondi area reels from two deadly attacks in two years",
      "description": "The Bondi shooting, and a deadly stabbing attack just last year, have left scores scarred and traumatised.",
      "url": "https://www.bbc.com/news/articles/cn8eknv7zkyo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 22:18:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Russian general killed in car bombing in Moscow",
      "description": "A Russian general was killed in Moscow on Monday when an explosive device detonated underneath his car.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/22/russian-general-killed-in-car-bombing-in-moscow?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 09:39:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Bondi Beach terror attack: Australia holds Day of Reflection",
      "description": "Australia fell silent on Sunday exactly one week after an antisemitic attack at Sydney's Bondi Beach.",
      "url": "https://www.dw.com/en/bondi-beach-terror-attack-australia-holds-day-of-reflection/a-75255713?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 02:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Minute's silence for Bondi Beach terror attack victims - as anger directed at Australian PM",
      "description": "Australia's prime minister was met with boos and insults when he arrived at a Bondi Beach vigil for victims of last week's gun attack.",
      "url": "https://news.sky.com/story/australian-pm-booed-at-bondi-beach-vigil-a-week-after-deadly-gun-attack-13486282",
      "published": "Sun, 21 Dec 2025 07:56:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Israeli diaspora minister says Australia should have seen 'writing on the wall' before terror attack",
      "description": "Israel’s Amichai Chikli said Australian officials overlooked rising antisemitism and extremist rhetoric ahead of the Bondi Beach Hanukkah attack, criticizing the focus on gun laws.",
      "url": "https://www.foxnews.com/world/israeli-diaspora-minister-australia-writing-wall-terror-attack",
      "published": "Sun, 21 Dec 2025 15:20:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "A radio station in Amsterdam is a lifeline for Sudan. After USAID cuts, it's faltering",
      "description": "Budget cuts threaten the future of Amsterdam-based Radio Dabanga, which has served as an information lifeline for Sudanese people about their war-torn country.",
      "url": "https://www.npr.org/2025/12/21/nx-s1-5616684/amsterdam-sudan-radio-usaid",
      "published": "Sun, 21 Dec 2025 06:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Calming the mind and promoting global peace on World Meditation Day",
      "description": "Meditation, which has its roots in religious, yogic and secular traditions from various civilisations, calls for living in the present moment.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166641",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran killing spree continues as regime sets new record for 2025 executions, dissident group says",
      "description": "Human rights crisis deepens as Iran's execution spree reportedly reaches unprecedented levels with over 2,000 prisoners killed so far this year by the Tehran regime.",
      "url": "https://www.foxnews.com/world/iran-killing-spree-continues-regime-sets-new-record-2025-executions-dissident-group-says",
      "published": "Fri, 19 Dec 2025 12:12:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Africa Cup of Nations kicks off in Morocco",
      "description": "The African Cup of nations opens in Rabat tonight with a match between the host country Morocco and the Comoros. It's a crucial event for the country, which is hoping to cement its status as a football superpower. The tournament will allow Morocco to show off infrastructure investments it is making ahead of the 2030 World Cup. The competition is hotly anticipated by Morocco fans - with the host team widely regarded as the favorite to win the African title. France24 Sport journalist Selina Sykes reports the latest from Rabat.",
      "url": "https://www.france24.com/en/video/20251221-africa-cup-of-nations-kicks-off-in-morocco",
      "published": "Sun, 21 Dec 2025 16:32:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Bondi gunmen 'meticulously' planned attack for months, police allege",
      "description": "Police release a tranche of documents allegedly tracing the suspects' movements prior to the deadly shooting.",
      "url": "https://www.bbc.com/news/articles/ce86l95gx5po?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 09:41:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Thailand, Cambodia agree to talks in bid to end deadly conflict - minister",
      "description": "At least 41 people have been killed and nearly one million others displaced on both sides, officials said.",
      "url": "https://www.bbc.com/news/articles/c5ydej888n9o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 09:17:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia-Ukraine war live: Moscow probes Kyiv link after bomb kills general",
      "description": "Investigators pursue various lines of inquiry, including possibility attack was 'linked' to 'Ukrainian special forces'.",
      "url": "https://www.aljazeera.com/news/liveblog/2025/12/22/russia-ukraine-war-live-moscow-probes-kyiv-link-after-bomb-kills-general?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 08:45:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump and top aides refuse to rule out war with Venezuela",
      "description": "President Nicolás Maduro orders Venezuelan navy to escort oil tankers after seizure by US forces What action is Trump taking against Venezuela’s oil industry? Donald Trump and his top advisers have refused to rule out the potential for open conflict with Venezuela as Nicolás Maduro urged his navy to escort oil tankers defying the largest US fleet deployed in the region in decades. In an interview broadcast on Friday morning, Donald Trump told NBC News that going to war with Maduro’s regime remains on the table. “I don’t rule it out, no,” he said in a phone interview with the network. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/19/trump-venezuela-war",
      "published": "Fri, 19 Dec 2025 19:12:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Australians honor victims one week after Bondi Beach shooting",
      "description": "A week after a deadly mass shooting, Australia marks an official day of reflection to honor the 15 people killed by gunmen.",
      "url": "https://www.npr.org/2025/12/21/nx-s1-5647703/australians-honor-victims-one-week-after-bondi-beach-shooting",
      "published": "Sun, 21 Dec 2025 08:10:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Nigeria says 130 abducted schoolchildren freed after mass kidnapping",
      "description": "Nigerian authorities said Sunday they have secured the release of 130 schoolchildren abducted from a Catholic boarding school in Niger state, bringing the total freed to more than 200 after a mass kidnapping in November. The announcement follows weeks of uncertainty over the fate of students taken by gunmen and renewed concern over Nigeria’s worsening kidnap-for-ransom crisis.",
      "url": "https://www.france24.com/en/africa/20251222-nigeria-says-130-abducted-schoolchildren-freed-after-mass-kidnapping",
      "published": "Mon, 22 Dec 2025 02:10:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sudan war: Kordofan’s El-Obeid ‘one or two steps’ away from being attacked",
      "description": "As fighting escalates in Sudan, “people are scared, people are fleeing their homes”, the UN migration agency, IOM, said on Friday, noting that more than 50,000 people have been uprooted since late October in the Kordofans region alone.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166633",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Former classmate says suspect in Brown, MIT killings was ‘socially awkward’ and ‘angry’ during college years",
      "description": "Shocking details emerge about suspect in Brown University shooting and MIT professor killing as former friend speaks about troubling behavior.",
      "url": "https://www.foxnews.com/us/former-classmate-says-suspect-brown-mit-killings-socially-awkward-angry-during-college-years",
      "published": "Sun, 21 Dec 2025 20:55:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Cruise ship chaos mounts as deaths, crimes on board shatter illusions of safety at sea, experts warn",
      "description": "Cruise ship crimes expose legal loopholes in maritime law. From Amy Bradley's disappearance to recent deaths, experts reveal why ships become crime hotbeds.",
      "url": "https://www.foxnews.com/us/cruise-ship-chaos-mounts-deaths-crimes-on-board-shatter-illusions-safety-sea-experts-warn",
      "published": "Sat, 20 Dec 2025 16:00:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Luigi Mangione lawyers renew bid to toss death penalty charge, alleging Pam Bondi has a conflict of interest",
      "description": "Luigi Mangione's defense lawyers claim Pam Bondi has conflict of interest in death penalty case due to her former UnitedHealth Group lobbying ties in 2025.",
      "url": "https://www.foxnews.com/us/luigi-mangione-lawyers-renew-bid-toss-death-penalty-charge-alleging-pam-bondi-conflict-interest",
      "published": "Sat, 20 Dec 2025 08:59:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Putin says Russia won't launch new attacks on other countries 'if you treat us with respect'",
      "description": "Russian President Vladimir Putin said Moscow won't attack other nations if its treated \"with respect\" and claimed he is \"ready and willing\" to end the Ukraine war \"peacefully.\"",
      "url": "https://www.foxnews.com/world/putin-says-russia-launch-new-attacks-other-countries-if-you-treat-us-with-respect",
      "published": "Fri, 19 Dec 2025 19:57:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "How Israel's grassroots hostage families group became a powerful international force",
      "description": "With just one hostage left in Gaza, members of the forum reflect on its influence in Israel and abroad.",
      "url": "https://www.bbc.com/news/articles/cm20ppy0rreo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 06:05:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "US accused of stealing oil after intercepting third Venezuelan tanker",
      "description": "The US is pursuing a third oil tanker in international waters off the coast of Venezuela.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/22/us-accused-of-stealing-oil-after-intercepting-third-venezuelan-tanker?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 08:58:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Israel approves new settlements in occupied West Bank",
      "description": "The number of settlements in the occupied West Bank rose by almost 50% under the current far-right Israeli government. The settlements are considered illegal under international law.",
      "url": "https://www.dw.com/en/israel-approves-new-settlements-in-occupied-west-bank/a-75257753?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 12:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela: US Coast Guard intercepts third tanker in two weeks",
      "description": "US officials say the national ⁠Coast Guard is pursuing an oil tanker in international waters near Venezuela, in what would be the second such operation this weekend and the third in less than two weeks if successful. Story by Ellen Gainsford.",
      "url": "https://www.france24.com/en/video/20251222-venezuela-us-coast-guard-intercepts-third-tanker-in-two-weeks",
      "published": "Mon, 22 Dec 2025 09:41:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Santas and elves rob Montreal grocery store to ‘give food to the needy’",
      "description": "Group called Robins des Ruelles later said in statement stunt was intended to highlight cost of living crisis Dressed in red suits and backed by masked elves, a group of Santas marched into a Montreal supermarket, loaded their bags with thousands of dollars worth of groceries and disappeared into the night. The bandit Santas later released a statement saying the food would be distributed to the needy, and saying the Robin Hood-style stunt was intended to highlight the spiralling cost of living crisis that has pushed basic necessities increasingly out of reach for ordinary Canadians. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/montreal-grocery-store-santas-elves-robbery",
      "published": "Fri, 19 Dec 2025 17:06:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Saudi Arabia awards Pakistan's powerful army chief highest national honor after defense pact",
      "description": "Pakistan's military says Saudi Arabia has awarded its highest national honor to Pakistan’s powerful army chief, Field Marshal Asim Munir, during his visit to Riyadh, underscoring deepening ties between the two countries, including cooperation on defens...",
      "url": "https://abcnews.go.com/International/wireStory/saudi-arabia-awards-pakistans-powerful-army-chief-highest-128613025",
      "published": "Mon, 22 Dec 2025 04:33:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Manhunt underway in South Africa after gunmen open fire at tavern, killing 9 and wounding 10",
      "description": "Manhunt underway after masked gunmen kill nine people at South African tavern in Bekkersdal township. At least 10 others hospitalized in the attack.",
      "url": "https://www.foxnews.com/world/manhunt-underway-south-africa-after-gunmen-open-fire-tavern-killing-wounding",
      "published": "Sun, 21 Dec 2025 09:54:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "TikTok signs Trump-backed deal to avoid US ban",
      "description": "Joint venture will take over part of app’s US operations, including data protection, algorithm security and content moderation Business live – latest updates US politics live – latest updates TikTok has reached a deal to form a joint venture that will allow it to continue operating in the US, five years after Donald Trump threatened to ban the social media platform over privacy and national security concerns, a move that further strained relations with China. ByteDance, TikTok’s Chinese owner, has signed a deal with Larry Ellison’s Oracle, the private-equity group Silver Lake and Abu Dhabi’s MGX that will allow it to retain control of its core US operations. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/18/tiktok-signs-deal-us-entity-sale",
      "published": "Fri, 19 Dec 2025 11:31:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "News outlet informing Sudanese about war faces foreign aid cuts",
      "description": "Budget cuts threaten the future of an Amsterdam-based journalism outlet informing people in Sudan about war, genocide, and how to survive.",
      "url": "https://www.npr.org/2025/12/21/nx-s1-5600731/news-outlet-informing-sudanese-about-war-faces-foreign-aid-cuts",
      "published": "Sun, 21 Dec 2025 08:10:23 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Germany: 1,600 asylum requests by people rejected at border",
      "description": "The German government said hundreds of people turned away at the border later applied for asylum. Meanwhile, Berlin's mayor is warning New Year's Eve's trouble makers. DW has the latest.",
      "url": "https://www.dw.com/en/germany-1-600-asylum-requests-by-people-rejected-at-border/live-75251407?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 09:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "A night out on the town during Nigeria's 'Detty December'",
      "description": "The first winds of west Africa's Harmattan dry season are in the air, and Lagos, the economic capital of the continent's most populous country, is abuzz.",
      "url": "https://www.france24.com/en/live-news/20251222-a-night-out-on-the-town-during-nigeria-s-detty-december",
      "published": "Mon, 22 Dec 2025 02:21:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand and Cambodia to resume ceasefire talks after deadly border clashes",
      "description": "Thailand’s foreign minister says Thailand and Cambodia will resume talks to work toward a more durable ceasefire along their border",
      "url": "https://abcnews.go.com/International/wireStory/thailand-cambodia-resume-ceasefire-talks-after-deadly-border-128610230",
      "published": "Mon, 22 Dec 2025 04:09:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Bondi Beach shooting suspect conducted firearms training with his father, police say",
      "description": "A man accused of killing 15 people at Sydney’s Bondi Beach allegedly conducted firearms training with his father",
      "url": "https://abcnews.go.com/International/wireStory/bondi-beach-shooting-suspect-conducted-firearms-training-father-128610473",
      "published": "Mon, 22 Dec 2025 02:16:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "At UN, nations pledge people-first digital future, tighter AI safeguards",
      "description": "UN Member States on Wednesday pledged to narrow widening digital divides and put stronger safeguards around artificial intelligence (AI), as the General Assembly concluded a major review of how the world manages the Internet and fast-evolving digital technologies.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166623",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Man rushed to hospital in apparent self-inflicted shooting at Atlanta airport",
      "description": "Man suffers apparent self-inflicted gunshot wound at Atlanta's Hartsfield-Jackson Airport near baggage claim. Victim hospitalized, alert and conscious.",
      "url": "https://www.foxnews.com/us/man-rushed-hospital-apparent-self-inflicted-shooting-atlanta-airport",
      "published": "Sun, 21 Dec 2025 19:31:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Several elephants killed in train crash after impact causes multiple coaches to derail",
      "description": "A high-speed passenger train struck an elephant herd in northeastern India, killing seven wild animals while all 650 passengers escape unharmed.",
      "url": "https://www.foxnews.com/world/several-elephants-killed-train-collision-impact-causes-multiple-coaches-derail",
      "published": "Sat, 20 Dec 2025 17:26:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Man jailed for 1,335 years as El Salvador sentences almost 250 MS-13 gang members",
      "description": "Attorney general’s office also says 10 people received prison terms from 463 to 958 years amid crackdown on gangs under state of emergency El Salvador has announced prison sentences for hundreds of gang members, with some of the convicted receiving terms of hundreds of years. The attorney general’s office posted on X that 248 members of the notorious Mara Salvatrucha (MS-13) street gang had received “exemplary sentences” for 43 homicides and 42 disappearances, among other crimes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/man-jailed-1335-years-el-salvador-sentences-ms-13-gang-members",
      "published": "Mon, 22 Dec 2025 04:29:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Settlements, hotels and farms flooded in Kenya’s Rift Valley",
      "description": "Dickson Ngome's farm at Lake Naivasha in Kenya's Rift Valley has been submerged due to rising water levels",
      "url": "https://abcnews.go.com/International/wireStory/water-settlements-hotels-farms-flooded-kenyas-rift-valley-128609598",
      "published": "Mon, 22 Dec 2025 02:13:12 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Fifty days on, Jamaica struggles to rebuild after Hurricane Melissa’s unprecedented destruction",
      "description": "Fifty days have passed since Hurricane Melissa ravaged Jamaica, leaving behind an unprecedented trail of destruction.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166621",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Progress on hunger in Asia-Pacific, key Gaza pipeline repaired, flu hits Europe hard",
      "description": "While the Asia and Pacific region has made notable progress in reducing hunger, persistent challenges remain in addressing malnutrition, food insecurity and unequal access to healthy diets, a new UN report published on Wednesday concludes.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166620",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Canadian police expose alleged ISIS conspirator in plot against Jews, women's attempted kidnappings",
      "description": "Canadian police say Waleed Khan faces terrorism charges for allegedly conspiring with ISIS and committing hate crimes targeting Jewish community in Toronto.",
      "url": "https://www.foxnews.com/world/canadian-police-expose-alleged-isis-conspirator-plot-jews-womens-attempted-kidnappings",
      "published": "Fri, 19 Dec 2025 15:02:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Yale professor’s father charged in mother’s decades-old murder, says he ‘used me as bait’: report",
      "description": "Daughter reveals she feared father 'used me as bait' to lure mother to her death in 1982. Yale professor breaks silence on father's murder arrest.",
      "url": "https://www.foxnews.com/us/yale-professors-father-charged-mothers-decades-old-murder-says-he-used-me-bait-report",
      "published": "Sun, 21 Dec 2025 16:00:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Australia vows to strengthen hate speech laws, gun control in wake of Bondi Beach attack",
      "description": "Australia proposes new hate speech laws and gun buyback program after Bondi Beach attack, sparking a heated debate over the government's response.",
      "url": "https://www.foxnews.com/world/australia-vows-strengthen-hate-speech-laws-gun-control-wake-bondi-beach-attack",
      "published": "Sun, 21 Dec 2025 08:01:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Australian authorities release 7 men detained over possible violent plot in wake of Bondi Beach shooting",
      "description": "Seven men who were arrested due to concerns that they were planning a \"violent act\" were released. The arrests came days after the shooting at Bondi Beach.",
      "url": "https://www.foxnews.com/world/australian-authorities-release-7-men-detained-over-possible-violent-plot-wake-bondi-beach-shooting",
      "published": "Fri, 19 Dec 2025 10:00:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Putin claims 'troops are advancing,' will achieve goals as EU approves massive Ukraine loan",
      "description": "As the war between Russia and Ukraine persists, Russian President Vladimir Putin said his nation's \"troops are advancing,\" The Associated Press reported.",
      "url": "https://www.foxnews.com/world/putin-claims-troops-advancing-achieve-goals-eu-approves-massive-ukraine-loan",
      "published": "Fri, 19 Dec 2025 08:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Manchester Museum seeks help to uncover hidden histories of African collection",
      "description": "New Africa Hub confronts colonial-era silences by asking visitors to share insights on 40,000 objects It’s a rare thing for a museum to talk about what it doesn’t know. But unanswered questions and archival silences are at the heart of the new Africa Hub at Manchester Museum, north-west England, which is inviting people around the world to help fill the gaps. The museum holds more than 40,000 items from across Africa, many of which were traded, collected, looted or preserved during the era of the British empire. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2025/dec/21/manchester-museum-uncover-hidden-histories-africa-hub",
      "published": "Sun, 21 Dec 2025 15:00:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "‘Slightly haunted but manageable’: new signs cause confusion – and delight – in Christchurch",
      "description": "Six absurdist signs resembling official city council information boards have popped up across New Zealand’s second-largest city Outside an abandoned building in New Zealand’s second-biggest city, a sign reads “slightly haunted but manageable”. In the middle of a busy shopping strip, pedestrians are warned to keep to a 2.83km/h walking speed. In another part of Christchurch, one piece of signage declares simply “don’t”. The baffling boards are not an overzealous new council initiative, but a piece of art designed to “play with the way we take authority and signage so seriously”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/new-zealand-christchurch-spoof-absurdist-road-signs",
      "published": "Mon, 22 Dec 2025 02:28:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Pope Leo summons cardinals for a key assembly to help him govern Catholic Church",
      "description": "Pope Leo XIV has summoned the world's cardinals for two days of meetings to help him govern the church, in the clearest sign yet that the new year will signal the unofficial start of his pontificate.",
      "url": "https://www.npr.org/2025/12/20/nx-s1-5650788/pope-leo-summons-cardinals-meeting-consistory",
      "published": "Sat, 20 Dec 2025 15:24:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Indonesians set to face cement giant Holcim in Swiss court",
      "description": "The landmark climate case by four residents of Indonesia's Pari Island against one of the world's largest cement producers has cleared a major hurdle.",
      "url": "https://www.dw.com/en/indonesians-set-to-face-cement-giant-holcim-in-swiss-court/a-75262039?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 08:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Morocco wins AFCON opener over Comoros, fans and royalty applaud",
      "description": "A spectacular bicycle kick earned royal approval for Ayoub El Kaabi as host Morocco opened the 35th Africa Cup of Nations with a 2-0 win over Comoros on Sunday. Home fans including Moroccan Crown Prince Moulay Hassan, who greeted the players before kickoff, had endured a frustrating game as island nation Comoros, ranked 108th in the world, stubbornly held out against one of the tournament favorites. Story by Caroline Baum.",
      "url": "https://www.france24.com/en/video/20251222-morocco-wins-afcon-opener-over-comoros-fans-and-royalty-applaud",
      "published": "Mon, 22 Dec 2025 09:42:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Denmark insists on respect for territorial integrity after Trump appoints envoy",
      "description": "The Danish foreign minister says his country insists that everyone, including the United States, must respect “the territorial integrity of the Kingdom of Denmark.”",
      "url": "https://abcnews.go.com/International/wireStory/denmark-insists-respect-territorial-integrity-after-trump-appoints-128612753",
      "published": "Mon, 22 Dec 2025 05:23:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza: Access to food improves but living conditions remain dire",
      "description": "A pregnant woman in Gaza thought she might lose her child because of malnourishment. Ten days ago, she gave birth and is now in recovery thanks to World Food Programme (WFP) facilities that are back up and running again, the agency’s representative for Palestine said on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166632",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Russian general killed by car bomb in Moscow, officials say",
      "description": "Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said.",
      "url": "https://www.bbc.com/news/articles/c8jwn9wznx1o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 09:02:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US and Ukraine call Miami talks productive despite no breakthrough",
      "description": "Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans.",
      "url": "https://www.bbc.com/news/articles/cn5lnzlvqg2o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 04:37:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Rights groups condemn new record number of executions in Saudi Arabia",
      "description": "At least 347 people have now been put to death this year, according to the UK-based campaign group Reprieve.",
      "url": "https://www.bbc.com/news/articles/cg5m49j14pyo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 12:08:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Car bomb kills Russian general in Moscow",
      "description": "Investigators say the possibility that the attack is linked to Ukrainian special forces is one line of inquiry.",
      "url": "https://www.aljazeera.com/news/2025/12/22/moscow-car-bomb-kills-russian-general?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 07:33:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US says talks with Russia, Ukraine in Miami ‘constructive, productive’",
      "description": "US envoy holds separate meetings with Russian and Ukrainian negotiators in Miami on ending Russia's war in Ukraine.",
      "url": "https://www.aljazeera.com/news/2025/12/22/us-talks-with-russia-ukraine-in-miami-constructive-productive?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 05:02:54 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,397",
      "description": "These are the key developments from day 1,397 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2025/12/22/russia-ukraine-war-list-of-key-events-day-1397?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 01:38:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘Alarming’ medicine shortages in Gaza amid Israeli restrictions",
      "description": "Gaza's Health Ministry says the most critical drug shortages are in emergency services.",
      "url": "https://www.aljazeera.com/news/2025/12/21/alarming-medicine-shortages-in-gaza-amid-israeli-restrictions?traffic_source=rss",
      "published": "Sun, 21 Dec 2025 22:39:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK Foreign Office victim of cyber-attack in October, says Chris Bryant",
      "description": "Minister says risk to ‘any individual’ from cyber-attack is low and that it is still unclear who is responsible The UK’s Foreign, Commonwealth and Development Office was hacked in October, a minister has said. Chris Bryant, a trade minister in Keir Starmer’s government, told Sky News there was a low risk to “any individual” from the cyber-attack. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/19/uk-foreign-office-victim-cyber-attack-october-",
      "published": "Fri, 19 Dec 2025 12:59:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Peace talks to end the war in Ukraine continue in Florida",
      "description": "The latest on the negotiations to end Russia's war on Ukraine, as talks with representatives from Moscow, Kyiv and the Trump administration continue in Miami this week.",
      "url": "https://www.npr.org/2025/12/22/nx-s1-5649499/peace-talks-to-end-the-war-in-ukraine-continue-in-florida",
      "published": "Mon, 22 Dec 2025 04:45:16 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia says talks on US peace plan for Ukraine 'are proceeding constructively'",
      "description": "A Kremlin envoy says peace talks in Florida on a U.S.-proposed plan to end the war in Ukraine are proceeding constructively, after U.S. meetings with Ukrainian and European officials in Berlin.",
      "url": "https://www.npr.org/2025/12/21/g-s1-103239/russia-says-talks-on-us-peace-plan-for-ukraine-are-proceeding-constructively",
      "published": "Sun, 21 Dec 2025 03:20:28 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why women get drunk faster than men — it's our biology, not tolerance",
      "description": "At the same table, with the same drinks, women often get drunk faster than men — and alcohol can affect women's brains differently, making its effects stronger, sometimes more rewarding. But also more addictive.",
      "url": "https://www.dw.com/en/why-women-get-drunk-faster-than-men-it-s-our-biology-not-tolerance/a-75223854?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 09:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "France: 3 suspects in Elysee Palace silverware theft to stand trial",
      "description": "France's presidential silverware keeper and two other men are suspected of stealing thousands of euros' worth of porcelain and other tableware from the president's official residence.",
      "url": "https://www.dw.com/en/france-3-suspects-in-elysee-palace-silverware-theft-to-stand-trial/a-75259472?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 18:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine battles new Russian incursion in Sumy region",
      "description": "The Ukrainian army says it is fighting a Russian attack in the northeastern Sumy region. Meanwhile, Moscow denied plans for three-way talks between Ukraine, Russia, and the US while diplomats were in Miami. Follow DW.",
      "url": "https://www.dw.com/en/ukraine-battles-new-russian-incursion-in-sumy-region/live-75252411?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 14:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US envoy Witkoff calls Ukraine talks in Miami 'productive'",
      "description": "US special envoy Steve Witkoff called weekend talks in Florida “productive and constructive” as officials from the US, Europe, and Ukraine worked to align positions. President Donald Trump pushes for a quick end to the nearly four-year conflict, but Russia wants to keep seized Ukrainian land.",
      "url": "https://www.france24.com/en/americas/20251221-us-envoy-witkoff-calls-ukraine-talks-in-miami-productive",
      "published": "Sun, 21 Dec 2025 21:21:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Our daughter vanished 20 years ago - but AI and an ear caught on camera may finally solve the case'",
      "description": "The parents of a woman who went missing nearly 20 years ago are hoping an AI enhanced picture of a suspect's ear could crack the case.",
      "url": "https://news.sky.com/story/our-daughter-vanished-20-years-ago-but-ai-and-an-ear-caught-on-camera-may-finally-solve-the-case-13484783",
      "published": "Sun, 21 Dec 2025 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia marks Day of Reflection for Bondi Beach shooting victims",
      "description": "Australians are lighting candles Sunday to remember the victims of a mass shooting at a Jewish festival in Sydney's Bondi Beach",
      "url": "https://abcnews.go.com/International/wireStory/australia-marks-day-reflection-bondi-beach-shooting-victims-128590005",
      "published": "Sat, 20 Dec 2025 21:29:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Élysée Palace silver steward arrested for stealing thousands of euros' worth of silverware",
      "description": "Three men are set to stand trial next year after a silver steward at the French president's residence was arrested for stealing silverware worth thousands of euros",
      "url": "https://abcnews.go.com/International/wireStory/lyse-palace-silver-steward-arrested-stealing-thousands-euros-128593998",
      "published": "Sun, 21 Dec 2025 06:37:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Starlink in the crosshairs: How Russia could attack Elon Musk's conquering of space",
      "description": "NATO-nation intelligence services believe Russia is developing a weapon to target Starlink satellites",
      "url": "https://abcnews.go.com/International/wireStory/starlink-crosshairs-russia-attack-elon-musks-conquering-space-128612017",
      "published": "Mon, 22 Dec 2025 02:40:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine is leveraging its powerful – and cheap – new drone killers for air defense",
      "description": "Ukraine is rapidly deploying low-cost interceptor drones to counter Russia’s evolving aerial attacks on cities and power infrastructure",
      "url": "https://abcnews.go.com/International/wireStory/ukraine-leveraging-powerful-cheap-new-drone-killers-air-128611272",
      "published": "Mon, 22 Dec 2025 02:01:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Crimean Tatar artist moulds new path through clay in wartime Ukraine",
      "description": "Through her ceramics, Crimean Tatar artist Elvira Demerdzhi finds moments of calm and a sense of home amid the ongoing war in Ukraine.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166615",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "LA deputies caught on camera racing into foggy ocean to rescue disoriented paragliders",
      "description": "Two deputies swam 75 feet to save panicked paragliders entangled in safety equipment, cutting them free with knives in a dramatic ocean rescue operation.",
      "url": "https://www.foxnews.com/us/la-deputies-caught-camera-racing-foggy-ocean-rescue-disoriented-paragliders",
      "published": "Sat, 20 Dec 2025 17:45:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Desperate search for 2 men underway after fishing boat found empty 70 miles off Florida coast",
      "description": "The U.S. Coast Guard is searching for a missing uncle and nephew after their fishing boat was found empty 70 miles off the coast of Florida.",
      "url": "https://www.foxnews.com/us/desperate-search-two-men-fishing-boat-found-empty-70-miles-off-florida-coast",
      "published": "Sat, 20 Dec 2025 12:27:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brown University, MIT shooting suspect likely died days before body found: autopsy",
      "description": "The suspect in the deadly Brown University shooting and MIT professor killing was found dead by suicide inside a New Hampshire storage unit, ending a nearly weeklong manhunt.",
      "url": "https://www.foxnews.com/us/brown-university-mit-shooting-suspect-likely-died-days-before-body-found-autopsy",
      "published": "Fri, 19 Dec 2025 19:38:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fox News True Crime Newsletter: Brown and MIT shooting suspect, Nick Reiner's lawyer, Brian Walshe's sentence",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-brown-mit-shooting-suspect-nick-reiner-lawyer-brian-walshe-sentence",
      "published": "Fri, 19 Dec 2025 16:04:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US envoy Witkoff says high-level Miami talks focused on 'unified Gazan authority' as Israel ceasefire advances",
      "description": "The U.S. leads talks with Egypt, Qatar and Turkey on Gaza ceasefire Phase 2, focusing on unified governance and regional integration for long-term stability.",
      "url": "https://www.foxnews.com/world/us-envoy-witkoff-says-high-level-miami-talks-focused-unified-gazan-authority-israel-ceasefire-advances",
      "published": "Sat, 20 Dec 2025 14:55:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Divided between two states, the town at the heart of America's abortion debate",
      "description": "The only abortion clinic in town is fighting an eviction notice and other efforts to shut it down.",
      "url": "https://www.bbc.com/news/articles/c93nwrzgypqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 00:07:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "CBS News delays 60 Minutes segment featuring investigation into El Salvador’s Cecot megaprison",
      "description": "Backlash after broadcaster announces the program, due to air on Sunday night, ‘needs additional reporting’ CBS News is facing a backlash, including from one of its own correspondents, after it cancelled a 60 Minutes investigation into a brutal prison in El Salvador where the Trump administration has deported hundreds of migrants. The episode of its flagship program about the Cecot megaprison was due to air on Sunday night. However, in an “editors note” posted on X , the broadcaster’s official account announced that “the lineup for tonight’s edition of 60 Minutes has been updated. Our report ‘Inside Cecot’ will air in a future broadcast.” Continue reading...",
      "url": "https://www.theguardian.com/media/2025/dec/22/cbs-news-delays-60-minutes-segment-featuring-investigation-into-cecot-megaprison",
      "published": "Mon, 22 Dec 2025 08:08:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Russia says Ukraine peace talks 'proceeding constructively,' as Kremlin launches deadly strike on Odesa",
      "description": "Peace talks between Russia and Ukraine reportedly proceed \"constructively\" in Florida even as deadly missile strike hits Odesa, killing eight people.",
      "url": "https://www.foxnews.com/world/russia-says-ukraine-peace-talks-proceeding-constructively-kremlin-launches-deadly-strike-odesa",
      "published": "Sun, 21 Dec 2025 07:08:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Image in Epstein files that features Trump reinstated after backlash",
      "description": "It was one of several removed from the justice department website because of concerns from victims, said a US official.",
      "url": "https://www.bbc.com/news/articles/c208y2wxxeno?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 08:09:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Why Croatia's capital wants to hold Europe's best Christmas market",
      "description": "The festive events help to put cities on the map and attract millions of tourists.",
      "url": "https://www.bbc.com/news/articles/c8dy5m56477o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 01:05:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Afcon is a special tournament, says Premier League star Iwobi",
      "description": "The Fulham midfielder will represent his birth country Nigeria in the competition featuring 24 nations.",
      "url": "https://www.bbc.com/news/articles/cx25dejn4n5o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 02:49:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "‘The inspiration I need’: baby Lilah arrives early for MPs Josh Burns and Georgie Purcell",
      "description": "Purcell, of Victoria’s Animal Justice party and Burns, of federal Labor, announce arrival of Lilah Poppy Purcell, born on Friday 19 December Get our breaking news email , free app or daily news podcast Federal MP Josh Burns and Victorian MP Georgie Purcell have announced the birth of their daughter – whose name offers a subtle nod to their political backgrounds. The couple took to social media on Monday night to announce the arrival of Lilah Poppy Purcell, who was born on Friday 19 December, weighing 2.56kg. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/22/mp-josh-burns-georgie-purcell-new-baby-lilah-arrives-early",
      "published": "Mon, 22 Dec 2025 08:30:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Germany trains immigrant teachers to fill gaps in schools",
      "description": "Germany is desperately looking for teachers. And many migrants and refugees were once teachers in their home country. A program in Cologne — and four other cities — is hoping to create a win-win situation.",
      "url": "https://www.dw.com/en/germany-trains-immigrant-teachers-to-fill-gaps-in-schools/a-75243649?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 06:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "REPLAY: Africa Cup of Nations build-up special",
      "description": "The African Cup of Nations opens in Rabat tonight with a match between the host country, Morocco and the Comoros. Ahead of kick-off, FRANCE 24's Emily Boyle was in the studio with special guests to talk all things AFCON.",
      "url": "https://www.france24.com/en/sport/20251221-replay-africa-cup-of-nations-build-up-special",
      "published": "Sun, 21 Dec 2025 19:30:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council hears of fading election prospects in Libya",
      "description": "The path to long-awaited elections in Libya is paved with complications but they can be overcome, the UN Special Representative for the country said on Friday in a briefing to the Security Council.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166646",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council renews DR Congo peacekeeping mission amid renewed M23 offensives in the east",
      "description": "The UN Security Council on Friday unanimously extended the mandate of the UN peacekeeping mission in the Democratic Republic of the Congo (DRC) for another year, as fighting in the country’s east intensified amid renewed offensives by the M23 rebel group.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166643",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Elizabeth Smart blasts Ghislaine Maxwell’s ‘country club’ prison treatment: ‘Makes me sick’",
      "description": "Kidnapping survivor Elizabeth Smart speaks out against Jeffrey Epstein associate Ghislaine Maxwell's prison privileges while advocating for trafficking victims.",
      "url": "https://www.foxnews.com/us/elizabeth-smart-blasts-ghislaine-maxwell-country-club-prison-treatment-makes-me-sick",
      "published": "Sat, 20 Dec 2025 14:00:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "In rebel-held Myanmar, civilians face devastating air strikes and a sham election",
      "description": "The BBC goes to a rebel-held part of Myanmar, ahead of a government-mandated election starting this month.",
      "url": "https://www.bbc.com/news/articles/cjrjpdz33vxo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 22:08:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "India express train kills seven elephants crossing tracks",
      "description": "The collision happened early on Saturday in the north-eastern state of Assam, local officials say.",
      "url": "https://www.bbc.com/news/articles/c9qe2yln2nlo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 01:18:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thousands of Serbians protest government pressure on universities",
      "description": "Thousands of demonstrators in Serbia gathered in Novi Pazar on Sunday to protest government pressures on universities.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/22/thousands-of-serbians-protest-government-pressure-on-universities?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 08:30:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Two Palestine Action hunger strikers in UK prisons admitted to hospital",
      "description": "Kamran Ahmed and Amu Gib have been hospitalised as a hunger strike that began 50 days ago raises alarm.",
      "url": "https://www.aljazeera.com/news/2025/12/22/two-palestine-action-hunger-strikers-in-uk-prisons-admitted-to-hospital?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 03:41:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Bondi shooters threw unexploded pipe bombs at crowd — police",
      "description": "The two gunmen threw home-made explosive devices into the crowd at the Bondi beach, but the bombs failed to go off, according to court documents. The father-son duo also practiced with firearms in rural Australia.",
      "url": "https://www.dw.com/en/bondi-shooters-threw-unexploded-pipe-bombs-at-crowd-police/a-75262016?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 09:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Bus crash in Indonesia kills at least 15 people, official says",
      "description": "A bus carrying 34 people lost control on a toll road, struck a concrete barrier,",
      "url": "https://abcnews.go.com/International/wireStory/passenger-bus-crash-indonesia-kills-15-people-official-128608466",
      "published": "Sun, 21 Dec 2025 22:08:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "South Sudan: UN condemns killing of staff member in Wau, calls for swift investigation",
      "description": "The United Nations on Friday condemned the killing of a civilian staff member serving with its peacekeeping mission in South Sudan (UNMISS), calling on the authorities to swiftly bring those responsible to justice.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166640",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza famine pushed back, but millions still face hunger and malnutrition, UN says",
      "description": "Food security in Gaza has improved since the ceasefire declared in October, pushing back famine conditions, but the situation remains critical with more than three-quarters of the population still facing acute hunger and malnutrition, a new UN-backed analysis has found.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166638",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "All pupils kidnapped from Nigeria Catholic school now free - officials",
      "description": "The authorities confirm the remaining students abducted in Niger state last month have been released.",
      "url": "https://www.bbc.com/news/articles/c3d03943zg8o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 08:18:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Israel approves 19 new settlements in occupied West Bank",
      "description": "Far-right Finance Minister Bezalel Smotrich said the move was about blocking the establishment of a Palestinian state.",
      "url": "https://www.bbc.com/news/articles/cqjg18xe0wwo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 09:10:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "New clashes erupt on Thai-Cambodia border as ASEAN convenes peace talks",
      "description": "Fighting resumes hours before regional foreign ministers meet in Malaysia to discuss steps to de-escalate hostilities.",
      "url": "https://www.aljazeera.com/news/2025/12/22/fresh-clashes-erupt-on-thai-cambodia-border-as-asean-convenes-peace?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 03:39:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Another 130 kidnapped schoolchildren released in Nigeria",
      "description": "Presidential spokesperson says all those abducted from a Catholic school in Niger state last month are now free Nigerian authorities say they have secured the release of a further 130 schoolchildren kidnapped from a Catholic school in November, after 100 were freed earlier this month . “Another 130 abducted Niger state pupils released, none left in captivity,” presidential spokesperson Sunday Dare said on X, in a post accompanied by a photo of smiling children. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria",
      "published": "Sun, 21 Dec 2025 20:05:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria: Remaining 130 abducted schoolchildren released",
      "description": "Nigeria's government said that all students abducted from a Catholic boarding school in Niger state in November have been released.",
      "url": "https://www.dw.com/en/nigeria-remaining-130-abducted-schoolchildren-released/a-75260977?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 22:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Spain's ruling Socialists suffer historic defeat in regional election",
      "description": "Spanish Prime Minister Pedro Sánchez’s embattled Socialists suffered a heavy defeat in Sunday’s regional election in Extremadura, slumping to their worst-ever result as the far-right Vox made strong gains, dealing another blow to the party amid mounting corruption and misconduct allegations.",
      "url": "https://www.france24.com/en/europe/20251222-spain-ruling-socialists-suffer-historic-defeat-in-regional-elections-far-right",
      "published": "Mon, 22 Dec 2025 00:29:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Israel approves 19 new Jewish settlements in occupied West Bank",
      "description": "Israel has approved 19 new Jewish settlements in the occupied West Bank in a fresh blow to the possibility of a Palestinian state.",
      "url": "https://news.sky.com/story/israel-approves-19-new-jewish-settlements-in-occupied-west-bank-13486439",
      "published": "Sun, 21 Dec 2025 17:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US pursuing third oil tanker near Venezuela — reports",
      "description": "The US considered the pursued vessel to be part of \"Venezuela's illegal sanctions evasion,\" according to media reports. A US official reportedly said the vessel was flying a false flag.",
      "url": "https://www.dw.com/en/us-pursuing-third-oil-tanker-near-venezuela-reports/a-75260455?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 20:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Day 1 roundup",
      "description": "Welcome to France 24's AFCON roundup, where we dive into all the action from the opening match of the 2025 African Cup of Nations in Morocco. We're here to break it all down with football experts Thando Sibiya and Andreas Evagora. We are also joined by our reporter on the ground, Selina Sykes.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251221-afcon-2025-day-1-roundup",
      "published": "Sun, 21 Dec 2025 23:24:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Mock funeral held for the penny at Lincoln Memorial as 230-year coin production ends",
      "description": "Mock funeral held at Lincoln Memorial marks end of penny production after President Trump's announcement to halt minting due to rising production costs.",
      "url": "https://www.foxnews.com/us/mock-funeral-held-penny-lincoln-memorial-230-year-coin-production-ends",
      "published": "Sun, 21 Dec 2025 23:02:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US Coast Guard pursues third 'dark fleet' oil tanker as Trump targets Venezuelan sanctions evasion network",
      "description": "President Trump escalates pressure on Venezuela as U.S. Coast Guard pursues sanctioned oil tanker reportedly evading sanctions, A U.S. official tells Fox News.",
      "url": "https://www.foxnews.com/us/us-coast-guard-pursues-third-dark-fleet-oil-tanker-trump-targets-venezuelan-sanctions-evasion-network",
      "published": "Sun, 21 Dec 2025 14:35:24 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "This billionaire tested China's limits. It cost him his freedom",
      "description": "Lai, who is facing life in prison, always said he owed Hong Kong, a city that had given him \"everything\".",
      "url": "https://www.bbc.com/news/articles/c5yqr485d84o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 22:58:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Cartagena's iconic horse carriages give way to electric buggies",
      "description": "Cartagena, Colombia, is set to ban its iconic horse-drawn carriages, replacing them with electric buggies — a move dividing the historic city over tradition, tourism, and animal welfare.",
      "url": "https://www.npr.org/2025/12/21/nx-s1-5648546/cartagena-horses-colombia-animal-welfare",
      "published": "Sun, 21 Dec 2025 09:48:01 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "San Francisco power outage puts 130,000 in the dark, as self-driving car service stops vehicles in the street",
      "description": "Massive power outage hits San Francisco, leaving 130,000 without electricity and self-driving cars stalled in streets across the city on Saturday.",
      "url": "https://www.foxnews.com/us/san-francisco-power-outage-puts-130000-dark-self-driving-car-service-stops-vehicles-street",
      "published": "Sun, 21 Dec 2025 07:30:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "US pursuing third oil tanker linked to Venezuela, official says",
      "description": "The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela.",
      "url": "https://www.bbc.com/news/articles/c99722j4lkgo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 07:29:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Survivors 'nervous and sceptical' about release of remaining Epstein files",
      "description": "US lawmakers who pushed for the documents to be made public have criticised the initial release as incomplete.",
      "url": "https://www.bbc.com/news/articles/c14vy02847vo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 07:42:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who and what are in the Epstein files?",
      "description": "High-profile figures, including Bill Clinton and Michael Jackson, can be seen in the long-awaited files.",
      "url": "https://www.bbc.com/news/articles/c8r38ne1x2mo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 21 Dec 2025 18:48:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jerusalem’s Latin Patriarch leads Christmas mass at Gaza church",
      "description": "Jerusalem’s Latin Patriarch led Christmas mass at Gaza’s only Catholic church just days before the holiday.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/22/jerusalems-latin-patriarch-leads-christmas-mass-at-gaza-church?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 09:17:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Is the US making a great gamble to reshape Iraq?",
      "description": "The Trump administration seeks to recalibrate US influence in the Middle East and wants to 'make Iraq great again'.",
      "url": "https://www.aljazeera.com/opinions/2025/12/22/is-the-us-making-a-great-gamble-to-reshape-iraq?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 07:37:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Swiss court to hear Indonesian islanders’ climate case against cement giant",
      "description": "Four residents of Pari, a low-lying Indonesian island, filed the complaint in January 2023.",
      "url": "https://www.aljazeera.com/news/2025/12/22/swiss-court-to-hear-indonesian-islanders-climate-case-against-cement-giant?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 07:03:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Thailand, Cambodia resume border clashes before talks",
      "description": "Fighting has resumed hours before the countries' foreign ministers meet in Malaysia to discuss steps to de-escalate.",
      "url": "https://www.aljazeera.com/news/liveblog/2025/12/22/live-thailand-cambodia-resume-border-clashes-before-talks?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 05:42:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sudanese bloc declares Nairobi roadmap, but is it a civilian breakthrough?",
      "description": "The new bloc's roadmap echoes the Quad plan, but observers say this only splinters civilian forces in Sudan.",
      "url": "https://www.aljazeera.com/news/2025/12/22/sudanese-bloc-declares-nairobi-roadmap-but-is-it-a-civilian-breakthrough?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 05:29:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysian court rejects Najib’s bid to serve sentence under house arrest",
      "description": "The Kuala Lumpur High Court says a royal document allowing the ex-PM's transfer to house arrest is invalid.",
      "url": "https://www.aljazeera.com/news/2025/12/22/malaysia-court-rejects-najibs-bid-to-serve-sentence-under-house-arrest?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 02:47:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Morocco seal AFCON win against Comoros in 2025 opener",
      "description": "Host nation Morocco overcome a spirited challenge by Africa Cup of Nations minnows Comoros to kick off the tournament.",
      "url": "https://www.aljazeera.com/sports/2025/12/22/morocco-seal-afcon-win-against-comoros-in-2025-opener?traffic_source=rss",
      "published": "Mon, 22 Dec 2025 02:02:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How volatile is the political situation in Bangladesh?",
      "description": "Tensions are growing after the killing of a student leader of last year's revolt, which toppled Sheikh Hasina.",
      "url": "https://www.aljazeera.com/video/inside-story/2025/12/21/how-volatile-is-the-political-situation-in-bangladesh?traffic_source=rss",
      "published": "Sun, 21 Dec 2025 21:40:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.9 - 5 km SE of San Ramon, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - V Time 2025-12-21 02:31:54 UTC 2025-12-21 02:31:54 UTC at epicenter Location 37.747°N 121.946°W Depth 10.03 km (6.23 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283691",
      "published": "2025-12-22T05:32:49.313Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.0 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:56:09 UTC 2025-12-20 03:56:09 UTC at epicenter Location 37.744°N 121.953°W Depth 9.63 km (5.98 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283031",
      "published": "2025-12-22T04:06:15.924Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.6 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:49:28 UTC 2025-12-20 03:49:28 UTC at epicenter Location 37.743°N 121.954°W Depth 9.56 km (5.94 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283016",
      "published": "2025-12-21T03:36:27.067Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists say they have discovered 20 new species deep in the Pacific Ocean",
      "description": "Researchers retrieved reef monitoring devices that had been placed in deep coral reefs in Guam. The devices were placed up to 330 feet below the surface.",
      "url": "https://www.npr.org/2025/12/21/nx-s1-5650781/new-species-deep-pacific-ocean",
      "published": "Sun, 21 Dec 2025 17:23:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European leaders lock in Ukraine funding amid renewed peace efforts",
      "description": "The European Union's ambassador to the U.S. argues that Europe's latest financing move strengthens Ukraine's hand at a fragile moment in peace negotiations.",
      "url": "https://www.npr.org/2025/12/21/nx-s1-5650771/european-leaders-lock-in-ukraine-funding-amid-renewed-peace-efforts",
      "published": "Sun, 21 Dec 2025 17:11:17 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why Trump is backing Bayer in weedkiller cancer battle",
      "description": "The Trump administration has diverged from the position of former US President Biden, throwing its weight behind the German chemical giant in its courtroom battle over the pesticide Roundup.",
      "url": "https://www.dw.com/en/why-trump-is-backing-bayer-in-weedkiller-cancer-battle/a-75188139?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 09:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malay court denies former PM Najib Razak house arrest",
      "description": "Former Malaysian Prime Minister Najib Razak has lost a bid to serve the rest of his sentence under house arrest instead of in jail.",
      "url": "https://www.dw.com/en/malay-court-denies-former-pm-najib-razak-house-arrest/a-75261290?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 04:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany registers over 1,000 suspicious drone flights in 2025",
      "description": "Drone sightings this year have disrupted German airports, causing headaches for travelers. Germany has ordered special anti-aircraft tanks to combat the unmanned aerial vehicles.",
      "url": "https://www.dw.com/en/germany-registers-over-1-000-suspicious-drone-flights-in-2025/a-75261162?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 03:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France to build new aircraft carrier — Macron",
      "description": "Macron said that France needed to be \"strong to be feared\" as Paris aims to enhance its projection as a naval power.",
      "url": "https://www.dw.com/en/france-to-build-new-aircraft-carrier-macron/a-75259779?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 21:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AI language models duped by poems",
      "description": "A new study has shown that prompts in the form of poems confuse AI models like ChatGPT, Gemini and Claude — to the point where sometimes, security mechanisms don't kick in. Are poets the new hackers?",
      "url": "https://www.dw.com/en/ai-language-models-duped-by-poems/a-75180648?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 12:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Christmas in the air: Why scents spark emotions and memories",
      "description": "The scent of fresh pine and apple cider makes you think of the holidays at grandma's house? You're not alone. Smells are our strongest sensory trigger for memories — both happy and painful.",
      "url": "https://www.dw.com/en/christmas-in-the-air-why-scents-spark-emotions-and-memories/a-75214747?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 07:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US: Tens of thousands left without power in San Francisco",
      "description": "The tech hub saw a major power outage that affected some 130,000 people, as well as businesses, traffic and public transport.",
      "url": "https://www.dw.com/en/us-tens-of-thousands-left-without-power-in-san-francisco/a-75255957?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 21 Dec 2025 06:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thousands of runners dressed as Santa take part in a race in Barcelona",
      "description": "Around 2,500 runners dressed as Santa Claus and 800 dressed as elves participate in a 5km race in Barcelona to kick off their Christmas celebrations. From Lapland, via Florida and the Amazon in Brazil to Pakistan, Italy and Spain. Santas have been spotted in various guises as people prepare for the Christmas Holiday Season. Nicholas Rushworth has spotted not one or two Santas but hundreds of them.",
      "url": "https://www.france24.com/en/video/20251222-thousands-of-runners-dressed-as-santa-take-part-in-a-race-in-barcelona",
      "published": "Mon, 22 Dec 2025 09:55:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Ayoub El Kaabi scores wondergoal as Morocco dominate Comoros",
      "description": "Morocco defeated Comoros (2-0) in the opening match of AFCON 2025. Ayoub El Kaabi scored a superb overhead kick.",
      "url": "https://www.france24.com/en/tv-shows/sports/20251222-afcon-2025-ayoub-el-kaabi-scores-wondergoal-as-morocco-dominate-comoros",
      "published": "Mon, 22 Dec 2025 06:28:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gold prices hit record high on US interest rate-cut bets",
      "description": "Gold hit a new record high on Monday, driven by expectations of US interest rate cuts and strong demand for safe-haven assets, while silver also reached an all-time peak. The gains mark a remarkable year for precious metals, supported by a weaker dollar, geopolitical tensions and strong investment inflows.",
      "url": "https://www.france24.com/en/americas/20251222-gold-prices-hit-record-high-on-fed-rate-cut-bets-usa-economy",
      "published": "Mon, 22 Dec 2025 04:15:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bollywood profits under pressure from soaring star fees",
      "description": "Bollywood’s top stars are driving production costs sky-high with private trailers, personal chefs and massive entourages, insiders say. The hefty fees are hiking up production costs and straining the Indian film industry's already fragile finances.",
      "url": "https://www.france24.com/en/live-news/20251222-india-s-bollywood-counts-costs-as-star-fees-squeeze-profits",
      "published": "Mon, 22 Dec 2025 01:47:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Morocco gets off to winning start at Africa Cup of Nations",
      "description": "Brahim Diaz and Ayoub El Kaabi scored second-half goals as Morocco beat Comoros 2-0 in the Africa Cup of Nations opener in Rabat. Diaz broke the deadlock 10 minutes after the break, and substitute El Kaabi sealed the win with a stunning overhead kick.",
      "url": "https://www.france24.com/en/sport/20251221-morocco-gets-off-to-winning-start-at-africa-cup-of-nations",
      "published": "Sun, 21 Dec 2025 21:30:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel approves 19 new West Bank settlements",
      "description": "Israel has approved 19 new settlements in the occupied West Bank, bringing the three-year total to 69. The move comes despite UN Secretary-General Antonio Guterres's recent condemnation of what he called the \"relentless\" expansion of settlements in the occupied territory.",
      "url": "https://www.france24.com/en/middle-east/20251221-israel-approves-19-new-west-bank-settlements",
      "published": "Sun, 21 Dec 2025 17:16:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Justice Department denies Epstein cover-up, restores photo of Trump to public files",
      "description": "The US Justice Department said on Sunday it had restored an image of President Donald Trump that it had removed a day earlier from the public release of Epstein-related files. The photograph was reposted as lawmakers accused officials of withholding key information in files related to the late sex offender, including photos of Trump and other elites.",
      "url": "https://www.france24.com/en/live-news/20251221-allegations-of-new-cover-up-over-epstein-files",
      "published": "Sun, 21 Dec 2025 16:39:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "130 children and staff abducted from Nigerian school last month freed 'in time for Christmas'",
      "description": "The remaining 130 schoolchildren and staff abducted by gunmen from a Catholic school in Nigeria last month have been freed.",
      "url": "https://news.sky.com/story/130-children-and-staff-abducted-from-nigerian-school-last-month-freed-in-time-for-christmas-13486536",
      "published": "Sun, 21 Dec 2025 22:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US in 'active pursuit' of third vessel off Venezuelan coast, officials say",
      "description": "The US is in \"active pursuit\" of a third oil tanker near Venezuela in the Caribbean Sea, officials have said.",
      "url": "https://news.sky.com/story/us-in-active-pursuit-of-third-vessel-off-venezuelan-coast-officials-say-13486511",
      "published": "Sun, 21 Dec 2025 20:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Epstein survivor describes 'wilful blindness' around financier",
      "description": "The earliest publicly known survivor of Jeffrey Epstein's abuse has told Sky News there was a \"wilful blindness\" about the young women and children around him - as she claimed the US Department of Justice (DoJ) had \"broken the law\" with the Epstein files.",
      "url": "https://news.sky.com/story/epstein-survivor-describes-blindness-around-financier-and-criticises-justice-department-over-files-13486445",
      "published": "Sun, 21 Dec 2025 17:49:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fears grow over AI bubble - and here are the pressure points that could burst it",
      "description": "The market seems to be content, for now at least, to keep betting big on AI.",
      "url": "https://news.sky.com/story/fears-grow-of-ai-bubble-and-here-are-the-pressure-points-that-could-burst-it-13486328",
      "published": "Sun, 21 Dec 2025 11:50:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'It's so painful': Shane MacGowan's sister on the struggle to avoid his music",
      "description": "Siobhan MacGowan almost looks surprised as she remembers.",
      "url": "https://news.sky.com/story/shane-macgowans-sister-on-the-struggle-to-avoid-his-music-13484497",
      "published": "Sun, 21 Dec 2025 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Images of Trump among documents reposted to Epstein files release after apparent removal",
      "description": "Pictures of Donald Trump were included among at least 16 documents that disappeared from the Epstein files released by the Department of Justice (DOJ).",
      "url": "https://news.sky.com/story/image-of-trump-among-documents-reposted-on-epstein-files-release-after-apparent-removal-13486310",
      "published": "Sun, 21 Dec 2025 09:47:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Prince William brings his son to the same homeless shelter he first visited with Princess Diana",
      "description": "Prince William and his son, Prince George, have helped make Christmas lunch at a homeless shelter",
      "url": "https://abcnews.go.com/International/wireStory/prince-william-brings-son-same-homeless-shelter-visited-128594554",
      "published": "Sun, 21 Dec 2025 07:29:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France will build a new aircraft carrier as it increases defense spending",
      "description": "French President Emmanuel Macron has announced plans to build a new aircraft carrier",
      "url": "https://abcnews.go.com/International/wireStory/france-build-new-aircraft-carrier-increases-defense-spending-128601533",
      "published": "Sun, 21 Dec 2025 14:49:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thousands cheer as the sun rises on winter solstice at Stonehenge",
      "description": "Thousands of people have gathered at Stonehenge to celebrate the winter solstice",
      "url": "https://abcnews.go.com/International/wireStory/thousands-cheer-sun-rises-winter-solstice-stonehenge-128594301",
      "published": "Sun, 21 Dec 2025 06:28:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russia says talks on US peace plan for Ukraine 'proceeding constructively'",
      "description": "The talks are part of the Trump administration’s monthslong push for peace.",
      "url": "https://abcnews.go.com/International/wireStory/russia-talks-us-peace-plan-ukraine-proceeding-constructively-128593595",
      "published": "Sun, 21 Dec 2025 12:41:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Saudi Arabia quietly expands access to its only alcohol store for non-Muslim residents",
      "description": "Saudi Arabia has quietly expanded access to its only alcohol store, now allowing non-Muslim Premium Residency holders to purchase alcohol legally",
      "url": "https://abcnews.go.com/International/wireStory/saudi-arabia-quietly-expands-access-alcohol-store-muslim-128593211",
      "published": "Sun, 21 Dec 2025 01:29:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraq's political future in limbo as factions vie for power",
      "description": "Political factions in Iraq have been maneuvering since the parliamentary election more than a month ago to form alliances that will shape the next government",
      "url": "https://abcnews.go.com/International/wireStory/iraqs-political-future-limbo-factions-vie-power-128592486",
      "published": "Sun, 21 Dec 2025 00:33:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Singapore to punish scammers with up to 24 strokes of the cane from Dec 30",
      "description": "Singapore’s government has announced that scammers will face mandatory caning of up to 24 strokes starting December 30",
      "url": "https://abcnews.go.com/International/wireStory/singapore-punish-scammers-24-strokes-cane-dec-30-128549262",
      "published": "Fri, 19 Dec 2025 07:24:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Can traditional medicine strengthen modern healthcare? An expert weighs in",
      "description": "Ginger and cinnamon are more than just ingredients. Along with other spices, their medicinal value is gaining both attention and legitimacy.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166628",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sudan: Needs rise as people continue to flee fighting in Kordofan",
      "description": "Families continue to flee intense hostilities across the Kordofan region of Sudan and humanitarian needs are surging, the UN said in an update on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166619",
      "published": "Wed, 17 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Elite Massachusetts boarding school rocked by teacher scandal and institutional cover-up allegations",
      "description": "Prestigious Miss Hall's boarding school faces major sexual abuse scandal involving former teacher Matthew Rutledge and alleged institutional cover-up.",
      "url": "https://www.foxnews.com/us/elite-massachusetts-boarding-school-rocked-teacher-scandal-institutional-cover-up-allegations",
      "published": "Sun, 21 Dec 2025 10:00:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Murdaugh lawyer ‘cautiously optimistic’ court clerk’s misconduct could pave way for new trial",
      "description": "Alex Murdaugh's defense team says they're \"cautiously optimistic\" about getting a new trial as the Supreme Court prepares to hear appeals in February.",
      "url": "https://www.foxnews.com/us/murdaugh-lawyer-cautiously-optimistic-court-clerks-misconduct-could-pave-way-new-trial",
      "published": "Sun, 21 Dec 2025 08:00:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gun jams as shoplifting suspect tries to shoot Ohio police officer at point-blank range in wild bodycam video",
      "description": "Wild bodycam footage shows a shoplifting suspect allegedly attempting to shoot an Ohio police officer at Walmart, but the gun malfunctioned during the incident.",
      "url": "https://www.foxnews.com/us/gun-jams-shoplifting-suspect-tries-shoot-ohio-police-officer-point-blank-range-wild-bodycam-video",
      "published": "Sat, 20 Dec 2025 18:48:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "DHS packages latest ICE arrests as 'Christmas gift to Americans'",
      "description": "The Department of Homeland Security calls ICE arrests of illegal immigrants with criminal records the agency's \"Christmas gift to Americans.\"",
      "url": "https://www.foxnews.com/us/dhs-packages-latest-ice-arrests-christmas-gift-americans",
      "published": "Sat, 20 Dec 2025 11:51:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "University of Illinois lesson materials push leftist race, class struggles on future teachers: leaked lectures",
      "description": "Leaked PowerPoint slides from University of Illinois teacher education course reveal left-wing ideology woven into curriculum for future educators.",
      "url": "https://www.foxnews.com/us/university-illinois-lesson-materials-push-leftist-race-class-struggles-future-teachers-leaked-lectures",
      "published": "Sat, 20 Dec 2025 10:00:08 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran executes man convicted of spying for Israeli intelligence",
      "description": "Iran executed a man convicted of spying for Israel's Mossad intelligence agency, accused of conducting over 200 spy missions across multiple cities, including Tehran.",
      "url": "https://www.foxnews.com/world/iran-executes-man-convicted-spying-israeli-intelligence",
      "published": "Sun, 21 Dec 2025 21:18:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}