{
  "last_updated": "2025-12-31T05:30:23.863749Z",
  "event_count": 224,
  "events": [
    {
      "title": "Trump’s shadow war in Venezuela grows, but country’s strongman leader still clings to power",
      "description": "Report of a drone attack on a port facility signals new phase in US military campaign against Nicolás Maduro US wargames played out scenarios for Maduro’s fall. None of them ended well for Venezuela Nearly a week after Donald Trump first announced what he said was the first US ground strike in a four-month-long military pressure campaign against Venezuela , details remain very thin on the ground. CNN and the New York Times reported late on Monday that they had confirmed the CIA had used a drone to target a “port facility” allegedly used by the Tren de Aragua street gang. No casualties were reported, but the date, time and location of the attack remain unknown. Venezuela’s strongman leader, Nicolás Maduro , and his government have remained silent. If confirmed, the first strike on land would mark a new phase in a campaign that since August has involved the deployment of a massive US naval fleet, airstrikes that have so far killed 107 people, a “total blockade” of sanctioned oil tankers, the seizure of two vessels and the pursuit of a third. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/military-drone-strike-venezuela-trump-maduro",
      "published": "Tue, 30 Dec 2025 19:34:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Looking back at 2025 - in satellite images",
      "description": "An earthquake, wildfires, war and a funeral are among the world events that satellite images have helped Sky News cover this year.",
      "url": "https://news.sky.com/story/looking-back-at-2025-in-satellite-images-13488715",
      "published": "Tue, 30 Dec 2025 14:21:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s camp confirm two of his close friends died in Nigeria car crash",
      "description": "British former boxing champion sustained minor injuries Sina Ghami and Kevin ‘Lateef’ Ayodel killed in accident The British heavyweight boxer Anthony Joshua has issued a statement after he was injured in a car crash in Nigeria on Monday morning which killed two of his close friends. The former world heavyweight boxing champion was taken to an undisclosed hospital after his car hit a stationary vehicle at about 11am on the Lagos-Ibadan Expressway, the Ogun state police commissioner, Lanre Ogunlowo, said. The driver of Joshua’s vehicle was also injured, he added. Continue reading...",
      "url": "https://www.theguardian.com/sport/2025/dec/29/anthony-joshua-injured-car-crash-nigeria",
      "published": "Tue, 30 Dec 2025 00:17:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "China launches live-fire drills around Taiwan simulating blockade of major ports",
      "description": "Taipei condemns exercise that Chinese army calls ‘a stern warning’ against separatist and external forces China has launched live-fire military drills around Taiwan, simulating a blockade of major ports, attacking maritime targets, and fending off international “interference”, in what it calls a warning to “separatist” forces in Taiwan. The People’s Liberation Army (PLA) – the military wing of the ruling Communist party in China – sent its navy, air force, rocket force and coastguard to surround Taiwan on Monday morning for a surprise exercise called “Justice Mission 2025”, which began less than an hour after it was announced. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/china-live-fire-military-drills-around-taiwan",
      "published": "Mon, 29 Dec 2025 13:40:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "UN, US sign $2 billion humanitarian funding agreement for 17 crisis-hit countries",
      "description": "The United Nations and the United States on Monday formalized an agreement under which the US committed $2 billion in humanitarian assistance for global relief programmes, a move the UN’s top relief official hailed as a landmark commitment to saving lives amid escalating humanitarian needs worldwide.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166678",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Hamas confirms five leaders killed, including 'masked spokesperson' in major blow to terror group",
      "description": "Five Hamas military commanders confirmed dead by terrorist group's armed wing, marking significant blow to Palestinian militant organization's leadership structure in Gaza conflict.",
      "url": "https://www.foxnews.com/world/hamas-confirms-five-leaders-killed-including-masked-spokesperson-major-blow-terror-group",
      "published": "Mon, 29 Dec 2025 20:15:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan civil war: Health system ‘on the verge of collapse’",
      "description": "The war in Sudan has been tearing the country apart for almost 1,000 days, putting the country’s health system under intolerable pressure. The World Health Organization (WHO) is reporting widespread disease outbreaks, severe shortages, malnutrition and rising deaths.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166673",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Man dead and teenage boy feared missing after boat capsizes off northern Sydney beach",
      "description": "One man rescued by helicopter after accident near Barrenjoey headland on Palm beach Get our breaking news email , free app or daily news podcast A man has died, a 14-year-old boy is feared missing and another man has been rescued after a boat capsized in waters off a northern Sydney’s beach on Wednesday. In a statement on Wednesday afternoon, NSW police said emergency services were called about 11.35am to Palm beach, after reports that a boat had capsized near Barrenjoey headland, about 40km from the Sydney CBD. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/palm-beach-man-dead-teenage-boy-feared-missing-boat-capsize",
      "published": "Wed, 31 Dec 2025 04:42:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Turkey arrests 357 people in operation against Islamic State group",
      "description": "Turkey said it arrested 357 people on Tuesday linked to the Islamic State group, following intelligence reports that the terrorist organisation was \"planning attacks\" during Christmas and New Year.",
      "url": "https://www.france24.com/en/asia-pacific/20251230-turkey-arrests-357-people-in-operation-against-islamic-state-group",
      "published": "Tue, 30 Dec 2025 17:13:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: Guterres deplores deadly mosque blast in Homs",
      "description": "UN Secretary-General António Guterres “unequivocally condemns” the deadly terrorist attack on a mosque in Homs, Syria during Friday prayers, his spokesperson said in a statement",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166674",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Africa’s Christian Crisis: How 2025’s deadly attacks finally drew global attention after Trump’s intervention",
      "description": "Christian communities in Africa reportedly under siege as Islamist groups target churches and believers across multiple countries during Christmas 2025.",
      "url": "https://www.foxnews.com/world/16m-christians-displaced-islamist-persecution-sweeps-across-africa-during-2025",
      "published": "Sun, 28 Dec 2025 08:00:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Australian police find no evidence of 'broader terrorist cell' in Bondi Beach antisemitic shooting",
      "description": "Police say an investigation that extended to the Philippines of two men accused of killing 15 people at a Sydney Jewish festival has found no evidence they were part of a “broader terrorist cell.”",
      "url": "https://abcnews.go.com/International/wireStory/australian-police-find-evidence-broader-terrorist-cell-bondi-128770999",
      "published": "Mon, 29 Dec 2025 22:49:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Hamas builds new terror regime in Gaza, recruiting teens amid problematic election",
      "description": "Hamas is recruiting teenage fighters during Gaza ceasefire after Israeli forces withdrew in October. This as national security analyst Professor Kobi Michael warns about growing militant control.",
      "url": "https://www.foxnews.com/world/hamas-builds-new-terror-regime-gaza-recruiting-teens-amid-problematic-election",
      "published": "Sun, 28 Dec 2025 21:25:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "At least 13 people killed and 98 injured in train derailment in Mexico",
      "description": "Train accident in Oaxaca is likely to raise criticisms about public works projects from the previous administration At least 13 people were killed when a train derailed in the Mexican state of Oaxaca, in an accident which is likely to revive opposition criticisms of the speed and dealings with which the country’s government builds its flagship public works projects. The incident took place on the Interoceanic Train, which was built to link the Atlantic and Pacific oceans across the narrowest part of the Isthmus of Tehuantepec, creating an alternative rail cargo route to the Panama canal intended to drive development in the region. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/mexico-train-derailment-oaxaca",
      "published": "Mon, 29 Dec 2025 18:48:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief urges world leaders to ‘get priorities straight’ as New Year message calls for peace over war",
      "description": "As the world enters 2026 amid mounting crises, the UN Secretary-General António Guterres has issued a stark but hopeful New Year appeal, urging global leaders to shift resources away from destruction and towards development, peace and people.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166677",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Sri Lanka cyclone: More than a million still need aid weeks after Ditwah floods",
      "description": "Nearly a month after Cyclone Ditwah tore across Sri Lanka, more than a million people – including over half a million children – remain in urgent need of humanitarian assistance, as floods, landslides and renewed rainfall continue to compound one of the country’s worst disasters in decades.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166671",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Key viewing spots for Sydney fireworks reach capacity as city urged to celebrate first New Year’s Eve since Bondi attack",
      "description": "NSW premier Chris Minns encourages Sydneysiders to ‘puff out your chest’, stating police on ‘high alert’ as more than 1 million people expected to celebrate in the city Guide to New Year’s Eve fireworks and events in Australia’s capital cities Get our breaking news email , free app or daily news podcast Thousands of people have taken up key vantage points for New Year’s Eve fireworks, with Chris Minns asking Sydneysiders to “square your shoulders, puff out your chest and walk out” to celebrate as a show of defiance after the Bondi attack. Key viewing sites, including at Mrs Macquarie’s Chair and other areas in the Royal Botanic Garden, were already at capacity on Wednesday afternoon. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/sydney-new-years-eve-fireworks-key-viewing-spots-full-nye-ntwnfb",
      "published": "Wed, 31 Dec 2025 03:57:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Brown University implements campus-wide security overhaul after mass shooting leaves 2 dead, 9 wounded",
      "description": "Brown University announces new safety measures including security cameras after Dec. 13 mass shooting that killed two students in engineering building.",
      "url": "https://www.foxnews.com/us/brown-university-implements-campus-wide-security-overhaul-after-mass-shooting-leaves-2-dead-9-wounded",
      "published": "Tue, 30 Dec 2025 16:14:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran reportedly developing chemical, biological missile warheads as protests spread over collapsing economy",
      "description": "As Netanyahu meets Trump, intelligence suggests Iran accelerating chemical weapons work while facing unprecedented domestic unrest and economic crisis.",
      "url": "https://www.foxnews.com/world/iran-reportedly-developing-chemical-biological-missile-warheads-protests-spread-over-collapsing-economy",
      "published": "Mon, 29 Dec 2025 10:52:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's pres. says answer to attack would be harsh in response to Trump warning",
      "description": "Iranian President Masoud Pezeshkian says his country’s answer to an attack would be harsh",
      "url": "https://abcnews.go.com/International/wireStory/irans-president-answer-attack-harsh-apparent-response-trump-128776925",
      "published": "Tue, 30 Dec 2025 09:22:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "California farming tycoon accused of fatally shooting wife through window amid fight over fortune: report",
      "description": "California farming tycoon charged with murdering estranged wife in Arizona home after cross-state investigation reveals evidence allegedly linking him to the shooting.",
      "url": "https://www.foxnews.com/us/california-farming-tycoon-accused-fatally-shooting-wife-through-window-amid-fight-over-fortune-report",
      "published": "Tue, 30 Dec 2025 18:08:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Nashville shooter Audrey Hale allegedly used federal student aid to buy guns for school attack",
      "description": "Audrey Elizabeth Hale used federal Pell Grant money to purchase firearms for Covenant School shooting in Nashville, according to newly released FBI records.",
      "url": "https://www.foxnews.com/us/nashville-shooter-audrey-hale-allegedly-used-federal-student-aid-buy-guns-school-attack",
      "published": "Mon, 29 Dec 2025 21:29:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Why China is bringing out the big guns for military drills around Taiwan",
      "description": "China stepped up its military drills around Taiwan with live-fire exercises on Tuesday, the second day of an operation dubbed “Justice Mission 2025\". The massive show of force comes at a crucial time as Beijing seeks to capitalise on domestic political tensions in Taiwan and issue a warning to foreign powers supporting Taipei.",
      "url": "https://www.france24.com/en/asia-pacific/20251230-why-china-is-bringing-out-the-big-guns-for-military-drills-around-taiwan",
      "published": "Tue, 30 Dec 2025 16:58:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Afghanistan to remain major crisis in 2026, UN, partners warn",
      "description": "Afghanistan is expected to remain one of the world’s largest humanitarian crises in 2026, UN agencies and humanitarian partners warned on Tuesday, launching a $1.7 billion appeal to assist nearly 18 million people in urgent need.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166684",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN peacekeeper injured in gunfire near ‘Blue Line’ in south Lebanon",
      "description": "One United Nations peacekeeper was injured on Friday after heavy machine gunfire from Israel Defense Forces (IDF) positions south of the Blue Line, following a nearby grenade explosion, impacted close to a UN patrol in southern Lebanon.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166676",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "2025 Most Memorable Heartwarming Moments: December 30, 2025",
      "description": "Choose between Robert Irwin winning Dancing with the Stars, the Nation raising money and supporting LA after the wildfires, or the Election of Pope Leo XIV.",
      "url": "https://www.foxnews.com/us/2025-most-memorable-heartwarming-moments-december-30-2025",
      "published": "Tue, 30 Dec 2025 07:52:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Syria arrests suspects in Latakia after sectarian violence, curfew imposed",
      "description": "Syrian authorities have arrested 21 people in the coastal province of Latakia over alleged links to the ousted government of Bashar al-Assad, state media reported, after sectarian violence prompted an overnight curfew in the provincial capital.",
      "url": "https://www.france24.com/en/middle-east/20251230-syria-arrests-latakia-sectarian-violence-curfew-imposed",
      "published": "Tue, 30 Dec 2025 23:27:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "SECURITY COUNCIL LIVE: Briefing on threats to international peace and security",
      "description": "The UN Security Council meets today to hear a briefing on threats to international peace and security following Israel’s recent recognition of the northern region of Somalia as an independent and sovereign state. Follow live below and UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166679",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Thousands of Somalis protest against Israel's recognition of Somaliland",
      "description": "In tonight's edition, the largest ever protests against Israel's recognition of Somaliland are organised across Somalia. Also, a blown tyre and high speed are behind the accident that left boxer Anthony Joshua just injured in a Nigerian hospital. And Abuja ends the year still unpicking the complex ramifications of the US’s airstrikes on alleged extremist camps in Nigeria’s northwest.",
      "url": "https://www.france24.com/en/tv-shows/eye-on-africa/20251230-thousands-of-somalis-protest-against-israel-s-recognition-of-somaliland",
      "published": "Tue, 30 Dec 2025 21:26:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How climate change is threatening human rights",
      "description": "With rising effects of climate change across the globe, the world has started recognising that climate change is not just an ecological collapse, but also a human rights crisis.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166649",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Industrialisation without destruction: A UN blueprint for the future",
      "description": "Since the 19th century, industrialisation has had a transformative effect on the world, both positive and negative. It has created jobs and lifted millions out of poverty. But it has also had devastating consequences; destroying ecosystems, polluting the air, and driving the climate crisis that threatens to make large parts of the planet uninhabitable.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166635",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian protesters clash with security forces as tear gas fills Tehran streets amid nationwide unrest",
      "description": "Iran protests escalated as demonstrators clashed with security forces in Tehran and Mashhad, with tear gas deployed amid nationwide strikes, reports say.",
      "url": "https://www.foxnews.com/world/iranian-protesters-clash-security-forces-tear-gas-fills-tehran-streets-amid-nationwide-unrest",
      "published": "Mon, 29 Dec 2025 20:05:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump vows to 'knock the hell out of' Iran if nuclear program is rebuilt again after high-stakes meeting",
      "description": "Trump warns Iran he'll 'knock the hell out of them' if nuclear program rebuilds, as new reports allegedly detail chemical weapons development for missiles.",
      "url": "https://www.foxnews.com/world/trump-vows-knock-hell-out-of-iran-nuclear-program-rebuilt-again-after-high-stakes-meeting",
      "published": "Mon, 29 Dec 2025 14:40:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua injured in Nigeria car crash that killed two team members",
      "description": "The British heavyweight boxer suffered minor injuries in the crash, which killed two team members and close friends.",
      "url": "https://www.bbc.com/news/articles/c8989e1wnj2o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 07:45:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Trump ‘not worried’ as China’s live-fire Taiwan wargame enters second day",
      "description": "US president says Chinese leader did not notify him of drills that have involved live missile launches into Taiwan strait Taiwan-China tensions – explained in 30 seconds Donald Trump has said he is not worried by China’s live-fire military drills surrounding Taiwan and that he has a great relationship with the Chinese leader, Xi Jinping, who “hasn’t told me anything about it”. The US president’s comments came amid a large two-day surprise attack simulation launched by the People’s Liberation Army (PLA) on Monday and Tuesday, which China has called “Justice Mission 2025”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/trump-not-worried-china-military-live-fire-drills-taiwan",
      "published": "Tue, 30 Dec 2025 10:56:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Two trains carrying tourists to Machu Picchu crash - as one person killed",
      "description": "At least one person has been killed and around 30 passengers have been injured after two trains taking tourists to Machu Picchu in Peru crashed.",
      "url": "https://news.sky.com/story/two-trains-carrying-tourists-to-machu-picchu-crash-as-one-person-killed-13488953",
      "published": "Tue, 30 Dec 2025 23:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "UN renews ceasefire push in Sudan",
      "description": "The UN has urged Sudan’s warring parties to pursue compromise and an immediate ceasefire, even as drone attacks, displacement and the killing of peacekeepers underscore the growing risks to civilians and humanitarians.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166675",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Anti-Iran regime protests grow across country as Trump admin boosts demonstrators offering support",
      "description": "U.S. officials voice support for Iranian demonstrators as protests intensify following currency crisis, with reports of tear gas and security crackdowns.",
      "url": "https://www.foxnews.com/world/anti-iran-regime-protests-grow-across-country-trump-admin-boosts-demonstrators-offering-support",
      "published": "Tue, 30 Dec 2025 12:47:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Nigeria: Can US airstrikes weaken Islamist militants?",
      "description": "Details remain sparse on the effectiveness of the United States' airstrikes on Islamist militants in Nigeria last week. However, the event signals a shift in US-Nigeria cooperation on fighting terror.",
      "url": "https://www.dw.com/en/nigeria-can-us-airstrikes-weaken-islamist-militants/a-75333828?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 16:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Russia's nuclear-capable Oreshnik missiles have entered active service, Moscow says",
      "description": "Russia’s nuclear-capable Oreshnik missile system has entered active service, Russia’s Ministry of Defense says, as negotiators continue to search for a breakthrough in peace talks to end Moscow’s war in Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/russias-nuclear-capable-oreshnik-missiles-entered-active-service-128774458",
      "published": "Tue, 30 Dec 2025 07:13:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Missing elderly person found in bitter cold woods after police deploy thermal imaging drone",
      "description": "Philadelphia police rescued a missing elderly person from a wooded area Sunday using thermal imaging drone technology in coordinated search effort.",
      "url": "https://www.foxnews.com/us/missing-elderly-person-found-bitter-cold-woods-after-police-deploy-thermal-imaging-drone",
      "published": "Tue, 30 Dec 2025 22:28:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘Only Trump can stop Russia’: Millions face freezing winter, Ukraine energy executive warns",
      "description": "Ukraine's largest private energy company reports 90% of generation capacity damaged by Russian attacks, leaving over 1 million without power during freezing temperatures.",
      "url": "https://www.foxnews.com/world/only-trump-can-stop-russia-millions-face-freezing-winter-ukraine-energy-executive-warns",
      "published": "Mon, 29 Dec 2025 17:18:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "The 'thorny' issues that threaten to derail a Russia-Ukraine peace deal",
      "description": "Two of the main sticking points involve territory and the fate of Europe's biggest nuclear plant, which is currently occupied by Russia.",
      "url": "https://www.bbc.com/news/articles/c78v5dj3x39o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 17:33:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "What challenges does the world economy face in 2026?",
      "description": "From trade tensions and high debt burdens to fears of an AI stocks bubble, the global economy will face an array of risks that could dampen growth in the new year.",
      "url": "https://www.dw.com/en/what-challenges-does-the-world-economy-face-in-2026/a-75238039?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 11:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UAE to withdraw forces from Yemen amid crisis with Saudi Arabia",
      "description": "The UAE said Tuesday it would withdraw its remaining forces from Yemen after Saudi Arabia led an airstrike on a southern Yemeni port targeting what it said was a UAE-linked weapons shipment. Following the strike, Saudi Arabia backed calls for UAE forces to leave the country within 24 hours.",
      "url": "https://www.france24.com/en/middle-east/20251230-yemeni-separatists-reject-calls-to-withdraw-after-saudi-port-strike",
      "published": "Tue, 30 Dec 2025 15:31:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Syrian authorities impose curfew in Latakia as violence surges",
      "description": "Cars and shops were vandalised during attacks on Alawite neighbourhoods in the city.",
      "url": "https://www.aljazeera.com/news/2025/12/30/syrian-authorities-impose-curfew-in-latakia-as-violence-surges?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 19:48:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Influx of cheap Chinese imports could drive down UK inflation, economists say",
      "description": "As Trump’s tariffs take effect, Britain is likely alternative destination for cars, telecoms and sound equipment Business live – latest updates The UK is poised for an influx of cheap Chinese imports that could bring down inflation amid the fallout from Donald Trump’s global trade war, leading economists have said. After figures showed China’s trade surplus surpassed $1tn (£750bn) despite Washington’s tariff policies hitting exports to the US, the Bank of England said the UK was among the nations emerging as alternative destinations for the goods. Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/29/chinese-imports-uk-inflation-trump-tariffs",
      "published": "Mon, 29 Dec 2025 11:19:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Russia accuses Ukraine of attempted drone strike, threatens to harden peace stance",
      "description": "Russia says Ukraine tried to hit one of Putin's homes with a drone. Kyiv denies it, calling the claim staged to justify war. The Kremlin now warns it may toughen its stance in the ongoing peace talks.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660691/russia-accuses-ukraine-of-attempted-drone-strike-threatens-to-harden-peace-stance",
      "published": "Tue, 30 Dec 2025 04:52:22 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Germany news: Fireworks back on sale, reignite ban debate",
      "description": "Germany's perennial debate over safety has flared up once again as fireworks sales resume ahead of New Year. Meanwhile, a spate of black ice has caused numerous accidents across the country. Follow our updates.",
      "url": "https://www.dw.com/en/germany-news-fireworks-back-on-sale-reignite-ban-debate/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 21:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "UAE to withdraw ‘counterterrorism’ units from Yemen after Saudi-led strike",
      "description": "The UAE says it’s withdrawing all ‘counterterrorism’ units from Yemen after a Saudi-led coalition launched air strikes.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/30/uae-to-withdraw-counterterrorism-units-from-yemen-after-saudi-led-strike?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 22:37:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Tensions between Saudis and Emiratis over future of Yemen reach boiling point",
      "description": "Dispute has potential to create civil war in south of Yemen and spill over into neighbouring countries Tensions between the United Arab Emirates and Saudi Arabia over the future of Yemen and the imminent possibility of the declaration of an independent southern state have reached boiling point with Saudi Arabia in effect accusing the UAE of threatening its future security. The dispute has the potential to create a civil war within the south of Yemen and also spill over into other disputes including in Sudan and the Horn of Africa where the two countries often find themselves backing opposite sides. Yemen could yet become only one theatre in which the two vastly wealthy Gulf states vie for political influence, control of shipping lanes and commercial access. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/saudi-arabia-uae-tension-future-yemen-boiling-point",
      "published": "Tue, 30 Dec 2025 17:19:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "‘Tonga is not a threat’: anger as small Pacific nation falls under Trump visa restrictions",
      "description": "Community leaders raise alarm over study links and Polynesian ties, with Tonga to face restrictions from January as US says too many overstay The small Pacific nation of Tonga is one of more than a dozen countries to be hit with visa and entry restrictions on 1 January as the Trump administration tightens its crackdown on immigration. In December , the US said it would further restrict and limit the entry of foreign nationals to protect the country from “national security and public safety threats”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/tonga-under-usa-trump-visa-ban",
      "published": "Wed, 31 Dec 2025 01:30:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "George and Amal Clooney become French after naturalisation process",
      "description": "US actor and British-Lebanese international human rights lawyer George and Amal Clooney have become French citizens after they were naturalised with their two children. The family bought a house on a vineyard in the south of France in 2021 and have become involved in the local life. The naturalisation of the Clooneys comes as some Americans, including a number of celebrities, are seeking citizenship in European nations, partially motivated by the Trump administration.",
      "url": "https://www.france24.com/en/video/20251230-george-and-amal-clooney-become-french-after-naturalisation-process",
      "published": "Tue, 30 Dec 2025 15:34:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sexual violence against children ‘entrenched, systemic and widespread’ across DR Congo, UNICEF warns",
      "description": "Sexual violence against children has become entrenched, systemic and increasingly widespread across the Democratic Republic of the Congo (DRC), with new data showing a sharp rise in cases since 2022, according to the UN Children’s Fund (UNICEF).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166683",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Judge halts Homeland Security plan to end Temporary Protected Status for South Sudan",
      "description": "A federal judge temporarily blocked DHS from ending TPS for South Sudan, preserving legal status for hundreds amid ongoing conflict concerns.",
      "url": "https://www.foxnews.com/us/judge-halts-homeland-security-plan-end-temporary-protected-status-south-sudan",
      "published": "Tue, 30 Dec 2025 14:51:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains 357 suspected IS members in nationwide raids",
      "description": "The arrests come just a day after three police officers were killed during a siege in the town of Yalova.",
      "url": "https://www.bbc.com/news/articles/c4g5gq19n9zo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 10:38:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Turkiye’s Erdogan calls Israel’s Somaliland recognition ‘unacceptable’",
      "description": "Somali President Hassan Sheikh Mohamud has accused Israel of violating international law and of 'illegal aggression'.",
      "url": "https://www.aljazeera.com/news/2025/12/30/trkiyes-erdogan-calls-israels-somaliland-recognition-unacceptable?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 21:49:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Central African Republic goes to polls as president seeks third term",
      "description": "Opposition hopes to tap into frustrations of people living in country where conflict remains a daily reality Central African Republic goes to the polls on Sunday with the president, Faustin-Archange Touadéra, seeking a third term. As many as 2.3 million registered voters will cast ballots for what observers are calling a quadruple election: votes for the presidency and parliament as well as local and municipal offices. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/central-african-republic-goes-to-polls-as-president-seeks-third-term",
      "published": "Sun, 28 Dec 2025 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela says it released 99 people detained for 2024 election protests",
      "description": "Government said the move was due to its ‘unrestricted respect for human rights’ in the face of US aggression Venezuela has said it has carried out its largest release of political prisoners this year, claiming to have freed 99 people detained for taking part in protests after the 2024 election, widely believed to have been stolen by the dictator Nicolás Maduro , as it comes under increasing military pressure from the US. Civil society organisations have treated the news with caution and stressed that the releases were insufficient, noting that at least 900 political prisoners remain in the country. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/venezuela-political-prisoner-release",
      "published": "Fri, 26 Dec 2025 14:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "A professor breaks down Russia's negotiating tactics with Ukraine",
      "description": "Nina Khrushcheva, professor of International Affairs at New York's New School, talks about the negotiating tactics Russia is using in peace talks with Ukraine.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660716/a-professor-breaks-down-russias-negotiating-tactics-with-ukraine",
      "published": "Tue, 30 Dec 2025 04:52:01 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Russia says hit by drone attack",
      "description": "Russia said its air defenses shot down drones over the Moscow region, parts of western Russia and the occupied Crimean Peninsula. Meanwhile, a power outage hit a town outside the capital, Moscow. Follow DW for more.",
      "url": "https://www.dw.com/en/ukraine-updates-russia-says-hit-by-drone-attack/live-75346952?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 03:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "An escalation in Yemen threatens to reignite civil war and widen tensions in the Gulf",
      "description": "Saudi Arabia bombed Yemen's port city of Mukalla, targeting a shipment of weapons from the United Arab Emirates for separatist forces. The UAE later said it would withdraw its forces from Yemen.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103991/yemen-conflict",
      "published": "Tue, 30 Dec 2025 11:48:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Sudan defying war to bring joy at AFCON 2025",
      "description": "A brutal civil war has been raging in Sudan since 2023. The national football team is participating in the Africa Cup of Nations in Morocco with more than just sporting success in mind.",
      "url": "https://www.dw.com/en/sudan-defying-war-to-bring-joy-at-afcon-2025/a-75341174?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Machu Picchu train crash leaves one dead and dozens injured",
      "description": "A train driver died and at least 40 people were injured in the crash on the single-track line to Machu Picchu.",
      "url": "https://www.bbc.com/news/articles/cn9zl309dz8o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 01:15:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump hopes to reach phase two of Gaza ceasefire 'very quickly'",
      "description": "The US president also warns Hamas will have \"hell to pay\" if it does not disarm, after talks with Netanyahu.",
      "url": "https://www.bbc.com/news/articles/cdj8jmxyzneo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 05:04:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "UAE says it will withdraw from Yemen after Saudi strike on separatist-held port",
      "description": "The UAE and Saudi have been allies in the war against the Houthis, but infighting between the rival factions they support has caused a rift between them.",
      "url": "https://www.bbc.com/news/articles/c8xdxz48l7yo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 18:22:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Train crash near Peru’s Machu Picchu kills driver, injures dozens",
      "description": "Train conductor killed in collision on rail line serving the famed archaeological site, authorities say.",
      "url": "https://www.aljazeera.com/news/2025/12/31/train-crash-near-perus-machu-picchu-kills-driver-injures-dozens?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 01:05:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The UAE denies shipping weapons to Yemen after overnight Saudi strike",
      "description": "In an overnight strike, the Saudi military hit a Yemeni port saying they were neutralising a weapons shipments arriving from UAE and meant for the STC separatist group. The UAE has denied the shipment contained weapons and claimed the vehicles were not intended for any groups. Both countries have supported the fighting sides in the over-decade long war in Yemen, but this strike has turned this rivalry into an open dispute.",
      "url": "https://www.france24.com/en/video/20251230-the-uae-denies-shipping-weapons-to-yemen-after-overnight-saudi-strike",
      "published": "Tue, 30 Dec 2025 14:49:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "China fires rockets into waters off Taiwan in second day of military drills",
      "description": "China has fired rockets into the waters off Taiwan on a second day of large-scale war games around the island aimed at rehearsing a blockade.",
      "url": "https://news.sky.com/story/china-fires-rockets-into-waters-off-taiwan-in-second-day-of-military-drills-13488623",
      "published": "Tue, 30 Dec 2025 07:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Key dates in Taiwan’s history: A contested island's evolution",
      "description": "China has been staging live-fire military drills around Taiwan featuring aircraft, warships and rocket launches",
      "url": "https://abcnews.go.com/International/wireStory/key-dates-taiwans-history-contested-islands-evolution-128775366",
      "published": "Tue, 30 Dec 2025 07:29:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Body found during search for missing Texas teen Camila Mendoza Olmos as another teen girl disappears",
      "description": "Texas authorities find body and firearm during search for 19-year-old Camila Olmos who vanished Christmas Eve from Bexar County in ongoing case.",
      "url": "https://www.foxnews.com/us/body-found-during-search-missing-texas-teen-camila-mendoza-olmos-another-teen-girl-disappears",
      "published": "Tue, 30 Dec 2025 20:23:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "China launches largest military drills off Taiwan in 8 months with live-fire exercises caught on camera",
      "description": "China launches biggest military encirclement of Taiwan in 8 months with live-fire drills, rockets and warships in massive 'Justice Mission 2025' exercise.",
      "url": "https://www.foxnews.com/world/china-launches-largest-military-drills-taiwan-8-months-live-fire-exercises-caught-camera",
      "published": "Tue, 30 Dec 2025 17:50:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "U.S. announces more military actions against ISIS: 'We will not relent'",
      "description": "CENTCOM declared that the U.S. and partner forces in Syria killed and captured ISIS figures in the time since a December 19 strike in Syria.",
      "url": "https://www.foxnews.com/world/u-s-announces-more-military-actions-against-isis-we-not-relent",
      "published": "Tue, 30 Dec 2025 10:17:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "M 6.0 - 2025 Taitung, Taiwan Earthquake",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VI Time 2025-12-24 09:47:06 UTC 2025-12-24 09:47:06 UTC at epicenter Location 22.851°N 121.207°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rkjm",
      "published": "2025-12-27T15:33:29.814Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UK PM Starmer–praised Egyptian extremist faces counter-terror probe over resurfaced tweets",
      "description": "U.K. counterterrorism police assess controversial social media posts by Egyptian-British activist after his return to Britain sparked political backlash.",
      "url": "https://www.foxnews.com/world/uk-pm-starmer-praised-egyptian-extremist-faces-counter-terror-probe-over-resurfaced-tweets",
      "published": "Tue, 30 Dec 2025 17:48:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UAE to withdraw forces from Yemen after Saudi strike",
      "description": "The UAE said it was withdrawing voluntarily after Yemen's Saudi-backed presidential council canceled a defense pact with the UAE and asked its forces to leave the country within 24 hours.",
      "url": "https://www.dw.com/en/uae-to-withdraw-forces-from-yemen-after-saudi-strike/a-75338239?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 14:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Eurostar suspends 'all trains' between London and Europe",
      "description": "Eurostar suspended services in the ⁠tunnel that links Britain and continental Europe. The company warned earlier of disruptions due to an overhead power supply issue.",
      "url": "https://www.dw.com/en/eurostar-suspends-all-trains-between-london-and-europe/a-75342682?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran protests spread to students on third day",
      "description": "The drop in value in Iran's rial and the country getting close to hyperinflation has increased the cost of living for many Iranians. After shopkeepers started protesting on December 28, Iranian students joined in on December 30. The protests are the biggest the country has known since the 'Woman, Life, Freedom' movement in 2022. FRANCE 24's Philip Turle tells us more.",
      "url": "https://www.france24.com/en/video/20251230-iran-protests-spread-to-students-on-third-day",
      "published": "Tue, 30 Dec 2025 16:53:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iranian university students join protests over soaring cost of living",
      "description": "University students in Iran have joined shopkeepers and bazaar merchants in protests over the country's soaring cost of living.",
      "url": "https://news.sky.com/story/iranian-university-students-join-protests-over-soaring-cost-of-living-13488739",
      "published": "Tue, 30 Dec 2025 16:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Sudan: UN warns of unprecedented child hunger in Darfur as fighting fuels refugee exodus",
      "description": "Sudan’s deepening war is driving unprecedented levels of hunger, child malnutrition and displacement, UN agencies report, as new data from Darfur and a renewed refugee influx into Chad underscore the rapidly deteriorating situation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166682",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Gaza battered by heavy rains as humanitarian response continues",
      "description": "Severe weather conditions have led to further casualties and heightened health risks in Gaza over the past 24 hours, the UN aid coordination office (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166680",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Is the US economy strong heading into 2026? The picture is complicated",
      "description": "The world's top economy is growing faster than its peers, but divide between wealthy and poorer Americans is growing.",
      "url": "https://www.aljazeera.com/news/2025/12/30/is-the-us-economy-strong-heading-into-2026-the-picture-is-complicated?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 23:55:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump, Netanyahu meet over ceasefire. And, Russia accuses Ukraine of attempted strike",
      "description": "Conditions are dire for people in Gaza as President Trump and Israel's prime minister discuss the next phase of the ceasefire deal. And, Russia accuses Ukraine of an attempted drone strike.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103964/up-first-newsletter-trump-benjamin-netanyahu-ukraine-peace-talk-doge",
      "published": "Tue, 30 Dec 2025 07:12:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Morning news brief",
      "description": "Trump and Israel's prime minister discuss next phase of Gaza peace plan, Russia threatens to harden stance in peace talks after accusing Ukraine attempted strike, the impact of DOGE in 2025.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5653382/morning-news-brief",
      "published": "Tue, 30 Dec 2025 04:52:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Syria imposes curfew in port city after sectarian violence",
      "description": "Syrian authorities announced a 13-hour curfew and said the arrest of 21 members of the Alawite community in Latakia. The city is a bastion of Syria's Alawite minority, of which former President Bashar Assad was part.",
      "url": "https://www.dw.com/en/syria-imposes-curfew-in-port-city-after-sectarian-violence/a-75345475?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 19:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Turkey detains 357 suspects after 'Islamic State' clashes",
      "description": "Turkish police have made hundreds of arrests in nationwide raids against suspected \"Islamic State\" networks. The sweep followed hours-long street fighting that left police and militants dead.",
      "url": "https://www.dw.com/en/turkey-detains-357-suspects-after-islamic-state-clashes/a-75343106?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 13:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cyprus back at the helm of EU Council presidency",
      "description": "After 14 years, Cyprus takes over the rotating presidency of the Council of the European Union on January 1. It will lead during a politically sensitive moment, and aims to shape the EU's role on the global stage.",
      "url": "https://www.dw.com/en/cyprus-back-at-the-helm-of-eu-council-presidency/a-75328041?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Miners clash with police in Bolivia as protests over fuel subsidies enter second week",
      "description": "Bolivian miners have set off dynamite and launched fireworks at police during protests against economic reforms by President Rodrigo Paz",
      "url": "https://abcnews.go.com/International/wireStory/miners-clash-police-bolivia-protests-fuel-subsidies-enter-128792998",
      "published": "Tue, 30 Dec 2025 18:05:17 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "First Person: Felipe Paullier, the youngest ever senior UN official, charged with giving a voice to young people around the world",
      "description": "A paediatrician by training, Felipe Paullier has long been an advocate for youth. Formerly Director of the Uruguayan Government's Youth Institute, a role which involved several joint actions with various UN agencies, he was appointed to run the UN Youth Office in 2023, the youngest senior appointment in United Nations history.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166651",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Paper and wood: Forest products show signs of recovery, UN agency says",
      "description": "From wood-based panels used in construction, to charcoal for cooking food, forest products are valued and traded all around the world.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166666",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Feds launch 'massive operation' in Minnesota amid fraud scandal",
      "description": "Federal authorities launched a massive operation in Minnesota targeting fraud suspects in a major crackdown on criminal activity across the state Tuesday.",
      "url": "https://www.foxnews.com/us/feds-launch-massive-operation-minnesota-fraud-scandal",
      "published": "Tue, 30 Dec 2025 12:14:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Russia's losses in Ukraine rise faster than ever as US pushes for peace deal",
      "description": "A steep rise in soldiers' obituaries is documented by the BBC as part of its work in counting Russian war losses.",
      "url": "https://www.bbc.com/news/articles/c62n922dnw7o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 00:12:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine denies drone attack on Putin's residence",
      "description": "Russia has accused Ukraine of targeting a presidential residence, which President Zelensky called \"typical Russian lies\".",
      "url": "https://www.bbc.com/news/articles/c4g4g5lgngvo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 11:43:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,406",
      "description": "These are the key developments from day 1,406 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2025/12/31/russia-ukraine-war-list-of-key-events-day-1406?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 03:52:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel to block dozens of aid groups working in war-battered Gaza",
      "description": "Aid groups facing bans include MSF and Oxfam as European countries sound the alarm over dire humanitarian situation.",
      "url": "https://www.aljazeera.com/news/2025/12/30/israel-says-it-will-halt-operations-of-several-ngos-in-gaza?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 20:30:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: Merz says 2026 can be a 'year of new beginnings'",
      "description": "Chancellor Friedrich Merz touched on war in Ukraine, increased defense spending, changing ties to the US, technological upheaval, industrial stagnation, sluggish reforms, migration and more in his New Year's address.",
      "url": "https://www.dw.com/en/germany-merz-says-2026-can-be-a-year-of-new-beginnings/a-75344460?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 23:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Congo president Sassou Nguesso to seek re-election in March 2026",
      "description": "Congo is heading towards another tightly watched presidential race after the ruling Congolese Labour Party confirmed it will again back veteran leader Denis Sassou Nguesso, extending the 82-year-old’s decades-long grip on power into a 2026 election already drawing opposition scrutiny.",
      "url": "https://www.france24.com/en/africa/20251230-congo-president-sassou-nguesso-seeks-re-election-2026",
      "published": "Tue, 30 Dec 2025 23:58:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brigitte Bardot's funeral divides French politics: Le Pen to attend, Macron sits out",
      "description": "France's far-right leader Marine Le Pen will attend the screen legend Brigitte Bardot's funeral next week, but President Emmanuel Macron will not, their teams said on Tuesday. In her later years, Bardot was an outspoken supporter of the far right and was convicted in court for hate speech, stirring debate over whether or not France should give her the honour of a national farewell ceremony.",
      "url": "https://www.france24.com/en/live-news/20251230-far-right-leader-le-pen-to-attend-brigitte-bardot-s-funeral",
      "published": "Tue, 30 Dec 2025 19:17:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Danish post office delivers last letter, ending a 400-year run to adapt to the digital age",
      "description": "It's the end of an era for the Danish post office. Citing a 90% drop in letter-sending over the past quarter-century, PostNord has ended delivering paper letters in the country, a service first started in 1624. Plus, France is set to issue €310 billion in new sovereign bonds next year, a move that's set to complicate its effort to reduce its debt pile, already at over 117% of GDP.",
      "url": "https://www.france24.com/en/tv-shows/business/20251230-danish-post-office-delivers-last-letter-ending-a-400-year-run-to-adapt-to-the-digital-age",
      "published": "Tue, 30 Dec 2025 18:08:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Situation in Gaza is 'catastrophic’, foreign ministers from 10 countries warn",
      "description": "A group of 10 countries, including France, warned on Tuesday that the situation in Gaza was \"catastrophic\" due to the \"renewed deterioration of the humanitarian situation\" in the Palestinian enclave. They called on Israel to allow greater access for NGOs and to lift restrictions on importing essential medical and shelter equipment.",
      "url": "https://www.france24.com/en/live-news/20251230-10-countries-warn-of-catastrophic-gaza-situation",
      "published": "Tue, 30 Dec 2025 17:15:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Leaders from Europe and Canada discuss US-led peace efforts as Russia-Ukraine tensions spike",
      "description": "Leaders from Europe and Canada have held talks on U.S.-led peace efforts to end the war between Russia and Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/european-leaders-discuss-us-led-peace-efforts-russia-128775457",
      "published": "Tue, 30 Dec 2025 09:13:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Missing Camila Mendoza Olmos: Dashcam captures last sighting of Texas teen who vanished Christmas Eve",
      "description": "Texas authorities release dashcam video showing missing 19-year-old Camila Mendoza Olmos walking alone on Christmas Eve, believed in imminent danger.",
      "url": "https://www.foxnews.com/us/missing-camila-mendoza-olmos-dashcam-captures-last-sighting-texas-teen-who-vanished-christmas-eve",
      "published": "Tue, 30 Dec 2025 10:01:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Armed Americans fight back: Inside 2025’s most gripping self-defense shootings across the US",
      "description": "Self-defense shootings made headlines across America in 2025. Texas donut shop owner, Virginia homeowner fight back against alleged armed robbers.",
      "url": "https://www.foxnews.com/us/armed-americans-fight-back-inside-2025-most-gripping-self-defense-shootings-across-us",
      "published": "Tue, 30 Dec 2025 08:00:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "These crimes exposed America's deepest fractures and kept millions glued to their screens",
      "description": "The most gripping crime stories of 2025 included Charlie Kirk's assassination, an ISIS-inspired New Orleans attack and murder trials that revealed deep fractures in society.",
      "url": "https://www.foxnews.com/us/crimes-exposed-americas-deepest-fractures-kept-millions-glued-screens",
      "published": "Tue, 30 Dec 2025 06:00:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Putin residence drone attack dismissed as ‘implausible’ as Ukraine accusations mount",
      "description": "Russian President Vladimir Putin's residence allegedly targeted by Ukrainian drones, but drone expert Cameron Chell says the claims lack credibility due to tactical impossibilities.",
      "url": "https://www.foxnews.com/world/putin-residence-drone-attack-dismissed-hard-fathom-ukraine-accusations-mount",
      "published": "Tue, 30 Dec 2025 21:59:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy denies Russian claim that Ukraine attacked Putin residence",
      "description": "Ukrainian President Volodymyr Zelenskyy calls alleged drone attack on Russian President Vladimir Putin's residence a \"complete fabrication\" as tensions escalate between Ukraine and Russia.",
      "url": "https://www.foxnews.com/world/zelenskyy-denies-russian-claim-ukraine-attacked-putin-residence",
      "published": "Mon, 29 Dec 2025 11:56:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump meets with Zelenskyy; talks could unlock first Zelenskyy-Putin call in five years: source",
      "description": "President Donald Trump assumes mediator role as talks with President Volodymyr Zelenskyy focus on a U.S.-backed 20-point peace plan that could end the war in Ukraine.",
      "url": "https://www.foxnews.com/world/trump-meets-zelenskyy-talks-could-unlock-first-zelenskyy-putin-call-five-years-source",
      "published": "Sun, 28 Dec 2025 16:30:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK flag clash as foreign banners fly, citizens push back against woke policies reshaping Britain",
      "description": "New polling reveals deep splits over Union Jack symbolism as Britain's changing demographics fuel heated debate about national flags and identity.",
      "url": "https://www.foxnews.com/world/uk-flag-clash-foreign-banners-fly-citizens-push-back-against-woke-policies-reshaping-britain",
      "published": "Sun, 28 Dec 2025 11:57:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "SoftBank to acquire DigitalBridge for $4bn in move to deepen ties to AI",
      "description": "Acquisition would further expand SoftBank’s investments in artificial intelligence as it tries to center itself in the boom SoftBank Group will acquire digital infrastructure investor DigitalBridge Group in a deal valued at $4bn, the companies said on Monday, as the Japanese investment firm looks to deepen its AI-related portfolio. The acquisition would expand SoftBank’s exposure to digital infrastructure as the Japanese conglomerate is positioning its portfolio to focus on artificial intelligence. SoftBank’s billionaire founder Masayoshi Son is seeking to capitalize on surging demand for the computing capacity that underpins artificial intelligence applications. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/29/softbank-digitalbridge-deal-artificial-intelligence",
      "published": "Mon, 29 Dec 2025 15:05:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Iran: Students join economic protests, president seeks talks",
      "description": "Students demonstrated at several universities in Iran, semi-official media reported, after demos by shopkeepers and bazaar merchants moved the president to announce plans for talks with protesters online.",
      "url": "https://www.dw.com/en/iran-students-join-economic-protests-president-seeks-talks/a-75346547?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 22:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Almost half of all Germans want a ban on fireworks",
      "description": "In Germany, it is only permitted to sell fireworks in the three days leading up to New Year’s Eve. Some line up early to buy them, but others have safety concerns and want to see them banned altogether.",
      "url": "https://www.dw.com/en/almost-half-of-all-germans-want-a-ban-on-fireworks/a-75345435?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 19:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "French right pushes for national tribute to film star Brigitte Bardot",
      "description": "A petition for a national homage to Brigitte Bardot - who died on Sunday - attracts more than 23,000 signatures.",
      "url": "https://www.bbc.com/news/articles/cp848g51zd3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 11:20:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Israel’s recognition of Somaliland ‘strange, unexpected’: Somali president",
      "description": "Hassan Sheikh Mohamud says his country believes the move is linked to Israel's plans to forcibly displace Palestinians.",
      "url": "https://www.aljazeera.com/news/2025/12/31/israels-recognition-of-somaliland-strange-unexpected-somali-president?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 03:43:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Disney to pay $10m over alleged breaches of US child privacy laws",
      "description": "Settlement comes after US Federal Trade Commission accused entertainment giant of unlawfully collecting children's data",
      "url": "https://www.aljazeera.com/economy/2025/12/31/disney-to-pay-10m-over-alleged-breaches-of-us-child-privacy-laws?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 02:42:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Indian cinema: National pride meets box office success",
      "description": "A wave of Bollywood films reflecting the BJP government's narratives is reshaping Indian cinema and finding major commercial success.",
      "url": "https://www.dw.com/en/indian-cinema-national-pride-meets-box-office-success/a-75345014?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 16:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea coup leader Doumbouya elected president in provisional results",
      "description": "More than three years after taking power in a military coup, Guinea’s junta leader Mamady Doumbouya secured a sweeping election victory on Tuesday that cements his grip on the presidency, in a vote critics say was held in a tightly controlled political environment as the country seeks to draw a line under years of upheaval.",
      "url": "https://www.france24.com/en/africa/20251231-guinea-coup-leader-doumbouya-elected-president",
      "published": "Wed, 31 Dec 2025 00:24:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "What's inside Mexico's Popocatépetl volcano? Scientists obtain first 3D images",
      "description": "Scientists from Mexico’s National Autonomous University have created the first three-dimensional image of the Popocatépetl volcano's interior",
      "url": "https://abcnews.go.com/International/wireStory/inside-mexicos-popocatpetl-volcano-scientists-obtain-3d-images-128772717",
      "published": "Tue, 30 Dec 2025 00:26:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mali and Burkina Faso impose retaliatory travel ban on US nationals",
      "description": "Mali and Burkina Faso have banned U.S. citizens from entering their countries",
      "url": "https://abcnews.go.com/International/wireStory/mali-burkina-faso-impose-retaliatory-travel-ban-us-128795911",
      "published": "Tue, 30 Dec 2025 22:15:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Russia sends 3 Iranian satellites into orbit, report says",
      "description": "Iran's state television says that Russia has sent three Iranian communications satellites into orbit",
      "url": "https://abcnews.go.com/International/wireStory/russia-sends-3-iranian-satellites-orbit-report-128733142",
      "published": "Sun, 28 Dec 2025 13:04:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "George Clooney ditches Hollywood culture for France, gains citizenship with wife and twins",
      "description": "George Clooney and wife Amal become French citizens with their twins, trading Hollywood glamor for peaceful farm life in the French countryside together.",
      "url": "https://www.foxnews.com/world/george-clooney-ditches-hollywood-culture-france-gains-citizenship-wife-twins",
      "published": "Mon, 29 Dec 2025 16:37:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Protests spread across Iran for third day after currency hits record low",
      "description": "The Iranian rial hit a record low against the US dollar on Sunday, prompting shopkeepers in Tehran to stage protests, which have quickly spread.",
      "url": "https://www.bbc.com/news/articles/cqj2llkjv8vo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 16:31:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thailand releases 18 Cambodian soldiers as ceasefire holds",
      "description": "Thailand hands over 18 soldiers after 155 days of captivity as truce agreed over the weekend continues to hold.",
      "url": "https://www.aljazeera.com/news/2025/12/31/thailand-releases-18-cambodian-soldiers-as-ceasefire-holds?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 04:53:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "UAE to pull forces out of Yemen after calls for withdrawal, Saudi strike",
      "description": "Move comes after Riyadh accused Abu Dhabi of backing separatists in Yemen, a claim the UAE denies.",
      "url": "https://www.aljazeera.com/news/2025/12/31/uae-to-pull-forces-out-of-yemen-as-tensions-rise-with-saudi-arabia?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 01:11:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Arsenal crush Aston Villa in Premier League; Wolves hold Man United",
      "description": "Arsenal storm to 4-1 win against Aston Villa to strengthen EPL title credentials, but Man Utd limp against lowly Wolves.",
      "url": "https://www.aljazeera.com/sports/2025/12/30/arsenal-crush-aston-villa-in-premier-league-wolves-hold-man-united?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 23:04:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US struck ‘big facility’ in Venezuela, Trump claimed without offering details",
      "description": "Trump alleged that US forces hit ‘very hard’ in what would mark his team’s first land strike on Venezuela if confirmed Donald Trump has claimed that US forces struck a “big facility” in Venezuela last week – but the president did not specify what it was, or where, and the White House has not commented further. “We just knocked out – I don’t know if you read or you saw – they have a big plant, or a big facility, where the ships come from. Two nights ago, we knocked that out. So we hit them very hard,” Trump told Republican donor and New York supermarket owner John Catsimatidis on Friday. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/29/trump-venezuela-facility-strike",
      "published": "Mon, 29 Dec 2025 17:30:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China flexes blockade capabilities near Taiwan on second day of military drills",
      "description": "China's People's Liberation Army is staging a second day of large-scale military drills around Taiwan. It's unleashing live-fire exercises as part of what it calls \"Justice Mission 2025.\"",
      "url": "https://www.npr.org/2025/12/30/g-s1-103963/china-flexes-blockade-capabilities-near-taiwan-on-second-day-of-military-drills",
      "published": "Tue, 30 Dec 2025 06:52:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump and Netanyahu meet to discuss next phase of Gaza ceasefire plan",
      "description": "Israel's prime minister met President Trump at the White House Monday to discuss next steps in the peace plan with Gaza and across the region.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660783/trump-and-netanyahu-meet-to-discuss-next-phase-of-gaza-ceasefire-plan",
      "published": "Tue, 30 Dec 2025 06:50:54 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Eurostar services gradually resuming after major power supply issue",
      "description": "Eurostar said on December 30 it was restarting services over a power supply problem in the Channel tunnel. Travellers were left scrambling to find alternatives after the operator postponed all services between London, Paris, Amsterdam and Brussels. FRANCE 24's Olivia Bizot spoke to some in Gare du Nord in Paris.",
      "url": "https://www.france24.com/en/video/20251230-eurostar-services-gradually-resuming-after-major-power-supply-issue",
      "published": "Tue, 30 Dec 2025 16:50:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anthony Joshua was 'shocked' and 'couldn't talk' after crash, eyewitness says",
      "description": "Boxer Anthony Joshua was \"shocked\" and \"couldn't talk\" after a car crash in Nigeria, according to an eyewitness.",
      "url": "https://news.sky.com/story/anthony-joshua-stable-after-nigeria-car-crash-as-tributes-paid-to-inspirational-friend-13488669",
      "published": "Mon, 29 Dec 2025 20:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Florida firefighters allegedly waterboarded, whipped rookie over TikTok video as 4 face criminal charges",
      "description": "Four Florida firefighters face criminal charges after allegedly waterboarding and whipping a 19-year-old rookie firefighter. Nearly a dozen employees fired.",
      "url": "https://www.foxnews.com/us/florida-firefighters-allegedly-waterboarded-whipped-rookie-tiktok-video-4-face-criminal-charges",
      "published": "Tue, 30 Dec 2025 21:16:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Bear remains under California home after weeks of failed removal attempts",
      "description": "Bear trap in Altadena accidentally catches wrong animal as 550-pound black bear continues living under California home despite month-long removal efforts.",
      "url": "https://www.foxnews.com/us/bear-remains-under-california-home-after-weeks-failed-removal-attempts",
      "published": "Tue, 30 Dec 2025 21:15:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Wild video shows speeding car going airborne, ejects driver into backyard pool",
      "description": "Surveillance footage captures car crashing through Nevada home's backyard, ejecting female driver into pool.",
      "url": "https://www.foxnews.com/us/wild-video-shows-speeding-car-going-airborne-ejects-driver-backyard-pool",
      "published": "Tue, 30 Dec 2025 20:27:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Cheaper medicines, rules for cash and new state laws: what will change in Australia on 1 January?",
      "description": "Changes include the Victorian government expanding land taxes and Queensland introducing a child sex offender register Get our breaking news email , free app or daily news podcast Cheaper medicines on the PBS, a Medicare phone service and new laws mandating businesses to accept cash payments are just some of the major changes coming into effect in the first week of 2026. Indexation increases to social security payments, changes to childcare settings and a new online mental health service will also kick in from the beginning of January. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/government-rules-new-laws-benefit-changes-on-1-january",
      "published": "Tue, 30 Dec 2025 14:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany: €30 million stolen in elaborate bank vault heist",
      "description": "Investigators have been piecing together how burglars drilled into a secure area from outside and ransacked thousands of safe-deposit boxes. Police say the evidence points to a highly organized operation.",
      "url": "https://www.dw.com/en/germany-€30-million-stolen-in-elaborate-bank-vault-heist/a-75344406?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 15:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Turkish police detain 357 suspects in raids against the Islamic State group",
      "description": "Turkish police have conducted large-scale operations against the Islamic State group across Turkey, detaining 357 suspects",
      "url": "https://abcnews.go.com/International/wireStory/turkish-police-detain-357-suspects-raids-islamic-state-128773939",
      "published": "Tue, 30 Dec 2025 04:09:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Development cooperation agreement marks new phase in UN-Iraq partnership",
      "description": "Better access to education, the protection of the environment and good governance are some of the areas in which the United Nations helps countries improve.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166670",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "State officials and daycare manager push back on viral video fraud allegations in Minnesota",
      "description": "Minnesota officials deny daycare fraud allegations after viral video questioned state-funded centers, sparking widespread controversy over taxpayer money usage.",
      "url": "https://www.foxnews.com/us/state-officials-daycare-manager-push-back-viral-video-fraud-allegations-minnesota",
      "published": "Mon, 29 Dec 2025 22:15:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "'No worries': Trump downplays Chinese military drills around Taiwan",
      "description": "The US President has downplayed the drills which follow a US announcement of an $11bn arms sale to Taiwan.",
      "url": "https://www.bbc.com/news/articles/cdxwxkeg9w6o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 03:22:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2025-12-31T05:30:02.089611Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar: Hundreds of passengers stranded in stations",
      "description": "Eurostar suspended all trains between London, Paris, Amsterdam and Brussels on Tuesday and advised passengers to postpone their journeys to a later date, citing a power supply problem in the Channel tunnel.",
      "url": "https://www.france24.com/en/video/20251230-eurostar-hundreds-of-passengers-stranded-in-stations",
      "published": "Tue, 30 Dec 2025 16:16:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "AFCON knockout race intensifies as groups C and D to wrap up",
      "description": "The Africa's Football Cup of Nations will see two group wrap up as Groups C and D teams play their last games in Morocco on December 30. Teams will be looking to qualify for the competition's round of 16, with Senegal being the big favourites alongside host nation Morocco. FRANCE 24's Selina Sykes reports directly from Rabat and tells us what to know ahead of the coming games.",
      "url": "https://www.france24.com/en/video/20251230-afcon-knockout-race-intensifies-as-groups-c-and-d-to-wrap-up",
      "published": "Tue, 30 Dec 2025 15:31:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar cancels all services after power issue",
      "description": "Eurostar suspended train services in Europe on December 30 after a power supply issue in the Channel tunnel, sparking travel chaos for passengers during the very busy New Year period. Its services to and from London “are suspended until further notice\" and the company advised its passengers to rebook their journeys for other days. FRANCE 24's Olivia Bizot tells us more from Gare du Nord in Paris.",
      "url": "https://www.france24.com/en/video/20251230-eurostar-cancels-all-services-after-power-issue",
      "published": "Tue, 30 Dec 2025 14:53:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "41 young men die in South Africa from circumcision procedures during initiation ceremonies",
      "description": "Authorities report that at least 41 young men have died from circumcision procedures during traditional initiation activities in South Africa in November and December",
      "url": "https://abcnews.go.com/International/wireStory/41-young-men-die-south-africa-circumcision-procedures-128785584",
      "published": "Tue, 30 Dec 2025 12:49:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar to resume services to and from London after 'major disruption' in Channel Tunnel forced cancellations",
      "description": "Eurostar suspends all London services due to major power supply issues in Channel Tunnel and failed LeShuttle train, forcing passengers to rebook journeys.",
      "url": "https://www.foxnews.com/world/eurostar-forced-cancel-all-services-from-london-after-major-disruption-channel-tunnel",
      "published": "Tue, 30 Dec 2025 10:25:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "From Gaza to Iran: What’s at stake in Trump-Netanyahu Mar-a-Lago talks?",
      "description": "Gaza peace plan and Iran both reportedly on agenda as President Donald Trump is set to meet Israeli Prime Minister Benjamin Netanyahu at Mar-a-Lago on Monday.",
      "url": "https://www.foxnews.com/world/from-gaza-iran-whats-stake-trump-netanyahu-mar-a-lago-talks",
      "published": "Mon, 29 Dec 2025 06:00:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "A Filipino tribe fights to stay as a ‘Smart City’ rises on a former US base",
      "description": "Aetas race to prove ancestral land claims before a 'Smart City' and a 'Taylor Swift-ready' stadium displace them.",
      "url": "https://www.aljazeera.com/news/2025/12/30/a-filipino-tribe-fights-to-stay-as-a-smart-city-rises-on-a-former-us-base?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 23:13:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Saudi Arabia bombs Yemen over shipment of weapons that arrived from UAE",
      "description": "Saudi Arabia says it bombed Yemen’s port city of Mukalla over a shipment of weapons for a separatist force there that arrived from the United Arab Emirates",
      "url": "https://abcnews.go.com/International/wireStory/saudi-arabia-bombs-yemen-shipment-weapons-separatists-arrived-128769161",
      "published": "Tue, 30 Dec 2025 09:13:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "US removal of panels honoring Black soldiers at WWII cemetery draws backlash",
      "description": "The American Cemetery in the Dutch village of Margraten has become a flashpoint over the removal of displays honoring Black soldiers",
      "url": "https://abcnews.go.com/International/wireStory/us-removal-panels-honoring-black-soldiers-wwii-cemetery-128773558",
      "published": "Tue, 30 Dec 2025 07:13:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar delays enter second day as passengers stuck onboard overnight",
      "description": "Eurostar says it plans to run all of its services on Wednesday but there may still be delays and cancellations.",
      "url": "https://www.bbc.com/news/articles/c0q4eg03eyzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 04:56:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Isiah Whitlock Jr: The Wire and Veep actor dies at 71",
      "description": "Whitlock was known for his notably elongated, profane catchphrase, which he used on The Wire and in films.",
      "url": "https://www.bbc.com/news/articles/cwyw56687z3o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 02:07:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thieves use drill to steal €30m in German bank heist",
      "description": "Gelsenkirchen Police say thieves used the \"quiet\" days after Christmas to break into the high street branch.",
      "url": "https://www.bbc.com/news/articles/c4grzz60kp3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 16:54:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel to bar 37 aid groups from Gaza",
      "description": "The move was criticised by foreign ministers from from 10 countries including the UK, who said the new rules were \"restrictive\" and \"unacceptable\".",
      "url": "https://www.bbc.com/news/articles/c1evp7weyv2o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 22:36:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bangladesh's first female prime minister Khaleda Zia dies aged 80",
      "description": "For decades, Zia and ousted PM Sheikh Hasina were bitter rivals - and their feud defined Bangladesh's politics.",
      "url": "https://www.bbc.com/news/articles/cm2v256vdkyo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 05:14:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea junta chief wins presidency in controversial election",
      "description": "The victory, which gives the junta leader a seven-year mandate, was widely expected.",
      "url": "https://www.bbc.com/news/articles/cx2520nyp8yo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 31 Dec 2025 01:27:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "K-pop band member sued for $30m after bitter record label feud",
      "description": "Record label Ador says it has dropped NewJeans member Danielle Marsh while the return of Minji remains uncertain.",
      "url": "https://www.bbc.com/news/articles/cdxwxqrde29o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 14:14:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Great white sharks face extinction in Mediterranean, say researchers",
      "description": "Overfishing and illegal fishing are contributing to the loss of sharks, including great whites.",
      "url": "https://www.bbc.com/news/articles/c9qe9wvq534o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 01:15:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Spanish woman who found fame for botching fresco restoration dies",
      "description": "Cecilia Giménez's effort to restore the painting Ecce Homo earned the artwork the nickname \"Monkey Christ\".",
      "url": "https://www.bbc.com/news/articles/cr5z5p633q5o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 03:26:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany hunts Christmas thieves after Ocean’s Eleven-style bank heist",
      "description": "Police are searching for suspects after thieves stole cash, gold and jewels worth up to $105m.",
      "url": "https://www.aljazeera.com/news/2025/12/31/germany-hunts-christmas-thieves-after-oceans-eleven-style-bank-heist?traffic_source=rss",
      "published": "Wed, 31 Dec 2025 05:00:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea coup leader Mamady Doumbouya wins presidential election",
      "description": "Doumbouya wins with 86.72 percent of the vote, an absolute majority, four years after he led a military takeover.",
      "url": "https://www.aljazeera.com/news/2025/12/30/guinea-coup-leader-mamdi-doumbouya-wins-presidential-election?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 23:34:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US and Ivory Coast sign $480m deal as part of ‘America First’ aid strategy",
      "description": "The Trump administration is forging bilateral deals with countries hit by widespread cuts to US foreign aid.",
      "url": "https://www.aljazeera.com/news/2025/12/30/us-and-ivory-coast-sign-480m-deal-as-part-of-america-first-aid-strategy?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 22:27:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Will China use force against Taiwan?",
      "description": "Beijing has carried out its biggest-ever military drills off the self-governed island.",
      "url": "https://www.aljazeera.com/video/inside-story/2025/12/30/would-china-use-force-against-taiwan?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 22:22:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal beat Benin to claim AFCON group, as DR Congo set up Algeria tie",
      "description": "Senegal beat Benin 3-0 to top AFCON 2025 group, while DR Congo beat Botswana, setting up a mouth-watering Algeria tie.",
      "url": "https://www.aljazeera.com/sports/2025/12/30/senegal-claim-afcon-group-with-benin-win-as-dr-congo-set-up-algeria-tie?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 22:19:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Burglars nab tens of millions in property from German bank",
      "description": "Footage shows a hole in the vault of Sparkasse Bank in Gelsenkirchen, Germany, where thieves made off with valuables.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/30/burglars-nab-tens-of-millions-in-property-from-german-bank?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 20:51:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria beat Uganda 3-1 to head into AFCON last 16 with perfect record",
      "description": "Elsewhere in Group C, Tanzania scrape through to the knockout stages for the first time after 1-1 draw with Tunisia.",
      "url": "https://www.aljazeera.com/sports/2025/12/30/nigeria-beat-uganda-3-1-to-head-into-afcon-last-16-with-perfect-record?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 18:38:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "More than 3,000 migrants died trying to reach Spain in 2025",
      "description": "Tighter border controls caused arrivals to decline sharply but forced people on to more dangerous routes, activists say More than 3,000 people died trying to reach Spain by sea over the past year, a sharp fall from the previous 12 months. However, activists cautioned that the drop reflected tighter border controls that have forced migrants to take increasingly dangerous routes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/more-than-3000-migrants-died-spain-figure-down",
      "published": "Mon, 29 Dec 2025 17:31:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Opposition anger as Guinea’s junta leader is frontrunner to be elected president",
      "description": "Mamady Doumbouya accused of betraying his promise to be the restorer of democracy after leading 2021 coup In September 2021, a tall, young colonel in the Guinean army announced that he and his comrades had forcibly seized power and toppled the longtime leader Alpha Condé. “The will of the strongest has always supplanted the law,” Mamady Doumbouya said in a speech, stressing that the soldiers were acting to restore the will of the people. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/27/guinea-junta-leader-mamady-doumbouya-frontrunner-president-election",
      "published": "Sat, 27 Dec 2025 08:00:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jair Bolsonaro undergoes second procedure to treat persistent hiccups",
      "description": "Former Brazilian president underwent a phrenic nerve block while temporarily released from prison for surgery Jair Bolsonaro underwent a second “phrenic nerve block procedure” on Monday to treat persistent hiccups. The treatment went well and the former Brazilian president’s condition is stable, according to his medical team. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/brazil-ex-president-jair-bolsonaro-hiccups-treatment",
      "published": "Mon, 29 Dec 2025 22:07:50 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Damien Martyn, former Australian Test cricketer, in hospital in induced coma with meningitis",
      "description": "54-year-old admitted to hospital on Boxing Day with meningitis Martyn played 67 Tests for Australia between 1992 and 2006 The former Australian Test cricketer Damien Martyn has been admitted to hospital and placed in an induced coma after being diagnosed with meningitis. The sporting community is rallying around the 54-year-old, who “is in for the fight of his life”, according to the former AFL player Brad Hardie, who revealed Martyn’s condition on 6PR on Tuesday. Continue reading...",
      "url": "https://www.theguardian.com/sport/2025/dec/31/former-australian-test-cricketer-damien-martyn-in-induced-coma",
      "published": "Wed, 31 Dec 2025 03:19:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Coral Adventurer passengers return with diverging accounts of cruise ship drama",
      "description": "One passenger tells the ABC it was ‘chaos’ and she felt her life was in danger, but others shrug off the incident Get our breaking news email , free app or daily news podcast A passenger onboard the Coral Adventurer has told the ABC she won’t travel with the luxury cruise liner again, after it was grounded on a reef off Papua New Guinea at the weekend. Ursula Daus alleged her life was in “danger” as a result of the incident. But other passengers told the ABC their experience was more positive, after landing at Cairns airport on Tuesday . Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/31/coral-adventurer-passengers-return-cruise-ship-drama",
      "published": "Wed, 31 Dec 2025 02:41:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.2 - 36 km W of Puerto Santa, Peru",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-28 02:51:50 UTC 2025-12-28 02:51:50 UTC at epicenter Location 8.960°S 78.974°W Depth 66.41 km (41.27 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl57",
      "published": "2025-12-31T01:12:43.205Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.6 - 31 km ESE of Yilan, Taiwan",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-27 15:05:56 UTC 2025-12-27 15:05:56 UTC at epicenter Location 24.657°N 122.041°E Depth 67.53 km (41.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl2n",
      "published": "2025-12-30T03:24:14.885Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel says it will bar aid groups, including Doctors Without Borders, from Gaza",
      "description": "Israel accused Doctors Without Borders, one of the largest health organizations operating in Gaza, of failing to clarify the roles of some staff that Israel accused of cooperation with militants.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103986/israel-gaza-aid-ngos",
      "published": "Tue, 30 Dec 2025 11:04:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Israeli negotiator talks about the next phase of the Gaza peace plan",
      "description": "NPR's Michel Martin talks about the prospects for Phase Two of the Gaza peace plan with former Israeli negotiator Daniel Levy, president of the U.S./Middle East Project.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660699/former-israeli-negotiator-talks-about-the-next-phase-of-the-gaza-peace-plan",
      "published": "Tue, 30 Dec 2025 06:50:48 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China conducting military drills around Taiwan, demonstrating blockade capabilities",
      "description": "China is conducting big military drills that encircle the island of Taiwan on Tuesday, demonstrating its ability to blockade Taiwan completely.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660680/china-conducting-military-drills-around-taiwan-demonstrating-blockade-capabilities",
      "published": "Tue, 30 Dec 2025 06:50:44 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea's junta leader declared winner of presidential election",
      "description": "Mamdi Doumbouya secured almost 87% of the vote, while several opposition figures were either barred from contesting or were in exile. Doumbouya seized power after staging a coup in 2021.",
      "url": "https://www.dw.com/en/guinea-s-junta-leader-declared-winner-of-presidential-election/a-75346950?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 31 Dec 2025 03:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tatiana Schlossberg, granddaughter of JFK, dies aged 35",
      "description": "Tatiana Schlossberg revealed she had been diagnosed with a rare type of leukemia in an essay in The New Yorker last month. She was highly critical of her relative Robert F. Kennedy Jr., the US health secretary.",
      "url": "https://www.dw.com/en/tatiana-schlossberg-granddaughter-of-jfk-dies-aged-35/a-75346596?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 23:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fact check: The disinformation we debunked in 2025",
      "description": "From doctored images to fabricated stories, we uncovered the most viral fakes of 2025 — deepfakes, election myths and health hoaxes. Here's what dominated the disinformation landscape.",
      "url": "https://www.dw.com/en/fact-check-the-disinformation-we-debunked-in-2025/a-75283770?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 17:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Female empowerment: Arab women rise to the mic",
      "description": "More and more Middle Eastern women thrive as comedians. Could their success on stage, in the film industry, at comedy festivals and on social media foster empowerment for the next generation of girls?",
      "url": "https://www.dw.com/en/female-empowerment-arab-women-rise-to-the-mic/a-75343404?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 16:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's 'nengajo' New Year card tradition losing its charm",
      "description": "A Japanese year-end rite that can trace its roots back more than 1,000 years is disappearing as people have less free time, feel less connected to work colleagues and prefer to send New Year greetings via social media.",
      "url": "https://www.dw.com/en/japan-s-nengajo-new-year-card-tradition-losing-its-charm/a-75341258?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "MH370 search resumes in Indian Ocean nearly 12 years after plane's disappearance",
      "description": "Nearly 12 years after Malaysia Airlines flight MH370 vanished with 239 people on board, a renewed search has begun in the remote southern Indian Ocean, as investigators deploy advanced deep-sea technology in a fresh bid to solve one of aviation’s most enduring mysteries.",
      "url": "https://www.france24.com/en/asia-pacific/20251230-mh370-search-resumes-in-indian-ocean-years-after-plane-disappearance",
      "published": "Tue, 30 Dec 2025 23:42:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Nigeria complete near-perfect group stage with third straight win",
      "description": "Nigeria have completed a near-perfect group stage after claiming a third straight win by beating Uganda 3-1.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251230-afcon-2025-nigeria-complete-near-perfect-group-stage-with-third-straight-win",
      "published": "Tue, 30 Dec 2025 22:02:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French ban on ‘forever chemicals' in cosmetics and clothes to enter into force",
      "description": "A French ban on the production and sale of PFAS chemicals – known as 'forever chemicals' as it takes them so long to break down – comes into effect on Thursday. The ban targets a wide range of cosmetics and clothes and will also require French authorities to regularly test drinking water for all kinds of PFAS.",
      "url": "https://www.france24.com/en/live-news/20251230-french-ban-on-forever-chemicals-in-cosmetics-clothing-to-enter-force",
      "published": "Tue, 30 Dec 2025 14:37:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Passenger describes being stranded on Eurostar train overnight - as disruption continues",
      "description": "Passengers have been stuck on a Eurostar train for hours overnight, after the train network was forced to cancel large parts of its London-Europe service on Tuesday.",
      "url": "https://news.sky.com/story/eurostar-passengers-brace-for-further-disruption-after-day-of-cancellations-13488920",
      "published": "Tue, 30 Dec 2025 22:39:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel suspends 37 aid organisations from operating in Gaza",
      "description": "Israel says it is suspending more than 30 humanitarian organisations, including Doctors Without Borders, from operating in Gaza for failing to comply with new registration rules.",
      "url": "https://news.sky.com/story/israel-suspends-37-aid-organisations-from-operating-in-gaza-13488815",
      "published": "Tue, 30 Dec 2025 20:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thieves drill into bank vault to steal valuables worth tens of millions of euros",
      "description": "Thieves have drilled into a German savings bank vault to steal millions of pounds worth of valuables from safety deposit boxes.",
      "url": "https://news.sky.com/story/thieves-drill-into-german-bank-vault-to-steal-valuables-worth-tens-of-millions-of-euros-13488710",
      "published": "Tue, 30 Dec 2025 13:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I have sunburn and whiplash after a head-spinning two days of Trump diplomacy... only one of them is his fault'",
      "description": "Two December days in Palm Beach and I have sunburn and whiplash.",
      "url": "https://news.sky.com/story/a-head-spinning-two-days-of-trump-diplomacy-but-how-much-was-theatrical-hot-air-13488600",
      "published": "Tue, 30 Dec 2025 02:57:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bangladesh's first female prime minister dies",
      "description": "Bangladesh's first female prime minister Khaleda Zia has died following a prolonged illness, her political party has said.",
      "url": "https://news.sky.com/story/bangladeshs-first-female-prime-minister-khaleda-zia-dies-at-80-13488601",
      "published": "Tue, 30 Dec 2025 03:42:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Khaleda Zia, former Bangladeshi prime minister and archrival of a previous premier, dies at 80",
      "description": "Former Bangladeshi Prime Minister Khaleda Zia has died at 80, her political party has announced Tuesday",
      "url": "https://abcnews.go.com/International/wireStory/khaleda-zia-former-bangladeshi-prime-minister-archrival-hasina-128768275",
      "published": "Tue, 30 Dec 2025 04:09:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China flexes blockade capabilities near Taiwan on second day of military drills",
      "description": "China's People's Liberation Army is conducting large-scale military drills around Taiwan as part of \"Justice Mission 2025.\"",
      "url": "https://abcnews.go.com/International/wireStory/china-flexes-blockade-capabilities-taiwan-day-military-drills-128773369",
      "published": "Tue, 30 Dec 2025 09:05:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Italy's Parliament approves 2026 budget with deficit-cutting measures",
      "description": "Italy’s Parliament has approved the government’s 2026 budget, which includes deficit-cutting measures",
      "url": "https://abcnews.go.com/International/wireStory/italys-parliament-approves-2026-budget-deficit-cutting-measures-128782467",
      "published": "Tue, 30 Dec 2025 11:02:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thieves drill into German bank vault, steal millions of euros worth of property",
      "description": "Police in Germany say thieves stole tens of millions of euros worth of property from safety deposit boxes inside a bank vault that they drilled into during the holiday lull",
      "url": "https://abcnews.go.com/International/wireStory/thieves-drill-german-bank-vault-steal-tens-millions-128783363",
      "published": "Tue, 30 Dec 2025 11:54:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea will end breeding of bears and extraction of their bile",
      "description": "South Korea says it will end its dwindling yet much-criticized bear bile farming industry",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-end-breeding-bears-extraction-bile-128775547",
      "published": "Tue, 30 Dec 2025 09:13:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's top diplomat blasts US arms sale to Taiwan as military drills unfold",
      "description": "China’s top diplomat has slammed a record U.S. military sale to Taiwan",
      "url": "https://abcnews.go.com/International/wireStory/chinas-top-diplomat-blasts-us-arms-sale-taiwan-128773742",
      "published": "Tue, 30 Dec 2025 06:41:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungary's 'water guardian' farmers fight back against desertification",
      "description": "Southern Hungary landowner Oszkár Nagyapáti has been battling severe drought on his land",
      "url": "https://abcnews.go.com/International/wireStory/hungarys-water-guardian-farmers-fight-back-desertification-128742465",
      "published": "Mon, 29 Dec 2025 00:11:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "General Assembly approves $3.45 billion UN regular budget for 2026",
      "description": "The General Assembly has approved a $3.45 billion regular budget for the United Nations for 2026, following weeks of intensive negotiations and one of the Organization’s most important reform initiatives, UN80.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166685",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: General Assembly decides on 2026 UN budget",
      "description": "Follow our live coverage as the General Assembly and its Fifth Committee meet today to finalize negotiations and vote on the United Nations’ regular budget for 2026. The Fifth Committee is responsible for administrative and budgetary matters, including the Organization’s finances and staffing. UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166681",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza: Humanitarian response ongoing despite restrictions",
      "description": "Although “significant restrictions and impediments” continue to hamper humanitarian operations in Gaza, teams are still responding to the population’s needs, the UN aid coordination office OCHA said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166669",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Priest catches suspect breaking into church ‘poor box’ days before Christmas, police say",
      "description": "A priest caught a suspect breaking into a church \"poor box\" days before Christmas in Philadelphia. Police shared surveillance video of the incident.",
      "url": "https://www.foxnews.com/us/priest-catches-suspect-breaking-church-poor-box-days-before-christmas-police-say",
      "published": "Tue, 30 Dec 2025 19:08:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tatiana Schlossberg, JFK's granddaughter, dies at 35 after year-and-a-half leukemia battle",
      "description": "Environmental journalist Tatiana Schlossberg, granddaughter of President John F. Kennedy and Jacqueline Kennedy Onassis, passed away at 35 after battling acute myeloid leukemia.",
      "url": "https://www.foxnews.com/us/tatiana-schlossberg-jfks-granddaughter-dies-35-leukemia-battle",
      "published": "Tue, 30 Dec 2025 14:24:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Slender Man stabber Morgan Geyser ordered back to psychiatric hospital after group home escape",
      "description": "Judge orders Morgan Geyser back to psychiatric hospital after escaping group home. Woman convicted in 2014 Slender Man stabbing loses privileges.",
      "url": "https://www.foxnews.com/us/slender-man-stabber-morgan-geyser-ordered-back-psychiatric-hospital-after-group-home-escape",
      "published": "Tue, 30 Dec 2025 14:00:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kentucky freight train carrying molten sulfur derails, leaks hazardous chemical in Todd County",
      "description": "Thirty-one freight train cars derailed in rural Todd County, Kentucky on Thursday, prompting a shelter-in-place after molten sulfur leaked from one car.",
      "url": "https://www.foxnews.com/us/kentucky-freight-train-carrying-molten-sulfur-derails-leaks-hazardous-chemical-todd-county",
      "published": "Tue, 30 Dec 2025 13:52:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Unearthed video allegedly shows rampant Minnesota fraud and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/unearthed-video-allegedly-shows-rampant-minnesota-fraud-more-top-headlines",
      "published": "Tue, 30 Dec 2025 06:53:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy claims Trump said US will consider giving Ukraine decades of security guarantees",
      "description": "Ukrainian President Volodymyr Zelenskyy indicated that American President Donald Trump said the U.S. will entertain the prospect of providing Ukraine with decades of security guarantees.",
      "url": "https://www.foxnews.com/world/zelenskyy-claims-trump-said-us-consider-giving-ukraine-decades-security-guarantees",
      "published": "Mon, 29 Dec 2025 10:58:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK prime minister slammed for welcoming home freed Egyptian prisoner after social media posts resurface",
      "description": "U.K. Prime Minister Keir Starmer is facing criticism after welcoming human rights activist Alaa Abd el-Fattah home, as the man's past posts sparked political backlash.",
      "url": "https://www.foxnews.com/world/uk-prime-minister-slammed-welcoming-home-freed-egyptian-prisoner-after-social-media-posts-resurface",
      "published": "Mon, 29 Dec 2025 03:42:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}