{
  "last_updated": "2026-01-18T18:30:11.736465Z",
  "event_count": 221,
  "events": [
    {
      "title": "Security Council LIVE: UN raises alarm over deadly Iran protests and ‘possible military strikes’",
      "description": "The UN Security Council is meeting in New York in emergency session on Iran, amid escalating concern over reports that hundreds have been killed during weeks of nationwide anti-government protests. The meeting was requested by the United States. Demonstrations that began in late December, fuelled by soaring inflation, rising food prices and the collapse of the national currency, triggered a deadly and widespread crackdown with thousands injured and detained, according to numerous firsthand accounts. The UN has called for independent investigations into all killings and warned against the possible use of the death penalty against protesters. Follow live coverage below, and UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "Kurdish forces risk turning to 'guerrilla' warfare as Syrian army advances",
      "description": "Kurdish-led forces withdrew from Syria's largest oil field on Sunday, according to a conflict monitor, as government troops expanded their control over vast areas in the country's north and east. As the Syrian army continues to advance into Kurdish-held territories, the Kurdish forces may resort to guerrilla warfare, potentially destabilizing the country, said Henri Barkey, Professor of International Relations at Lehigh University.",
      "url": "https://www.france24.com/en/kurdish-forces-risk-turning-to-guerrilla-warfare-as-syrian-army-advances",
      "published": "Sun, 18 Jan 2026 13:10:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns of a world in chaos as impunity and unpredictability spreads",
      "description": "In his final annual address outlining his priorities, UN Secretary-General António Guterres warned that the world is “brimming with conflict, impunity, inequality and unpredictability” – even as international cooperation is fraying at the moment it is most needed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166772",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "'State of catastrophe' in Chile as deadly wildfires rage",
      "description": "At least 16 people have been killed and nearly 20,000 people have fled to safety after wildfires, as a \"state of catastrophe\" was declared in Chile.",
      "url": "https://news.sky.com/story/state-of-catastrophe-in-chile-as-deadly-wildfires-rage-13495867",
      "published": "Sun, 18 Jan 2026 15:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "'Experienced terrorist' with links to deadly ambush killed by US strike",
      "description": "An \"experienced terrorist leader\" with ties to al Qaeda has been killed in US strikes, after an Islamic State ambush last month left three Americans dead.",
      "url": "https://news.sky.com/story/experienced-terrorist-killed-by-us-strikes-in-syria-after-deadly-ambush-left-three-americans-dead-13495724",
      "published": "Sun, 18 Jan 2026 00:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "US-based activist agency says it has verified 3,766 deaths from Iran protests",
      "description": "A U.S.-based activist agency reports at least 3,766 deaths during recent protests in Iran",
      "url": "https://abcnews.go.com/International/wireStory/us-based-activist-agency-verified-3766-deaths-iran-129330736",
      "published": "Sun, 18 Jan 2026 12:41:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Police warn of ‘door-kicking challenge’ that can turn viral prank ‘from funny to fatal’",
      "description": "Authorities issued a warning as a door-kicking prank trend gains traction on social media. The dangerous challenge has led to shootings and arrests nationwide.",
      "url": "https://www.foxnews.com/us/police-warn-door-kicking-challenge-that-can-turn-viral-prank-from-funny-fatal",
      "published": "Sat, 17 Jan 2026 14:00:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Former Iranian prisoners reveal torture horrors as regime kills protesters on sight during crackdown",
      "description": "Three former political prisoners in Iran share harrowing accounts of detention abuse, warning the world about escalating violence during the current uprising.",
      "url": "https://www.foxnews.com/world/former-iranian-prisoners-reveal-torture-horrors-regime-kills-protesters-sight-during-crackdown",
      "published": "Sat, 17 Jan 2026 12:00:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "At least 32 killed as crane collapses on train in Thailand",
      "description": "Crane in use on high-speed rail project hits passing train, causing it to derail At least 32 people in Thailand have been killed and scores injured after a crane collapsed on to a passenger train and derailed it, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars and smoke rising from the wreckage of the train below. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths",
      "published": "Wed, 14 Jan 2026 15:44:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "US strike eliminates al Qaeda operative connected to ISIS ambush that killed 3 Americans in Syria",
      "description": "U.S. forces killed an al Qaeda-affiliated leader allegedly linked to an ISIS attack that killed three Americans in Syria, as CENTCOM launched counterterrorism operations Jan. 16.",
      "url": "https://www.foxnews.com/world/us-strike-eliminates-al-qaeda-operative-connected-isis-ambush-killed-3-americans-syria",
      "published": "Sat, 17 Jan 2026 16:59:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Chile declares 'state of catastrophe' as deadly wildfires menace cities",
      "description": "At least 16 people are confirmed dead and 20,000 are evacuated as fires rage in two southern regions.",
      "url": "https://www.bbc.com/news/articles/cz7ypw4rjrzo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 16:39:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "The week in pictures: ICE In Minnesota, tractors in Paris and Trump gets a second-hand Nobel",
      "description": "Iran's protests go international amid a deadly crackdown, ICE agents terrorise US citizens in Minnesota, far-right leader Marine Le Pen appeals her embezzlement conviction, French farmers protest with tractors in Paris and US President Donald Trump gets his long-coveted Nobel Prize – albeit second-hand. FRANCE 24 looks back at the week's most striking images.",
      "url": "https://www.france24.com/en/culture/20260118-the-week-in-pictures-ice-minnesota-tractors-paris-trump-second-hand-nobel",
      "published": "Sun, 18 Jan 2026 11:24:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Fears Iran's internet shutdown could lead to 'extreme digital isolation'",
      "description": "Internet monitor FilterWatch warns that authorities are trying to cut the country off from international connectivity.",
      "url": "https://www.bbc.com/news/articles/cg5gegrdq3go?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 11:09:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russia strikes 6 Ukrainian regions, killing at least 2",
      "description": "Dozens of people were wounded and at least two were killed in overnight Russian air attacks on Ukraine, according to the Ukrainian president. The attack comes as US and Ukrainian officials are set to meet in Miami.",
      "url": "https://www.dw.com/en/russia-strikes-6-ukrainian-regions-killing-at-least-2/a-75552564?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 12:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "‘Disappointed’ Jewish leaders call for compromise on hate speech laws after Labor backs down on bill",
      "description": "Executive Council of Australia Jewry implores Anthony Albanese and Sussan Ley to thrash out deal after government splits contentious bill Get our breaking news email , free app or daily news podcast Jewish leaders have warned Labor and the Coalition their community remains at risk from the promotion of antisemitic hatred, urging a last-minute compromise to secure tough new hate speech laws ahead of a special sitting of parliament. After Anthony Albanese agreed to split draft laws made in the wake of the Bondi Beach terror attack, new gun control measures are set to pass with the support of the Greens. Sign up: AU Breaking News email Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/18/disappointed-jewish-leaders-call-for-compromise-on-hate-speech-laws-after-labor-backdown-on-bill-ntwnfb",
      "published": "Sun, 18 Jan 2026 06:37:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "UNRWA officials lobby congressional staffers against Trump terrorist designation threat",
      "description": "UNRWA officials briefed congressional staffers on potential Trump administration plans to designate the U.N. agency as a terrorist organization.",
      "url": "https://www.foxnews.com/world/unrwa-officials-lobby-congressional-staffers-against-trump-terrorist-designation-threat",
      "published": "Fri, 16 Jan 2026 10:57:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Jagan Chapagain: Is the global humanitarian system breaking down?",
      "description": "The IFRC chief on US aid cuts, attacks on aid workers and whether neutrality can survive modern wars.",
      "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2026/1/18/jagan-chapagain-is-the-global-humanitarian-system-breaking-down?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 14:27:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Amid Sudan’s humanitarian crisis, Chad shows ‘act of solidarity’",
      "description": "In war-torn Sudan, local communities say they don’t have enough settlements for the internally displaced, few solutions for women who have suffered sexual violence – and there’s a lack of aid available for people with disabilities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166777",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "WFP warns Sudan food aid could run out in March",
      "description": "The World Food Programme (WFP) said on Thursday that it is struggling to keep emergency operations running in Sudan, where more than 1,000 days of war have pushed families to the brink.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166766",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Federal judge restricts ICE agents amid ongoing Minneapolis area protests",
      "description": "U.S. District Judge Kate Menendez, in Minnesota, bars ICE and Border Patrol from using tear gas against peaceful protesters during Operation Metro Surge in Minneapolis following deadly shooting of Renee Good.",
      "url": "https://www.foxnews.com/us/federal-judge-restricts-ice-agents-amid-ongoing-minneapolis-area-protests-over-fatal-shooting",
      "published": "Sat, 17 Jan 2026 00:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Top Iran prayer leader who dubbed protesters 'Trump's soldiers' calls for executions amid ongoing unrest",
      "description": "Iranian cleric reportedly calls for death penalty against protesters as regime claims widespread damage to mosques and hospitals during nationwide unrest.",
      "url": "https://www.foxnews.com/world/top-iran-prayer-leader-who-dubbed-protesters-trumps-soldiers-calls-executions-amid-ongoing-unrest",
      "published": "Fri, 16 Jan 2026 10:19:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Six killed in Pakistan shopping mall fire",
      "description": "Parts of the huge plaza in Karachi have collapsed as firefighters battle to extinguish the blaze.",
      "url": "https://www.bbc.com/news/articles/c150pg5dvp2o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 15:00:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Dozens of dogs killed in fire at home of ‘breeder’ in Washington state, firefighters rescue 3 from flames",
      "description": "Fire officials in Washington state are investigating a deadly blaze that killed about 40 dogs at the home of a man who claimed to be dog breeder.",
      "url": "https://www.foxnews.com/us/dozens-dogs-killed-fire-home-breeder-washington-state-firefighters-rescue-3-from-flames",
      "published": "Sun, 18 Jan 2026 10:18:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Europe warns of 'dangerous downward spiral' after Trump threatens tariffs over Greenland",
      "description": "The eight European countries targeted by U_S_ President Donald Trump for a 10% tariff for opposing American control of Greenland have criticized the move in an unusually strong joint statement, warning that his threats “undermine transatlantic relation...",
      "url": "https://abcnews.go.com/International/wireStory/europe-warns-dangerous-downward-spiral-after-trump-threatens-129324725",
      "published": "Sun, 18 Jan 2026 11:13:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Game-changing international ocean treaty comes into force",
      "description": "Almost two decades in the making, an international agreement to protect and sustainably use marine life in international waters and the international seabed is due to come into force on Saturday, marking a major step forward in efforts to ensure the health of ocean ecosystems for decades to come.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166762",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN urges ‘maximum restraint’ to avert more death, wider escalation",
      "description": "As nationwide protests in Iran appear to ease after nearly three weeks of unrest and bloodshed, a senior UN official called on Thursday for action to prevent further escalation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166773",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran’s supreme leader acknowledges thousands killed as Trump calls for new leadership: reports",
      "description": "Iran's supreme leader Khamenei reportedly acknowledges thousands died in recent protests for the first time, as death toll estimates reach over 3,000.",
      "url": "https://www.foxnews.com/world/irans-supreme-leader-acknowledges-thousands-killed-trump-calls-new-leadership",
      "published": "Sat, 17 Jan 2026 20:28:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Rapper suggests foreign forces brought in for 'massacre' crackdown in Iran",
      "description": "An Iranian rapper who took part in the country's protests has described \"a massacre on the streets\", suggesting foreign forces have been brought in to stamp out the demonstrations.",
      "url": "https://news.sky.com/story/iranian-rapper-describes-bodies-on-streets-left-as-a-warning-to-protesters-13495443",
      "published": "Sat, 17 Jan 2026 16:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iran supreme leader acknowledges thousands killed during recent protests",
      "description": "Ayatollah Ali Khamenei says some deaths were “inhuman” and “savage” but blames the US.",
      "url": "https://www.bbc.com/news/articles/ckglee733wno?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 20:14:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Netherlands ushers in Spring with National Tulip Day celebration",
      "description": "The Netherlands celebrated National Tulip Day on Saturday, marking the upcoming arrival of spring and the start of the tulip season. Dutch tulip growers arranged around 200,000 tulips in a vibrant display for visitors to pick from. The country is the world's largest producer and exporter of tulips.",
      "url": "https://www.france24.com/en/netherlands-ushers-in-spring-with-national-tulip-day-celebration",
      "published": "Sun, 18 Jan 2026 15:25:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran internet shutdown: activists warn of 'permanent' blackout",
      "description": "Iran is 10 days into an internet blackout, which rights groups say is intended to prevent further protests and conceal the regime's deadly crackdown. What happens now is unclear. Iranian digital activists are warning the blackout may become \"permanent,\" but local media report that the authorities are considering a gradual return to the internet.",
      "url": "https://www.france24.com/en/tv-shows/tech-24/20260118-iran-internet-shutdown-activists-warn-of-permanent-blackout",
      "published": "Sun, 18 Jan 2026 15:00:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "EU ambassadors hold emergency meeting to discuss response to US tariff threats over Greenland",
      "description": "European Union ⁠leaders on Saturday warned of a \"dangerous downward spiral\" over US President Donald Trump's vow to implement increasing tariffs ​on European allies until the US is ‍allowed to buy Greenland. Ambassadors from the European Union's 27 countries will convene on ‍Sunday for an emergency meeting to discuss their response to ‌the ​tariff threat.",
      "url": "https://www.france24.com/en/eu-ambassadors-hold-emergency-meeting-to-discuss-response-to-us-tariff-threats-over-greenland",
      "published": "Sun, 18 Jan 2026 10:03:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Indonesian rescuers find plane wreckage in mountainous region",
      "description": "Indonesian rescuers have recovered wreckage from a missing plane believed to have crashed with 11 people on board",
      "url": "https://abcnews.go.com/International/wireStory/indonesian-rescuers-find-wreckage-plane-mountainous-region-129323471",
      "published": "Sun, 18 Jan 2026 00:48:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Pakistan road crashes kill at least 24 people and injure 45 others",
      "description": "Authorities in Pakistan say at least two dozen people have been killed and 45 others injured in separate road crashes hours apart",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-road-crashes-kill-24-people-injure-45-129306767",
      "published": "Sat, 17 Jan 2026 10:02:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "WATCH: Ellen Greenberg’s ex-fiancé dodges questions as feds reopen death case of teacher with 23 stab wounds",
      "description": "Federal authorities reportedly reopen investigation into Ellen Greenberg's controversial 2011 death as former fiancé Sam Goldberg spotted in NYC.",
      "url": "https://www.foxnews.com/us/watch-ellen-greenberg-ex-fiance-dodges-questions-feds-reopen-death-case-teacher-with-23-stab-wounds",
      "published": "Sat, 17 Jan 2026 09:00:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Uganda’s opposition leader ‘taken by army’ as Museveni nears re-election",
      "description": "Bobi Wine flown to unknown location, his party says, hours after security forces allegedly killed 10 of his campaigners The Ugandan opposition leader Bobi Wine was taken from his house and brought to an unknown location on Friday, his party said as President Yoweri Museveni closed in on a landslide re-election. Wine’s National Unity Platform party said on Friday evening in a post on X that an army helicopter had landed in his compound in the capital, Kampala, and “forcibly taken him away to an unknown destination”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/uganda-election-early-results-show-museveni-in-lead-as-violence-reported",
      "published": "Fri, 16 Jan 2026 21:33:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Factory explosion in China's Inner Mongolia region kills 2 and hospitalizes 66",
      "description": "An explosion at a factory in China's Inner Mongolia region has killed two people and left 66 others hospitalized",
      "url": "https://abcnews.go.com/International/wireStory/factory-explosion-chinas-mongolia-region-kills-2-hospitalizes-129325160",
      "published": "Sun, 18 Jan 2026 07:43:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "A Saudi-UAE rift is turning two close allies into regional rivals",
      "description": "The key question now is whether the Saudi-UAE rift settles back into business as usual or accelerates into a wider realignment, says Marc Lynch, professor of political science and international affairs at George Washington University.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5677289/a-saudi-uae-rift-is-turning-two-close-allies-into-regional-rivals",
      "published": "Sat, 17 Jan 2026 17:00:07 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Live: European nations targeted by Trump 'stand united' over Greenland tariffs threat",
      "description": "European nations threatened with new tariffs if they oppose US President Donald Trump's plans for Greenland said on Sunday that they \"stand united\". Such threats \"undermine transatlantic relations and risk a dangerous downward spiral\", said a joint statement from the UK, France, Denmark, Germany, Finland, the Netherlands, Norway and Sweden. Follow our liveblog for the latest developments.",
      "url": "https://www.france24.com/en/europe/20260118-live-european-nations-greenland-trump-tariffs-threat",
      "published": "Sun, 18 Jan 2026 13:47:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Man allegedly assaulted with flagpole by Minneapolis anti-ICE agitators in violent parking garage attack",
      "description": "Jake Lang, a pardoned Jan. 6 rioter, was also allegedly attacked during anti-ICE protests, Saturday, outside Minneapolis City Hall.",
      "url": "https://www.foxnews.com/us/man-allegedly-assaulted-flagpole-minneapolis-anti-ice-agitators-violent-parking-garage-attack",
      "published": "Sat, 17 Jan 2026 22:54:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Germany sees surge in young Ukrainian refugees as Kyiv eases travel ban",
      "description": "Since Ukraine allowed men aged 18 to 22 to travel abroad last August, Germany has seen a growing number of young Ukrainian refugees. Seeking work and hoping to avoid mobilisation, around 20,000 arrived between September and December. They now face the challenge of integrating into German society. As Russian strikes intensify, however, Berlin is urging Kyiv to slow the departures, warning Ukraine risks losing an entire generation.",
      "url": "https://www.france24.com/en/germany-sees-surge-in-young-ukrainian-refugees-as-kyiv-eases-travel-ban",
      "published": "Sun, 18 Jan 2026 10:13:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Secretary-General on UN at 80: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "11-year streak of record global warming continues, UN weather agency warns",
      "description": "The past 11 years have been the warmest in the modern era, while oceans continue to heat up, too, says the UN weather agency.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166758",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "European leaders warn Trump tariffs over Greenland 'risk a dangerous downward spiral'",
      "description": "European leaders unite against Trump's tariff threats over Greenland acquisition, warning of damage to transatlantic relations as tensions escalate.",
      "url": "https://www.foxnews.com/world/european-leaders-warn-trump-tariffs-over-greenland-risk-dangerous-downward-spiral",
      "published": "Sun, 18 Jan 2026 09:46:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "A deadly fire swept through a nightclub in just 90 seconds. I got out",
      "description": "Twenty-two years before the Swiss ski resort fire, Gina escaped a near-identical disaster. Would you know what to do if it happened to you?",
      "url": "https://www.bbc.com/news/articles/czejykzg77po?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 00:08:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US launches new retaliatory strike in Syria, killing leader tied to deadly Islamic State ambush",
      "description": "A third round of retaliatory strikes by the U.S. in Syria has resulted in the death of an Al-Qaeda-affiliated leader, said U.S. Central Command.",
      "url": "https://www.npr.org/2026/01/17/g-s1-106418/us-strike-syria-islamic-state-ambush",
      "published": "Sat, 17 Jan 2026 17:09:12 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Syria strikes new ceasefire deal with SDF — state media",
      "description": "The deal follows advances by the Syrian military into northern and eastern areas previously under the control of Syrian Democratic Forces, or SDF. DW has the latest.",
      "url": "https://www.dw.com/en/syria-strikes-new-ceasefire-deal-with-sdf-state-media/live-75553804?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 17:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump also has 'a lot to lose' from threatened tariffs over Greenland, French minister says",
      "description": "French Agriculture Minister Annie Genevard warned Sunday that US President Trump's proposed tariffs on European countries opposing his plans to purchase Greenland would be \"deadly for the United States\". Trump on Saturday threatened a 10-percent tariff from February 1 on all goods sent to the US from eight European countries, including France.",
      "url": "https://www.france24.com/en/europe/20260118-trump-has-lot-to-lose-threatened-tariffs-greenland-french-minister-says",
      "published": "Sun, 18 Jan 2026 10:47:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "5 skiers killed in a pair of avalanches in Austria",
      "description": "Rescue helicopters, mountain rescue and Red Cross dog teams rushed to the scene.",
      "url": "https://abcnews.go.com/International/wireStory/5-skiers-killed-pair-avalanches-austria-129314287",
      "published": "Sat, 17 Jan 2026 15:45:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Aid cuts push millions in West and Central Africa deeper into hunger",
      "description": "A staggering 55 million people across West and Central Africa are expected to suffer crisis levels of hunger, or worse, during the lean season from June to August as funding cuts to humanitarian operations continue amid rising violence and displacement.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166776",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar’s Rohingya people called ‘Muslim dogs’ before attacks, ICJ hears",
      "description": "Hearings continued on Thursday at the UN’s top court into the Gambia’s claim that Myanmar committed genocide against the Rohingya people, with allegations that military officials incited violence through hate speech, calling the ethnic minority “Muslim dogs” who should be made “extinct”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166764",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "8 fun facts about Dolly Parton for her 80th birthday",
      "description": "Dolly Parton is one of the world's most successful artists. Now 80, she has an eventful life to look back over. Here are some important and extraordinary facts about the country icon.",
      "url": "https://www.dw.com/en/8-fun-facts-about-dolly-parton-for-her-80th-birthday/a-75503168?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 16:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "East Jerusalem: Forced shutdown of UN clinic signals escalating disregard for international law",
      "description": "The temporary closure of a UN-run health centre in East Jerusalem is the latest phase in “a pattern of deliberate disregard” for international law, the head of the UN agency that assists Palestine refugees, UNRWA, said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166760",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Khamenei calls Trump a ‘criminal,’ blames him for deadly protests sweeping Iran",
      "description": "Iran's supreme leader accused President Donald Trump of orchestrating protests as tensions escalate. State radio broadcasts threats as thousands reported dead.",
      "url": "https://www.foxnews.com/world/khamenei-calls-trump-criminal-blames-him-deadly-protests-sweeping-iran",
      "published": "Sat, 17 Jan 2026 07:49:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "FAA warns about flying in Central, South America and eastern Pacific, citing possible ‘military activities’",
      "description": "The FAA issued a series of flight safety warnings for U.S. airlines flying over the eastern Pacific near Mexico, Central America and South America",
      "url": "https://www.foxnews.com/world/faa-warns-about-flying-central-south-america-eastern-pacific-citing-possible-military-activities",
      "published": "Sat, 17 Jan 2026 07:20:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Exiled Iranian crown prince reveals 6-step plan to exert pressure on Tehran's regime",
      "description": "Exiled Iranian crown prince Reza Pahlavi outlined his 6-step plan to exert international pressure on the regime, describing it as being \"close to collapse\"",
      "url": "https://www.foxnews.com/world/exiled-iranian-crown-prince-reveals-6-step-plan-exert-pressure-tehrans-regime",
      "published": "Fri, 16 Jan 2026 13:50:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Under fire from the sea, families in Odesa try to escape Russian barrage",
      "description": "Ukraine's third largest city has come under sustained attack on its ports in a Russian bid to sap morale.",
      "url": "https://www.bbc.com/news/articles/cnvg70v1z0ro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 00:14:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Sudan’s people endure ‘horror and hell’ in war, says UN rights chief",
      "description": "United Nations rights chief Volker Turk visits Sudan and says people in country are going through 'hell'.",
      "url": "https://www.aljazeera.com/news/2026/1/18/sudans-people-endure-horror-and-hell-in-war-says-un-rights-chief?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 15:27:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "The threat against Greenland shows that we need to stop appeasing Trump",
      "description": "The world must unite in standing up to imperial bullying and preserving the rules-based order.",
      "url": "https://www.aljazeera.com/opinions/2026/1/18/the-threat-against-greenland-shows-that-we-need-to-stop-appeasing-trump?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 13:42:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Israeli attacks wound civilians across Gaza in latest ceasefire violations",
      "description": "Gaza City, al-Mawasi and Bureij refugee camp all come under Israeli air attacks and gunfire.",
      "url": "https://www.aljazeera.com/news/2026/1/18/israeli-attacks-wound-civilians-across-gaza-in-latest-ceasefire-violations?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 11:50:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Rare twins born in DRC raise cautious hope for endangered mountain gorillas",
      "description": "Virunga park ranger says babies are well cared for by mother Mafuko but high infant mortality makes first weeks critical It was noon by the time Jacques Katutu first saw the newborn mountain gorillas. Cradled in the arms of their mother, Mafuko, the tiny twins clung to her body for warmth in the forest clearing in Virunga national park, in eastern Democratic Republic of the Congo (DRC). Katutu, head of gorilla monitoring in Virunga, has seen dozens of newborns in his 15 years as a ranger. But, he tells the Guardian, even he was touched by the sight of the fragile infant males, who face serious obstacles if they are to become silverbacks one day. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/17/twin-baby-mountain-gorilla-virunga-drc-survival-conservation-aoe",
      "published": "Sat, 17 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Death toll rises to 6 in a fire at a shopping plaza in Pakistan’s city of Karachi",
      "description": "Firefighters in Karachi are battling a blaze at a multistory shopping plaza that erupted overnight, killing six people, including a firefighter",
      "url": "https://abcnews.go.com/International/wireStory/death-toll-rises-6-fire-shopping-plaza-pakistans-129324832",
      "published": "Sun, 18 Jan 2026 07:45:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump announces new tariffs over Greenland: How have EU allies responded?",
      "description": "The European Union is having an emergency meeting to devise a response to Trump's tariff threats over Greenland.",
      "url": "https://www.aljazeera.com/news/2026/1/18/trump-announces-new-tariffs-over-greenland-how-have-eu-allies-responded?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 17:05:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran's supreme leader acknowledges thousands killed as pressure builds on clerical rule",
      "description": "Iran's Supreme Leader Ayatollah Ali Khamenei acknowledged that \"thousands\" have been killed in protests that began in late December. But he put the blame on President Trump.",
      "url": "https://www.npr.org/2026/01/16/g-s1-106345/iran-protests-cleric-ayatollah-ahmad-khatami-trump-threat",
      "published": "Fri, 16 Jan 2026 19:44:18 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Greenland row: EU considers its response to Trump",
      "description": "EU ambassadors convened an emergency meeting in Brussels after Donald Trump threatened tariffs on eight European countries in a dispute over Greenland. France wants the block to use its so-called trade \"bazooka.\"",
      "url": "https://www.dw.com/en/greenland-row-eu-considers-its-response-to-trump/live-75550031?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 13:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "How can Europe respond to Trump's tariff threats over Greenland?",
      "description": "FRANCE 24 Brussels correspondent Pierre Benazet talks about the closed-door crisis meeting between ambassadors from all 27 European Union members following US President Donald Trump's decision to slap tariffs on eight nations accused of opposing his efforts to annex the Danish autonomous territory of Greenland.",
      "url": "https://www.france24.com/en/how-can-europe-respond-to-trump-s-tariff-threats-over-greenland",
      "published": "Sun, 18 Jan 2026 17:55:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran's leader calls Trump a 'criminal' for backing protests",
      "description": "He blamed demonstrators for causing thousands of deaths.",
      "url": "https://abcnews.go.com/International/wireStory/irans-leader-calls-trump-criminal-backing-protests-blames-129305931",
      "published": "Sat, 17 Jan 2026 15:38:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Tyler Robinson's lover Lance Twiggs no longer protected by FBI: What we know about alleged assassin's partner",
      "description": "FBI ends protection for transgender partner of Charlie Kirk's alleged assassin Tyler Robinson after four months of ongoing investigation into the shooting.",
      "url": "https://www.foxnews.com/us/tyler-robinson-lover-lance-twiggs-no-longer-protected-by-fbi-what-we-know-about-alleged-assassins-partner",
      "published": "Sat, 17 Jan 2026 08:00:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Syria agrees ceasefire with Kurdish-led forces after two weeks of clashes",
      "description": "President Ahmed al-Sharaa said the deal would allow the Syrian state to reassert control over most areas.",
      "url": "https://www.bbc.com/news/articles/c4gwk37ewvwo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 17:49:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Israel recognises Homesh settlement to “prevent a Palestinian state”",
      "description": "“So, whether you call it a settlement or an outpost actually doesn't matter. They're all war crimes.”",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/18/israel-recognises-homesh-settlement-to-prevent-a-palestinian?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 12:24:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Counterprotesters confront conservative influencer in Minneapolis",
      "description": "Hundreds of counterprotesters drowned out a far-right activist’s attempt to hold a small rally in support of the Trump administration’s latest immigration crackdown in Minneapolis on Saturday, as the governor’s office announced that National Guard troops were mobilised and ready to assist law enforcement though not yet deployed to city streets.",
      "url": "https://www.france24.com/en/counterprotesters-drive-off-conservative-influencer-in-minneapolis",
      "published": "Sun, 18 Jan 2026 10:05:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "A regional passenger aircraft with 11 people is missing in Indonesia and a search is underway",
      "description": "A regional passenger aircraft carrying 11 people has lost contact with ground control while approaching a mountainous region between Java and Sulawesi islands in Indonesia",
      "url": "https://abcnews.go.com/International/wireStory/regional-passenger-aircraft-11-people-missing-indonesia-search-129306305",
      "published": "Sat, 17 Jan 2026 09:29:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "A protester from Iran shares her experience",
      "description": "NPR's Scott Simon speaks with A., an Iranian who recently left the country after participating in several days of protests.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5677587/a-protester-from-iran-shares-her-experience",
      "published": "Sat, 17 Jan 2026 07:43:01 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Syrian government says it has struck ceasefire deal with Kurdish-led forces",
      "description": "Damascus on Sunday announced a ceasefire deal with the Kurdish-led Syrian Democratic Forces (SDF) as Syrian troops continued a deadly advance through Kurdish-held territories in the country's northeast. The deal would see SDF forces merged into the government's defence and interior ministries.",
      "url": "https://www.france24.com/en/middle-east/20260118-syrian-government-says-it-has-struck-ceasefire-deal-with-kurdish-led-forces",
      "published": "Sun, 18 Jan 2026 17:12:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis posts anti-ICE video promoting 'peaceful protest' and unity",
      "description": "Minneapolis releases anti-ICE video promoting \"peaceful protest\" as tensions escalate. Federal agents face harassment while troops prepare for deployment.",
      "url": "https://www.foxnews.com/us/minneapolis-posts-anti-ice-video-promoting-peaceful-protest-unity",
      "published": "Sun, 18 Jan 2026 11:48:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minnesota National Guard placed on standby to support law enforcement as protests turn violent",
      "description": "Minnesota National Guard members will wear yellow reflective vests to distinguish themselves from other law enforcement if activated during anti-ICE protests.",
      "url": "https://www.foxnews.com/us/minnesota-national-guard-placed-standby-support-law-enforcement-protests-turn-violent",
      "published": "Sat, 17 Jan 2026 18:21:24 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "911 transcripts, documents detail chaotic scene after ICE agent fatally shot Renee Good",
      "description": "Renee Nicole Good suffered four gunshot wounds, according to newly released reports. Witnesses described the chaotic scene and said she was shot at 'point-blank' range.",
      "url": "https://www.foxnews.com/us/911-transcripts-documents-detail-chaotic-scene-after-ice-agent-fatally-shot-renee-good",
      "published": "Fri, 16 Jan 2026 22:02:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump announces escalating tariffs on Denmark and other European nations to force Greenland purchase deal",
      "description": "President Donald Trump threatens steep tariffs on European nations unless Denmark sells Greenland to the U.S., citing national defense and security.",
      "url": "https://www.foxnews.com/world/trump-announces-escalating-tariffs-denmark-other-european-nations-force-greenland-purchase-deal",
      "published": "Sat, 17 Jan 2026 11:51:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "'I want to show the world what Africa is': YouTube star brings joy and tears on tour",
      "description": "\"I love the love in Africa. The energy here is crazy,\" he says on his maiden tour of the continent.",
      "url": "https://www.bbc.com/news/articles/c5y5le7yl7po?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 00:21:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Canada PM hails strategic partnership with China to adapt to ‘new global realities’",
      "description": "Mark Carney holds talks with Xi Jinping on rare Beijing trip as Canada seeks to diversify trade links away from US Business live – latest updates Canada’s prime minister, Mark Carney, has hailed a “new strategic partnership” with China as he held talks in Beijing with President Xi Jinping , the first visit by a Canadian leader in eight years. Addressing Xi in the Great Hall of the People, Carney said: “Together we can build on the best of what this relationship has been in the past to create a new one adapted to new global realities.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/china-canada-partnership-new-global-realities-carney-xi-jinping",
      "published": "Fri, 16 Jan 2026 09:37:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: A push to reduce the number of federal states",
      "description": "Bavaria's State Premier Markus Söder wants to change Germany's political map, but his proposal to merge federal states is meeting with resistance.",
      "url": "https://www.dw.com/en/germany-a-push-to-reduce-the-number-of-federal-states/a-75541520?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 16:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Will Turkey export home-grown 'Islamic State' extremists?",
      "description": "Turkey is no longer just a transit country for one branch of the extremist \"Islamic State\" group. Experts say the group has become more professional in Turkey and could pose a danger domestically, and abroad.",
      "url": "https://www.dw.com/en/will-turkey-export-home-grown-islamic-state-extremists/a-75544113?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 06:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU and Mercosur countries sign landmark free trade deal",
      "description": "The agreement took 25 years to negotiate and will create one of the world's largest free trade zones. The deal was signed, despite opposition from some European farmers.",
      "url": "https://www.dw.com/en/eu-and-mercosur-countries-sign-landmark-free-trade-deal/a-75545794?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 18:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump’s tariff policies: Pressuring rivals and alienating allies",
      "description": "During his second term, President Donald Trump used tariffs not only to rebalance trade but to pressure both allies and rivals into aligning with his policies. While this approach has raised tensions, critics argue it’s damaging US relations and global standing.",
      "url": "https://www.france24.com/en/trump-s-tariff-policies-pressuring-rivals-and-alienating-allies",
      "published": "Sun, 18 Jan 2026 16:36:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Mum's dash across the world pays off as Briton wins on Australian Open debut",
      "description": "British tennis player Arthur Fery is through to the second round of the Australian Open after beating the 20th seed Flavio Cobolli.",
      "url": "https://news.sky.com/story/arthur-fery-mums-dash-across-the-world-pays-off-as-briton-wins-on-australian-open-debut-13495764",
      "published": "Sun, 18 Jan 2026 08:05:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Surgeon ex in Ohio dentist murders job hopped across country, dodged lawsuits after divorce",
      "description": "Ohio doctor faces murder charges in alleged killing of divorced wife and her husband. McKee worked across states before Columbus arrest in shocking case.",
      "url": "https://www.foxnews.com/us/surgeon-ex-ohio-dentist-murders-job-hopped-across-country-dodged-lawsuits-after-divorce",
      "published": "Sun, 18 Jan 2026 10:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Economic Forum invites Iranian foreign minister to Davos after regime slaughter of Iranian civilians",
      "description": "World Economic Forum is facing calls to exclude Iranian officials from Davos after the regime slaughtered thousands of its civilians, rights groups say.",
      "url": "https://www.foxnews.com/world/world-economic-forum-invites-iranian-foreign-minister-davos-after-regime-slaughter-iranian-civilians",
      "published": "Sun, 18 Jan 2026 12:04:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Protests explode in Greenland amid Trump takeover push: 'We are not interested in being Americans'",
      "description": "Thousands marched in Greenland wearing \"Make America Go Away\" hats, rejecting Trump's purchase demands and tariff threats saying, \"We are not interested in being Americans.\"",
      "url": "https://www.foxnews.com/world/protests-explode-greenland-amid-trump-takeover-push-we-not-interested-being-americans",
      "published": "Sat, 17 Jan 2026 18:16:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Lindsey Graham speaks against pending execution of 26-year-old Iranian protester: 'This regime must fall'",
      "description": "Sen. Lindsey Graham calls for Iranian regime change as 26-year-old protester Erfan Soltani faces possible execution despite President Donald Trump's threats.",
      "url": "https://www.foxnews.com/world/lindsey-graham-speaks-against-pending-execution-26-year-old-iranian-protester-this-regime-must-fall",
      "published": "Sat, 17 Jan 2026 13:39:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Gangland killing at a funeral shocks idyllic French island",
      "description": "Corsica is shaken by the shooting, which brings into stark relief one of the highest murder rates in France.",
      "url": "https://www.bbc.com/news/articles/c620nq38y6po?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 00:08:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria announces ceasefire agreement with Kurd-led SDF after heavy fighting",
      "description": "Agreement will see government takeover of SDF-controlled areas, and SDF integration into Syrian military.",
      "url": "https://www.aljazeera.com/news/2026/1/18/syria-announces-ceasefire-agreement-with-kurd-led-sdf-after-heavy-fighting?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 16:01:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Who’s on Trump’s ‘Board of Peace’ and why does Israel have objections?",
      "description": "US President Donald Trump has named high-level members of his ‘Board of Peace’ to oversee Gaza’s post-war transition.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/18/whos-on-trumps-board-of-peace-and-why-does-israel-have-objections?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 13:27:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brazil’s Bolsonaro finds novel way to reduce 27-year sentence: reading books",
      "description": "Former president convicted for coup plot to take advantage of law that knocks four days off jail term for each book read Jair Bolsonaro’s lawyers appear to have been reading up on the country’s penal code and have found a way to help their client reduce the 27-year prison sentence he received last year for plotting a coup: by reading books. There is only one problem: the former far-right Brazilian president has never been known as a bibliophile. “Sorry, I don’t have time to read,” Bolsonaro once declared. “It’s been three years since I read a book.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/brazil-jair-bolsonaro-reduce-sentence-reading-books",
      "published": "Fri, 16 Jan 2026 13:19:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea sentences ex-president to five years in first martial law verdict",
      "description": "Yoon Suk Yeol’s conviction for obstructing own arrest separate from main trial that could lead to death penalty A South Korean court has sentenced former president Yoon Suk Yeol to five years in prison for mobilising presidential security forces to block his own arrest and abusing his powers. It is the first judicial ruling linked to the events surrounding his failed martial law declaration in December 2024. The ruling is separate from Yoon’s main insurrection trial, where prosecutors earlier this week sought the death penalty and a verdict is due next month. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/south-korea-sentences-ex-president-yoon-suk-yeol-five-years-first-martial-law-verdict",
      "published": "Fri, 16 Jan 2026 09:51:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Shark attack at Nielsen Park in Sydney’s east leaves boy fighting for his life",
      "description": "Child in a critical condition in hospital after being pulled from the water in Vaucluse at about 4.20pm Sunday Get our breaking news email , free app or daily news podcast A boy has been attacked by a shark in Sydney’s east and is in a critical condition after suffering serious injuries to both legs. The boy, believed to be aged about 13, was pulled from the water near Shark beach at Neilsen Park, in the eastern suburb of Vaucluse, at about 4.20pm Sunday afternoon. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/18/boy-fighting-for-life-after-being-bitten-by-shark-at-nielsen-park-in-sydneys-east",
      "published": "Sun, 18 Jan 2026 07:04:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Uganda's longtime leader declared winner in disputed vote",
      "description": "Museveni claims victory in Uganda's contested election as opposition leader Bobi Wine goes into hiding amid chaos, violence and accusations of fraud.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5680817/uganda-museveni-wine-election-disputed-election",
      "published": "Sat, 17 Jan 2026 10:18:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "WEF: Donald Trump set to dominate Davos 2026",
      "description": "Davos braces for Trump's return. Weeks after attacking Venezuela, capturing its controversial leader, and reviving Greenland ambitions, the US president's presence is expected to raise the stakes at WEF's annual meeting.",
      "url": "https://www.dw.com/en/wef-donald-trump-set-to-dominate-davos-2026/a-75509182?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 18:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Austria: Eight people killed in three avalanches",
      "description": "Officials said fresh snowfall in the Austrian Alps is poorly bonded to older layers on the peaks, increasing the risk of repeated avalanches, and urged extreme caution.",
      "url": "https://www.dw.com/en/austria-eight-people-killed-in-three-avalanches/a-75551698?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 09:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel objects to US lineup of 'Gaza executive board'",
      "description": "Netanyahu's office said the lineup runs contrary to Israeli policy. The Trump administration had announced panel members who will oversee the transitional government in the war-ravaged Palestinian territory.",
      "url": "https://www.dw.com/en/israel-objects-to-us-lineup-of-gaza-executive-board/a-75550023?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 23:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ceasefire declared between Syrian government and Kurdish-led forces",
      "description": "A ceasefire has been declared between Syrian government troops and US-backed Kurdish-led forces, according to state media.",
      "url": "https://news.sky.com/story/syrian-army-seizes-oil-and-gas-fields-after-fighting-kurdish-led-forces-13495795",
      "published": "Sun, 18 Jan 2026 10:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Eight skiers killed in Austrian avalanches",
      "description": "Eight people have been killed in a series of avalanches in Austria, authorities say.",
      "url": "https://news.sky.com/story/eight-skiers-killed-in-austrian-avalanches-13495767",
      "published": "Sun, 18 Jan 2026 08:29:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "More than 200,000 homes without power in Russian-occupied Ukraine, official says",
      "description": "Moscow kept up its hammering of Ukraine’s energy grid in overnight attacks.",
      "url": "https://abcnews.go.com/International/wireStory/drone-strikes-cut-power-200000-homes-russian-occupied-129325842",
      "published": "Sun, 18 Jan 2026 10:09:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Democratic Socialists of America in NYC training thousands of activists to counter ICE: report",
      "description": "NYC's Democratic Socialists of America chapter reportedly plans to train 4,000 volunteers for \"rapid response\" against anticipated federal immigration enforcement operations.",
      "url": "https://www.foxnews.com/us/democratic-socialists-america-nyc-training-thousands-activists-counter-ice-report",
      "published": "Sun, 18 Jan 2026 13:14:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Professors were disciplined for vulgar posts after Charlie Kirk's assassination: Where are they now?",
      "description": "Professors fired for controversial posts about Charlie Kirk's assassination have been reinstated at their universities as the spring semester begins.",
      "url": "https://www.foxnews.com/us/professors-disciplined-vulgar-posts-after-charlie-kirk-assassination-where-are-they-now",
      "published": "Sun, 18 Jan 2026 08:00:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "One of Tyler Robinson's last meals as a free man may have been a steak dinner — medium rare",
      "description": "Tyler Robinson's potential last meal as a free man was traced to a Utah steakhouse before the Charlie Kirk shooting arrest, a restaurant owner told FBI investigators.",
      "url": "https://www.foxnews.com/us/one-tyler-robinson-last-meals-free-man-may-have-been-steak-dinner-medium-rare",
      "published": "Sat, 17 Jan 2026 16:00:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Argentina's bungled hunt for Hitler's right-hand man Martin Bormann revealed in declassified files",
      "description": "Files show Argentina's bungled hunt for Hitler's henchman Martin Bormann, marked by mistaken arrests and bureaucratic incompetence in the post-war era.",
      "url": "https://www.foxnews.com/world/argentinas-bungled-hunt-hitlers-right-hand-man-martin-bormann-revealed-declassified-files",
      "published": "Sun, 18 Jan 2026 06:00:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump launches phase 2 of Gaza peace plan — but Hamas disarmament remains the real test",
      "description": "Trump launches phase two of Gaza plan focusing on demilitarization Hamas and reconstruction, but experts warn disarming Hamas remains decisive challenge.",
      "url": "https://www.foxnews.com/world/trump-launches-phase-2-gaza-peace-plan-hamas-disarmament-remains-real-test",
      "published": "Fri, 16 Jan 2026 10:12:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why a Chinese ‘mega embassy’ is not such a worry for British spies",
      "description": "Politicians are raising the alarm, while MI5 quietly welcomes the prospect of Beijing’s new London facility While there has been no shortage of politicians eager to raise concerns about China’s proposed “mega embassy” near the Tower of London, the espionage community quietly takes a different view, arguing that concerns about the development are exaggerated and misplaced. The domestic Security Service, MI5, is already quietly welcoming the prospect of rationalising China’s seven diplomatic sites to one, but a more significant argument is that modern technology and the nature of the Chinese threat means that, in the words of one former British intelligence officer, “embassies are less and less relevant”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chinese-mega-embassy-london-british-spies-mi5-analysis",
      "published": "Sun, 18 Jan 2026 09:19:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Protesters pledge to ‘break the ban’ on 26 January after standoff at Sydney rally – as it happened",
      "description": "This blog is now closed. Get our breaking news email , free app or daily news podcast Labor does not ‘share the concerns of the Greens’ on hate speech laws: Gallagher Speaking at Parliament House in Canberra, the finance minister, Katy Gallagher , says she has spoken with the Coalition and the Greens Senate managers ahead of this week’s special sittings. We don’t share the concerns of the Greens on that one, and we’ve made that clear to them in the last week. The elements of the bill that exist without the racial vilification still have very strong purpose around combating antisemitism, and that is why many of these groups, including neo-Nazis, have foreshadowed they are going disband, once they saw this exposure draft bill. The PM has been clear about this from the get go, that we need to get something from the opposition. We haven’t had anything to date, and we need to make sure that the parliament does deal with this legislation in a way that ensures Australians are safer. Australians want to see unity. They want to see agreement. They want to see the parliament working together, and that’s the approach we’re taking to the sitting. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/18/australia-news-live-weather-sydney-nsw-storms-sunday-politics-ntwnfb",
      "published": "Sun, 18 Jan 2026 04:58:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "European governments condemn Trump's tariff threats over Greenland",
      "description": "European governments blasted US President Donald Trump’s announcement that eight countries will face 10% tariff for opposing American control of Greenland beginning next month. Denmark, Norway, Sweden, France, Germany, the United Kingdom, the Netherlands and Finland are on Trump's list, though it was not immediately clear if the tariffs would impact the European Union as a bloc.",
      "url": "https://www.france24.com/en/european-governments-condemn-trump-s-tariff-threats-over-greenland",
      "published": "Sun, 18 Jan 2026 15:22:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump admin preparing 1,500 soldiers for potential Minnesota deployment",
      "description": "The Trump administration is reportedly preparing 1,500 troops for potential deployment in Minnesota amid anti-ICE protests in the Twin Cities.",
      "url": "https://www.foxnews.com/us/trump-admin-preparing-1500-soldiers-potential-minnesota-deployment-report",
      "published": "Sun, 18 Jan 2026 07:35:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Around 1,500 soldiers on standby for deployment to Minneapolis, officials say",
      "description": "The troops are an option should Donald Trump decide to use them to quell anti-ICE protests in the city, an official tells CBS News.",
      "url": "https://www.bbc.com/news/articles/c74v0pxg2nvo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 07:28:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Machado vows to lead Venezuela 'when right time comes'",
      "description": "The opposition leader says she has a mandate to lead the country after the US seized its president.",
      "url": "https://www.bbc.com/news/articles/cz7y14ypg2qo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 19:01:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Peace boards and technocrats won’t stem out Palestinian resistance",
      "description": "Any governance structure that does not take into account the Palestinian national aspirations is doomed to failure.",
      "url": "https://www.aljazeera.com/opinions/2026/1/18/peace-boards-and-technocrats-wont-stem-out-palestinian-resistance?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 16:19:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration says deporting college student trying to surprise family was a ‘mistake’",
      "description": "Any Lucía López Belloza was detained at Boston’s airport in November and flown to Honduras two days later US citizens and permanent residents: have you been racially profiled by ICE? The Trump administration apologized in court for a “mistake” in the deportation of a Massachusetts college student who was detained trying to fly home to surprise her family in Texas for Thanksgiving. But the administration still argued that the federal government error should not affect her immigration case. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/16/trump-administration-mistake-college-student-detained",
      "published": "Fri, 16 Jan 2026 20:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "CIA chief visits Maduro successor as Machado vows to become Venezuela’s president",
      "description": "John Ratcliffe meets Delcy Rodríguez in Caracas less than two weeks after his agents helped to oust her precedessor The CIA chief whose agents reputedly played a key role in abducting Nicolás Maduro has flown to Venezuela to meet his successor as the sidelined opposition leader, María Corina Machado, vowed she would become the country’s first elected female president. Machado’s comments were broadcast on Friday, a day after she handed her Nobel peace prize medal to Donald Trump in recognition of what she called a principled and decisive move against Maduro, whom US special forces snatched on 3 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/cia-chief-visits-maduro-successor-as-machado-vows-to-become-venezuelas-president",
      "published": "Fri, 16 Jan 2026 17:23:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "The latest on what's happening in Ukraine",
      "description": "Many residents in Kyiv are suffering through freezing temperatures with no heat or electricity after Russian strikes on energy infrastructure.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5678596/the-latest-on-whats-happening-in-ukraine",
      "published": "Sat, 17 Jan 2026 07:43:07 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Hong Kong: Life sentence looms for media tycoon Jimmy Lai",
      "description": "With the last stage of Jimmy Lai's national security trial drawing to a close, Hong Kong's High Court is set to decide on the sentence for the pro-democracy tycoon. Will Lai get life in prison?",
      "url": "https://www.dw.com/en/hong-kong-life-sentence-looms-for-media-tycoon-jimmy-lai/a-75516554?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 16:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US: Anti-ICE protesters clash with far-right group in Minneapolis",
      "description": "Right-wing influencer Jake Lang, who organized a pro-ICE rally, had announced that he intended to \"burn a Quran\" on the steps of City Hall. A much larger group of people chased him and his supporters off the scene.",
      "url": "https://www.dw.com/en/us-anti-ice-protesters-clash-with-far-right-group-in-minneapolis/a-75551272?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 03:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Illegal migrant workers caught on camera leaping across rooftops to escape Border Patrol in California raid",
      "description": "Dramatic video captured alleged illegal immigrants fleeing across California rooftops as federal agents conducted an enforcement raid at a construction site.",
      "url": "https://www.foxnews.com/us/illegal-migrant-workers-caught-camera-leaping-across-rooftops-escape-border-patrol-california-raid",
      "published": "Sat, 17 Jan 2026 17:54:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "National Guard troops will likely remain in DC through 2026, official says",
      "description": "National Guard troops likely will have their ongoing deployment to Washington, D.C., extended until the end of 2026, a U.S. official told Fox News.",
      "url": "https://www.foxnews.com/us/national-guard-troops-likely-remain-dc-through-2026-official-says",
      "published": "Sat, 17 Jan 2026 13:28:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Illegal alien with 24 convictions among ‘worst of the worst’ arrested in Minnesota ICE operation: DHS",
      "description": "Federal agents arrested criminal illegal aliens as the DHS blasted Minnesota Gov. Tim Walz for allegedly protecting dangerous offenders through sanctuary policies.",
      "url": "https://www.foxnews.com/us/illegal-alien-24-convictions-among-worst-of-worst-arrested-minnesota-ice-operation-dhs",
      "published": "Fri, 16 Jan 2026 20:37:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "‘Everything is bad’: Fear and anxiety grip Iranians abroad amid protests",
      "description": "Iranians in the diaspora express worry about loved ones during an internet shutdown and deadly demonstrations.",
      "url": "https://www.aljazeera.com/features/2026/1/18/everything-is-bad-fear-and-anxiety-grip-iranians-abroad-amid-protests?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 12:59:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Not for sale': massive protest in Copenhagen against Trump's desire to acquire Greenland",
      "description": "Thousands of people rallied in Copenhagen to push back on President Trump's rhetoric that the U.S. should acquire Greenland.",
      "url": "https://www.npr.org/2026/01/17/g-s1-106401/not-for-sale-massive-protest-in-copenhagen-against-trumps-desire-to-acquire-greenland",
      "published": "Sat, 17 Jan 2026 12:00:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Port Assab becomes flashpoint for Ethiopia–Eritrea relations",
      "description": "Addis Ababa's renewed calls for sea access threaten an already fragile relationship with Eritrea, drawing anger from Asmara.",
      "url": "https://www.dw.com/en/port-assab-becomes-flashpoint-for-ethiopia-eritrea-relations/a-75453946?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 08:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thousands oppose US plans in 'Hands off Greenland' protests",
      "description": "Organizers have called on Danish and Greenlandic residents to join marches and rallies against US President Donald Trump's push to acquire Greenland.",
      "url": "https://www.dw.com/en/thousands-oppose-us-plans-in-hands-off-greenland-protests/a-75546625?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 19:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump tariff threats over Greenland prompt calls for unprecedented EU counter-measures",
      "description": "French President Emmanuel Macron will ask the EU to activate its \"anti-coercion\" measure – dubbed its trade “bazooka” – for the first time ever if US President Donald Trump follows through with threats to impose new tariffs on European countries for opposing his plans for Greenland. An extraordinary meeting of EU ambassadors has been called for Sunday afternoon in Brussels.",
      "url": "https://www.france24.com/en/europe/20260118-macron-wants-eu-anti-coercion-instrument-against-trump-tariffs-greenland",
      "published": "Sun, 18 Jan 2026 12:01:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ugandan election a 'fraudulent affair', Bobi Wine's lawyer says - as protesters face violent crackdown",
      "description": "President Yoweri Museveni has extended his 40-year reign over Uganda by another five years.",
      "url": "https://news.sky.com/story/ugandan-election-a-fraudulent-affair-bobi-wines-lawyer-says-as-protesters-face-violent-crackdown-13495674",
      "published": "Sat, 17 Jan 2026 20:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Families in ‘survival mode’ amid Russian strikes and deadly cold",
      "description": "Families across Ukraine are in “constant survival mode” amid ongoing waves of Russian missile and drone strikes that have left blocks without power for days at a time, while temperatures plunge to deadly lows, the UN Children's Fund (UNICEF) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166774",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Cat caught on camera starting dangerous kitchen fire after jumping on stove and turning on burner",
      "description": "Surveillance video captured the moment a cat turned on a stove burner in Garland, Texas, igniting items and causing extensive kitchen damage to the home.",
      "url": "https://www.foxnews.com/us/cat-caught-camera-starting-dangerous-kitchen-fire-jumping-stove-turning-burner",
      "published": "Fri, 16 Jan 2026 19:05:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Georgian demonstrators watch Iran closely as their own protests grind on",
      "description": "Georgians display Iranian Lion and Sun flags during daily protests in Tbilisi, showing solidarity with Iranian demonstrators while opposing EU accession halt by their government.",
      "url": "https://www.foxnews.com/world/georgian-demonstrators-watch-iran-closely-own-protests-grind",
      "published": "Fri, 16 Jan 2026 18:34:41 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China reports record trillion-dollar trade surplus despite Trump tariffs",
      "description": "Results for 2025 risk further unsettling economies about China’s trade practices and overcapacity, and their own over-reliance on Chinese products China has reported a strong export run in 2025 with a record trillion-dollar surplus, as its producers brace for three more years of a Trump administration set on slowing the manufacturing powerhouse by shifting US orders to other markets. Beijing’s resilience to renewed tariff tensions since Donald Trump returned to the US presidency last January has emboldened Chinese firms to shift their focus to south-east Asia, Africa and Latin America to offset US duties. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/china-reports-record-trillion-dollar-trade-surplus-despite-trump-tariffs",
      "published": "Wed, 14 Jan 2026 04:50:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Trump says 8 EU countries to be charged 10% tariff for opposing US control of Greenland",
      "description": "In a post on social media, Trump said a 10% tariff will take effect on Feb. 1, and will climb to 25% on June 1 if a deal is not in place for the United States to purchase Greenland.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5680839/trump-eu-greenland-tariffs",
      "published": "Sat, 17 Jan 2026 12:22:48 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "More countries confirm invites to Trump's Board of Peace for Gaza. $1 billion buys a permanent seat",
      "description": "At least four more countries say the United States has invited them to join President Donald Trump’s new “Board of Peace\" overseeing next steps for Gaza",
      "url": "https://abcnews.go.com/International/wireStory/countries-confirm-invites-trumps-board-peace-gaza-1-129329341",
      "published": "Sun, 18 Jan 2026 11:13:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US troops pull out of major Iraq airbase amid ongoing regional consolidation effort, progress against ISIS",
      "description": "The U.S. withdrawal of troops from Ain al-Asad Airbase was completed by Friday as part of regional consolidation following progress on ISIS as CENTCOM calls for \"teamwork.\"",
      "url": "https://www.foxnews.com/world/us-troops-pull-out-major-iraq-airbase-amid-ongoing-regional-consolidation-effort-progress-against-isis",
      "published": "Sat, 17 Jan 2026 15:54:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Paracetamol is safe in pregnancy, says study refuting Trump autism claims",
      "description": "Researchers say their gold-standard review should put an end to the debate over use of the common painkiller during pregnancy.",
      "url": "https://www.bbc.com/news/articles/c74vdgkw1kzo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 00:13:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "SA premier ‘fundamentally opposed’ Randa Abdel-Fattah appearing at Adelaide writers’ week, letter to board shows",
      "description": "Three-page letter acknowledged that while Peter Malinauskas could not direct festival board, he was ‘deeply concerned’ Palestinian Australian author’s invitation not rescinded Get our breaking news email , free app or daily news podcast A letter sent by the South Australian premier to the Adelaide writers’ week board criticising the inclusion of Palestinian Australian writer Randa Abdel-Fattah in the 2026 program has been made public. The three-page letter, first published in full by Adelaide’s Sunday Mail newspaper, was signed by Peter Malinauskas and dated 2 January. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/18/peter-malinauskas-adelaide-writers-week-letter-randa-abdel-fattah-ntwnfb",
      "published": "Sun, 18 Jan 2026 07:24:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Syrian army extends control in north, seizes gas, oil fields",
      "description": "The Syrian army continues to push against the Kurdish-led Syrian Democratic Forces (SDF), reportedly capturing major oil and gas fields in eastern Syria.",
      "url": "https://www.dw.com/en/syrian-army-extends-control-in-north-seizes-gas-oil-fields/a-75551958?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 12:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US 'wants countries to pay $1bn to stay on Gaza peace board'",
      "description": "Donald Trump wants countries to pay $1bn to be permanent members of the US-backed Board of Peace, according to reports.",
      "url": "https://news.sky.com/story/us-wants-countries-to-pay-1bn-to-stay-on-gaza-peace-board-13495801",
      "published": "Sun, 18 Jan 2026 10:53:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Taiwanese reporter accused of bribing military officers to leak information to China",
      "description": "A journalist in Taiwan has been detained on allegations of bribing army officers to provide military information to people from mainland China, as the self-ruled island cracks down on potential infiltration from China",
      "url": "https://abcnews.go.com/International/wireStory/taiwanese-reporter-accused-bribing-military-officers-leak-information-129322900",
      "published": "Sun, 18 Jan 2026 00:41:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Inmates in 3 Guatemalan prisons hold dozens of guards hostage",
      "description": "Guatemalan authorities are reporting that inmates are holding several dozen prison guards in three prisons",
      "url": "https://abcnews.go.com/International/wireStory/inmates-3-guatemalan-prisons-hold-dozens-guards-hostage-129320790",
      "published": "Sat, 17 Jan 2026 22:01:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting leader was once a DEA 'priority target': report",
      "description": "Venezuela's interim president Delcy Rodríguez was reportedly labeled a DEA \"priority target\" in 2022, appearing in intelligence files since at least 2018.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-leader-once-dea-priority-target-report",
      "published": "Sun, 18 Jan 2026 11:33:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Local coaching success marks 'sea change' for the sport, expert says",
      "description": "As the 2025 Africa Cup of Nations nears its conclusion, with Morocco set to face Senegal in the final on Sunday, FRANCE 24 speaks to Leslie Koroma Sr., CEO of Africa Sports Ventures Group, to reflect on the tournament and its spotlight on local talent. Noting that all four semi-finalist teams were coached by locals, Koroma described this as a \"sea change\" for the sport, highlighting the growing emphasis on developing homegrown talent.",
      "url": "https://www.france24.com/en/afcon-2025-local-coaching-success-marks-sea-change-for-the-sport-expert-says",
      "published": "Sun, 18 Jan 2026 14:16:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Syrian government seizes strategic town in Raqqa from Kurdish forces",
      "description": "Syrian government forces have entered Raqqa as part of their ongoing push against Kurdish-led forces in eastern Syria",
      "url": "https://abcnews.go.com/International/wireStory/syrian-government-seizes-strategic-town-raqqa-kurdish-forces-129324524",
      "published": "Sun, 18 Jan 2026 11:13:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Oregon city reverses vote, removes convicted murderer from police review board after backlash",
      "description": "Salem City Council reverses controversial decision, removes convicted murderer Kyle Hedquist from police advisory boards after intense public outrage and criticism.",
      "url": "https://www.foxnews.com/us/oregon-city-reverses-vote-removes-convicted-murderer-from-police-review-board-after-backlash",
      "published": "Sat, 17 Jan 2026 10:00:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Avalanches kill eight skiers in Austrian Alps",
      "description": "A number of people have died in the Alps over the past week, as heavy snowfall has hit the region.",
      "url": "https://www.bbc.com/news/articles/c3r1v7gqdp8o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 14:31:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nasa's mega Moon rocket arrives at launch pad for Artemis II mission",
      "description": "Final preparations now get underway for the first crewed mission to the Moon in more than 50 years.",
      "url": "https://www.bbc.com/news/articles/cly148lvyevo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 01:22:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan leader extends 40-year rule after winning contested poll",
      "description": "President Yoweri Museveni wins a seventh term, as his main rival Bobi Wine decries \"fake results\".",
      "url": "https://www.bbc.com/news/articles/c2lgxxrxd52o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 17:43:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japanese mayor apologises after calling staff 'human scum'",
      "description": "Yokohama mayor Takeharu Yamanaka admits using the terms \"idiot\" and \"human scum\" to disparage staff.",
      "url": "https://www.bbc.com/news/articles/czejwl2z80lo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 08:08:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Google appeals landmark antitrust verdict over search monopoly",
      "description": "The tech giant is seeking a pause on court-ordered fixes aimed at limiting its monopoly power.",
      "url": "https://www.bbc.com/news/articles/clyn0ek5rdpo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 02:44:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From camouflage to tracksuits - Guinea's junta leader becomes civilian president",
      "description": "Junta chief Mamadi Doumbouya, set for a seven-year term, has to prove himself as a democratic leader.",
      "url": "https://www.bbc.com/news/articles/cpv70mek448o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 14:41:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "CIA director had two-hour meeting with new Venezuelan leader in Caracas",
      "description": "The pair discussed economic opportunities and preventing Venezuela becoming a place for \"America's adversaries\", a US official said.",
      "url": "https://www.bbc.com/news/articles/cvgjn5yyeljo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 13:28:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China and Canada announce tariffs relief after a high-stakes meeting between Carney and Xi",
      "description": "Canola oil and electric cars are at the centre of the deal agreed by Mark Carney and Xi Jinping after years of strained ties.",
      "url": "https://www.bbc.com/news/articles/cy59pvkqvl5o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 16 Jan 2026 13:11:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who is part of Trump’s ‘Board of Peace’ for Gaza?",
      "description": "Trump unveils a complex three-tier governing structure for Gaza that places Trump and pro-Israel officials at the top.",
      "url": "https://www.aljazeera.com/news/2026/1/18/who-is-part-of-trumps-board-of-peace-for-gaza?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 17:02:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Benin’s opposition loses all parliamentary seats, provisional results show",
      "description": "Electoral commission says two parties aligned with President Patrice Talon win all 109 seats in the assembly.",
      "url": "https://www.aljazeera.com/news/2026/1/18/benin-opposition-loses-all-parliamentary-seats-provisional-results-show?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 16:25:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Senegal vs Morocco – AFCON final",
      "description": "Follow our live build-up, with team news coverage, ahead of our text commentary stream of the 2025 AFCON final in Rabat.",
      "url": "https://www.aljazeera.com/sports/liveblog/2026/1/18/live-senegal-vs-morocco-afcon-final?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 15:30:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Police chief steps down after UK fallout from ban on Tel Aviv football fan",
      "description": "UK police chief retires after backlash over banning Maccabi Tel Aviv fans from a match against Aston Villa last year.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/18/police-chief-steps-down-after-uk-fallout-from-ban-on-tel-aviv-football-fan?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 13:57:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Recent fighting in Syria is “a nightmare scenario for the US”",
      "description": "“This is the nightmare scenario for Western policymakers.”",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/18/recent-fighting-in-syria-is-a-nightmare-scenario-for-the?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 13:44:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syrian army advances on SDF stronghold of Raqqa: What’s the latest?",
      "description": "Military takes control of Tabqa in Raqqa governorate, and President al-Sharaa signs a decree recognising Kurdish rights.",
      "url": "https://www.aljazeera.com/news/2026/1/18/syrian-army-advances-on-sdf-stronghold-of-raqqa-whats-the-latest?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 13:15:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syria’s al-Sharaa restores citizenship and language rights to Syrian Kurds",
      "description": "Syria's Ahmed al-Sharaa has signed a decree formally restoring citizenship and language rights to Syrian Kurds.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/18/syrias-al-sharaa-restores-citizenship-and-language-rights-to-syrian-kurds?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 13:12:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Italy’s PM Meloni calls Trump’s Greenland tariffs on Europe a mistake",
      "description": "Italy’s PM Giorgia Meloni has criticised US President Donald Trump’s pledge to impose tariffs on European countries.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/18/italys-pm-meloni-calls-trumps-greenland-tariffs-on-europe-a-mistake?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 13:11:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alcaraz, Sabalenka make stuttering starts to Australian Open 2026",
      "description": "Top seeds are pushed despite straight-sets wins as the tennis Grand Slam gets under way on a hot day in Melbourne.",
      "url": "https://www.aljazeera.com/sports/2026/1/18/alcaraz-sabalenka-make-stuttering-starts-to-australian-open-2026?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 12:42:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Voters in Portugal electing new president, could be far-right winner",
      "description": "Among the frontrunners is Andre Ventura, whose far-right party is the second-largest in parliament.",
      "url": "https://www.aljazeera.com/news/2026/1/18/voters-in-portugal-electing-new-president-could-be-far-right-winner?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 12:18:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Julio Iglesias denies sexual abuse claims of two former female employees",
      "description": "Women allege Spanish singer subjected them ‘to inappropriate touching, insults and humiliation … in atmosphere of control’ The Spanish singer Julio Iglesias has broken his silence over allegations that he sexually abused two women who worked in his Caribbean mansions, saying he has never “abused, coerced or disrespected any woman”. The 82-year-old entertainer, whose career spans six decades, had been accused by two female former employees who allege they had been sexually assaulted and subjected “to inappropriate touching, insults and humiliation … in an atmosphere of control and constant harassment”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/julio-iglesias-denies-sexual-abuse-claims-of-two-former-female-employees",
      "published": "Fri, 16 Jan 2026 07:58:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US says it reached deal with Taiwan to lower tariffs and boost investments",
      "description": "US to lower tariffs on Taiwanese goods to 15% as chip and tech businesses pledge $250bn spending in US operations The US said on Thursday that it had signed a deal with Taiwan to reduce tariffs on goods from the democratic island, while increasing Taiwanese semiconductor and tech companies’ investments in America. The agreement, the US commerce department said, “will drive a massive reshoring of America’s semiconductor sector”. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/us-taiwan-tariff-deal",
      "published": "Thu, 15 Jan 2026 22:07:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘I’m back’: Damien Martyn out of hospital after surviving meningitis",
      "description": "Former Australia batter given a ‘50/50 chance of surviving’ Spent eight days in induced coma Damien Martyn has said he is back after overcoming a meningitis scare, which he said took his life out of his hands. In a heartfelt post on his social media accounts, the former Australia batter said he was given a 50% chance to live after battling the disease, which causes an infection and swelling of fluid and membranes around the brain and spinal cord. The 54-year-old was put into an induced coma on 27 December and was fighting for his life in a Gold Coast intensive care unit until he woke eight days later. Continue reading...",
      "url": "https://www.theguardian.com/sport/2026/jan/17/damien-martyn-declares-im-back-after-leaving-hospital-following-meningitis",
      "published": "Sat, 17 Jan 2026 10:14:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-18T12:34:06.123Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: Maduro's enforcer Cabello still central to power",
      "description": "The ousting of Venezuela's president raised hopes of change — but the politician now controlling the streets shows how little has really shifted.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5678974/venezuela-maduro-enforcer-cabello",
      "published": "Sun, 18 Jan 2026 06:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What a visit to a French clown school reveals about clowning",
      "description": "A visit to the Gaulier clown school - home to alumni including Sacha Baron Cohen and Emma Thompson - reveals that clowning is all about the art of failure.",
      "url": "https://www.npr.org/2026/01/17/nx-s1-5640672/what-a-visit-to-a-french-clown-school-reveals-about-clowning",
      "published": "Sat, 17 Jan 2026 07:42:48 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's Greenland tariffs: What you need to know",
      "description": "Donald Trump's pursuit of Greenland now extends to new tariffs on countries considered NATO allies. But what would such tariffs mean for the European countries affected, how have they been received, and what happens now?",
      "url": "https://www.dw.com/en/trump-s-greenland-tariffs-what-you-need-to-know/a-75553538?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 14:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany's AfD receives millions in public funding",
      "description": "The right-wing extremist party Alternative for Germany (AfD) profits significantly from public funding. Is democracy in Germany funding its own downfall?",
      "url": "https://www.dw.com/en/germany-s-afd-receives-millions-in-public-funding/a-75533025?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 06:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan: Popular Prime Minister Takaichi calls early election",
      "description": "Japan's first female leader is popular with voters. She has now called for early elections to leverage their approval. The move could bolster her position, but it carries risks.",
      "url": "https://www.dw.com/en/japan-popular-prime-minister-takaichi-calls-early-election/a-75550678?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 20:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungary: Orban gives asylum to EU politicians accused of corruption",
      "description": "Hungary has just granted asylum to Poland's ex-justice minister, Zbigniew Ziobro, who fled corruption charges at home. The move shows how far Hungary has drifted from the EU, but it's a risky gambit for Viktor Orban.",
      "url": "https://www.dw.com/en/hungary-orban-gives-asylum-to-eu-politicians-accused-of-corruption/a-75549301?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 18:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump to impose tariffs on European nations over Greenland",
      "description": "Germany, Denmark, Norway, Sweden, France, the UK, the Netherlands and Finland to face a 10% tariff beginning February 1. Trump said tariffs will be in place until \"a deal is reached\" on Greenland.",
      "url": "https://www.dw.com/en/trump-to-impose-tariffs-on-european-nations-over-greenland/a-75549367?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 17 Jan 2026 16:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Watch live: AFCON 2025 comes to climactic close as hosts Morocco square off against Senegal",
      "description": "Morocco's Atlas Lions will face off against Senegal's Lions of Teranga in Rabat on Sunday night, where the host nation hopes to win its first Africa Cup of Nations title in half a century. Watch our special coverage live on FRANCE 24.",
      "url": "https://www.france24.com/en/africa/20260118-afcon-2025-comes-to-climactic-close-hosts-morocco-square-off-against-senegal-final",
      "published": "Sun, 18 Jan 2026 15:13:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portugal votes in tight presidential race with far right expected to reach runoff",
      "description": "Opinion polls in Portugal show that far-right candidate Andre Ventura could win 24 percent, closely followed by Socialist Antonio Jose Seguro, FRANCE 24's Sarah Morris said. Portugal is holding what may be the first round of presidential elections on Sunday. In the five decades since ‍Portugal threw off its fascist dictatorship, a presidential election has only once before - in 1986 - required a runoff,",
      "url": "https://www.france24.com/en/portugal-votes-in-tight-presidential-race-with-far-right-expected-to-reach-runoff",
      "published": "Sun, 18 Jan 2026 11:28:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Ideas of Africa' exhibit in NY captures a continent coming into its own",
      "description": "A new exhibition at the Museum of Modern Art (MoMA) in New York, “Ideas of Africa: Portraiture and Political Imagination”, features photographic portraits by African artists and captures the spirit of decolonisation that swept across the continent in the 1960s and '70s alongside the US Civil Rights movement.",
      "url": "https://www.france24.com/en/culture/20260118-ideas-of-africa-exhibit-in-ny-captures-a-continent-coming-into-its-own",
      "published": "Sun, 18 Jan 2026 10:57:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portugal votes in presidential election as far right eyes historic run-off",
      "description": "Portugal started voting Sunday in the first round of a presidential election in which a far-right candidate could for the first time make it to a run-off, but with the final result hard to call. Polls predict Andre Ventura, leader of the far-right Chega (\"Enough\") party, could top the first round but would lose round two, regardless of which of the other candidates he faces there.",
      "url": "https://www.france24.com/en/portugal-votes-in-presidential-election-as-far-right-eyes-historic-run-off",
      "published": "Sun, 18 Jan 2026 10:55:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Senegal vs Morocco, a dream final between the tournament favorites",
      "description": "It’s a clash of Lions this Sunday in the AFCON final. The Lions of Teranga face off against the Atlas Lions in Rabat, with history on the line: a first continental crown in 50 years for hosts Morocco, or a second title in four years for reigning champions Senegal.",
      "url": "https://www.france24.com/en/tv-shows/sports/20260118-afcon-2025-senegal-vs-morocco-a-dream-final-between-the-tournament-favorites",
      "published": "Sun, 18 Jan 2026 10:18:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump is not bluffing, Greenland situation is critical for Europe and NATO",
      "description": "\"The situation is critical…\" Those are the four words a top European diplomat chose when we discussed Donald Trump's position on Greenland.",
      "url": "https://news.sky.com/story/trump-is-not-bluffing-greenland-situation-is-critical-for-europe-and-nato-13495736",
      "published": "Sun, 18 Jan 2026 06:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraq veterans living with 'ticking time bomb'",
      "description": "British soldiers say they were not offered biological screening after being exposed to a deadly toxin in Iraq 20 years ago - despite official guidance they should have been, Sky News can reveal.",
      "url": "https://news.sky.com/story/iraq-veterans-living-with-ticking-time-bomb-after-not-receiving-medical-screening-for-deadly-toxin-exposure-13484777",
      "published": "Sun, 21 Dec 2025 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's president says election victory over young challenger shows his strength",
      "description": "Museveni took 71.6% of the vote while his closest challenger took 24.7%,",
      "url": "https://abcnews.go.com/International/wireStory/ugandas-president-strong-election-victory-youthful-challenger-taste-129325650",
      "published": "Sun, 18 Jan 2026 09:20:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portugal's presidential election may deliver another gain for populists in Europe",
      "description": "Portugal's presidential election features a record 11 candidates, with a populist party leader poised for a potential breakthrough",
      "url": "https://abcnews.go.com/International/wireStory/portugals-presidential-election-deliver-gain-populists-europe-129323135",
      "published": "Sun, 18 Jan 2026 11:13:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thousands rally in Serbia as students vow to lead on fight against corruption",
      "description": "Thousands of people have rallied in Serbia as university students announced a new stage in their struggle against President Aleksandar Vucic’s government after leading more than a year of mass demonstrations that shook his autocratic rule in the Balkan...",
      "url": "https://abcnews.go.com/International/wireStory/thousands-rally-serbia-students-vow-lead-fight-corruption-129314285",
      "published": "Sat, 17 Jan 2026 15:06:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraqi army fully takes over key base following US withdrawal",
      "description": "All U.S. forces have left the base and removed all American equipment from it.",
      "url": "https://abcnews.go.com/International/wireStory/iraqi-army-fully-takes-key-base-us-withdrawal-129314011",
      "published": "Sat, 17 Jan 2026 15:16:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sri Lanka unveils a rare purple star sapphire claimed to be the biggest of its kind",
      "description": "A massive purple star sapphire weighing 3,563 carats has been unveiled in Sri Lanka",
      "url": "https://abcnews.go.com/International/wireStory/sri-lanka-unveils-rare-purple-star-sapphire-claimed-129306758",
      "published": "Sat, 17 Jan 2026 10:19:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Horses leap through flames and pets go to church in Spanish rituals honoring saint",
      "description": "Hundreds of people in Spain have watched horses gallop through flames as part of the centuries-old tradition called Las Luminarias",
      "url": "https://abcnews.go.com/International/wireStory/horses-leap-flames-pets-church-spanish-animal-rituals-129305751",
      "published": "Sat, 17 Jan 2026 20:27:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "FBI captures Top Ten Most Wanted fugitive sought for alleged 2016 murder of North Carolina co-worker in Mexico",
      "description": "FBI Director Kash Patel announced the arrest of a wanted fugitive who has been on the run after the alleged murder of his former co-worker in 2016.",
      "url": "https://www.foxnews.com/us/fbi-captures-top-ten-most-wanted-fugitive-mexico-sought-2016-murder-nc-coworker",
      "published": "Sat, 17 Jan 2026 12:40:39 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Woman wakes up with 8-foot python coiled on her chest while sleeping: 'Don't move'",
      "description": "A Brisbane woman calmly removed an 8-foot carpet python from her bedroom after waking to find the non-venomous snake on top of her chest Monday night.",
      "url": "https://www.foxnews.com/world/woman-wakes-up-8-foot-python-coiled-her-chest-while-sleeping-dont-move",
      "published": "Sat, 17 Jan 2026 23:11:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NATO ambassador says Europe 'has a tendency to overreact' over Greenland dispute",
      "description": "U.S. NATO ambassador Matthew Whitaker defends American focus on Greenland amid European backlash, calling Arctic security crucial for continental defense.",
      "url": "https://www.foxnews.com/world/nato-ambassador-says-europe-has-tendency-overreact-over-trumps-greenland-dispute",
      "published": "Sat, 17 Jan 2026 06:00:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}