{
  "last_updated": "2026-01-19T15:52:35.966821Z",
  "event_count": 222,
  "events": [
    {
      "title": "Security Council LIVE: UN raises alarm over deadly Iran protests and ‘possible military strikes’",
      "description": "The UN Security Council is meeting in New York in emergency session on Iran, amid escalating concern over reports that hundreds have been killed during weeks of nationwide anti-government protests. The meeting was requested by the United States. Demonstrations that began in late December, fuelled by soaring inflation, rising food prices and the collapse of the national currency, triggered a deadly and widespread crackdown with thousands injured and detained, according to numerous firsthand accounts. The UN has called for independent investigations into all killings and warned against the possible use of the death penalty against protesters. Follow live coverage below, and UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "15 years after Fukushima, Japan prepares to restart the world’s biggest nuclear plant",
      "description": "A return to nuclear power is at the heart of Japan’s energy policy but, in the wake of the 2011 disaster, residents’ fears about tsunamis, earthquakes and evacuation plans remain The activity around the Kashiwazaki-Kariwa nuclear power plant is reaching its peak: workers remove earth to expand the width of a main road, while lorries arrive at its heavily guarded entrance. A long perimeter fence is lined with countless coils of razor wire, and in a layby, a police patrol car monitors visitors to the beach – one of the few locations with a clear view of the reactors, framed by a snowy Mount Yoneyama. When all seven of its reactors are working, Kashiwazaki-Kariwa generates 8.2 gigawatts of electricity, enough to power millions of households. Occupying 4.2 sq km of land in Niigata prefecture on the Japan Sea coast, it is the biggest nuclear power plant in the world. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/japan-nuclear-plant-restart-kashiwazaki-kariwa-fukushima",
      "published": "Mon, 19 Jan 2026 01:46:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 57,
      "severity_level": "Critical"
    },
    {
      "title": "Chile declares 'state of catastrophe' as wildfires leave at least 18 dead",
      "description": "Chile's president warned the death toll cold rise in the Ñuble and Biobío regions.",
      "url": "https://www.bbc.com/news/articles/cz7ypw4rjrzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 03:30:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Chilean president declares state of catastrophe as wildfires kill at least 18",
      "description": "Fires blaze through 8,500 hectares, forcing 50,000 people to evacuate as firefighters struggle to extinguish flames Wildfires raging across central and southern Chile have killed at least 18 people, scorched thousands of hectares of forest and destroyed scores of homes, authorities said, as the South American country swelters under a heatwave. Chile’s president, Gabriel Boric, declared a state of catastrophe in the country’s central Biobío region and the neighbouring Ñuble region, about 500km (300 miles) south of Santiago, the capital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chile-president-declares-state-of-catastrophe-as-wildfires-kill",
      "published": "Sun, 18 Jan 2026 20:16:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of emergency after eight police officers killed in prison gang violence",
      "description": "President announces 30-day order after inmates also took 46 people hostage at three prisons Guatemala’s president has declared a 30-day nationwide state of emergency to combat criminal gangs after authorities accused them of killing eight police officers and holding hostages at three prisons. The killings occurred in the capital, Guatemal City, and surrounding areas a day after gang-affiliated inmates took 46 people hostage in the three prisons across the country to demand incarcerated gang leaders be moved to lower-security facilities. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/guatemala-state-of-emergency-police-officers-killed-prison-gang-violence",
      "published": "Mon, 19 Jan 2026 12:53:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns of a world in chaos as impunity and unpredictability spreads",
      "description": "In his final annual address outlining his priorities, UN Secretary-General António Guterres warned that the world is “brimming with conflict, impunity, inequality and unpredictability” – even as international cooperation is fraying at the moment it is most needed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166772",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "'Most challenging situation’ for transatlantic relations as Trump threatens EU with tariffs",
      "description": "EU member states on Monday are exploring countermeasures in response to US President Donald Trump's tariff threats over Greenland, which he has expressed interest in acquiring despite opposition from Denmark and the EU. “This is not only about trade; it is putting enormous, unexpected stress on the transatlantic relationship,” said Carsten Brzeski, Global Head of Macro for ING Research, adding that it is likely the most challenging situation for transatlantic relations since the end of World War II. \"There are no winners in trade wars\", he said.",
      "url": "https://www.france24.com/en/most-challenging-situation-for-transatlantic-relations-as-trump-threatens-eu-with-tariffs",
      "published": "Mon, 19 Jan 2026 13:04:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "What is the EU’s anti-coercion instrument and how could it be used against the US?",
      "description": "Calls are growing louder for the European Union to deploy its powerful \"anti-coercion instrument\" in response to US President Donald Trump's threats to impose tariffs in the standoff over Greenland. Referred to as a \"bazooka\" or \"nuclear\" option, the instrument is intended to deter economic coercion against any of the EU's 27 member states. FRANCE 24's International Affairs Editor Rochelle Ferguson explains.",
      "url": "https://www.france24.com/en/video/20260119-what-is-the-eu-s-anti-coercion-instrument-and-how-could-it-be-used-against-the-us-1",
      "published": "Mon, 19 Jan 2026 11:51:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Former Iranian prisoners reveal torture horrors as regime kills protesters on sight during crackdown",
      "description": "Three former political prisoners in Iran share harrowing accounts of detention abuse, warning the world about escalating violence during the current uprising.",
      "url": "https://www.foxnews.com/world/former-iranian-prisoners-reveal-torture-horrors-regime-kills-protesters-sight-during-crackdown",
      "published": "Sat, 17 Jan 2026 12:00:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's regime cannot 'hold its power just through terror', activist says",
      "description": "The leader of a group that aims to unite Iranian students amid the violence in the country has spoken to FRANCE 24 about her belief that the Islamic regime cannot hold its power just through terror. Aïda Tavakoli is founder of the group We Are Iranian Students. She spoke to us after Iran's supreme leader for the first time publicly admitted that thousands of his own people have been killed in the huge demonstrations there. She spoke to us in Perspective.",
      "url": "https://www.france24.com/en/tv-shows/perspective/20260119-iran-s-regime-cannot-hold-its-power-just-through-terror-activist-says",
      "published": "Mon, 19 Jan 2026 14:32:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "India still plagued by scourge of 'witch-hunting'",
      "description": "\"Witch-hunting\" remains widespread across India, targeting mostly village women who are often single, widowed or otherwise isolated. Many endure severe psychological torment, social ostracism and abuse including sexual violence. Although several states have enacted laws to curb it, \"witch-hunting\" remains a threat to women. According to the National Crime Records Bureau (NCRB), more than 2,500 women have been killed over \"witchcraft\" since 2000. FRANCE 24's Khansa Juned and Lisa Gamonet report.",
      "url": "https://www.france24.com/en/tv-shows/focus/20260119-india-still-plagued-by-scourge-of-witch-hunting",
      "published": "Mon, 19 Jan 2026 14:07:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of siege after gang violence",
      "description": "Guatemala is in a state of emergency following a weekend of gang-related violence. Gang-affiliated inmates rioted in three prisons. Seven police officers were killed as authorities took action.",
      "url": "https://www.dw.com/en/guatemala-declares-state-of-siege-after-gang-violence/a-75557482?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 05:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Viral protest video against Iran’s supreme leader sparks copycat demonstrations worldwide",
      "description": "Viral video shows Iranian refugee lighting cigarette with burning photo of supreme leader, sparking global defiance movement amid Iran protests.",
      "url": "https://www.foxnews.com/world/viral-protest-video-against-irans-supreme-leader-sparks-copycat-demonstrations-worldwide",
      "published": "Sun, 18 Jan 2026 21:52:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "US strike eliminates al Qaeda operative connected to ISIS ambush that killed 3 Americans in Syria",
      "description": "U.S. forces killed an al Qaeda-affiliated leader allegedly linked to an ISIS attack that killed three Americans in Syria, as CENTCOM launched counterterrorism operations Jan. 16.",
      "url": "https://www.foxnews.com/world/us-strike-eliminates-al-qaeda-operative-connected-isis-ambush-killed-3-americans-syria",
      "published": "Sat, 17 Jan 2026 16:59:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "China’s economy hit growth target last year despite Trump trade war and property crisis",
      "description": "Economy weathered a fraught geopolitical landscape to reach 5% goal but domestic structural challenges ‘not going away’, say experts China’s population falls again as birthrate hits record low Business live – latest updates China has said its economy grew 5% last year, hitting Beijing’s official target as the world’s second-largest economy overcame Donald Trump’s tariff war with a record trade surplus. Data released on Monday by Beijing’s National Bureau of Statistics showed the Chinese economy hit the official target of “around” 5% – the same growth as in 2024 – despite a slowdown to 4.5% in the final three months of the year. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/chinas-economy-hit-growth-goal-last-year-despite-trump-trade-war-and-property-crisis",
      "published": "Mon, 19 Jan 2026 06:26:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Arts24 in Nashville: The unstoppable rise of country music (1/2)",
      "description": "On the occasion of the one-year anniversary of Donald Trump's return to the White House, arts24 travels to the undisputed world capital of country music – Nashville, Tennessee – for a special two-part programme exploring how this quintessentially American genre has become both a global force and a mirror of a deeply divided nation.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260119-arts24-in-nashville-the-unstoppable-rise-of-country-music-1-2",
      "published": "Mon, 19 Jan 2026 13:51:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Spain train crash: What we know about the fatal derailment so far",
      "description": "At least 39 people have been killed and 170 others injured after two high-speed trains derailed in southern Spain on Sunday.",
      "url": "https://news.sky.com/story/what-we-know-so-far-about-the-fatal-train-crash-in-spain-13496110",
      "published": "Mon, 19 Jan 2026 08:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "'Major risk' to global economy from increased tariffs, IMF says",
      "description": "Higher levels of tariffs and increased geopolitical threats are a \"major risk\" to the global economy, the International Monetary Fund (IMF) has said.",
      "url": "https://news.sky.com/story/major-risk-to-global-economy-from-increased-tariffs-imf-says-13496112",
      "published": "Mon, 19 Jan 2026 08:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Blast at a hotel in downtown Kabul leaves multiple casualties, officials say",
      "description": "An explosion at a hotel in downtown Kabul has left several people dead and injured, according to officials",
      "url": "https://abcnews.go.com/International/wireStory/blast-hotel-downtown-kabul-leaves-multiple-casualties-officials-129343424",
      "published": "Mon, 19 Jan 2026 08:25:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russia plots major strike on Europe's largest nuclear plant power lines: source",
      "description": "Ukraine nuclear facilities face Russian attack threats as Moscow weighs strikes on power substations to force capitulation, officials say. Zaporizhzhia is a primary target.",
      "url": "https://www.foxnews.com/world/russia-threaten-ukraine-europe-nuclear-plant-winter-energy-war-escalates",
      "published": "Sun, 18 Jan 2026 19:21:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "World Economic Forum boots Iranian foreign minister from Davos summit amid deadly crackdown on protesters",
      "description": "World Economic Forum withdraws Iranian foreign minister's Davos invitation amid deadly nationwide protests that have killed thousands of civilians.",
      "url": "https://www.foxnews.com/world/world-economic-forum-boots-iranian-foreign-minister-from-davos-summit-amid-deadly-crackdown-protesters",
      "published": "Mon, 19 Jan 2026 09:49:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Pakistan: At least 14 dead in Karachi mall fire",
      "description": "A mall in Pakistan's Karachi was on fire for more than 24 hours. At least 14 people have been killed while over 60 are still missing.",
      "url": "https://www.dw.com/en/pakistan-at-least-14-dead-in-karachi-mall-fire/a-75557903?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 07:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Amid Sudan’s humanitarian crisis, Chad shows ‘act of solidarity’",
      "description": "In war-torn Sudan, local communities say they don’t have enough settlements for the internally displaced, few solutions for women who have suffered sexual violence – and there’s a lack of aid available for people with disabilities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166777",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "WFP warns Sudan food aid could run out in March",
      "description": "The World Food Programme (WFP) said on Thursday that it is struggling to keep emergency operations running in Sudan, where more than 1,000 days of war have pushed families to the brink.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166766",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Yemen faces worst food crisis since 2022, aid group warns",
      "description": "Aid cuts, conflict and economic collapse push millions of Yemenis towards severe hunger in 2026.",
      "url": "https://www.aljazeera.com/news/2026/1/19/yemen-faces-worst-food-crisis-since-2022-aid-group-warns?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 14:12:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares 30-day state of emergency after prison riots",
      "description": "Guatemala has declared a 30-day state of emergency after prison riots led to coordinated gang attacks.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/guatemala-declares-30-day-state-of-emergency-after-prison-riots?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 12:01:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Dozens of dogs killed in fire at home of ‘breeder’ in Washington state, firefighters rescue 3 from flames",
      "description": "Fire officials in Washington state are investigating a deadly blaze that killed about 40 dogs at the home of a man who claimed to be dog breeder.",
      "url": "https://www.foxnews.com/us/dozens-dogs-killed-fire-home-breeder-washington-state-firefighters-rescue-3-from-flames",
      "published": "Sun, 18 Jan 2026 10:18:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Several killed in Kabul blast, Afghanistan’s Interior Ministry says",
      "description": "Explosion occurred in the Shahr-e-Naw neighbourhood, ⁠thought to be one of the most secure areas ‌in Kabul.",
      "url": "https://www.aljazeera.com/news/2026/1/19/several-killed-in-kabul-blast-afghan-taliban-interior-ministry-says?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 12:25:54 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Game-changing international ocean treaty comes into force",
      "description": "Almost two decades in the making, an international agreement to protect and sustainably use marine life in international waters and the international seabed is due to come into force on Saturday, marking a major step forward in efforts to ensure the health of ocean ecosystems for decades to come.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166762",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN urges ‘maximum restraint’ to avert more death, wider escalation",
      "description": "As nationwide protests in Iran appear to ease after nearly three weeks of unrest and bloodshed, a senior UN official called on Thursday for action to prevent further escalation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166773",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran’s supreme leader acknowledges thousands killed as Trump calls for new leadership: reports",
      "description": "Iran's supreme leader Khamenei reportedly acknowledges thousands died in recent protests for the first time, as death toll estimates reach over 3,000.",
      "url": "https://www.foxnews.com/world/irans-supreme-leader-acknowledges-thousands-killed-trump-calls-new-leadership",
      "published": "Sat, 17 Jan 2026 20:28:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At least 39 dead in Spain train collision",
      "description": "At least 39 people were killed in a high-speed train collision in southern Spain Sunday, police said. Efforts to recover the bodies are continuing, and the death toll is likely to rise.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5681943/at-least-39-dead-in-spain-train-collision",
      "published": "Mon, 19 Jan 2026 06:48:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Syrian government announces ceasefire with Kurdish forces",
      "description": "Syrian President Ahmed al-Sharaa on Sunday announced a deal with the chief of Kurdish-led forces that includes a ceasefire, after government troops advanced across Kurdish-held areas of the country's north and east. Syrian Kurdish leader Mazloum Abdi said he agreed to the deal to avoid a broader war.",
      "url": "https://www.france24.com/en/video/20260119-syrian-government-announces-ceasefire-with-kurdish-forces-1",
      "published": "Mon, 19 Jan 2026 11:48:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Spain train crash: PM Sanchez vows to 'find out the truth'",
      "description": "Spain's Prime Minister Pedro Sanchez promised to \"find out the truth\" as he spoke at a news conference near the site of the train crash in southern Spain. At least 39 people have been killed and dozens more injured.",
      "url": "https://www.dw.com/en/spain-train-crash-pm-sanchez-vows-to-find-out-the-truth/live-75556054?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 00:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Spanish train collision death toll could rise as search for bodies continues",
      "description": "Spanish police said on January 19 that at least 39 people are confirmed dead in a high-speed train collision. Authorities said all the survivors had been rescued in the early morning while work remained to recover and identify the dead. #spain #traincrash #spaincrash",
      "url": "https://www.france24.com/en/video/20260119-spanish-train-collision-death-toll-could-rise-as-search-for-bodies-continues",
      "published": "Mon, 19 Jan 2026 11:20:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "1 dead and 6 wounded in Czech town hall shooting",
      "description": "A shooting at a town hall in northern Czech Republic has left one dead and six others wounded, including a police officer",
      "url": "https://abcnews.go.com/International/wireStory/1-dead-4-wounded-czech-town-hall-shooting-129341149",
      "published": "Mon, 19 Jan 2026 08:15:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Death toll in Karachi shopping plaza fire rises to 15 as search continues for missing",
      "description": "The death toll from a massive fire at a shopping plaza in Karachi has risen to 23",
      "url": "https://abcnews.go.com/International/wireStory/death-toll-karachi-shopping-plaza-fire-rises-10-129339842",
      "published": "Mon, 19 Jan 2026 09:13:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Labor’s hate speech laws set to pass as Ley and Albanese cut deal on bill crafted in wake of Bondi terror attack",
      "description": "Liberals MPs agreed late on Monday to back Labor’s revised bill, which came in the wake of the Bondi beach terror attack Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Hate speech laws designed to help combat antisemitism in the wake of the Bondi beach terror attack are set to pass after Sussan Ley agreed to cut a deal with Anthony Albanese. Ahead of a Coalition partyroom meeting to settle a final position, Liberals MPs agreed late on Monday to back Labor’s revised bill after talks between the prime minister and opposition leader. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/labor-coalition-deal-hate-speech-laws-ley-albanese",
      "published": "Mon, 19 Jan 2026 10:40:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Refusing to play by the rules",
      "description": "Trump administration’s abduction of a head of state throws into question the future of international law.",
      "url": "https://www.aljazeera.com/gallery/2026/1/19/refusing-to-play-by-the-rules?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 10:43:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Ukraine works to restore power amid freezing temps after Russian strikes",
      "description": "Ukraine is struggling to deal with repeated Russian attacks on the country's energy grid that left tens of thousands of residents without heat in freezing weather.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5679523/ukraine-works-to-restore-power-amid-freezing-temps-after-russian-strikes",
      "published": "Mon, 19 Jan 2026 04:59:13 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Spanish PM Pedro Sanchez travels to site of deadly train crash",
      "description": "Spanish Prime Minister Pedro Sanchez and Transport Minister Oscar Puente were among those making their way to the crash site on Monday morning. Sanchez cancelled his trip to the World Economic Forum in Davos, Switzerland after the accident. FRANCE 24's Sarah Morris brings you the latest from Madrid.",
      "url": "https://www.france24.com/en/spanish-pm-pedro-sanchez-travels-to-site-of-deadly-train-crash",
      "published": "Mon, 19 Jan 2026 12:31:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Man allegedly assaulted with flagpole by Minneapolis anti-ICE agitators in violent parking garage attack",
      "description": "Jake Lang, a pardoned Jan. 6 rioter, was also allegedly attacked during anti-ICE protests, Saturday, outside Minneapolis City Hall.",
      "url": "https://www.foxnews.com/us/man-allegedly-assaulted-flagpole-minneapolis-anti-ice-agitators-violent-parking-garage-attack",
      "published": "Sat, 17 Jan 2026 22:54:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran state TV hacked to show exiled Crown Prince Pahlavi",
      "description": "Iranian state TV hacked to show exiled Crown Prince Reza Pahlavi urging military to join protesters as death toll reportedly reaches nearly 4,000.",
      "url": "https://www.foxnews.com/world/iran-state-tv-hacked-show-exiled-crown-prince-pahlavi",
      "published": "Mon, 19 Jan 2026 07:46:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "IMF warns of trade tension risk to global growth",
      "description": "Trade tensions and a reversal in the AI boom are among the main risks to global economic growth, the IMF says.",
      "url": "https://www.bbc.com/news/articles/c0r47ey0d1vo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 11:04:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "South African team helps search for politician swept away by Mozambique floodwaters",
      "description": "Mozambique President Daniel Chapo cancels a trip to Davos due to severe floods in the country",
      "url": "https://www.bbc.com/news/articles/c62nen4n971o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 14:22:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "EU weighs response to Trump's tariff threat over Greenland",
      "description": "Europe is split between hitting back at Trump's tariff threat or holding fire to avoid a damaging trade war.",
      "url": "https://www.bbc.com/news/articles/c87r41j4n4jo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 21:05:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Why Germany probably won't get political at 2026 World Cup",
      "description": "After their very public protest at the last World Cup in Qatar, Germany's football team looks unlikely to do the same in the United States in 2026.",
      "url": "https://www.dw.com/en/why-germany-probably-won-t-get-political-at-2026-world-cup/a-75504617?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 15:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump charges $1bn for permanent seat on Gaza ‘Board of Peace’, invites Russia’s Putin",
      "description": "A permanent seat on US President Donald Trump's \"Board of Peace\" aimed at resolving conflicts will cost countries $1 billion each, according to its charter. Invited world leaders include Russian President Vladimir Putin, Hungarian premier Viktor Orban and Canadian Prime Minister Mark Carney.",
      "url": "https://www.france24.com/en/americas/20260119-trump-charges-1bn-for-permanent-seat-on-gaza-board-of-peace-invites-russia-s-putin",
      "published": "Mon, 19 Jan 2026 15:24:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trains collide in southern Spain, killing dozens",
      "description": "Spanish police said Monday that at least 39 people are confirmed dead in a high-speed train collision the previous night in the south of the country. The crash occurred Sunday at 7:45pm when the tail end of a train carrying 289 passengers on the route from Malaga to the capital, Madrid, went off the rails. It slammed into an incoming train traveling from Madrid to Huelva, another southern Spanish city, according to rail operator Adif.",
      "url": "https://www.france24.com/en/trains-collide-in-southern-spain-killing-dozens",
      "published": "Mon, 19 Jan 2026 11:47:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Secretary-General on UN at 80: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "European leaders warn Trump tariffs over Greenland 'risk a dangerous downward spiral'",
      "description": "European leaders unite against Trump's tariff threats over Greenland acquisition, warning of damage to transatlantic relations as tensions escalate.",
      "url": "https://www.foxnews.com/world/european-leaders-warn-trump-tariffs-over-greenland-risk-dangerous-downward-spiral",
      "published": "Sun, 18 Jan 2026 09:46:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Man seriously injured in Sydney's third shark attack in two days",
      "description": "In three separate incidents, a 12-year-old was also injured and an 11-year-old received assistance after his surfboard was bitten.",
      "url": "https://www.bbc.com/news/articles/c8013p5v2yvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 09:38:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Thirteen schoolchildren killed after bus collides with lorry in South Africa",
      "description": "The fatal collision is just the latest in South Africa, where the road safety record is poor.",
      "url": "https://www.bbc.com/news/articles/cvgdmkxl1mko?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 13:13:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Man seriously injured in Sydney's third shark attack in two days",
      "description": "In three separate incidents, a 12-year-old was also injured and an 11-year-old received assistance after his surfboard was bitten.",
      "url": "https://www.bbc.com/news/articles/c8013p5v2yvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 09:38:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "What we know about Spain's worst rail disaster in over a decade",
      "description": "What caused the train to derail remains unclear but officials say an investigation has been launched.",
      "url": "https://www.bbc.com/news/articles/clye22ljxw4o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 15:35:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Man and boy critical after 3 shark attacks off Sydney in just over 24 hours",
      "description": "Three separate shark attacks in Sydney in just over 24 hours have left a man and a boy critically injured, police said",
      "url": "https://abcnews.go.com/International/wireStory/man-boy-critical-after-3-shark-attacks-off-129342696",
      "published": "Mon, 19 Jan 2026 08:09:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "School bus crash in South Africa kills at least 13 children, police say",
      "description": "Authorities in South Africa say a collision between a truck and a school minibus in Gauteng province has killed at least 13 children",
      "url": "https://abcnews.go.com/International/wireStory/school-bus-crash-south-africa-kills-13-children-129341763",
      "published": "Mon, 19 Jan 2026 09:05:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Aid cuts push millions in West and Central Africa deeper into hunger",
      "description": "A staggering 55 million people across West and Central Africa are expected to suffer crisis levels of hunger, or worse, during the lean season from June to August as funding cuts to humanitarian operations continue amid rising violence and displacement.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166776",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar’s Rohingya people called ‘Muslim dogs’ before attacks, ICJ hears",
      "description": "Hearings continued on Thursday at the UN’s top court into the Gambia’s claim that Myanmar committed genocide against the Rohingya people, with allegations that military officials incited violence through hate speech, calling the ethnic minority “Muslim dogs” who should be made “extinct”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166764",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Grieving father says daughter’s death by illegal alien shows cost of sanctuary policies",
      "description": "A year after Katie Abraham was killed by an illegal immigrant, her father Joe faults Gov. JB Pritzker’s weak policies and backs DHS’s Operation Midway Blitz.",
      "url": "https://www.foxnews.com/us/grieving-father-says-daughters-death-illegal-alien-shows-cost-sanctuary-policies",
      "published": "Sun, 18 Jan 2026 17:50:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "‘Long Island Lolita’ survivor Mary Jo Buttafuoco says bullet in her head ‘will get me eventually’",
      "description": "From near-fatal shooting to addiction recovery, Mary Jo Buttafuoco's journey of survival and healing is told in a new biopic, \"I Am Mary Jo Buttafuoco.\"",
      "url": "https://www.foxnews.com/us/long-island-lolita-survivor-mary-jo-buttafuoco-bullet-head-will-get-me-eventually",
      "published": "Sun, 18 Jan 2026 14:00:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Australian boy fighting for life after shark attack, rescued by friends in Sydney Harbor waters",
      "description": "A 12-year-old boy is fighting for his life after a catastrophic shark attack in Sydney Harbor. He was rescued by heroic friends who leaped from a cliff to save him.",
      "url": "https://www.foxnews.com/world/australian-boy-fighting-life-after-shark-attack-rescued-friends-sydney-harbor-waters",
      "published": "Mon, 19 Jan 2026 09:23:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US believes its power matters more than international law, UN chief tells BBC",
      "description": "António Guterres says Washington's \"clear conviction\" is that multilateral solutions are irrelevant.",
      "url": "https://www.bbc.com/news/articles/c4g0zx0llpzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 06:17:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Factory explosion in China kills four, injures 84",
      "description": "The blast caused noticeable tremors in the area and sent large plumes of smoke into the sky.",
      "url": "https://www.bbc.com/news/articles/c5y2pg28lgjo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 11:45:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump's Board of Peace requires nations pay $1 billion for permanent membership",
      "description": "President Trump's Board of Peace is part of his next steps for Gaza. Its charter includes broad international powers for Trump and a $1 billion contribution from nations seeking permanent membership.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5681395/trumps-board-of-peace-requires-nations-pay-1-billion-for-permanent-membership",
      "published": "Mon, 19 Jan 2026 05:00:02 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Why Myanmar election won't change Europe's mind on junta",
      "description": "Seeking international legitimacy, Myanmar's ruling military junta claims elections this week are a return to democracy. But it will take more than the junta's word to convince the EU that the polls are free and fair.",
      "url": "https://www.dw.com/en/why-myanmar-election-won-t-change-europe-s-mind-on-junta/a-75563513?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 14:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "8 fun facts about Dolly Parton for her 80th birthday",
      "description": "Dolly Parton is one of the world's most successful artists. Now 80, she has an eventful life to look back over. Here are some important and extraordinary facts about the country music icon.",
      "url": "https://www.dw.com/en/8-fun-facts-about-dolly-parton-for-her-80th-birthday/a-75503168?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 16:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "California man kills wife, teen daughter in murder-suicide: authorities",
      "description": "Los Angeles County shooting leaves three dead in apparent murder-suicide as 19-year-old daughter escapes gunfire unharmed, sheriff's deputies report.",
      "url": "https://www.foxnews.com/us/california-man-kills-wife-teen-daughter-murder-suicide-authorities",
      "published": "Sun, 18 Jan 2026 14:30:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of killing 16,500 in sweeping ‘genocide’ crackdown: report",
      "description": "Supreme Leader Ayatollah Ali Khamenei acknowledges thousands killed in Iran protests as regime allegedly accelerates executions to more than eight per day.",
      "url": "https://www.foxnews.com/world/iran-accused-killing-16500-sweeping-genocide-crackdown-report",
      "published": "Sun, 18 Jan 2026 22:07:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Rare twins born in DRC raise cautious hope for endangered mountain gorillas",
      "description": "Virunga park ranger says babies are well cared for by mother Mafuko but high infant mortality makes first weeks critical It was noon by the time Jacques Katutu first saw the newborn mountain gorillas. Cradled in the arms of their mother, Mafuko, the tiny twins clung to her body for warmth in the forest clearing in Virunga national park, in eastern Democratic Republic of the Congo (DRC). Katutu, head of gorilla monitoring in Virunga, has seen dozens of newborns in his 15 years as a ranger. But, he tells the Guardian, even he was touched by the sight of the fragile infant males, who face serious obstacles if they are to become silverbacks one day. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/17/twin-baby-mountain-gorilla-virunga-drc-survival-conservation-aoe",
      "published": "Sat, 17 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Davos 2026 updates: Spanish PM cancels trip amid train crash",
      "description": "It's opening day of the World Economic Forum in Davos, Switzerland. Spanish Prime Minister Pedro Sanchez will be a prominent absentee; his office says he won't travel given the huge train crash in Spain. DW has more.",
      "url": "https://www.dw.com/en/davos-2026-updates-spanish-pm-cancels-trip-amid-train-crash/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Who are the Kurds?",
      "description": "The Kurds are widely believed to be the largest stateless ethnic group in the world.",
      "url": "https://www.aljazeera.com/news/2026/1/19/who-are-the-kurds-2?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 15:05:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "In Iran, the US-Israeli addiction to hybrid warfare is on full display",
      "description": "Hybrid war tactics help explain why Trump’s strategy oscillates between threats of war and false offers of peace.",
      "url": "https://www.aljazeera.com/opinions/2026/1/19/in-iran-the-us-israeli-addiction-to-hybrid-warfare-is-on-full-display?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 14:35:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Deadly high-speed train collision in Spain kills dozens",
      "description": "Rescue efforts continue after high-speed train crash in southern Spain kills at least 39 and injures more than 150.",
      "url": "https://www.aljazeera.com/gallery/2026/1/19/deadly-high-speed-train-collision-in-spain-kills-dozens?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 10:10:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'Sentimental Value' sweeps European Film Awards. Next step, Oscars?",
      "description": "Joachim Trier's drama won the top accolades, adding to the buzz ahead of the Oscar awards. Iran was also in the spotlight, with director Jafar Panahi decrying the government's brutal crackdown on protest.",
      "url": "https://www.dw.com/en/sentimental-value-sweeps-european-film-awards-next-step-oscars/a-75553966?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "A look at the EU's 'Anti-Coercion Instrument' amid Greenland dispute with US",
      "description": "Trump on Saturday threatened to impose more tariffs on eight European nations until the US is allowed to buy Greenland, citing US national security concerns. EU governments are drawing up retaliatory measures, including possibly ​hitting the US with 93 billion euros' worth of tariffs or the so far unused \"Anti-Coercion Instrument\", which permits investment ‍restrictions and curbs the export of services such as those provided by US digital giants.",
      "url": "https://www.france24.com/en/a-look-at-the-eu-s-anti-coercion-instrument-amid-greenland-dispute-with-us",
      "published": "Mon, 19 Jan 2026 14:03:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran’s internet briefly restored amid widespread protest crackdown",
      "description": "Limited internet access briefly returned in Iran before dropping again, a monitor said Sunday, 10 days into a communications blackout that rights groups said aimed to mask a protest crackdown that killed thousands. Demonstrations sparked in late December by anger over economic hardship exploded into protests widely seen as the biggest challenge to the Iranian leadership in years.",
      "url": "https://www.france24.com/en/video/20260119-iran-s-internet-briefly-restored-amid-widespread-protest-crackdown",
      "published": "Mon, 19 Jan 2026 13:54:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Sadio Mane leads Senegal to AFCON glory",
      "description": "Senegal ⁠talisman Sadio Mane emerged with more than just the Player of the Tournament award after Sunday’s Africa Cup of Nations final, earning widespread respect for persuading his aggrieved side to complete the match ​against Morocco. It was Mane who convinced teammates to return to the pitch in Rabat ‍after their coach Pape Bouna Thiaw ordered them off in protest at a penalty awarded against them deep in stoppage time.",
      "url": "https://www.france24.com/en/sadio-mane-leads-senegal-to-afcon-glory",
      "published": "Mon, 19 Jan 2026 13:11:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The misunderstanding that may have triggered Trump's latest Greenland threat",
      "description": "Sir Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year.",
      "url": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
      "published": "Sun, 18 Jan 2026 19:26:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "What Trump tariff threat could mean for Europe's economies",
      "description": "\"A trade war is in no one's interest\".",
      "url": "https://news.sky.com/story/greenland-row-what-trump-tariff-threat-could-mean-for-europes-economies-13496195",
      "published": "Mon, 19 Jan 2026 11:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Police in South Africa say a school bus crash has killed at least 12 children",
      "description": "Police in South Africa say a school bus crash has killed at least 12 children",
      "url": "https://abcnews.go.com/International/wireStory/police-south-africa-school-bus-crash-killed-12-129341750",
      "published": "Mon, 19 Jan 2026 07:21:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "A look at some of Europe’s deadliest train accidents in recent years",
      "description": "A high-speed train derailment in southern Spain has left at least 39 people dead and injured more than 150, according to authorities",
      "url": "https://abcnews.go.com/International/wireStory/europes-deadliest-train-accidents-recent-years-129341379",
      "published": "Mon, 19 Jan 2026 06:41:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen: Children are dying and it’s going to get worse, warns aid veteran",
      "description": "In Yemen, renewed political instability and economic woes linked to the war threaten to complicate the already difficult task of helping vulnerable people suffering from deepening hunger, illness and displacement, the UN’s top aid official there said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166786",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Power lines and power struggles: Unpacking Syria’s push towards unification",
      "description": "As government takes control of resource-rich areas, rebuilding trust will be key to achieving a united Syria.",
      "url": "https://www.aljazeera.com/news/2026/1/19/power-lines-and-power-struggles-unpacking-syria-push-towards-unification?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 10:26:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Japan’s prime minister calls snap election as approval ratings ride high",
      "description": "Sanae Takaichi tells senior figures in ruling Liberal Democratic party she plans to dissolve lower house on 23 January Japan’s prime minister, Sanae Takaichi , has called a snap election as she attempts to capitalise on high approval ratings since becoming the country’s first female prime minister three months ago. Takaichi, a conservative who is embroiled in a deepening dispute with China over the security of Taiwan, said on Monday she would dissolve the lower house of the Diet – Japan’s parliament – on 23 January, with an election to follow on 8 February. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/japan-snap-election-sanae-takaichi-ldp",
      "published": "Mon, 19 Jan 2026 09:39:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "China's economy is rising, but many citizens are left behind, analysts say",
      "description": "China's National Bureau of Statistics released data on its 2025 GDP growth Monday. Analysts say it reveals strong economic growth for the country, but ordinary people still face deep challenges.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5679532/chinas-economy-is-rising-but-many-citizens-are-left-behind-analysts-say",
      "published": "Mon, 19 Jan 2026 05:00:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Swiss deadly fire bar owners' lawyers condemn 'vindictiveness'",
      "description": "Lawyers for the Moretti couple say \"lies\" have been circulating about their clients, in their first public statement since the fire.",
      "url": "https://www.bbc.com/news/articles/c5yvl4x3nqeo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 14:53:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Billionaires' wealth hits new peak amid rising poverty, Oxfam says",
      "description": "Billionaire wealth surged at three times ‍its recent pace ​last year to reach its highest level on record, deepening economic and political divides that threaten democratic ⁠stability, anti-poverty group Oxfam said on Monday. In France, 53 billionaires are as wealthy as 48 percent of citizens. Meanwhile, more than 11 million people in the country live in poverty, a record high.",
      "url": "https://www.france24.com/en/billionaires-wealth-hits-new-peak-amid-rising-poverty-oxfam-says",
      "published": "Mon, 19 Jan 2026 13:14:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "What to know about the annual World Economic Forum meeting in Davos",
      "description": "Nearly 3,000 high-level participants from business, government and beyond plus untold numbers of activists, journalists and observers are converging on the Swiss town of Davos for the World Economic Forum’s annual meeting",
      "url": "https://abcnews.go.com/International/wireStory/annual-world-economic-forum-meeting-davos-129341982",
      "published": "Mon, 19 Jan 2026 07:53:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Viral video shows ICE agent telling agitators they're disrupting arrest of child sex offender in Minnesota",
      "description": "Viral video shows alleged interference with ICE operation targeting suspected child sex offender in Minnesota. Federal agents confronted by protesters.",
      "url": "https://www.foxnews.com/us/viral-video-shows-ice-agent-telling-agitators-theyre-disrupting-arrest-child-sex-offender-minnesota",
      "published": "Sun, 18 Jan 2026 22:34:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "ICE says 2 demonstrators were arrested in Minnesota for allegedly assaulting officers",
      "description": "Two protesters allegedly assaulted federal officers during anti-ICE demonstrations in Minnesota, leading to their arrests as clashes between protesters and officers continue.",
      "url": "https://www.foxnews.com/us/ice-says-2-demonstrators-were-arrested-minnesota-allegedly-assaulting-officers",
      "published": "Sun, 18 Jan 2026 21:49:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis posts anti-ICE video promoting 'peaceful protest' and unity",
      "description": "Minneapolis releases anti-ICE video promoting \"peaceful protest\" as tensions escalate. Federal agents face harassment while troops prepare for deployment.",
      "url": "https://www.foxnews.com/us/minneapolis-posts-anti-ice-video-promoting-peaceful-protest-unity",
      "published": "Sun, 18 Jan 2026 11:48:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minnesota National Guard placed on standby to support law enforcement as protests turn violent",
      "description": "Minnesota National Guard members will wear yellow reflective vests to distinguish themselves from other law enforcement if activated during anti-ICE protests.",
      "url": "https://www.foxnews.com/us/minnesota-national-guard-placed-standby-support-law-enforcement-protests-turn-violent",
      "published": "Sat, 17 Jan 2026 18:21:24 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Ecstasy and now a day off - Senegal fans around the world celebrate Afcon win",
      "description": "Senegal supporters have been partying after their team grabbed a dramatic 1-0 win over Morocco.",
      "url": "https://www.bbc.com/news/articles/ce3ekz4yx21o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 11:41:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Incoming NT administrator insulted PM and claimed First Nations people ‘main group’ behind crime",
      "description": "Exclusive: David Connolly says he won’t publicly express political opinions after he was announced for a role similar to that of a state governor Get our breaking news email , free app or daily news podcast The Northern Territory’s incoming administrator levelled a series of insults at Anthony Albanese and claimed First Nations people were “the main group responsible” for crime in the Top End in a 2024 speech, it can be revealed. David Connolly is due to begin his tenure as administrator – King Charles’s representative in the territory, which is the equivalent of a state governor – next month. A former NT Cattlemen’s Association president, Connolly was chosen for the role by the territory’s Country Liberal chief minister, Lia Finocchiaro. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/incoming-nt-administrator-insulted-pm-and-claimed-first-nations-people-main-group-behind",
      "published": "Mon, 19 Jan 2026 14:00:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump attends World Economic Forum amid U.S.-European tensions over Greenland",
      "description": "President Trump is attending the World Economic Forum meeting in Davos this year with fellow world leaders who seek answers on Ukraine and Gaza.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5680097/trump-attends-world-economic-forum-amid-u-s-european-tensions-over-greenland",
      "published": "Mon, 19 Jan 2026 05:00:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Hackers target Iranian state TV as exiled crown prince tells military to 'join the people'",
      "description": "Hackers have disrupted Iranian state TV broadcasts to transmit messages from the country's exiled crown prince, calling on the military to \"join the people\", online video has revealed.",
      "url": "https://news.sky.com/story/hackers-target-iranian-state-tv-as-exiled-crown-prince-tells-military-to-join-the-people-13496091",
      "published": "Mon, 19 Jan 2026 08:02:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Zootropolis 2 becomes Hollywood's highest-grossing animated film of all time",
      "description": "Zootropolis 2 is now Hollywood's highest-grossing animated film of all time, earning $1.7bn (£1.3bn) at the box office globally.",
      "url": "https://news.sky.com/story/zootropolis-2-becomes-hollywoods-highest-grossing-animated-film-of-all-time-13496204",
      "published": "Mon, 19 Jan 2026 12:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Surgeon ex in Ohio dentist murders job hopped across country, dodged lawsuits after divorce",
      "description": "Ohio doctor faces murder charges in alleged killing of divorced wife and her husband. McKee worked across states before Columbus arrest in shocking case.",
      "url": "https://www.foxnews.com/us/surgeon-ex-ohio-dentist-murders-job-hopped-across-country-dodged-lawsuits-after-divorce",
      "published": "Sun, 18 Jan 2026 10:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Six countries confirm US invitations to Gaza peace board",
      "description": "Trump invites multiple countries, including Jordan, Greece and India, to join his \"Board of Peace\" for Gaza reconstruction and governance oversight.",
      "url": "https://www.foxnews.com/world/six-countries-confirm-us-invitations-gaza-peace-board",
      "published": "Sun, 18 Jan 2026 14:21:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Economic Forum invites Iranian foreign minister to Davos after regime slaughter of Iranian civilians",
      "description": "World Economic Forum is facing calls to exclude Iranian officials from Davos after the regime slaughtered thousands of its civilians, rights groups say.",
      "url": "https://www.foxnews.com/world/world-economic-forum-invites-iranian-foreign-minister-davos-after-regime-slaughter-iranian-civilians",
      "published": "Sun, 18 Jan 2026 12:04:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Protests explode in Greenland amid Trump takeover push: 'We are not interested in being Americans'",
      "description": "Thousands marched in Greenland wearing \"Make America Go Away\" hats, rejecting Trump's purchase demands and tariff threats saying, \"We are not interested in being Americans.\"",
      "url": "https://www.foxnews.com/world/protests-explode-greenland-amid-trump-takeover-push-we-not-interested-being-americans",
      "published": "Sat, 17 Jan 2026 18:16:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Lindsey Graham speaks against pending execution of 26-year-old Iranian protester: 'This regime must fall'",
      "description": "Sen. Lindsey Graham calls for Iranian regime change as 26-year-old protester Erfan Soltani faces possible execution despite President Donald Trump's threats.",
      "url": "https://www.foxnews.com/world/lindsey-graham-speaks-against-pending-execution-26-year-old-iranian-protester-this-regime-must-fall",
      "published": "Sat, 17 Jan 2026 13:39:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump links Greenland dispute to not getting Nobel Peace Prize",
      "description": "The US president says he no longer feels obliged to think only of peace, after not being awarded the annual prize.",
      "url": "https://www.bbc.com/news/articles/cy7mev35x2lo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 13:54:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump asks Putin to join Gaza ‘board of peace’ even as Ukraine war rages",
      "description": "The Kremlin says it is seeking to \"clarify all the nuances\" of the offer from Washington.",
      "url": "https://www.aljazeera.com/news/2026/1/19/trump-asks-putin-to-join-gaza-board-of-peace-even-as-ukraine-war-rages?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 13:38:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump tells Norway PM not bound to ‘think purely of peace’ after Nobel snub",
      "description": "Barbed message to Oslo follows Trump’s bitterness over missing out on the Nobel Peace Prize he coveted.",
      "url": "https://www.aljazeera.com/news/2026/1/19/trump-tells-norway-pm-not-bound-to-think-purely-of-peace-after-nobel-snub?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 11:55:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "How Russia is weaponising the freezing weather in Ukraine",
      "description": "Freezing temperatures and Russian attacks on Ukraine’s energy grid have left much of Kyiv without reliable heat.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/how-russia-is-weaponising-the-freezing-weather-in-ukraine?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 11:54:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brazil’s Bolsonaro finds novel way to reduce 27-year sentence: reading books",
      "description": "Former president convicted for coup plot to take advantage of law that knocks four days off jail term for each book read Jair Bolsonaro’s lawyers appear to have been reading up on the country’s penal code and have found a way to help their client reduce the 27-year prison sentence he received last year for plotting a coup: by reading books. There is only one problem: the former far-right Brazilian president has never been known as a bibliophile. “Sorry, I don’t have time to read,” Bolsonaro once declared. “It’s been three years since I read a book.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/brazil-jair-bolsonaro-reduce-sentence-reading-books",
      "published": "Fri, 16 Jan 2026 13:19:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Man in critical condition after third Sydney shark attack in two days",
      "description": "NSW Ambulance treat man at Manly beach in Sydney’s north after attack by shark on Monday evening Get our breaking news email , free app or daily news podcast A man believed to be in his 20s is in a critical condition after being bitten by a shark in the third attack at Sydney beaches in two days. He was taken to Royal North Shore hospital on Monday evening after New South Wales Ambulance officers treated the man at Manly beach in Sydney’s north following the attack. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/man-in-critical-condition-after-third-sydney-shark-attack-in-two-days",
      "published": "Mon, 19 Jan 2026 08:46:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Woman found dead on popular Australian tourist island K’gari",
      "description": "Queensland police appeal for witnesses after 19-year-old, a Canadian citizen, found on beach north of the Maheno shipwreck Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A 19-year-old Canadian woman found dead on the beach on a popular tourist island off the Queensland coast on Monday morning was discovered surrounded by a pack of dingoes. But despite confirming her body had been “touched and interfered with” by the wild canids on K’gari (formerly known as Fraser Island), police say they will await a postmortem before speculating as to the cause of her death. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/woman-found-dead-australian-island-kgari-dingoes-ntwnfb",
      "published": "Mon, 19 Jan 2026 08:43:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump writes Norway's PM, ties Greenland to peace prize snub",
      "description": "The US president wrote to complain about not getting a Nobel Peace Prize, a decision that doesn't rest with Norway's PM. He said he would devote more thought to US interests, after having \"stopped 8 Wars PLUS\" [sic].",
      "url": "https://www.dw.com/en/trump-writes-norway-s-pm-ties-greenland-to-peace-prize-snub/a-75562817?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 14:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "WEF: Donald Trump set to dominate Davos 2026",
      "description": "Weeks after attacking Venezuela, capturing its controversial leader, and reviving Greenland ambitions, the US president's presence in Davos is expected to raise the stakes at the WEF's annual meeting.",
      "url": "https://www.dw.com/en/wef-donald-trump-set-to-dominate-davos-2026/a-75509182?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 05:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria announces new ceasefire deal with Kurdish-led SDF",
      "description": "The deal follows advances by the Syrian military into northern and eastern areas previously under the control of Syrian Democratic Forces, or SDF. DW has the latest.",
      "url": "https://www.dw.com/en/syria-announces-new-ceasefire-deal-with-kurdish-led-sdf/live-75553804?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 17:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Florida triple murder of 3 tourists was 'senseless,' 'random,' sheriff says",
      "description": "Florida man accused of randomly shooting three stranded tourists at Kissimmee rental home. Ahmad Bojeh arrested and charged with premeditated murder.",
      "url": "https://www.foxnews.com/us/florida-triple-murder-3-tourists-senseless-random-sheriff-says",
      "published": "Mon, 19 Jan 2026 07:56:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Democratic Socialists of America in NYC training thousands of activists to counter ICE: report",
      "description": "NYC's Democratic Socialists of America chapter reportedly plans to train 4,000 volunteers for \"rapid response\" against anticipated federal immigration enforcement operations.",
      "url": "https://www.foxnews.com/us/democratic-socialists-america-nyc-training-thousands-activists-counter-ice-report",
      "published": "Sun, 18 Jan 2026 13:14:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Professors were disciplined for vulgar posts after Charlie Kirk's assassination: Where are they now?",
      "description": "Professors fired for controversial posts about Charlie Kirk's assassination have been reinstated at their universities as the spring semester begins.",
      "url": "https://www.foxnews.com/us/professors-disciplined-vulgar-posts-after-charlie-kirk-assassination-where-are-they-now",
      "published": "Sun, 18 Jan 2026 08:00:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian regime elites allegedly move millions of dollars out of country amid sanctions",
      "description": "Treasury sanctions target Iran's shadow banking as Mojtaba Khamenei allegedly transferred $328 million overseas according to Treasury Department reports.",
      "url": "https://www.foxnews.com/world/iranian-regime-elites-allegedly-move-tens-millions-dollars-out-country-amid-sanctions",
      "published": "Sun, 18 Jan 2026 20:29:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian drone strikes leave hundreds of thousands without power across Russian-controlled area",
      "description": "Ukrainian drone strikes against Russian energy infrastructure left over 200,000 without power as both sides continue targeting electrical grids.",
      "url": "https://www.foxnews.com/world/ukrainian-drone-strikes-leave-hundreds-thousands-without-power-across-russian-controlled-area",
      "published": "Sun, 18 Jan 2026 14:07:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Argentina's bungled hunt for Hitler's right-hand man Martin Bormann revealed in declassified files",
      "description": "Files show Argentina's bungled hunt for Hitler's henchman Martin Bormann, marked by mistaken arrests and bureaucratic incompetence in the post-war era.",
      "url": "https://www.foxnews.com/world/argentinas-bungled-hunt-hitlers-right-hand-man-martin-bormann-revealed-declassified-files",
      "published": "Sun, 18 Jan 2026 06:00:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump escalates tensions across Europe with new threats about Greenland acquisition",
      "description": "President Trump said the U.S. will impose tariffs on eight European countries until the U.S. acquires Greenland. The announcement came as a congressional delegation visited Denmark to ease tensions.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5680873/trump-escalates-tensions-across-europe-with-new-threats-about-greenland-acquisition",
      "published": "Mon, 19 Jan 2026 05:00:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Former diplomat on Trump's tariff threats against NATO allies over Greenland issue",
      "description": "NPR's Steve Inskeep asks Kurt Volker, a former U.S. ambassador to NATO, about what critics perceive as the Trump administration's threat to the transatlantic alliance.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5681384/former-diplomat-on-trumps-tariff-threats-against-nato-allies-over-greenland-issue",
      "published": "Mon, 19 Jan 2026 05:00:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump admin preparing 1,500 soldiers for potential Minnesota deployment",
      "description": "The Trump administration is reportedly preparing 1,500 troops for potential deployment in Minnesota amid anti-ICE protests in the Twin Cities.",
      "url": "https://www.foxnews.com/us/trump-admin-preparing-1500-soldiers-potential-minnesota-deployment-report",
      "published": "Sun, 18 Jan 2026 07:35:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "High-speed train crash in Spain kills at least 39",
      "description": "More than 400 passengers were on board the trains that derailed near the city of Córdoba, in Spain's worst rail crash in more than a decade.",
      "url": "https://www.bbc.com/news/articles/cedw6ylpynyo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 08:20:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration says deporting college student trying to surprise family was a ‘mistake’",
      "description": "Any Lucía López Belloza was detained at Boston’s airport in November and flown to Honduras two days later US citizens and permanent residents: have you been racially profiled by ICE? The Trump administration apologized in court for a “mistake” in the deportation of a Massachusetts college student who was detained trying to fly home to surprise her family in Texas for Thanksgiving. But the administration still argued that the federal government error should not affect her immigration case. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/16/trump-administration-mistake-college-student-detained",
      "published": "Fri, 16 Jan 2026 20:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "CIA chief visits Maduro successor as Machado vows to become Venezuela’s president",
      "description": "John Ratcliffe meets Delcy Rodríguez in Caracas less than two weeks after his agents helped to oust her precedessor The CIA chief whose agents reputedly played a key role in abducting Nicolás Maduro has flown to Venezuela to meet his successor as the sidelined opposition leader, María Corina Machado, vowed she would become the country’s first elected female president. Machado’s comments were broadcast on Friday, a day after she handed her Nobel peace prize medal to Donald Trump in recognition of what she called a principled and decisive move against Maduro, whom US special forces snatched on 3 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/cia-chief-visits-maduro-successor-as-machado-vows-to-become-venezuelas-president",
      "published": "Fri, 16 Jan 2026 17:23:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "China expected to get London embassy go-ahead this week after years of wrangling",
      "description": "Decision expected on Monday or Tuesday, potentially smoothing relations before Keir Starmer’s visit to China Why Chinese ‘mega embassy’ is not such a worry for British spies A decision on China’s proposed mega embassy in London is expected on Monday or Tuesday, with Chinese officials and British diplomats in Beijing holding their breath in anticipation of the planning application finally being approved. The saga, which has been running since 2018, is widely expected to end with the British government giving the green light for construction. If it does, one group likely to be grateful is those who work in the British embassy’s dilapidated building in Beijing. The UK’s plans to redevelop its outpost in China’s capital have been blocked for years by the Chinese government because of the London embassy row. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/19/china-expected-to-get-london-embassy-go-ahead-uk",
      "published": "Mon, 19 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says he's pursuing Greenland after perceived Nobel Peace Prize snub",
      "description": "\"Considering your Country decided not to give me the Nobel Peace Prize… I no longer feel an obligation to think purely of Peace,\" Trump wrote in a message to the Norwegian Prime Minister.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5682038/trump-greenland-nobel-peace-prize",
      "published": "Mon, 19 Jan 2026 10:27:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. lawmakers wrap reassurance tour in Denmark as tensions around Greenland grow",
      "description": "A bipartisan congressional delegation traveled to Denmark to try to deescalate rising tensions. Just as they were finishing, President Trump announced new tariffs on the country until it agrees to his plan of acquiring Greenland.",
      "url": "https://www.npr.org/2026/01/19/g-s1-106427/congress-bipartisan-denmark-greenland",
      "published": "Mon, 19 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Germany news: Syrian president puts planned visit on hold",
      "description": "President Ahmad al-Sharaa has postponed his visit to Berlin, for talks with Chancellor Friedrich Merz, due to the political situation in his country. The repatriation of Syrian refugees was high on the agenda.",
      "url": "https://www.dw.com/en/germany-news-syrian-president-puts-planned-visit-on-hold/live-75545809?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 19:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Texas couple labeled fake ‘Chip and Joanna Gaines’ admits $5M dream home renovation scam",
      "description": "Texas couple allegedly defrauded over 40 homeowners of nearly $5M through fake construction business promoted on social media. The Judges face federal charges.",
      "url": "https://www.foxnews.com/us/texas-couple-labeled-fake-chip-joanna-gaines-admits-5m-dream-home-renovation-scam",
      "published": "Sun, 18 Jan 2026 16:00:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Watch: Spain train crash survivors describe 'absolutely terrifying' scene",
      "description": "Passengers recount the moment two trains collided between Málaga and Madrid on Sunday evening.",
      "url": "https://www.bbc.com/news/videos/c23r1rx5vp7o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 11:59:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Europe won't be blackmailed,' Danish PM says in wake of Trump Greenland threats",
      "description": "Trump says he will impose new taxes on eight US allies in February if they oppose his proposed takeover of the autonomous Danish territory.",
      "url": "https://www.bbc.com/news/articles/ceqz0llpnyqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 07:15:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Keir Starmer says Trump’s tariffs over Greenland are ‘completely wrong’",
      "description": "Keir Starmer said Donald Trump’s threats to impose tariffs on allies over Greenland are ‘completely wrong’.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/keir-starmer-says-trumps-tariffs-over-greenland-are-completely?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 13:44:56 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Video: Questions in Gaza over phase 2 of ceasefire",
      "description": "Palestinians are questioning Israel's commitment to the second phase of the US-backed ceasefire deal for Gaza.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/video-questions-in-gaza-over-phase-2-of-ceasefire?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 11:30:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Activist arrested over protesting US actions in Venezuela",
      "description": "Activist arrested over protesting US actions in Venezuela",
      "url": "https://www.aljazeera.com/video/unmute/2026/1/19/activist-arrested-over-protesting-us-actions-in-venezuela?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 10:50:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany updates: Berlin brings back EV subsidies",
      "description": "The German government has reintroduced subsidies for electric vehicles, but the move is under fire for including hybrids. Meanwhile, the IMF is predicting stronger economic growth in 2026. Follow DW.",
      "url": "https://www.dw.com/en/germany-updates-berlin-brings-back-ev-subsidies/live-75560659?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland: Europe to counter Trump 'blackmail', Berlin says",
      "description": "Germany has vowed a \"united\" response from Europe after Donald Trump threatened tariffs on nations that oppose him over Greenland. NATO's Mark Rutte is set for talks with Danish and Greenland officials. Follow DW.",
      "url": "https://www.dw.com/en/greenland-europe-to-counter-trump-blackmail-berlin-says/live-75558976?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 09:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "French investigators expose failings in Dominique Pelicot mass rape case",
      "description": "France's General Inspectorate of Justice has exposed failings in an investigation into Dominique Pelicot, accusing authorities of not acting on DNA evidence against him for a dozen years. Pelicot's DNA was taken by police after he was first apprehended in 2010 in a suburban Paris shopping centre while filming up women's skirts .",
      "url": "https://www.france24.com/en/france/20260119-french-investigators-expose-failings-in-dominique-pelicot-mass-rape-case",
      "published": "Mon, 19 Jan 2026 14:54:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Louvre closes for third time in a month due to staff strike",
      "description": "A staff strike at the Louvre in Paris on Monday led to its closure for the third time in a month as trade unions pressed for more recruitment, higher pay and better maintenance of the museum. The prior closures in December and earlier in January resulted in a loss of \"at least one million euros\" in revenue, Louvre management said.",
      "url": "https://www.france24.com/en/france/20260119-louvre-closes-for-the-day-due-to-staff-strike",
      "published": "Mon, 19 Jan 2026 13:21:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about the train crash in Spain",
      "description": "A high-speed train in southern Spain derailed Sunday evening, colliding with another train and killing at least 39 people",
      "url": "https://abcnews.go.com/International/wireStory/train-crash-spain-129342990",
      "published": "Mon, 19 Jan 2026 09:29:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Families in ‘survival mode’ amid Russian strikes and deadly cold",
      "description": "Families across Ukraine are in “constant survival mode” amid ongoing waves of Russian missile and drone strikes that have left blocks without power for days at a time, while temperatures plunge to deadly lows, the UN Children's Fund (UNICEF) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166774",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anti-ICE mob storms Minnesota church over pastor's alleged ties to immigration enforcement",
      "description": "Anti-ICE agitators disrupted worship at Cities Church in St. Paul, chanting inside the sanctuary after claiming one of the pastors was affiliated with ICE.",
      "url": "https://www.foxnews.com/us/anti-ice-mob-storms-minnesota-church-over-pastors-alleged-ties-immigration-enforcement",
      "published": "Sun, 18 Jan 2026 19:47:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Foreign influence & Somalia’s fight for unity",
      "description": "On Centre Stage, Al Jazeera’s Mohamed Hassan speaks with Ali Omar, Somalia’s minister of state for foreign affairs.",
      "url": "https://www.aljazeera.com/video/centre-stage/2026/1/19/foreign-influence-somalias-fight-for-unity?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 11:36:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "The 2026 Olympics are the most widespread in history. See what's happening where",
      "description": "Competitions will be hosted at 25 venues spanning an area of more than 8,000 square miles. Here's what's happening at each of the four main clusters.",
      "url": "https://www.npr.org/2026/01/19/nx-s1-5621791/winter-olympics-venues-milan-cortina",
      "published": "Mon, 19 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Hackers target Iran state TV satellite transmission to broadcast exiled crown prince",
      "description": "Hackers have disrupted Iranian state television to air footage supporting the exiled crown prince",
      "url": "https://abcnews.go.com/International/wireStory/hackers-target-iran-state-tvs-satellite-transmission-broadcast-129340123",
      "published": "Mon, 19 Jan 2026 04:41:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US troops pull out of major Iraq airbase amid ongoing regional consolidation effort, progress against ISIS",
      "description": "The U.S. withdrawal of troops from Ain al-Asad Airbase was completed by Friday as part of regional consolidation following progress on ISIS as CENTCOM calls for \"teamwork.\"",
      "url": "https://www.foxnews.com/world/us-troops-pull-out-major-iraq-airbase-amid-ongoing-regional-consolidation-effort-progress-against-isis",
      "published": "Sat, 17 Jan 2026 15:54:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "China’s population falls again as birthrate drops 17% to record low",
      "description": "Fourth year of decline deepens concerns over ageing, shrinking workforce and long-term economic impact China’s population fell for a fourth consecutive year in 2025 as the birthrate plunged to another record low despite the introduction of polices aimed at encouraging people to have children. Registered births dropped to 7.92 million in 2025 – or 5.63 for every 1,000 members of the population – down 17% from 9.54 million in 2024, and the lowest since records began in 1949. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/china-population-falls-again-birthrate-record-low",
      "published": "Mon, 19 Jan 2026 12:12:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2026-01-19T15:52:20.600774Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Germany-US rift is looming after a year of Trump",
      "description": "The second term of US President Donald Trump has brought unprecedented strain on once-solid German-American relations. The issue of Greenland could be a tipping point. DW looks back on a year of trans-Atlantic tensions.",
      "url": "https://www.dw.com/en/germany-us-rift-is-looming-after-a-year-of-trump/a-75562705?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 12:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Gaza board extended membership to cost $1 billion — reports",
      "description": "According to media reports, the Gaza \"Board of Peace\" draft charter requires members to contribute $1 billion in cash to extend their membership.",
      "url": "https://www.dw.com/en/gaza-board-extended-membership-to-cost-1-billion-reports/a-75553537?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 23:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Unleashing Europe's most powerful trade weapon on the US was unthinkable - not anymore",
      "description": "The mood in Brussels is a mixture of determination and deep concern.",
      "url": "https://news.sky.com/story/greenland-crisis-unleashing-europes-most-powerful-trade-weapon-on-the-us-was-previously-unthinkable-not-anymore-13495977",
      "published": "Sun, 18 Jan 2026 19:24:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Norwegian leader says he received Trump message that reportedly ties Greenland to Nobel Peace Prize",
      "description": "Norway’s prime minister says that he has received a message from U.S. President Donald Trump about rising tensions over Greenland",
      "url": "https://abcnews.go.com/International/wireStory/starmer-trade-war-interest-after-trumps-greenland-tariff-129340783",
      "published": "Mon, 19 Jan 2026 09:29:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "China reports its economy expanded at a 5% annual pace in 2025, buoyed by strong exports despite Trump's tariffs",
      "description": "China reports its economy expanded at a 5% annual pace in 2025, buoyed by strong exports despite Trump's tariffs",
      "url": "https://abcnews.go.com/International/wireStory/china-reports-economy-expanded-5-annual-pace-2025-129337938",
      "published": "Sun, 18 Jan 2026 22:09:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting leader was once a DEA 'priority target': report",
      "description": "Venezuela's interim president Delcy Rodríguez was reportedly labeled a DEA \"priority target\" in 2022, appearing in intelligence files since at least 2018.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-leader-once-dea-priority-target-report",
      "published": "Sun, 18 Jan 2026 11:33:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Israel launches ‘large-scale’ military raid in occupied West Bank’s Hebron",
      "description": "Army deploys armoured vehicles and imposes curfew in the city, shutting down neighbourhoods.",
      "url": "https://www.aljazeera.com/news/2026/1/19/israel-launches-large-scale-military-raid-in-occupied-west-banks-hebron?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 12:07:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Inequality and unease are rising as elite Davos event opens with Trump set to attend",
      "description": "The Swiss town of Davos hosts the annual meeting of elites from business, government and culture this week",
      "url": "https://abcnews.go.com/International/wireStory/inequality-unease-rising-elite-davos-event-opens-pro-129340318",
      "published": "Mon, 19 Jan 2026 06:49:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Ghana arrests Nigerians accused of running cyber-crime networks",
      "description": "There is a growing trend of foreigners being lured to Ghana under the pretext of lucrative work.",
      "url": "https://www.bbc.com/news/articles/cr4k35q6yr0o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 15:15:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan PM Takaichi calls snap election three months after taking office",
      "description": "Sanae Takaichi, who took office last October, hopes the vote will give her a stronger mandate.",
      "url": "https://www.bbc.com/news/articles/c1dk0x0v6pdo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 12:00:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's birth rate hits record low as population continues to shrink",
      "description": "Beijing has been trying hard to encourage more young people to marry and have children.",
      "url": "https://www.bbc.com/news/articles/c79r7v7qr53o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 07:12:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Shameful' and 'terrible look' - the chaos that marred Senegal's Afcon triumph",
      "description": "Senegal beat Morocco to win the Africa Cup of Nations after the final is overshadowed when they temporarily refuse to play.",
      "url": "https://www.bbc.com/sport/football/articles/c70ljednyl6o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 10:46:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Inter Milan vs Arsenal: UEFA Champions League – team news, start, lineups",
      "description": "Leaders Arsenal itching to get back to winning ways against Inter in league phase of UEFA Champions League on Tuesday.",
      "url": "https://www.aljazeera.com/sports/2026/1/19/inter-milan-vs-arsenal-uefa-champions-league-team-news-start-lineups?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 13:04:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The UK is now willing to undermine British institutions to protect Israel",
      "description": "British football fans are regularly banned without scandal. Why is it that Israeli fans cannot be?",
      "url": "https://www.aljazeera.com/opinions/2026/1/19/the-uk-is-now-willing-to-undermine-british-institutions-to-protect-israel?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 12:12:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What happened in controversial AFCON final?",
      "description": "Senegal’s win in the 2026 AFCON final will be remembered for their walk off pitch after a controversial penalty decision",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/what-happened-in-controversial-afcon-final?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 11:43:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India is profiling Kashmir mosques, raising new surveillance fears",
      "description": "Residents say police exercise feels less like routine survey and more like an attempt to control religious institutions.",
      "url": "https://www.aljazeera.com/news/2026/1/19/india-is-profiling-kashmir-mosques-raising-new-surveillance-fears?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 11:33:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Debt collector hired to chase unpaid taxes for the ATO pays zero corporate tax itself",
      "description": "Neither Recoveriescorp nor its parent entity has paid the tax since securing multi-million dollar government contracts Get our breaking news email , free app or daily news podcast A private debt collector has paid zero corporate tax since securing contracts worth tens of millions of dollars from the Australian Taxation Office to pursue arrears payments, including from welfare recipients. The parent entity of the outsource operator, Recoveriescorp, has recorded large income streams in its two most recent annual accounts, according to Guardian Australia analysis, with revenue surpassing $100m during 2025. Do you know more? Email jonathan.barrett@theguardian.com Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/debt-collector-hired-by-ato-pays-zero-corporate-tax",
      "published": "Mon, 19 Jan 2026 14:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-19T04:32:27.458Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The key elections in Africa in 2026",
      "description": "Benin's parliamentary elections and Uganda's general elections, both held in January, marked the beginning of a busy and decisive year at ballot boxes across the African continent.",
      "url": "https://www.dw.com/en/the-key-elections-in-africa-in-2026/a-75558971?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 14:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Human cost of wildlife conservation in Tanzania",
      "description": "Trophy hunting interests are turning the screw on northern Tanzania's Maasai communities and wildlife paradise. Meanwhile, well-funded conservation efforts are attracting scrutiny amid rising Maasai eviction cases.",
      "url": "https://www.dw.com/en/human-cost-of-wildlife-conservation-in-tanzania/a-75447264?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 10:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China: Population sinks for fourth year in a row",
      "description": "Financial incentives for future parents have failed to have the desired effect. At the current rate, China's population could drop as low as 800 million by the year 2100, according to the United Nations.",
      "url": "https://www.dw.com/en/china-population-sinks-for-fourth-year-in-a-row/a-75558927?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 08:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON: Senegal snatches football cup from hosts Morocco",
      "description": "Senegal's Pape Gueye scored the decisive point in the fourth minute of extra time, after a goalless game that was briefly interrupted with a Senegal walk-off.",
      "url": "https://www.dw.com/en/afcon-senegal-snatches-football-cup-from-hosts-morocco/a-75555184?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 22:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland: UK Prime Minister criticises US tariffs in rare change of tone",
      "description": "Following Donald Trump's decision to impose tariffs on eight European countries until the US purchase of Greenland, British Prime Minister Keir Starmer criticised the move in a rare change of tone with the US President. #uk #trump #greenland",
      "url": "https://www.france24.com/en/video/20260119-greenland-uk-prime-minister-criticises-us-tariffs-as-eu-mulls-over-response",
      "published": "Mon, 19 Jan 2026 15:17:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's Greenland ambitions lack domestic support, polls show",
      "description": "Despite US President Donald Trump’s insistence on acquiring Greenland, public support for the idea remains low. A Reuters/Ipsos poll of US residents this week showed that fewer than one in five respondents back acquiring Greenland, while a separate CBS poll found that just 14 percent would approve the use of military force to take the island. Instead, many Americans say they want the president to focus on domestic economic pressures, particularly the cost of living. A CNN poll last week found that 58 percent of Americans believe Trump’s first year back in the White House has been a failure, especially on the economy.",
      "url": "https://www.france24.com/en/trump-s-greenland-ambitions-lack-domestic-support-polls-show",
      "published": "Mon, 19 Jan 2026 14:59:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French PM Lecornu inches closer to passing budget bill without vote",
      "description": "France’s government is set to meet Monday to discuss a highly controversial budget bill that has left Prime Minister Sebastian Lecornu and political parties at an impasse. Lecornu is moving closer to pushing the bill through parliament without a vote, while simultaneously seeking a way to avoid being toppled by parliament over the measure. FRANCE 24's Marc Perelman explains.",
      "url": "https://www.france24.com/en/french-pm-lecornu-inches-closer-to-passing-budget-bill-without-vote",
      "published": "Mon, 19 Jan 2026 13:08:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "FIFA chief Infantino condemns 'unacceptable scenes' during AFCON final",
      "description": "FIFA president Gianni Infantino condemned “unacceptable scenes” during the AFCON final on Monday, calling out certain players and some of the Senegalese staff who left the field for several minutes in the middle of the match. Senegal won the match against Morocco 1-0 after extra time.",
      "url": "https://www.france24.com/en/sport/20260119-fifa-chief-infantino-condemns-unacceptable-scenes-during-afcon-final",
      "published": "Mon, 19 Jan 2026 11:17:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's extraordinary letter to Norway about Greenland - in full and fact-checked",
      "description": "The letter from President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary.",
      "url": "https://news.sky.com/story/trumps-extraordinary-letter-to-norway-about-greenland-in-full-and-fact-checked-13496272",
      "published": "Mon, 19 Jan 2026 15:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Putin invited to join 'Peace Council' for Gaza, Kremlin says",
      "description": "Vladimir Putin has received an invitation to join a US-led \"Peace Council\" for Gaza, the Kremlin has said.",
      "url": "https://news.sky.com/story/putin-invited-to-join-peace-council-for-gaza-kremlin-says-13494883",
      "published": "Fri, 16 Jan 2026 10:02:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What is mysterious iron 'bar' in space?",
      "description": "Astronomers have spotted a mysterious cloud in the shape of a bar 2,600 light-years from Earth.",
      "url": "https://news.sky.com/story/ring-nebula-what-is-mysterious-iron-bar-in-space-13496185",
      "published": "Mon, 19 Jan 2026 11:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What to know about Syria's main Kurdish-led force and its deal with Damascus",
      "description": "The Kurdish-led Syrian Democratic Forces are set to merge into the Syrian army after suffering major setbacks",
      "url": "https://abcnews.go.com/International/wireStory/syrias-main-kurdish-led-force-deal-damascus-after-129347117",
      "published": "Mon, 19 Jan 2026 09:39:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Five face trial in Peru in rare prosecution over the killing of an Amazon defender",
      "description": "Five men are set to stand trial in Peru over the 2023 killing of an Indigenous Amazon defender",
      "url": "https://abcnews.go.com/International/wireStory/face-trial-peru-rare-prosecution-killing-amazon-defender-129346450",
      "published": "Mon, 19 Jan 2026 09:29:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Catholic cardinals urge Trump administration to embrace a moral compass in foreign policy",
      "description": "Three U.S. Catholic cardinals have urged the Trump administration to use a moral compass in foreign policy",
      "url": "https://abcnews.go.com/International/wireStory/us-catholic-cardinals-urge-trump-administration-embrace-moral-129346423",
      "published": "Mon, 19 Jan 2026 09:29:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU executive arm, Russia and Thailand asked to join Trump's Board of Peace for Gaza",
      "description": "The EU's executive arm, Russia and Thailand say they've been asked to join U.S. President Donald Trump’s new Board of Peace that will supervise the next phase of the Gaza peace plan",
      "url": "https://abcnews.go.com/International/wireStory/eu-executive-arm-russia-thailand-asked-join-trumps-129344329",
      "published": "Mon, 19 Jan 2026 08:57:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian court sentences American to 5 years on charges of illegally transporting arms",
      "description": "A Russian court has convicted and sentenced an American on charges of illegally transporting weapons",
      "url": "https://abcnews.go.com/International/wireStory/russian-court-sentences-american-5-years-charges-illegally-129342012",
      "published": "Mon, 19 Jan 2026 08:01:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Philippine president announces new gas find in waters facing disputed South China Sea",
      "description": "Philippine President Ferdinand Marcos Jr. has announced the discovery of a new natural gas deposit near the disputed South China Sea",
      "url": "https://abcnews.go.com/International/wireStory/philippine-president-announces-new-gas-find-waters-facing-129340792",
      "published": "Mon, 19 Jan 2026 08:01:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's population falls again as births drop 17% a decade after policy ended",
      "description": "China's population continues to shrink",
      "url": "https://abcnews.go.com/International/wireStory/chinas-population-falls-births-drop-17-decade-after-129340027",
      "published": "Mon, 19 Jan 2026 07:13:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portland DA cracks down on drug crimes as Seattle pulls back on enforcement",
      "description": "Portland DA announces drug prosecution crackdown for those refusing treatment, contrasting sharply with Seattle's lenient approach to possession cases.",
      "url": "https://www.foxnews.com/us/portland-da-cracks-down-drug-crimes-seattle-softens-enforcement",
      "published": "Mon, 19 Jan 2026 08:00:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ICE agent confronts agitators interfering with alleged child sex offender arrest and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/ice-agent-agitators-alleged-child-sex-offender-more-top-headlines",
      "published": "Mon, 19 Jan 2026 06:52:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Harvard student exposes 'systematic' liberal bias forcing conservatives to avoid certain classes",
      "description": "Harvard student says \"systematic\" bias exists at Ivy League school, with conservative students avoiding courses due to left-leaning faculty influence.",
      "url": "https://www.foxnews.com/us/harvard-student-exposes-systematic-liberal-bias-forcing-conservatives-avoid-certain-classes",
      "published": "Mon, 19 Jan 2026 06:00:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida woman, 81, arrested in murder-for-hire plot after sharing plan with undercover detective, sheriff says",
      "description": "Florida woman, 81, allegedly tried to hire hitman to commit murder but met undercover officer instead. Elouise Leland was charged with solicitation to commit first-degree murder.",
      "url": "https://www.foxnews.com/us/florida-woman-arrested-murder-for-hire-plot-after-sharing-plan-undercover-detective-sheriff-says",
      "published": "Sun, 18 Jan 2026 13:55:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Woman wakes up with 8-foot python coiled on her chest while sleeping: 'Don't move'",
      "description": "A Brisbane woman calmly removed an 8-foot carpet python from her bedroom after waking to find the non-venomous snake on top of her chest Monday night.",
      "url": "https://www.foxnews.com/world/woman-wakes-up-8-foot-python-coiled-her-chest-while-sleeping-dont-move",
      "published": "Sat, 17 Jan 2026 23:11:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}