{
  "last_updated": "2026-01-15T11:21:25.172269Z",
  "event_count": 221,
  "events": [
    {
      "title": "Trump to meet Venezuelan opposition leader and Nobel peace laureate Maria Corina Machado later – US politics live",
      "description": "Trump and his top advisers have previously hinted at their willingness to work with acting president Delcy Rodríguez The US Senate has voted against a war powers resolution that would have prevented Donald Trump from taking further military action against Venezuela without giving Congress advance notice. Senators Josh Hawley of Missouri and Todd Young of Indiana, who had joined three other Republicans to advance the resolution alongside Democrats last week, flipped after they said they received assurances from the Trump administration . The US Senate has voted against a war powers resolution that would have prevented Donald Trump from taking further military action against Venezuela without giving Congress advance notice. Senators Josh Hawley of Missouri and Todd Young of Indiana, who had joined three other Republicans to advance the resolution alongside Democrats last week, flipped after they said they received assurances from the Trump administration . The Trump administration received approval from the justice department to use the military to seize Nicolás Maduro even as it declined to address whether the operation would violate international law, according to a legal memo. The dark-of-night raid to capture Venezuela’s president has raised a host of legal issues concerning the president’s power to start an armed conflict without congressional approval and possible breaches of international law. The Trump administration has indefinitely suspended immigrant visa processing for people from 75 countries, marking one of its most expansive efforts yet to restrict legal pathways to the United States. The freeze, which takes effect on 21 January, targets applicants officials deem likely to become a “public charge” – who they describe as people who may rely on government benefits for basic needs. Donald Trump has said it would be “unacceptable” for Greenland to be “in the hands” of any country other than the US, reiterating his demand to take over the arctic island, a semi-autonomous territory of Denmark. “The US needs Greenland for the purpose of national security. Nato should be leading the way for us to get it,” the US president said on social media . The alliance “becomes far more formidable and effective” with the territory under US control, he said. The Iranian government has signalled that detained protesters are to face speedy trials and executions , defying a threat by Trump to intervene if authorities continue their crackdown. The Democratic representative Robin Kelly on Wednesday formally introduced articles of impeachment against Trump’s homeland security secretary, Kristi Noem , following the fatal shooting of a US citizen by an immigration agent in Minneapolis last week. The Trump administration on Tuesday evening unexpectedly canceled up to $1.9bn in funding for substance use and mental health care, which providers say will immediately affect thousands of patients. “The scope of care that’s disrupted by these grants is catastrophic,” said Ryan Hampton, founder of Mobilize Recovery, a national advocacy organization for people in and seeking recovery. “Tens of thousands, if not hundreds of thousands, of people will die.” Continue reading...",
      "url": "https://www.theguardian.com/us-news/live/2026/jan/15/us-politics-latest-news-updates-donald-trump-venezuela-maria-corina-machado",
      "published": "Thu, 15 Jan 2026 11:13:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 62,
      "severity_level": "Critical"
    },
    {
      "title": "Security Council LIVE: Attacks against Ukrainian civilians unacceptable, unjustifiable and must stop, says UN",
      "description": "The UN Security Council is meeting in emergency session in New York over Russia’s ongoing deadly missile and drone strikes targeting Ukrainian civilians and energy infrastructure, as frigid winter conditions grip the war-torn country. Millions have been deprived of electricity, heating and water. The UN Secretary-General has called the stepped up attacks an unacceptable violation of international humanitarian law. Follow live below and find all our in-depth meetings coverage here. UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166743",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Quarter of developing countries poorer than in 2019, World Bank finds",
      "description": "Global growth ‘downshifted’ since Covid pandemic and sub-Saharan Africa particularly affected, report says Business live – latest updates A quarter of countries in the developing world are poorer than they were in 2019 before the Covid pandemic, the World Bank has found. The Washington-based organisation said a large group of low-income countries, many in sub-Saharan Africa, had suffered a negative shock in the six years to the end of last year. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/13/developing-countries-poorer-world-bank-report",
      "published": "Tue, 13 Jan 2026 14:30:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "‘We’ve lost everything, you can see caravans floating away’: flash flooding hits Victoria’s Great Ocean Road",
      "description": "Woman camping at flooded Wye River with her daughters says ‘it’s just heartbreaking, strangers are hugging strangers’ Get our breaking news email , free app or daily news podcast Hundreds of people have evacuated a major camping ground after a severe thunderstorm caused flash flooding at Wye River, closed a major scenic tourism road and washed cars out to sea. An emergency warning was in place for the Wye, Kennett and Cumberland rivers in the Lorne area in Victoria’s south-west coast after thunderstorms dumped more than 170mm of rain on the area on Thursday afternoon. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/river-wye-flooding-victoria-great-ocean-road-cars-washed-away",
      "published": "Thu, 15 Jan 2026 06:19:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Global employment stable but decent jobs in short supply",
      "description": "Global unemployment remains stable, but progress toward decent work has stalled, according to a new report from the International Labour Organization (ILO), which warns that young people continue to struggle in a job market which risks being further undermined by AI and trade policy uncertainty.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166751",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "At least 32 killed as crane collapses on train in Thailand",
      "description": "Crane in use on high-speed rail project hits passing train, causing it to derail At least 32 people in Thailand have been killed and scores injured after a crane collapsed on to a passenger train and derailed it, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars and smoke rising from the wreckage of the train below. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths",
      "published": "Wed, 14 Jan 2026 15:44:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Ending famine, refugee solidarity in Kenya, Ukraine civilian casualties update",
      "description": "The head of the UN’s emergency food agency has urged world leaders on Monday to end “man-made famines” and conflicts that “drive hunger and desperation”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166744",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "G7 threatens Iran with new sanctions over nationwide protest crackdown killing thousands",
      "description": "Iran protests death toll reaches over 2,400, according to Human Rights Activist News Agency as G7 foreign ministers warn of new sanctions over regime's violent response.",
      "url": "https://www.foxnews.com/world/g7-threatens-iran-new-sanctions-nationwide-protest-crackdown-killing-thousands",
      "published": "Wed, 14 Jan 2026 15:22:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "'I carried my wife's body for an hour and a half' - BBC hears stories of protesters killed in Iran",
      "description": "BBC Persian has received dozens of accounts from inside Iran, with witnesses saying they want to ensure the world knew of the violence against protesters.",
      "url": "https://www.bbc.com/news/articles/c8e54zp5j6no?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 20:35:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "US launches wave of strikes in Somalia targeting ISIS, al-Shabab terror threats",
      "description": "U.S. Africa Command General Michael E. Langley warns of jihadi threat to homeland as airstrikes against al-Shabab and ISIS-Somalia intensify under Trump administration.",
      "url": "https://www.foxnews.com/world/us-launches-wave-strikes-somalia-targeting-isis-al-shabab-terror-threats",
      "published": "Tue, 13 Jan 2026 20:56:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "ICE agent shoots Venezuelan national in Minneapolis after shovel attack during ambush: DHS",
      "description": "A shooting involving an ICE agent unfolded in Minneapolis late Wednesday after a suspect allegedly assaulted a federal officer with a shovel, authorities said.",
      "url": "https://www.foxnews.com/us/ice-agent-shoots-venezuelan-national-minneapolis-shovel-attack-ambush-dhs",
      "published": "Wed, 14 Jan 2026 22:00:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "‘A torture that never stops’: Sri Lanka failing survivors of conflict sexual violence, UN says",
      "description": "Conflict-related sexual violence in Sri Lanka remains largely unaddressed more than 15 years after the end of the civil war, with survivors still denied justice, recognition and reparations, according to a new report by the UN human rights office, OHCHR, on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166755",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Trump administration ends temporary protected status for Somalis in US",
      "description": "Critics condemn ‘bigoted attack’ as Trump bids to revoke citizenship of naturalized immigrants convicted of fraud The Trump administration is terminating temporary protected status (TPS) for Somalis living in the United States, giving hundreds of people two months to leave the country or face deportation. The homeland security secretary, Kristi Noem , said in a statement that conditions in the east African country had improved sufficiently and that Somalis no longer qualified for the designation under federal law. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/13/trump-administration-ends-tps-somalia",
      "published": "Tue, 13 Jan 2026 22:59:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: A ceasefire that still kills children is not enough, says UNICEF",
      "description": "Airstrikes, drone attacks and hypothermia continue in Gaza despite the ceasefire, with more than 100 youngsters killed since early October, the UN Children’s Fund (UNICEF) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166750",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Storms worsen already dire humanitarian situation, UN warns",
      "description": "The humanitarian crisis across the Gaza Strip remains extremely serious, with harsh winter weather threatening to reverse recent gains in aid delivery, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166747",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘shocked’ by reports of excessive force against protesters in Iran",
      "description": "The UN Secretary-General is shocked by reports of violence and excessive use of force by Iranian authorities against protesters across the country, urging restraint and the immediate restoration of communications as unrest enters its third week.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166739",
      "published": "Sun, 11 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "NASA brings astronauts home early after health issue in first-ever evacuation",
      "description": "NASA completed its first-ever medical evacuation from space, bringing four astronauts back to Earth early after a health issue aboard the International Space Station.",
      "url": "https://www.foxnews.com/us/nasa-brings-astronauts-home-early-after-health-issue-first-ever-evacuation",
      "published": "Thu, 15 Jan 2026 04:27:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Minneapolis: Officer shoots person in leg during arrest",
      "description": "An officer was allegedly attacked with a shovel and broom handle while trying to arrest the person, DHS said. The shooting took place a few kilometers from where an immigration agent fatally shot Renee Good.",
      "url": "https://www.dw.com/en/minneapolis-officer-shoots-person-in-leg-during-arrest/a-75511317?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 04:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN World Court begins landmark hearings on Rohingya genocide case against Myanmar",
      "description": "Public hearings opened on Monday at the International Court of Justice (ICJ) in a landmark case brought by the Gambia against Myanmar, alleging violations of the Genocide Convention over the military’s treatment of the Rohingya minority.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166746",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Multiple people killed after construction crane falls, derails train in Thailand",
      "description": "A deadly construction accident unfolded in northeastern Thailand when a crane collapsed onto a moving passenger train, officials said.",
      "url": "https://www.foxnews.com/world/multiple-people-killed-after-construction-crane-falls-derails-train-thailand",
      "published": "Wed, 14 Jan 2026 03:07:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Watch: Astronauts return to Earth after medical evacuation",
      "description": "Four astronauts who left the International Space Station (ISS) a month early due to one of the crew members falling ill have returned to Earth on Thursday.",
      "url": "https://www.bbc.com/news/videos/c89q0y5xd79o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 10:38:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Attempt to overturn the Gambia’s ban on FGM heard by supreme court",
      "description": "Case brought by Muslim leaders and MP follows failed 2024 bid and seen as part of global anti-women’s rights backlash A group of religious leaders and an MP in the Gambia have launched efforts to overturn a ban on female genital mutilation at the country’s supreme court. The court case, due to resume this month, comes after two babies bled to death after undergoing FGM in the Gambia last year. Almameh Gibba, an MP and one of the plaintiffs, tabled a bill to decriminalise FGM that was rejected by the country’s parliament in 2024. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/09/the-gambia-female-genital-mutilation-fgm-supreme-court-case-overturn-ban",
      "published": "Fri, 09 Jan 2026 06:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Another ICE shooting fuels chaos in Minneapolis",
      "description": "A US immigration officer shot and wounded a Venezuelan man fleeing a traffic stop in ⁠Minneapolis on Wednesday, the government said, escalating tension over an unwelcome deployment of militarized federal agents in Minnesota's most populous city. Story by Peter O'Brien.",
      "url": "https://www.france24.com/en/another-ice-shooting-fuels-chaos-in-minneapolis",
      "published": "Thu, 15 Jan 2026 10:27:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "NASA conducts first-ever medical evacuation from space station",
      "description": "NASA carried out its first medical evacuation from the International Space Station after an astronaut required care, bringing four crew members back to Earth earlier than planned. The early return temporarily reduces the station crew, limiting spacewalks until a replacement team arrives.",
      "url": "https://www.france24.com/en/technology/20260115-nasa-conducts-first-ever-medical-evacuation-from-space-station",
      "published": "Thu, 15 Jan 2026 01:54:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Escalating fighting in Sudan, displacement in Syria’s Aleppo, $1.5 billion appeal for South Sudan",
      "description": "More civilians in Sudan continue to be killed and displaced as fighting escalates in multiple parts of the country, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166756",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: ‘The killing of peaceful demonstrators must stop,’ UN rights chief says",
      "description": "As anti-government demonstrations continue across Iran, the UN human rights chief said on Tuesday that he was horrified at the mounting violence directed by security forces against protestors, with reports of hundreds killed and thousands arrested.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166752",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Armed Kurdish fighters try to breach Iran border as regional threat grows amid protests: reports",
      "description": "Turkey's intelligence agency, MIT, warned Iran's Revolutionary Guard about Kurdish fighters trying to cross the Iran-Iraq border during ongoing government crackdowns.",
      "url": "https://www.foxnews.com/world/kurdish-fighters-try-exploit-iran-chaos-regional-threat-grows-amid-nationwide-protests",
      "published": "Wed, 14 Jan 2026 20:44:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran shuts down airspace; foreign officials warn against travel to Israel",
      "description": "Iran closes airspace to most flights amid rising U.S. tensions. Trump says Iranian protest killings have stopped, but military officials reportedly warned an attack was imminent.",
      "url": "https://www.foxnews.com/world/iran-shuts-down-airspace-foreign-officials-warn-against-travel-israel",
      "published": "Wed, 14 Jan 2026 18:54:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime opened fire with live ammunition on protesters, doctor says: ‘Shoot-to-kill’",
      "description": "Iranian protests that began Dec. 28 saw security forces shift to live ammunition by Jan. 8, with over 3,000 deaths estimated nationwide.",
      "url": "https://www.foxnews.com/world/iran-regime-opened-fire-live-ammunition-protesters-doctor-says-shoot-to-kill",
      "published": "Tue, 13 Jan 2026 18:57:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Ugandans to vote in election expected to extend Museveni’s four-decade rule",
      "description": "Campaign beset by violence with supporters of rival candidate Bobi Wine teargassed and detained Ugandans are preparing to vote in an election that is expected to result in Yoweri Museveni extending his nearly four-decade grip on power in the east African country, after a campaign beset by violence. Security forces have frequently clamped down on supporters of Museveni’s main opponent, Bobi Wine, by teargassing and shooting bullets at events and detaining people. Authorities have also arrested civil society members and suspended rights groups. On Tuesday, they shut down internet access and limited mobile phone services countrywide. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/15/uganda-vote-election-yoweri-museveni-bobi-wine",
      "published": "Thu, 15 Jan 2026 05:00:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Live: Iran protester won't face death penalty, judiciary says",
      "description": "Erfan Soltani, a 26-year-old Iranian man arrested on January 10 during protests, will not be sentenced to death, the country's judiciary said, according to state media. The news comes ahead of a Security Council meeting on Thursday afternoon to discuss the situation in Iran. Follow our liveblog for all the latest developments.",
      "url": "https://www.france24.com/en/middle-east/20260115-live-un-security-council-to-meet-for-a-briefing-on-the-situation-in-iran",
      "published": "Thu, 15 Jan 2026 04:14:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine war: UN appeals for $2.3 billion to support aid teams’ ‘heroic work’",
      "description": "Amid ongoing and intensifying Russian attacks across Ukraine, the UN on Tuesday launched a $2.3 billion humanitarian appeal for 2026 to support 4.1 million of the country’s most vulnerable people.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166749",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Deadly Russian strikes push civilians deeper into winter crisis",
      "description": "Ukraine has entered the new year under intensifying and deadly Russian attacks which have crippled energy systems and left millions without heating, electricity or water amid freezing temperatures, senior UN officials told the Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166748",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Casey Anthony calls Minneapolis ICE shooting a crime, rips JD Vance for protecting ‘Gestapo’ agents",
      "description": "Casey Anthony, dubbed \"America's most hated mom,\" accuses federal authorities of shielding ICE agents from accountability in Minneapolis shooting death.",
      "url": "https://www.foxnews.com/us/casey-anthony-calls-minneapolis-ice-shooting-crime-rips-jd-vance-protecting-gestapo-agents",
      "published": "Wed, 14 Jan 2026 14:51:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Renee Nicole Good's family hires George Floyd legal team for civil investigation after fatal ICE shooting",
      "description": "The family of the woman fatally shot by an ICE agent hired George Floyd's lawyers from the Romanucci & Blandin law firm for a new civil investigation, according to the firm.",
      "url": "https://www.foxnews.com/us/renee-nicole-goods-family-hires-george-floyd-legal-team-civil-investigation-fatal-ice-shooting",
      "published": "Wed, 14 Jan 2026 19:47:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Agitators clash with federal officers after another ICE shooting in Minneapolis",
      "description": "Rioters clashed with federal agents in Minneapolis after a second ICE shooting, with tear gas and pepper balls deployed as demonstrators demand the agency leave the city.",
      "url": "https://www.foxnews.com/us/protesters-clash-federal-officers-after-another-ice-shooting-minneapolis",
      "published": "Thu, 15 Jan 2026 03:01:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran pushes for fast trials and executions of suspects detained in protests despite Trump's warning: report",
      "description": "Iran chief justice Gholamhossein Mohseni-Ejei calls for fast trials and executions of suspects in ongoing anti-government demonstrations, a report said.",
      "url": "https://www.foxnews.com/world/iran-pushes-fast-trials-executions-suspects-detained-protests-despite-trumps-warning-report",
      "published": "Wed, 14 Jan 2026 11:05:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Wary of Israeli appropriation, Palestine lists 14 sites with UNESCO",
      "description": "Palestinian Authority submits files for Gaza’s Old City and West Bank landmarks to UNESCO World Heritage list.",
      "url": "https://www.aljazeera.com/features/2026/1/15/wary-of-israeli-appropriation-palestine-lists-14-sites-with-unesco?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 08:03:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "How Trump's 'America First' is upending the world order",
      "description": "President Trump is dismantling the global system the U.S. built in the 20th century. Foreign policy experts say he wants a world that looks more like the 19th century.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5667212/how-trumps-america-first-is-upending-the-world-order",
      "published": "Wed, 14 Jan 2026 16:54:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Five US lawmakers investigated over warning troops about illegal orders",
      "description": "Five US legislators say they are under investigation by the Department of Justice over a video released in November.",
      "url": "https://www.aljazeera.com/news/2026/1/15/five-us-lawmakers-investigated-over-warning-troops-about-illegal-orders?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 08:26:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump says ‘we’ve been told killing has stopped’ in Iran",
      "description": "A day after warning of ‘serious consequences,’ Trump said he had been told the killing of protesters in Iran had stopped",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/trump-says-weve-been-told-killing-has-stopped-in-iran?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 06:57:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Zelensky declares energy emergency after Russian strikes",
      "description": "Ukrainian President Volodymyr Zelensky said Wednesday a \"state of emergency\" will be declared in the energy sector, after relentless Russian strikes on heat and electricity supplies during freezing winter temperatures. Story by Liza Kaminov.",
      "url": "https://www.france24.com/en/ukraine-zelensky-declares-energy-emergency-after-russian-strikes",
      "published": "Thu, 15 Jan 2026 10:33:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "NATO at a 'crossroads': Does the IGO military alliance need to 'reinvent' itself?",
      "description": "Emmanuel Macron is convening an ⁠emergency defence cabinet to discuss Donald's Trump's intent to acquire Greenland and Iran's brutal ​crackdown on mass protests. For in-depth analysis and insight, Oliver Farry welcomes Dr Alexandre Vautravers, Expert in Strategy and Security and Editor-in-Chief of the Swiss Military Review. Dr. Vautravers affirms that France is taking US threats 'very seriously' and says that France might need to reassess its \"schizophrenic approach' to defence that prioritises expeditionary forces over conventional territorial defence.",
      "url": "https://www.france24.com/en/nato-at-a-crossroads-does-the-igo-military-alliance-need-to-reinvent-itself",
      "published": "Thu, 15 Jan 2026 10:24:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump says Iran executions ‘stopping’ as Tehran signals fast trials and hangings",
      "description": "President Donald Trump claimed on Wednesday that executions in Iran may have been halted, citing unnamed sources, even as the Iranian government intensified warnings of rapid trials and possible executions for thousands of detainees amid ongoing protests.",
      "url": "https://www.france24.com/en/middle-east/20260115-trump-says-iran-executions-stopping-as-tehran-signals-fast-trials-and-hangings",
      "published": "Thu, 15 Jan 2026 00:39:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "11-year streak of record global warming continues, UN weather agency warns",
      "description": "The past 11 years have been the warmest in the modern era, while oceans continue to heat up, too, says the UN weather agency.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166758",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Increase taxes on sugary drinks and alcohol to save lives, urges WHO",
      "description": "Beverages like sugary drinks and alcohol are too accessible and cost too little in most of the world – helping fuel obesity, diabetes, cancer and injury, the World Health Organization (WHO) warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166754",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iran protests: AI and dated photos mislead about pro-regime rallies",
      "description": "Amid nationwide protests in Iran against the country's theocracy, this week has also seen rallies take place in support of the government. But online, social media users have been sharing misleading content about these pro-regime rallies, using AI-generated footage and dated images to talk up the demonstrations. Vedika Bahl explains in this edition of Truth or Fake.",
      "url": "https://www.france24.com/en/tv-shows/truth-or-fake/20260114-iran-protests-ai-and-dated-photos-mislead-about-pro-regime-rallies-1",
      "published": "Wed, 14 Jan 2026 22:05:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Brazilian police kill 4 in Rio favela in operation to contain Red Command criminal gang",
      "description": "Police in Rio de Janeiro say they killed four people who attacked security forces during an operation against the Red Command gang",
      "url": "https://abcnews.go.com/International/wireStory/brazilian-police-kill-4-rio-favela-operation-red-129221985",
      "published": "Wed, 14 Jan 2026 17:45:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Video shows police officer ambushed in patrol car in explosion of gunfire; suspect found dead after shootout",
      "description": "Video shows a gunman wounding a police officer in an alleged ambush, then fleeing and leading a deadly chase through Greenville County streets.",
      "url": "https://www.foxnews.com/us/video-shows-police-officer-ambushed-patrol-car-explosion-gunfire-suspect-found-dead-after-shootout",
      "published": "Wed, 14 Jan 2026 19:23:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Police chief touts gun link in Ohio dentist murders; records show three 9 mm casings found in killings",
      "description": "Columbus police say a gun is linked to the fatal shootings of Ohio dentist Spencer Tepe and wife Monique. Ex-husband Michael McKee faces murder charges.",
      "url": "https://www.foxnews.com/us/police-chief-touts-gun-link-ohio-dentist-murders-records-show-three-9mm-casings-found-killings",
      "published": "Wed, 14 Jan 2026 17:58:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia losing 'massive' 25,000 troops monthly in Ukraine as war grinds on, NATO chief says",
      "description": "Russia's \"massive\" military losses in Ukraine are unsustainable, NATO's secretary general warned with the conflict about to enter its fourth year with no clear end in sight.",
      "url": "https://www.foxnews.com/world/russia-losing-massive-25000-troops-monthly-ukraine-war-grinds-on-nato-chief-mark-rutte-says",
      "published": "Wed, 14 Jan 2026 14:38:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Watch: Aerial footage shows cars swept away by flash floods in Australia",
      "description": "Australia's Great Ocean Road closed on Thursday after flash floods hit the state of Victoria.",
      "url": "https://www.bbc.com/news/videos/c1wz807vpglo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 09:30:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela regime claims release of political prisoners is sign of new era",
      "description": "NGOs estimate that there are still close to 1,000 political prisoners in Venezuela despite claims by new leaders Venezuela’s acting president has claimed that the regime’s release of political prisoners sent a “very clear message” that the country was “opening up to a new political moment”, days after the seizure and rendition of the dictator Nicolás Maduro. Delcy Rodríguez also vowed to continue the releases and accused NGOs that have described the process as slow and opaque of “lying to the world and trying to sell falsehoods about Venezuela”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/venezuelan-political-prisoners-released",
      "published": "Wed, 14 Jan 2026 19:25:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Korean prosecutors demand death penalty for former president Yoon Suk Yeol",
      "description": "Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol",
      "published": "Wed, 14 Jan 2026 00:43:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "East Jerusalem: Forced shutdown of UN clinic signals escalating disregard for international law",
      "description": "The temporary closure of a UN-run health centre in East Jerusalem is the latest phase in “a pattern of deliberate disregard” for international law, the head of the UN agency that assists Palestine refugees, UNRWA, said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166760",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Federal agent shoots Minneapolis man in leg after attack, officials say",
      "description": "The agent was acting in self-defence after being attacked with a shovel, said the Department of Homeland Security.",
      "url": "https://www.bbc.com/news/articles/c205677pxvxo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 10:22:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Workers at Chinese factory that produces Labubu toys are being exploited, says NGO",
      "description": "Exclusive: China Labor Watch says people aged 16-18 employed without required special protections A labour rights NGO says it has found evidence of worker exploitation in the supply chain of Labubus, the furry toys that took the world by storm last year and which are expected to continue to grow in popularity in 2026. Labubus, toothy gremlins made by the Chinese toy company Pop Mart, have become one of China’s hottest cultural exports. In the first half of 2025 alone, “the Monsters” line of toys, which includes Labubus, generated 4.8bn yuan (£511m) in sales for the Hong Kong-listed company. In August, Pop Mart’s chief executive, Wang Ning, said the company was on track to reach 20bn yuan in revenues in 2025. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/workers-at-chinese-factory-that-produces-labubu-toys-are-being-exploited-says-ngo",
      "published": "Tue, 13 Jan 2026 09:55:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Taxpayer-funded Minnesota charter school shuts down in-person learning amid ICE raids",
      "description": "Minnesota charter school moves classes online citing safety concerns as community warns of reported ICE activity affecting local families and students.",
      "url": "https://www.foxnews.com/us/taxpayer-funded-minnesota-charter-school-shuts-down-person-learning-ice-raids",
      "published": "Wed, 14 Jan 2026 21:43:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Rift at top of the Taliban: BBC reveals clash of wills behind internet shutdown",
      "description": "The Taliban leader once warned of a split: A BBC investigation reveals how attitudes to women, the internet and religion are dividing the group at the very top.",
      "url": "https://www.bbc.com/news/articles/cg7vdpy1l2vo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 06:05:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'It was terrifying': Residents describe carnage after Thai train crash kills 32",
      "description": "The BBC arrived at a grim scene in the evening, with rescuers still pulling bodies out of the mangled train.",
      "url": "https://www.bbc.com/news/articles/cm2yvnen1qyo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 06:46:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Gaza plan phase two: US to discuss Hamas disarmament, Israeli withdrawal",
      "description": "The second phase of the ceasefire deal includes naming a panel of Palestinian technocrats to lead post-war Gaza.",
      "url": "https://www.aljazeera.com/news/2026/1/15/gaza-plan-phase-two-us-to-discuss-hamas-disarmament-israeli-withdrawal?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 07:18:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Denmark warns of 'fundamental disagreements' over Greenland after White House talks",
      "description": "The UK has deployed a military officer to Greenland as Denmark and its European allies seek to counter Donald Trump's threats to take the territory, after talks at the White House ended with \"fundamental disagreement\".",
      "url": "https://news.sky.com/story/denmark-says-fundamental-disagreement-remains-with-trump-but-agrees-to-high-level-talks-over-greenland-13494401",
      "published": "Wed, 14 Jan 2026 22:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand suffers another construction accident just a day after rail tragedy that killed 32",
      "description": "A new construction accident near Bangkok has occurred just 24 hours after a deadly train accident in another part of Thailand",
      "url": "https://abcnews.go.com/International/wireStory/thailand-suffers-construction-accident-day-after-rail-tragedy-129230897",
      "published": "Thu, 15 Jan 2026 01:05:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump envoy reportedly meets with exiled Iranian prince as regime faces protests",
      "description": "The Trump administration allegedly made the first high-level contact with the Iranian opposition amid intensifying nationwide anti-regime protests.",
      "url": "https://www.foxnews.com/world/trump-envoy-reportedly-meets-exiled-iranian-prince-regime-faces-protests",
      "published": "Tue, 13 Jan 2026 18:32:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Republican senator condemns alleged Syrian army abuses as ceasefire follows Aleppo fighting",
      "description": "US Senator demands accountability after alleged human rights violations by Syrian forces against Kurdish civilians in Aleppo amid ongoing conflict.",
      "url": "https://www.foxnews.com/world/republican-senator-condemns-alleged-syrian-army-abuses-ceasefire-follows-aleppo-fighting",
      "published": "Tue, 13 Jan 2026 17:29:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iranian student shot in head at close range amid protests, body buried along roadside",
      "description": "Iranian student Rubina Aminian was shot in the head at close range, joining thousands allegedly killed by government forces, according to Iran Human Rights, a Norway-based group.",
      "url": "https://www.foxnews.com/world/iranian-student-shot-head-close-range-amid-protests-body-buried-along-roadside",
      "published": "Tue, 13 Jan 2026 17:16:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Was Nicolas Maduro ‘flooding’ the US with fentanyl, as White House claims?",
      "description": "Trump administration's claim that abducted Venezuelan leader is behind gangs sending drugs to US do not stack up.",
      "url": "https://www.aljazeera.com/features/2026/1/15/was-nicolas-maduro-flooding-the-us-with-fentanyl-as-white-house-claims?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 10:27:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Construction firm in spotlight after deadly Thailand crane collapses",
      "description": "Dashcam video captured the moment a crane collapsed in Thailand, killing two people.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/construction-firm-in-spotlight-after-deadly-thailand-crane-collapses?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 09:33:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "xAI restricts Grok chatbot after sexualised AI images spark global concern",
      "description": "Elon Musk’s AI company xAI has imposed limits on its Grok chatbot’s image editing capabilities after hyper-realistic sexualised images – including depictions of minors – circulated online. The restrictions apply to all users, including paid subscribers, and block image generation in jurisdictions where such content is illegal.",
      "url": "https://www.france24.com/en/technology/20260115-xai-restricts-grok-chatbot-after-sexualised-ai-images-spark-global-concern",
      "published": "Thu, 15 Jan 2026 03:17:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Protests after man shot during US federal raid in Minneapolis",
      "description": "Protests erupted in Minneapolis after a federal immigration agent shot a Venezuelan man in the leg after a traffic stop.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/protests-after-man-shot-during-us-federal-raid-in-minneapolis?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 09:46:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "BTS announces return with new world tour in 2026 and 2027",
      "description": "K-pop band to start tour in April after nearly four-year hiatus due to all seven members needing to complete South Korea’s mandatory military service The BTS comeback is upon us: the K-pop septet has announced a 2026-2027 world tour, kicking off in South Korea in April and running through to March 2027 with more than 70 dates across Asia, North America, South America, Australia and Europe. The tour marks the group’s first headline performances since their 2021–22 Permission to Dance on Stage tour. 9 April and 11-12 April – Goyang, South Korea 17-18 April – Tokyo 25-26 April – Tampa, Florida 2-3 May – El Paso, Texas 7 May and 9-10 May – Mexico City 16-17 May – Stanford, California 23-24 and 27 May – Las Vegas 12-13 June – Busan, South Korea 26-27 June – Madrid 1-2 July – Brussels 6-7 July – London 11-12 July – Munich 17-18 July – Paris 1-2 Aug – East Rutherford, New Jersey 5-6 Aug – Foxborough, Massachusetts 10-11 Aug – Baltimore 15-16 Aug – Arlington, Texas 22-23 Aug – Toronto 27-28 Aug – Chicago 1-2 Sept and 5-6 Sept – Los Angeles 2-3 Oct – Bogotá, Colombia 9-10 Oct – Lima, Peru 16-17 Oct – Santiago, Chile 23-24 Oct – Buenos Aires, Argentina 28 Oct and 30-31 Oct – São Paulo 19 Nov and 21-22 Nov – Kaohsiung, Taiwan 3 Dec and 5-6 Dec – Bangkok 12-13 Dec – Kuala Lumpur, Malaysia 17 Dec, 19-20 Dec and 22 Dec – Singapore 26-27 Dec – Jakarta 12-13 Feb – Melbourne, Australia 20-21 Feb – Sydney 4 March and 6-7 March – Hong Kong 13-14 March – Manila, Philippines Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/14/bts-announces-return-with-new-world-tourm-includin-in-2026-and-2027",
      "published": "Wed, 14 Jan 2026 00:40:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Uganda votes for a new president under internet blackout and police crackdown",
      "description": "Ugandans voted ⁠in a tense national election on Thursday after an often violent campaign and internet shutdown, with President Yoweri Museveni seeking to extend his rule into a fifth decade. Museveni is expected to fend off a challenge from the popular singer Bobi Wine, but the election is a test of the 81-year-old leader's political strength ​and ability to avoid the kind of unrest that has rocked neighbours Tanzania and Kenya. Details by FRANCE 24 correspondent in Uganda, Juliette Montilly.",
      "url": "https://www.france24.com/en/uganda-votes-for-a-new-president-under-internet-blackout-and-police-crackdown",
      "published": "Thu, 15 Jan 2026 10:31:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "AFCON 2025 semi-finals: Morocco down Nigeria on penalties, Senegal edge Egypt",
      "description": "Morocco capitalised on home support to stay the course and beat Nigeria on penalties (4-2) in their AFCON semi-final after 120 minutes produced no goals. They'll meet 2021 winners Senegal in the final, after the Lions of Teranga beat the Pharaohs of Egypt 1-0 thanks to Sadio Mané's late strike from range. Jean-Émile Jammine is joined by sports journalists Thando Sibiya and Andrea Evagora, as well as FRANCE 24's Selina Sykes in Rabat.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20260114-africa-cup-of-nations-2025-latest",
      "published": "Wed, 14 Jan 2026 23:59:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran's regime could fall, says Trump - as US president considers intervention",
      "description": "Donald Trump has said he believes Iran's regime could fall following weeks of unrest across the country, as the US president considers whether to intervene.",
      "url": "https://news.sky.com/story/irans-regime-could-fall-says-trump-as-us-president-considers-intervention-13494415",
      "published": "Wed, 14 Jan 2026 22:24:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Former Cyprus President George Vassiliou, who put the country on the path to EU membership, has died",
      "description": "Former Cypriot President George Vassiliou, a successful businessman who helped to energize his divided island’s economy and set it on the road to European Union membership, has died",
      "url": "https://abcnews.go.com/International/wireStory/former-cyprus-president-george-vassiliou-put-country-path-129193512",
      "published": "Wed, 14 Jan 2026 04:09:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Russia unlikely to risk ‘reputation failure’ by intervening in Iran unrest",
      "description": "A former Russian diplomat and analysts decode Moscow's muted response to protests and political tension.",
      "url": "https://www.aljazeera.com/news/2026/1/15/why-rattle-sabers-russias-response-to-iran-protests?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 09:12:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Musk's xAI curbs sexually explicit image generation in Grok",
      "description": "xAI has announced measures to rein in Grok's 'Spicy Mode' after global backlash over AI-edited images undressing women and children.",
      "url": "https://www.dw.com/en/musk-s-xai-curbs-sexually-explicit-image-generation-in-grok/a-75511331?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 05:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'It's like a road closure' - Uganda's president on shutting the internet as his country votes",
      "description": "A church service at Nakasero State House marks the end of a frenetic election cycle.",
      "url": "https://news.sky.com/story/its-like-a-road-closure-ugandas-president-on-shutting-down-the-internet-as-his-country-votes-in-election-13494517",
      "published": "Thu, 15 Jan 2026 08:34:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Is America surrendering Antarctica to its rivals?",
      "description": "As Donald Trump fights for control of arctic Greenland, is he losing at the other end of the world and leaving it open for rivals like China?",
      "url": "https://news.sky.com/story/is-america-surrendering-antarctica-to-its-rivals-13494444",
      "published": "Wed, 14 Jan 2026 23:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Watchdog highlights nations where Christians face persecution around the globe",
      "description": "Open Doors' World Watch List 2026 discusses Christian persecution in nations around the globe, including North Korea, Somalia, Yemen, Sudan and others.",
      "url": "https://www.foxnews.com/world/watchdog-highlights-nations-where-christians-face-persecution-around-globe",
      "published": "Wed, 14 Jan 2026 13:53:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Denmark warns of 'fundamental disagreement' after White House talks on Greenland",
      "description": "There was no major breakthrough during the meeting, and President Trump reiterated his interest in acquiring the island shortly afterwards.",
      "url": "https://www.bbc.com/news/articles/cx20vzz0g8vo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 02:56:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky declares energy emergency as biting cold persists",
      "description": "The move comes as US President Donald Trump said Ukraine is \"less ready\" than the Russian president to make a peace deal.",
      "url": "https://www.bbc.com/news/articles/cq6vm677z76o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 10:41:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Another crane collapses in Thailand, killing two, after 32 die previous day",
      "description": "Thursday's incident outside Bangkok follows a crane collapse the day before that killed dozens in the northeast.",
      "url": "https://www.aljazeera.com/news/2026/1/15/another-crane-collapses-in-thailand-killing-two-after-32-die-previous-day?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 07:44:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Astronauts splash down on Earth after first-ever ISS medical evacuation",
      "description": "Four astronauts end their mission early so that a crew member can receive medical treatment.",
      "url": "https://www.aljazeera.com/news/2026/1/15/astronauts-depart-international-space-station-after-medical-emergency?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 07:30:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death",
      "description": "Lawyers for Adichie and her husband serve Euracare hospital with legal notice after death of 21-month-old The Nigerian author Chimamanda Ngozi Adichie has accused a Lagos hospital of negligence after the death of one of her 21-month-old twin boys. Nkanu Nnamdi died on 6 January after a brief illness. He was one of twin boys born to Adichie and Ivara Esege, a doctor, in 2024 by surrogacy, eight years after the birth of their first child, a girl. Continue reading...",
      "url": "https://www.theguardian.com/books/2026/jan/12/chimamanda-ngozi-adichie-accuses-lagos-hospital-negligence-son-death",
      "published": "Mon, 12 Jan 2026 14:26:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Person taken to hospital after ingesting hand sanitiser supplied by Australia’s largest privately owned hotel chain",
      "description": "The ACCC recalls Dr Schwartz Hand Sanitiser after it was identified as containing a high concentration of methanol Get our breaking news email , free app or daily news podcast A person was hospitalised with acute methanol poisoning after ingesting a now-recalled hand sanitiser while staying at Australia’s largest privately owned hotel chain, Queensland health authorities say. The Dr Schwartz Hand Sanitiser was recalled on Wednesday by the Australian Competition and Consumer Commission (ACCC) after it was identified to contain a high concentration of methanol. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/hand-sanitiser-recall-dr-schwartz-hotel-chain-accc",
      "published": "Thu, 15 Jan 2026 08:10:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "How the Trump administration's threats to Iran are stoking tensions in the region",
      "description": "NPR's Michel Martin talks to Vali Nasr, a professor of Middle East studies at Johns Hopkins University, about how President Trump's threats against Iran are escalating regional tensions.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677278/how-the-trump-administrations-threats-to-iran-are-stoking-tensions-in-the-region",
      "published": "Thu, 15 Jan 2026 04:45:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Four astronauts exit ISS in first-ever medical evacuation",
      "description": "NASA has ended Crew-11's space stay a few weeks early due to a \"lingering risk\" to an astronaut's health. The crew is now on its way back to Earth.",
      "url": "https://www.dw.com/en/four-astronauts-exit-iss-in-first-ever-medical-evacuation/a-75511073?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 02:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US says second phase of Gaza peace plan underway",
      "description": "As Trump's Middle East envoy says the peace plan is moving forward, disarming Hamas and sustaining a transitional government in Gaza remain elusive.",
      "url": "https://www.dw.com/en/us-says-second-phase-of-gaza-peace-plan-underway/a-75510389?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 21:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria: No end to conflict between Kurds, central government",
      "description": "The past week's fighting between the Syrian army and Syrian Kurdish paramilitaries shows how difficult the military integration of the two will be to achieve.",
      "url": "https://www.dw.com/en/syria-no-end-to-conflict-between-kurds-central-government/a-75506075?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Rescue or crime? Humanitarian aid workers on trial in Greece",
      "description": "Humanitarian aid workers face up to 20 years in prison if found guilty of facilitating the illegal entry of migrants to Greece. The trial has been dubbed \"the largest case of the criminalization of solidarity in Europe.\"",
      "url": "https://www.dw.com/en/rescue-or-crime-humanitarian-aid-workers-on-trial-in-greece/a-75505957?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 16:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US launches phase two of plan to end Gaza conflict, including creation of transitional authority",
      "description": "Donald Trump's special envoy Steve Witkoff has announced the launch of phase two ​of ​the plan to end the conflict in Gaza.",
      "url": "https://news.sky.com/story/us-launches-phase-two-of-plan-to-end-gaza-conflict-including-creation-of-transitional-authority-13494283",
      "published": "Wed, 14 Jan 2026 16:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'It was war': Iranian woman who fled Tehran describes killings",
      "description": "\"It was war.\"",
      "url": "https://news.sky.com/story/everyone-was-being-shot-in-the-head-iranian-woman-who-fled-tehran-describes-killings-and-crackdown-13494160",
      "published": "Wed, 14 Jan 2026 11:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel to honor Charlie Kirk with award for fighting antisemitism",
      "description": "Israel plans to honor the late Charlie Kirk for his efforts against antisemitism",
      "url": "https://abcnews.go.com/International/wireStory/israel-honor-charlie-kirk-award-fighting-antisemitism-129233134",
      "published": "Thu, 15 Jan 2026 06:18:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Virginia nanny’s jailhouse letters reveal conflicting loyalties in love triangle murder trial",
      "description": "Au pair Juliana Peres Magalhães reads emotional jailhouse letters professing love for Brendan Banfield, charged with murdering his wife Christine Banfield and Joseph Ryan in 2023.",
      "url": "https://www.foxnews.com/us/virginia-nannys-jailhouse-letters-reveal-conflicting-loyalties-love-triangle-murder-trial",
      "published": "Thu, 15 Jan 2026 06:00:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "ICE detainer issued for El Salvadoran national charged with killing two North Carolina teens",
      "description": "North Carolina sanctuary policies face renewed criticism after an illegal alien was charged in the murders of two teenagers, ages 16 and 18, in Charlotte.",
      "url": "https://www.foxnews.com/us/ice-detainer-issued-el-salvadoran-national-charged-killing-two-north-carolina-teens",
      "published": "Wed, 14 Jan 2026 18:37:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "California man sues McDonald's after homeless man accused of attacking wife in drive-thru",
      "description": "California widower sues McDonald's after wife allegedly died from drive-thru attack injuries. Lawsuit claims employees watched assault without calling 911.",
      "url": "https://www.foxnews.com/us/california-man-sues-mcdonalds-after-homeless-man-accused-attacking-wife-drive-thru",
      "published": "Wed, 14 Jan 2026 12:55:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "ICE agent struck by Renee Good's vehicle suffered internal bleeding to torso, DHS says",
      "description": "An ICE agent suffered internal bleeding to his torso after Renee Nicole Good's vehicle struck him during the Minneapolis shooting last week, an official said.",
      "url": "https://www.foxnews.com/us/ice-agent-struck-renee-goods-vehicle-suffered-internal-bleeding-torso-dhs-says",
      "published": "Wed, 14 Jan 2026 12:14:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korean prosecutor seeks death penalty for ex-President Yoon over martial law declaration: 'Self-coup'",
      "description": "An independent counsel demanded a death sentence for former South Korean President Yoon Suk Yeol on rebellion charges over his controversial martial law decree.",
      "url": "https://www.foxnews.com/world/south-korean-prosecutor-seeks-death-penalty-ex-president-yoon-over-martial-law-declaration-self-coup",
      "published": "Wed, 14 Jan 2026 03:29:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why big oil giants may not rush to buy into Donald Trump’s Venezuelan vision",
      "description": "It may well be safer, easier and cheaper for US companies to procure whatever oil the US economy needs at home There are a few reasons that Donald Trump – now self-anointed acting President of Venezuela , as well as the United States – might be so excited about appropriating Venezuela’s oil . Trump may be counting on some boost from cheap oil to the US economy: he is obsessed with the price of gas . As the midterm elections approach, he has become concerned about unemployment . Deeply imprinted memories of scarcity during the oil crises of the 1970s may prime his belief that cheap oil cures it all. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/15/trump-big-oil-venezuela",
      "published": "Thu, 15 Jan 2026 11:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "FBI searches Washington Post reporter's home",
      "description": "FBI agents searched Hannah Natanson's home as part of an investigation into sharing secret government information. The paper said investigators told her she was not a focus of the probe.",
      "url": "https://www.dw.com/en/fbi-searches-washington-post-reporter-s-home/a-75507082?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 18:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Some museum entrance fees go up for non-EU tourists in France",
      "description": "Tourists visiting France from outside the European Union now have to pay significantly higher entrance fees at some of the most popular sites in the country: €10 more at the Louvre museum and €3 more at the Palace of Versailles. This after a recent daytime heist at the Louvre exposed shortcomings in its maintenance and security systems. Plus, Ryanair's CEO has blasted what he called \"stupid\" passenger taxes in Brussels and said the company would reduce its flights to the city by 10 percent this year.",
      "url": "https://www.france24.com/en/tv-shows/business/20260114-some-museum-entrance-fees-go-up-for-non-eu-tourists-in-france",
      "published": "Wed, 14 Jan 2026 22:14:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian military tells civilians to evacuate contested area east of Aleppo amid rising tensions",
      "description": "Syria’s military has announced it will open a “humanitarian corridor” for civilians to evacuate from an area in Aleppo province",
      "url": "https://abcnews.go.com/International/wireStory/syrian-military-tells-civilians-evacuate-contested-area-east-129209927",
      "published": "Wed, 14 Jan 2026 23:05:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "University of Utah student charged with making gun gestures, threatening to shoot conservative debaters",
      "description": "A University of Utah student allegedly threatened to shoot conservative speakers \"in the neck\" during a debate on campus, leading to his arrest.",
      "url": "https://www.foxnews.com/us/university-utah-student-charged-making-gun-gestures-threatening-shoot-conservative-debaters",
      "published": "Wed, 14 Jan 2026 16:01:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Bangladesh’s Muhammad Yunus Era",
      "description": "How Bangladesh’s interim government has fared in steering the country to this point?",
      "url": "https://www.aljazeera.com/video/the-india-report/2026/1/15/bangladeshs-muhammad-yunus-era?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 08:49:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Teal MPs call out Coalition over stance on hate speech laws – as it happened",
      "description": "This blog is now closed Labor’s hate speech and gun laws set to fail as Coalition and Greens rule out support Get our breaking news email , free app or daily news podcast Iranian Australians left distraught with no confirmation their family is safe Almost a week into Iran’s communication blackout, Iranian Australian activist Mohammad Hashemi received a call from his home country. When I heard the stories, what happened to people, I was crying about the situation and what’s going on in our country. We continue to advise do not travel to Iran. If you choose to remain in Iran, you’re responsible for your own safety. Be prepared to shelter in place for an extended period. Make sure you have supplies of water, food and medication. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/15/victoria-bushfires-school-data-hack-adelaide-writers-week-peter-malinauskas-labor-hate-speech-laws-political-reaction-anthony-albanese-sussan-ley-coalition-ntwnfb",
      "published": "Thu, 15 Jan 2026 06:25:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Labor’s hate speech and gun laws set to fail as Coalition and Greens rule out support",
      "description": "Opposition leader says government took ‘a month to deliver this bad bill’ as Labor criticises Liberal ‘hypocrisy’ on proposed hate laws Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Labor’s proposed hate speech and gun laws look set to fail in federal parliament without a significant overhaul, after the Coalition and the Greens both ruled out support – prompting angry claims of hypocrisy from Anthony Albanese. Even as the Executive Council of Australian Jewry (ECAJ) urged the Coalition to push for amendments rather than oppose the bill outright next week, the opposition leader, Sussan Ley, called the prime minister’s plan “pretty unsalvageable” and suggested it did not adequately fight antisemitism or Islamic extremism. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/sussan-ley-coalition-criticises-labor-hate-speech-reforms-ntwnfb",
      "published": "Thu, 15 Jan 2026 06:18:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuelan opposition member Freddy Guevara talks about the future of his country",
      "description": "Freddy Guevara, former vice president of the Venezuelan Parliament and a member of the Venezuelan opposition, talks about what's next for his country.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5672484/venezuelan-opposition-member-freddy-guevara-talks-about-the-future-of-his-country",
      "published": "Thu, 15 Jan 2026 04:46:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Live: Macron delivers his New Year's address to the French army",
      "description": "French President Emmanuel Macron, commander-in-chief of the armed forces, on Thursday outlines his “guidelines for national defence” at the strategic air base in Istres, Bouches-du-Rhône. His speech is highly anticipated as France continues to seek approval for its 2026 budget amid rising geopolitical tensions and growing military needs. Watch live on FRANCE 24 at 12:30pm Paris time.",
      "url": "https://www.france24.com/en/france/20260115-live-macron-delivers-his-new-year-s-address-to-the-french-army",
      "published": "Thu, 15 Jan 2026 11:18:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "For Syria’s new rulers, Sunni clans hold the key to stability – and ending sectarian strife",
      "description": "Headed by a close ally of Syria’s President Ahmed al-Sharaa, the recently established Office of Tribes and Clans aims to ease tensions within the country’s Sunni majority, divided between former rebels, those who once sided with the Assad regime, and others in the ranks of the Kurdish-led Syrian Democratic Forces. FRANCE 24’s Wassim Nasr has gained exclusive access to a crucial link in the Syrian reconciliation process.",
      "url": "https://www.france24.com/en/middle-east/20260115-syria-sunni-clans-hold-key-to-stability-ending-sectarian-strife-sharaa",
      "published": "Thu, 15 Jan 2026 06:21:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump calls Venezuela’s interim president 'a terrific person' after phone call",
      "description": "US President Donald Trump has described a “great” conversation with Venezuela’s interim president Delcy Rodriguez, as Washington signals a willingness to work with the post-Maduro leadership while pressing for access to the country’s oil and continued political concessions.",
      "url": "https://www.france24.com/en/americas/20260114-trump-calls-venezuela-interim-president-terrific-person",
      "published": "Wed, 14 Jan 2026 23:02:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Russia expels British diplomat from Moscow embassy over spying claims",
      "description": "Russian authorities have ordered a British diplomat to leave the country, accusing the official of spying",
      "url": "https://abcnews.go.com/International/wireStory/russia-expels-british-diplomat-moscow-embassy-spying-claims-129233338",
      "published": "Thu, 15 Jan 2026 06:17:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Angry mob caught on camera hurling profanity, demands federal agents leave Minnesota Mexican restaurant",
      "description": "Federal agents were forced to leave a Minnesota restaurant Sunday after angry diners confronted them with expletives, demanding they exit amid rising tensions.",
      "url": "https://www.foxnews.com/us/angry-mob-caught-camera-hurling-profanity-demands-federal-agents-leave-minnesota-mexican-restaurant",
      "published": "Wed, 14 Jan 2026 18:01:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Japan's Prime Minister Takaichi plans to dissolve Parliament and call early election to strengthen coalition",
      "description": "Japan's first female Prime Minister, Sanae Takaichi, plans a snap election to capitalize on 70% approval ratings and strengthen her coalition majority.",
      "url": "https://www.foxnews.com/world/japans-prime-minister-takaichi-plans-dissolve-parliament-call-early-election-strengthen-coalition",
      "published": "Wed, 14 Jan 2026 19:56:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump told 'killing has stopped' in Iran after violent protest crackdown",
      "description": "The US president does not rule out military action in Iran, as Tehran temporarily shuts its airspace to nearly all flights.",
      "url": "https://www.bbc.com/news/articles/c07xpndjdd8o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 04:57:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Watch: Paraglider survives 500ft drop into ocean",
      "description": "The man's powered paraglider malfunctioned causing him to crash into the water off the coast of Palm Beach County, Florida.",
      "url": "https://www.bbc.com/news/videos/c3wz4v8xl8wo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 19:30:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Grim scene': BBC on site after crane collapses on train in Thailand",
      "description": "Correspondent Jonathan Head says the 'devastating' accident is an enormous setback for Thailand's efforts to modernise its infrastructure.",
      "url": "https://www.bbc.com/news/videos/cd7z8p0nq8jo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 13:24:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump vows 'very strong action' if Iran executes protesters",
      "description": "Relatives of 26-year-old Erfan Soltani, who was detained last week, have told BBC Persian he is due to be executed on Wednesday.",
      "url": "https://www.bbc.com/news/videos/c4g0d892p7go?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 09:00:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What message do Greenlanders have for Trump?",
      "description": "The BBC's Europe editor Katya Adler hears from Greenlanders, whose island is embroiled in a geopolitical storm.",
      "url": "https://www.bbc.com/news/videos/cr57v8y9r77o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 22:09:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Quebec premier François Legault resigns from post in surprise move",
      "description": "Legault’s abrupt resignation follows months of chaos that has rocked the governing Coalition Avenir Québec party Quebec ’s premier, François Legault, has announced his resignation as leader of the province, in an abrupt departure for the polarizing figure whose embattled government faces the prospects of an electoral wipeout in the coming months. Speaking at a hastily arranged press conference in Quebec City on Wednesday, Legault said he was proud to have founded the Coalition Avenir Québec (CAQ) party and won consecutive majority governments beginning in 2018 . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/quebec-premier-francois-legault-resigns",
      "published": "Wed, 14 Jan 2026 17:22:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. says second phase of Gaza ceasefire has begun, but major challenges remain",
      "description": "The White House says the ceasefire deal between Israel and Hamas is moving into its second phase, which includes the demilitarization of Gaza, a key point in President Trump's peace plan.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677315/u-s-says-second-phase-of-gaza-ceasefire-has-begun-but-major-challenges-remain",
      "published": "Thu, 15 Jan 2026 04:45:47 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran updates: Trump holds off on strikes after assurances",
      "description": "US President Donald Trump says Iran has halted killings and executions, citing assurances he received. Tehran denies plans for hangings as tensions remain high and airspace closures disrupt flights. Follow DW for more.",
      "url": "https://www.dw.com/en/iran-updates-trump-holds-off-on-strikes-after-assurances/live-75511404?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 07:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Why Iran's fate means more to oil markets than Venezuela's",
      "description": "While markets appeared barely fazed by the fate of Venezuela's oil industry, they are considerably more nervous about the potential impact of internal unrest and foreign escalation when it comes to Iran. Rightly so?",
      "url": "https://www.dw.com/en/why-iran-s-fate-means-more-to-oil-markets-than-venezuela-s/a-75507250?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fact check: AI fakes and old videos mislead on Iran protests",
      "description": "Iran's protests face an information blackout, fueling a surge of AI-generated videos and recycled footage online. DW Fact check investigates how disinformation thrives when truth is hard to verify.",
      "url": "https://www.dw.com/en/fact-check-ai-fakes-and-old-videos-mislead-on-iran-protests/a-75504757?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: Bundestag president pushes changes to security",
      "description": "Drones, spies and extremists? Bundestag President Julia Klöckner sounds the alarm on security gaps threatening Germany’s democracy. Her proposals could hit the far-right AfD party the hardest.",
      "url": "https://www.dw.com/en/germany-bundestag-president-pushes-changes-to-security/a-75503530?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 16:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Musk's xAI limits Grok's capacity to generate sexualised images",
      "description": "Elon Musk's xAI says its Grok AI chatbot will be restricted from generating sexualised images of real people after it was used to create pictures of women and children in varying states of undress. Also in this edition: France's traditional Epiphany cake gets subsidised for Celiac disease sufferers.",
      "url": "https://www.france24.com/en/tv-shows/business/20260115-musk-s-xai-limits-grok-s-capacity-to-generate-sexualised-images",
      "published": "Thu, 15 Jan 2026 10:53:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran: Donald Trump says killings have halted after anti-government protests",
      "description": "US President Donald Trump said Wednesday that he’s been told \"on good authority\" that plans for executions in Iran have stopped. Tehran, on its end, has signaled fast trials and executions ahead in its crackdown on protesters. Story by Charlotte Hughes and Eliza Herbert.",
      "url": "https://www.france24.com/en/iran-donald-trump-says-killings-have-halted-after-anti-government-protests",
      "published": "Thu, 15 Jan 2026 09:31:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Phase two of Gaza peace plan will be complicated, protracted and unpredictable",
      "description": "America aims to maintain the momentum of the Gaza peace process, which is why Steve Witkoff ushered in the second phase of the ceasefire before the first had actually come to an end.",
      "url": "https://news.sky.com/story/phase-two-of-gaza-peace-plan-will-be-complicated-protracted-and-unpredictable-13494365",
      "published": "Wed, 14 Jan 2026 21:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "In Haiti’s storm-hit south, food vouchers restore choice and dignity for families",
      "description": "Standing outside a colourfully painted building in southeastern Haiti, at the entrance to a bustling shop called Gods Will Depot where bags of food are stacked to the ceiling, Ketia surveys the large pile of groceries she has selected for her family: a big sack of flour, packages of spaghetti, boxed milk, some bars of soap.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166757",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran protests instigated by Israel to distract from Gaza 'genocide,' Columbia professor claims",
      "description": "Columbia professor claims Israel allegedly orchestrating Iran protests with Mossad agents, citing former CIA director's social media post as evidence.",
      "url": "https://www.foxnews.com/us/iran-protests-instigated-by-israel-distract-from-gaza-genocide-columbia-professor-claims",
      "published": "Wed, 14 Jan 2026 12:31:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran allegedly airs 97 'coercive confessions' amid record-breaking North Korea-style internet blackout",
      "description": "The Iranian regime aired alleged forced confessions from handcuffed protesters during a record-breaking internet blackout lasting over 144 hours.",
      "url": "https://www.foxnews.com/world/iran-allegedly-airs-97-coercive-confessions-amid-record-breaking-north-korea-style-internet-blackout",
      "published": "Wed, 14 Jan 2026 18:30:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "France condemns Iran protest crackdown, weighs satellite internet aid amid blackout",
      "description": "France condemns Iran's violent crackdown on protests as Paris considers satellite communications support to help Iranians bypass internet blackout.",
      "url": "https://www.foxnews.com/world/france-condemns-iran-protest-crackdown-weighs-satellite-internet-aid-amid-blackout",
      "published": "Wed, 14 Jan 2026 15:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China reports record trillion-dollar trade surplus despite Trump tariffs",
      "description": "Results for 2025 risk further unsettling economies about China’s trade practices and overcapacity, and their own over-reliance on Chinese products China has reported a strong export run in 2025 with a record trillion-dollar surplus, as its producers brace for three more years of a Trump administration set on slowing the manufacturing powerhouse by shifting US orders to other markets. Beijing’s resilience to renewed tariff tensions since Donald Trump returned to the US presidency last January has emboldened Chinese firms to shift their focus to south-east Asia, Africa and Latin America to offset US duties. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/china-reports-record-trillion-dollar-trade-surplus-despite-trump-tariffs",
      "published": "Wed, 14 Jan 2026 04:50:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "'Fundamental disagreement' with US over Greenland remains",
      "description": "Danish and Greenlandic officials said they still have a “fundamental disagreement” with President Donald Trump over Greenland after meeting in Washington with Vice President JD Vance and Secretary of State Marco Rubio.",
      "url": "https://www.dw.com/en/fundamental-disagreement-with-us-over-greenland-remains/live-75504607?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 19:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US to suspend immigrant visa processing for 75 countries",
      "description": "The US is suspending the process for immigrant visas from 75 countries, the Department of State said on Wednesday.",
      "url": "https://news.sky.com/story/us-to-suspend-immigrant-visa-processing-for-75-countries-13494347",
      "published": "Wed, 14 Jan 2026 20:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "British Columbia ending its 3-year drug decriminalization pilot project",
      "description": "Canada’s Pacific coast province of British Columbia is ending its three-year experiment in decriminalizing possession of small amounts of drugs",
      "url": "https://abcnews.go.com/International/wireStory/british-columbia-ending-3-year-drug-decriminalization-pilot-129222631",
      "published": "Wed, 14 Jan 2026 18:09:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: UN independent investigators call for immediate release of all political prisoners",
      "description": "More than 100 political prisoners have been released in Venezuela, the Government announced on Monday, just over a week after the seizure and rendition of President Nicolás Maduro in Caracas by the United States.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166745",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Parents erupt into massive brawl during Catholic youth basketball game in Staten Island",
      "description": "Shocking footage shows parents erupting into violent brawl during Catholic youth basketball game in Staten Island, prompting new spectator rules.",
      "url": "https://www.foxnews.com/us/parents-erupt-massive-brawl-catholic-youth-basketball-game-staten-island",
      "published": "Wed, 14 Jan 2026 22:06:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Denmark and U.S. to form working group to talk about U.S. security concerns",
      "description": "After meeting with President Trump's top aides, Danish officials say they will form a working group to talk through U.S. security concerns about control of Greenland.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5677517/denmark-and-u-s-to-form-working-group-to-talk-about-u-s-security-concerns",
      "published": "Thu, 15 Jan 2026 04:46:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Iran updates: 'No plan' to hang people — foreign minister",
      "description": "Airlines have been diverting flights to avoid using Iranian and Iraqi airspace. Meanwhile, Iran's top diplomat denied any plans of hanging, amid earlier reports suggesting swift executions. Follow DW.",
      "url": "https://www.dw.com/en/iran-updates-no-plan-to-hang-people-foreign-minister/live-75498434?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 01:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Wikipedia at 25: Of collective knowledge and its fault lines",
      "description": "From utopian origins to AI-driven rivals, the \"people's encyclopedia\" has been shaped by debates over neutrality, expertise and the future of shared knowledge.",
      "url": "https://www.dw.com/en/wikipedia-at-25-of-collective-knowledge-and-its-fault-lines/a-75480616?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 16:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘Beyond GDP’ economists push for clearer metrics on wellbeing, sustainability",
      "description": "Top finance experts are meeting at UN Geneva this week to push for a radical shake up in the way economic growth is gauged, in response to concerns that GDP measurements provide little insight about progress on key sustainability targets that are vital to our survival.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166740",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Violent repeat offender accused of killing teacher as 911 call revealed her final moments: report",
      "description": "North Carolina teacher Zoe Welsh's final 911 call captured her alleged murder by repeat offender Ryan Camacho, who is accused of breaking into her Raleigh home.",
      "url": "https://www.foxnews.com/us/violent-repeat-offender-accused-killing-teacher-911-call-revealed-her-final-moments-report",
      "published": "Wed, 14 Jan 2026 16:12:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting president touts ‘new political moment,’ hints at further release of political prisoners",
      "description": "Venezuela's new leadership hints at additional prisoner releases amid political transition, with hundreds of detainees reportedly still in custody.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-president-touts-new-political-moment-hints-further-release-political-prisoners",
      "published": "Wed, 14 Jan 2026 19:12:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Secret room to be built at Chinese embassy near cable lines, sparking widespread espionage fears",
      "description": "Unredacted plans for China's new London embassy reveal secret underground chamber near cables, sparking espionage concerns among UK security experts.",
      "url": "https://www.foxnews.com/world/secret-room-built-chinese-embassy-near-cable-lines-sparking-widespread-espionage-fears",
      "published": "Tue, 13 Jan 2026 19:21:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump to discuss Venezuela’s future with Machado after Maduro’s capture",
      "description": "Venezuelan opposition leader and Nobel prize winner had been sidelined by White House after US seized Maduro Donald Trump will host María Corina Machado , the Venezuelan opposition leader and 2025 Nobel peace prize winner, at the White House on Thursday for a high-stakes talks on the oil-rich nation’s future following the US capture of Nicolás Maduro . Many in Venezuela and abroad had expected Machado to take charge after an elite US military team seized Maduro in a pre-dawn raid on 3 January and transported him to a New York City jail . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/15/trump-maria-corina-machado-venezuela",
      "published": "Thu, 15 Jan 2026 11:07:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "From behind bars, Aung San Suu Kyi casts a long shadow over Myanmar",
      "description": "The democracy campaigner has spent 20 years in total in detention, five of them since being overthrown by a coup.",
      "url": "https://www.bbc.com/news/articles/c3r197we875o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 23:01:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Singapore's opposition leader stripped of title after conviction for lying",
      "description": "Singh, who was convicted for lying to MPs, has always maintained his innocence.",
      "url": "https://www.bbc.com/news/articles/cp80217r1kpo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 08:59:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Widespread delays hit Uganda election amid internet shutdown",
      "description": "The election is a rematch between Bobi Wine and Yoweri Museveni, who has been president for 40 years.",
      "url": "https://www.bbc.com/news/articles/cx2xn1yvgr4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 10:36:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US launches phase two of Gaza peace plan with new technocratic government",
      "description": "It includes the establishment of a technocratic Palestinian government, as well as the reconstruction and demilitarisation of Gaza, US envoy Steve Witkoff says.",
      "url": "https://www.bbc.com/news/articles/cjw1nxe5pvlo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 20:50:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "She's offered to share her Nobel with Trump. But what might Machado ask for in return?",
      "description": "Venezuela's opposition leader will meet with US President Donald Trump at the White House on Thursday.",
      "url": "https://www.bbc.com/news/articles/c801p8jppv5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 09:42:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why the UAE has incurred the wrath of Somalia",
      "description": "The government in Mogadishu has accused the UAE of undermining its sovereignty.",
      "url": "https://www.bbc.com/news/articles/c99k4jxz0ndo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 00:27:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Labubu toy manufacturer exploited workers, labour group claims",
      "description": "Investigators allege that a factory making Pop Mart products neglected staff safety and welfare.",
      "url": "https://www.bbc.com/news/articles/cn4037v0w12o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 15 Jan 2026 05:36:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU-Latin America trade deal: Who wins?",
      "description": "The EU and the Mercosur trading bloc of five Latin American nations seal a sweeping trade pact.",
      "url": "https://www.aljazeera.com/video/counting-the-cost/2026/1/15/eu-latin-america-trade-deal-who-wins-2?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 10:35:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan, Philippines sign new defence pacts amid surging China tensions",
      "description": "One deal allows the tax-free provision of ammunition, fuel and other supplies when their forces stage joint training.",
      "url": "https://www.aljazeera.com/news/2026/1/15/japan-philippines-sign-new-defence-pacts-amid-surging-china-tensions?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 09:18:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump suspends immigrant visas for 75 countries: Who’s affected?",
      "description": "The suspension will take effect on January 21 but does not apply to visitors or short-term visa holders.",
      "url": "https://www.aljazeera.com/news/2026/1/15/trump-suspends-immigrant-visas-for-75-countries-whos-affected?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 08:49:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Musk’s Grok to bar users from generating sexual images of real people",
      "description": "The billionaire's platform has been inundated with Grok-produced sexualised images, including of children.",
      "url": "https://www.aljazeera.com/news/2026/1/15/musks-grok-to-bar-users-from-generating-sexual-images-of-real-people?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 08:47:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Morocco and Senegal celebrate advancing to the AFCON final showdown",
      "description": "Senegal will now face host nation Morocco in the final, following Morocco's penalty shootout triumph over Nigeria.",
      "url": "https://www.aljazeera.com/gallery/2026/1/15/morocco-and-senegal-celebrate-advancing-to-the-afcon-final-showdown?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 08:02:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fans celebrate as AFCON hosts Morocco reach final",
      "description": "Africa Cup of Nations hosts Morocco secured their place in the final with a 4–2 penalty shootout victory over Nigeria.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/15/fans-celebrate-as-afcon-hosts-morocco-reach-final?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 07:33:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syrian army tells civilians to evacuate new front with SDF east of Aleppo",
      "description": "A 'humanitarian zone' is expected to remain open on Thursday, allowing residents to leave Deir Hafer and Maskana.",
      "url": "https://www.aljazeera.com/news/2026/1/15/syrian-army-tells-civilians-to-evacuate-new-front-with-sdf-east-of-aleppo?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 07:04:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian writers’ festival apologises to Palestinian author after boycott",
      "description": "Randa Abdel-Fattah said she accepts the board's apology and will consider invitation to participate in 2027 event.",
      "url": "https://www.aljazeera.com/news/2026/1/15/australian-writers-festival-apologises-to-palestinian-author-after-boycott?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 06:51:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian Open tennis 2026: Key dates, draw, top seeds, prize money",
      "description": "Who are the favourites? Will there be another Sincaraz final? Will Djokovic play? Al Jazeera has the answers.",
      "url": "https://www.aljazeera.com/sports/2026/1/15/australian-open-tennis-2026-key-dates-draw-top-seeds-prize-money?traffic_source=rss",
      "published": "Thu, 15 Jan 2026 06:25:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jewish American columnist Thomas Friedman says he was uninvited from 2024 Adelaide writers’ week over ‘timing’",
      "description": "Claim comes after former festival board member Tony Berg accused Louise Adler and Randa Abdel-Fattah of ‘hypocrisy’ in their accusations of repressing freedom of speech Get our breaking news email , free app or daily news podcast A New York Times columnist at the centre of a second controversy engulfing Adelaide writers’ week has said he was uninvited from the event in 2024. Thomas Friedman, who is Jewish, confirmed to Nine newspapers on Thursday that after he agreed to appear in a video link session, he was subsequently notified “that the timing would not work out”. Continue reading...",
      "url": "https://www.theguardian.com/culture/2026/jan/15/jewish-american-columnist-thomas-friedman-says-he-was-uninvited-from-2024-adelaide-writers-week-ntwnfb",
      "published": "Thu, 15 Jan 2026 06:36:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland to boost the Arctic island's security",
      "description": "Troops from several European countries, including France, Germany, Norway and Sweden, are arriving in Greenland after talks between Denmark, Greenland and the U.S. on Wednesday highlighted disagreement.",
      "url": "https://www.npr.org/2026/01/15/g-s1-106113/european-troops-arrive-greenland",
      "published": "Thu, 15 Jan 2026 05:26:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda goes to the polls amid heavy security and internet blackout",
      "description": "Ugandans are voting in a tense presidential election as 81-year-old President Yoweri Museveni seeks to extend his four-decade rule amid an internet shutdown and heavy military deployment.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5675906/uganda-election-museveni-bobi-wine",
      "published": "Thu, 15 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What Teddy Roosevelt has to do with Trump's moves in Venezuela and Greenland",
      "description": "Presidents James Monroe and Theodore Roosevelt helped shape a policy that rationalizes U.S. intervention in Latin America and elsewhere. But Trump has brought that idea to a whole new level.",
      "url": "https://www.npr.org/2026/01/15/nx-s1-5675874/trump-monroe-doctrine-roosevelt-latin-america-intervention",
      "published": "Thu, 15 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Julio Iglesias accused of sexual assault as Spanish prosecutors study the allegations",
      "description": "Spanish prosecutors are studying allegations that Grammy-winning singer Julio Iglesias sexually assaulted two former employees at his residences in the Dominican Republic and the Bahamas.",
      "url": "https://www.npr.org/2026/01/15/g-s1-106108/julio-iglesias-accused-sexual-assault",
      "published": "Thu, 15 Jan 2026 02:46:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How are Iranians accessing the internet despite government efforts?",
      "description": "Iranians are using Starlink to get online during the government's near-total internet shutdown.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5676308/how-are-iranians-accessing-the-internet-despite-government-efforts",
      "published": "Wed, 14 Jan 2026 16:07:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German military personnel set to arrive in Greenland",
      "description": "The German reconnaissance team is among the groups of European military personnel who are scheduled to arrive in Greenland on Thursday.",
      "url": "https://www.dw.com/en/german-military-personnel-set-to-arrive-in-greenland/a-75514480?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Women poised to take India sports to the next level",
      "description": "India has been experiencing major growth in women's sports in recent years. This is being fuelled by investment from both the public and private sector – as well as many role models.",
      "url": "https://www.dw.com/en/women-poised-to-take-india-sports-to-the-next-level/a-75506901?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Economy narrowly avoids 3rd year of recession",
      "description": "Germany's GDP grew 0.2% in 2025, ending a run of two consecutive years of recession, new figures show. The justice minister wants to combat the misuse of AI to create sexualized images. DW has more",
      "url": "https://www.dw.com/en/germany-news-economy-narrowly-avoids-3rd-year-of-recession/live-75513024?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 09:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tense Uganda goes to vote amid internet blackout",
      "description": "Ugandans lined up outside polling stations and encountered delays amid technical difficulties, after a repressive campaign saw hundreds of supporters of President Museveni's opponent arrested.",
      "url": "https://www.dw.com/en/tense-uganda-goes-to-vote-amid-internet-blackout/a-75511408?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 15 Jan 2026 06:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump hails call with Venezuela's 'terrific' interim leader",
      "description": "The US president said he had a \"great\" conversation with Delcy Rodriguez, who described her first call with Trump as \"productive and courteous.\"",
      "url": "https://www.dw.com/en/trump-hails-call-with-venezuela-s-terrific-interim-leader/a-75510622?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 23:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tech-savvy Mykhailo Fedorov is Ukraine's new defense minister",
      "description": "Ukrainian President Volodymyr Zelenskyy aims to boost Ukraine's defense capabilities through technology by appointing Mykhailo Fedorov as the new defense minister. What do experts say?",
      "url": "https://www.dw.com/en/tech-savvy-mykhailo-fedorov-is-ukraine-s-new-defense-minister/a-75491995?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 17:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NATO allies move troops to Greenland in European military mission",
      "description": "Troops from several European countries, including France, Germany, Norway and Sweden, are arriving in Greenland to help boost the Arctic island's security after talks between representatives of Denmark, Greenland and the US on Wednesday highlighted “fundamental disagreement” between the Trump administration and European allies. Details by FRANCE 24 Brussels correspondent, Dave Keating.",
      "url": "https://www.france24.com/en/nato-allies-move-troops-to-greenland-in-european-military-mission",
      "published": "Thu, 15 Jan 2026 10:29:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandans vote amid internet blackout and police repression",
      "description": "Ugandans head to the polls on Thursday for presidential elections with President Yoweri Museveni seeking to extend his 40 years in power amid repression and internet blackouts.",
      "url": "https://www.france24.com/en/africa/20260115-ugandans-vote-amid-internet-blackout-and-police-repression",
      "published": "Thu, 15 Jan 2026 07:40:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Morocco beat Nigeria on penalties to reach first AFCON final since 2004",
      "description": "Morocco's dream of an AFCON home victory is still alive. Achraf Hakimi's side beat Nigeria on penalties in the semi-finals (0-0, 4-2 on penalties) to set up a thrilling final against Senegal. Morocco are aiming to win their first continental title since 1976, while Senegal return to the final for the third time in seven years.",
      "url": "https://www.france24.com/en/tv-shows/sports/20260115-morocco-beat-nigeria-on-penalties-to-reach-first-afcon-final-since-2004",
      "published": "Thu, 15 Jan 2026 06:09:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Morocco edge Nigeria on penalties to reach Africa Cup of Nations final",
      "description": "Morocco booked their place in the Africa Cup of Nations final after a dramatic penalty shootout saw them overcome Nigeria 4-2, following a goalless draw in a tense semi-final in Rabat.",
      "url": "https://www.france24.com/en/sport/20260115-morocco-defeats-nigeria-reach-arica-cup-of-nations-final",
      "published": "Thu, 15 Jan 2026 00:03:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "British activists banned from France over 'destruction' of small boats",
      "description": "Ten British \"far-right activists\" have been banned from France for \"reconnaissance and destruction activities\" against small boats used in migrant crossings.",
      "url": "https://news.sky.com/story/ten-british-far-right-activists-banned-from-france-over-reconnaissance-and-destruction-against-small-boats-13494191",
      "published": "Wed, 14 Jan 2026 16:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Inquiry launched into Latin pop legend Julio Iglesias over allegations of sexual assault",
      "description": "Spanish prosecutors are investigating allegations that singer Julio Iglesias sexually assaulted two former employees in the Caribbean.",
      "url": "https://news.sky.com/story/inquiry-launched-into-latin-pop-legend-julio-iglesias-over-allegations-of-sexual-assault-13494227",
      "published": "Wed, 14 Jan 2026 14:02:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European troops arrive in Greenland as talks with US highlight 'disagreement'",
      "description": "Troops from NATO countries, including France and Germany, are arriving in Greenland to boost security",
      "url": "https://abcnews.go.com/International/wireStory/european-troops-arrive-greenland-talks-us-highlight-disagreement-129233667",
      "published": "Thu, 15 Jan 2026 06:14:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Voting begins in Uganda’s presidential election during internet shutdown",
      "description": "Voting has opened in Uganda’s presidential election",
      "url": "https://abcnews.go.com/International/wireStory/voting-begins-ugandas-presidential-election-internet-shutdown-polling-129231347",
      "published": "Thu, 15 Jan 2026 02:33:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Voting begins in Uganda’s presidential election during internet shutdown and delays",
      "description": "Voting begins in Uganda’s presidential election during internet shutdown and delays",
      "url": "https://abcnews.go.com/International/wireStory/voting-begins-ugandas-presidential-election-internet-shutdown-delays-129230986",
      "published": "Thu, 15 Jan 2026 01:49:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan and the Philippines sign a new defense pact as they face Chinese aggression",
      "description": "Japan and the Philippines have signed a defense pact that will allow the tax-free provision of ammunition, fuel, food and other necessities when their forces stage joint training to boost deterrence against China’s growing aggression in the region and ...",
      "url": "https://abcnews.go.com/International/wireStory/japan-philippines-sign-new-defense-pact-face-growing-129228533",
      "published": "Thu, 15 Jan 2026 02:43:20 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Activist in Costa Rica denies plotting to assassinate the president",
      "description": "A Costa Rican activist and government critic accused of plotting to kill President Rodrigo Chaves says that the allegations were ridiculous and politically motivated",
      "url": "https://abcnews.go.com/International/wireStory/activist-costa-rica-denies-plotting-assassinate-president-129218200",
      "published": "Wed, 14 Jan 2026 15:53:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela's acting president vows to continue releasing prisoners detained under Maduro",
      "description": "Venezuela’s acting President Delcy Rodríguez vows to continue releasing prisoners detained under former President Nicolás Maduro",
      "url": "https://abcnews.go.com/International/wireStory/venezuelas-acting-president-vows-continue-releasing-prisoners-detained-129211691",
      "published": "Wed, 14 Jan 2026 21:30:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU targets Ukraine's military needs with massive new loan program plus billions in budget support",
      "description": "The European Union plans to allocate most of a new loan program to Ukraine's military needs over the next two years",
      "url": "https://abcnews.go.com/International/wireStory/eu-targets-ukraines-military-massive-new-loan-program-129199681",
      "published": "Wed, 14 Jan 2026 08:50:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian Prime Minister Mark Carney arrives in Beijing for a landmark four-day visit to China",
      "description": "Canadian Prime Minister Mark Carney arrives in Beijing for a landmark four-day visit to China",
      "url": "https://abcnews.go.com/International/wireStory/canadian-prime-minister-mark-carney-arrives-beijing-landmark-129198253",
      "published": "Wed, 14 Jan 2026 08:17:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France bans British far-right activists targeting migrant boats",
      "description": "Ten members of a British far-right group have been banned from entering France where they have been accused of destroying small boats used by migrants trying to reach the UK",
      "url": "https://abcnews.go.com/International/wireStory/france-bans-british-activists-targeting-migrant-boats-129196155",
      "published": "Wed, 14 Jan 2026 07:14:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's Takaichi plans to dissolve lower house to set up an early snap election",
      "description": "Japan's Prime Minister Sanae Takaichi plans to dissolve the lower house of Parliament soon for a snap election to seek the public's mandate for her policies",
      "url": "https://abcnews.go.com/International/wireStory/japans-takaichi-plans-dissolve-lower-house-set-early-129195029",
      "published": "Wed, 14 Jan 2026 08:01:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The UK is watering down plans for mandatory digital ID cards after a backlash",
      "description": "The British government has scaled back plans for mandatory digital ID cards, initially proposed as a way of helping control immigration",
      "url": "https://abcnews.go.com/International/wireStory/uk-watering-plans-mandatory-digital-id-cards-after-129194786",
      "published": "Wed, 14 Jan 2026 04:31:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Serbians mark Orthodox Christian New Year according to old tradition",
      "description": "Nearly two weeks after celebrating New Year, many Serbians did it again on Tuesday evening, this time according to old Orthodox Christian tradition",
      "url": "https://abcnews.go.com/International/wireStory/serbians-mark-orthodox-christian-new-year-tradition-129194533",
      "published": "Wed, 14 Jan 2026 04:09:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan voters face soldiers in the street and internet shutdown before election",
      "description": "Ugandans are set to vote in an election for president and other leaders",
      "url": "https://abcnews.go.com/International/wireStory/ugandan-voters-face-soldiers-street-internet-shutdown-presidential-129193873",
      "published": "Wed, 14 Jan 2026 03:46:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Private jet skids 300 yards off Colorado runway, sustains severe damage in violent crosswind",
      "description": "A private jet was violently thrown off a Colorado runway by brutal crosswinds, skidding 300 yards with damage. All three aboard escaped injury in Telluride.",
      "url": "https://www.foxnews.com/us/private-jet-skids-300-yards-colorado-runway-sustains-severe-damage-violent-crosswind",
      "published": "Wed, 14 Jan 2026 21:01:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "University researcher accused of calling for assassination of conservative voices in social media post",
      "description": "University of Washington is investigating a researcher who allegedly posted comments calling for the assassination of conservative voices, sparking controversy.",
      "url": "https://www.foxnews.com/us/university-researcher-accused-calling-assassination-conservative-voices-social-media-post",
      "published": "Wed, 14 Jan 2026 18:39:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portland officer reassigned after video surfaces with comments about Renee Nicole Good: 'Criminals get shot'",
      "description": "Portland police officer reassigned after video purportedly shows him making comments about Renee Nicole Good, saying at one point, \"Sometimes criminals get shot.\"",
      "url": "https://www.foxnews.com/us/portland-officer-reassigned-video-surfaces-comments-renee-nicole-good-criminals-get-shot",
      "published": "Wed, 14 Jan 2026 14:20:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Some US military personnel told to leave Middle East bases, US official confirms",
      "description": "The U.S. has ordered some of its military personnel to depart from bases in the Middle East on Tuesday as tensions with Iran escalate.",
      "url": "https://www.foxnews.com/world/some-us-military-personnel-told-leave-middle-east-bases-us-official-confirms",
      "published": "Wed, 14 Jan 2026 09:31:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Passengers baffled and confused after screams burst from beneath taxiing Air Canada plane",
      "description": "Passengers aboard a taxiing Air Canada flight were left shaken after muffled screams and banging were suddenly heard from beneath the cabin.",
      "url": "https://www.foxnews.com/world/passengers-baffled-confused-screams-burst-taxiing-air-canada-plane",
      "published": "Tue, 13 Jan 2026 22:03:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}