{
  "last_updated": "2026-01-13T22:23:36.971189Z",
  "event_count": 222,
  "events": [
    {
      "title": "Security Council LIVE: Attacks against Ukrainian civilians unacceptable, unjustifiable and must stop, says UN",
      "description": "The UN Security Council is meeting in emergency session in New York over Russia’s ongoing deadly missile and drone strikes targeting Ukrainian civilians and energy infrastructure, as frigid winter conditions grip the war-torn country. Millions have been deprived of electricity, heating and water. The UN Secretary-General has called the stepped up attacks an unacceptable violation of international humanitarian law. Follow live below and find all our in-depth meetings coverage here. UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166743",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Quarter of developing countries poorer than in 2019, World Bank finds",
      "description": "Global growth ‘downshifted’ since Covid pandemic and sub-Saharan Africa particularly affected, report says Business live – latest updates A quarter of countries in the developing world are poorer than they were in 2019 before the Covid pandemic, the World Bank has found. The Washington-based organisation said a large group of low-income countries, many in sub-Saharan Africa, had suffered a negative shock in the six years to the end of last year. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/13/developing-countries-poorer-world-bank-report",
      "published": "Tue, 13 Jan 2026 14:30:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "In Sudan & Iran, digital shutdown 'masks atrocities against civilians protesting for basic freedoms'",
      "description": "As Iran’s violent crackdown intensifies, amid unprecedented sociopolitical and economic uprisings nationwide, François Picard welcomes Alp Toker, Director of NetBlocks. Mr. Toker describes a sophisticated campaign by Iranian authorities to block all digital communications, a strategic move to crush dissent and control the national and global narrative. Analysts, journalists, and human rights organizations estimate that the death toll from the regime’s ruthless crackdown could range from 2,000 to upwards of 20,000 Iranian citizens.",
      "url": "https://www.france24.com/en/video/20260113-in-sudan-iran-digital-shutdown-masks-atrocities-against-civilians-protesting-for-basic-freedoms-1",
      "published": "Tue, 13 Jan 2026 20:08:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s other Latin American feud: why Colombia’s Petro is not Maduro",
      "description": "Leftwing leader rallies his supporters as US president accuses him of drug trafficking and threatens military action A leftwing South American firebrand calls for his followers to rally in public squares nationwide to defend his country’s sovereignty and decry verbal attacks from Donald Trump. The US president accuses the leader of personally flooding American streets with illegal drugs and imposes sanctions against him and his wife. Threats of military action are followed by a phone conversation between the two leaders. One might imagine that this is a description of the buildup of tensions that led to the 3 January special forces raid on Caracas to capture the Venezuelan leader, Nicolás Maduro, and his wife, Cilia Flores, to face several criminal charges in New York. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/12/trump-latin-america-feud-colombia-gustavo-petro",
      "published": "Mon, 12 Jan 2026 12:07:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Ending famine, refugee solidarity in Kenya, Ukraine civilian casualties update",
      "description": "The head of the UN’s emergency food agency has urged world leaders on Monday to end “man-made famines” and conflicts that “drive hunger and desperation”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166744",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Displaced Palestinians weather deadly winds, extreme cold in tents",
      "description": "At least six people were killed after heavy rain flooded tents and collapsed homes sheltering displaced Gazan families.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/displaced-palestinians-weather-deadly-winds-extreme-cold-in-tents?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 18:52:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Two weeks on, questions linger over targeting and impact of US airstrikes in Nigeria",
      "description": "Very little information has been shared about strikes in Sokoto state Two weeks after the US carried out Christmas Day airstrikes in north-west Nigeria on what it described as Islamic State fighters, questions remain over the specific group that was targeted and the operation’s impact. In the aftermath of the strikes, Donald Trump said in a post on his Truth Social platform that “ISIS Terrorist Scum in Northwest Nigeria , who have been targeting and viciously killing, primarily, innocent Christians” were hit with “numerous perfect strikes”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/questions-targeting-impact-us-airstrikes-in-nigeria",
      "published": "Thu, 08 Jan 2026 05:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: Limited internet returns, but no chat or comments",
      "description": "In Iran, limited international internet access is affecting nearly 90 million people and severely limiting information coming out of the country, as authorities imposed one of the most extensive nationwide shutdowns in recent years amid widespread protests.",
      "url": "https://www.france24.com/en/video/20260113-iran-limited-internet-returns-but-no-chat-or-comments",
      "published": "Tue, 13 Jan 2026 18:33:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "US gives terrorist designation to Muslim Brotherhood in Egypt, Lebanon, Jordan",
      "description": "The US on Tuesday designated the Egyptian, Lebanese and Jordanian chapters of the Muslim Brotherhood as terrorist organisations, accusing them of \"violence and destabilisation\".",
      "url": "https://www.france24.com/en/middle-east/20260113-us-gives-terrorist-designation-muslim-brotherhood-in-egypt-lebanon-jordan",
      "published": "Tue, 13 Jan 2026 16:37:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "US plan to exploit Venezuela’s oil could eat up 13% of carbon budget to keep 1.5C limit",
      "description": "Exclusive: ClimatePartner analysis shows how move would risk plunging Earth further into climate catastrophe US plans to exploit Venezuela’s oil reserves could by 2050 consume more than a tenth of the world’s remaining carbon budget to limit global heating to 1.5C, according to an exclusive analysis. The calculation highlights how any moves to further exploit the South American nation’s oil reserves – the largest in the world, at least on paper – would put increasing pressure on climate goals, and risk plunging the Earth further into climate catastrophe. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/12/us-plan-to-exploit-venezuelas-oil-could-eat-up-13-of-carbon-budget-to-keep-15c-limit",
      "published": "Mon, 12 Jan 2026 17:38:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Australia news live: taking guns from ‘law-abiding citizens’ not the ‘appropriate response’ to Bondi tragedy, Bridget McKenzie says",
      "description": "Shadow infrastructure minister says she is concerned there is not enough time to work through hate speech and gun reform legislation. Follow live Get our breaking news email , free app or daily news podcast Bridget McKenzie concerned there’s not enough time to work through hate speech and gun reform legislation Bridget McKenzie , the shadow minister for infrastructure, said she is concerned there is not enough time to work through upcoming legislation on hate speech and gun reforms after the Bondi terror attack. Those pieces of legislation were subjected to long and lengthy and appropriate scrutiny by the parliament, by the broader community, by the experts, so that we, as a parliament, could get it right … Unfortunately, the prime minister has chosen to play politics with this bill. He’s lumped migration changes in with the management of firearms and obviously in with hate speech laws. So there’s a lot to unpack and not enough time before we debate it to actually get those opinions from the experts. It was right and appropriate that we as an opposition seek to work with the government to call a royal commission to actually bring parliament back to move motions of condolence and support for our, particularly our Jewish community … But when it comes to a piece of legislation, that should go through the appropriate processes of parliament so that we can get it right. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/14/adelaide-festival-writers-week-lousie-adler-politics-reaction-peter-malinauskas-victoria-bushfires-queensland-floods-anthony-albanese-labor-sussan-ley-coalition-ntwnfb",
      "published": "Tue, 13 Jan 2026 22:03:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's Khamenei issues direct warning to United States in Russian-language posts",
      "description": "Iran's Supreme Leader Ali Khamenei issues warning to U.S. in Russian on social media, signaling Tehran's growing alignment with Moscow amid nationwide protests.",
      "url": "https://www.foxnews.com/world/irans-khamenei-issues-direct-warning-united-states-russian-language-posts",
      "published": "Mon, 12 Jan 2026 12:35:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "People in Iran describe heavy security and some damage in first calls to outside world",
      "description": "Iranians made phone calls abroad for the first time in days Tuesday after authorities severed communications during a crackdown on nationwide protests that activists say killed at least 646 people.",
      "url": "https://www.npr.org/2026/01/13/g-s1-105832/iran-first-calls-outside-world",
      "published": "Tue, 13 Jan 2026 03:09:55 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Minnesota protesters square off with ICE after deadly shooting",
      "description": "Protesters in Minneapolis, Minnesota confronted federal agents days after an ICE agent fatally shot Renee Nicole Good.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/minnesota-protesters-square-off-with-ice-after-deadly-shooting?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 21:23:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "At least 2,000 protesters killed in Iran, with footage suggesting summary executions",
      "description": "The death toll from nationwide protests in Iran spiked January 12 to at least 2,000 people killed, activists say. With the Internet down in Iran, gauging the demonstrations from abroad has grown more difficult. The Associated Press has been unable to independently assess the toll. Iran’s government hasn’t offered overall casualty figures. FRANCE 24's Ershad Alijani, journalist at the Observers' desk, tells us more about their findings.",
      "url": "https://www.france24.com/en/at-least-2-000-protesters-killed-in-iran-with-footage-suggesting-summary-executions",
      "published": "Tue, 13 Jan 2026 14:57:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Carney heads to Beijing as Trump’s America First agenda forces Canada into trade rethink",
      "description": "Canada’s PM seeks to smooth over past ructions in relationship with China as trade war takes its toll During the final stretch of Canada’s spring election campaign, Mark Carney told a debate audience that China was the country’s “biggest geopolitical risk”. He pointed to its attempts to meddle in elections and its recent efforts to disrupt Canada’s Arctic claims. When Carney’s government plane touches down in Beijing this week, it will be the first time a Canadian prime minister has been welcomed in nearly a decade. The trip, undertaken amid the rupturing of global economic and political alliances , reflects a desire by Ottawa to mend a broken relationship with a global superpower that uses its vast and lucrative market to both woo and punish countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/12/carney-heads-to-beijing-as-trump-america-first-agenda-forces-canada-into-trade-rethink",
      "published": "Mon, 12 Jan 2026 09:39:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Deaths overtake births in France for first time since World War II",
      "description": "More people died than were born in France last year for the first time since the end of World War II, official figures released on Tuesday indicated. France has long maintained comparatively high birthrates in the face of a widespread drop in the number of children being born across Europe and beyond.",
      "url": "https://www.france24.com/en/france/20260113-deaths-overtake-births-france-first-time-since-world-war-ii",
      "published": "Tue, 13 Jan 2026 15:05:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: A ceasefire that still kills children is not enough, says UNICEF",
      "description": "Airstrikes, drone attacks and hypothermia continue in Gaza despite the ceasefire, with more than 100 youngsters killed since early October, the UN Children’s Fund (UNICEF) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166750",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Storms worsen already dire humanitarian situation, UN warns",
      "description": "The humanitarian crisis across the Gaza Strip remains extremely serious, with harsh winter weather threatening to reverse recent gains in aid delivery, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166747",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘shocked’ by reports of excessive force against protesters in Iran",
      "description": "The UN Secretary-General is shocked by reports of violence and excessive use of force by Iranian authorities against protesters across the country, urging restraint and the immediate restoration of communications as unrest enters its third week.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166739",
      "published": "Sun, 11 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan war leaves millions hungry and displaced as health system nears collapse",
      "description": "Sudan’s protracted conflict has spiralled into one of the world’s most severe humanitarian crises, with hunger, displacement and the collapse of basic services exacting a daily toll on civilians.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166738",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "NSW government calls for rethink on capital gains tax discount to ease housing affordability",
      "description": "Federal parliamentary inquiry hears tax concessions undercut policies, including first home buyer assistance Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Generous capital gains tax rules have pushed up property prices and damaged housing affordability, the NSW government says, warning the discount benefits wealthy investors at the expense of first-time buyers. NSW Treasury has told a federal parliamentary inquiry into the 50% CGT discount that tax concessions including negative gearing “skew incentives towards property investment” and undercut policies, including first home buyer assistance. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/13/nsw-government-capital-gains-tax-discount-negative-gearing-australia-housing-affordability",
      "published": "Tue, 13 Jan 2026 14:00:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Korean prosecutors demand death penalty for ex-leader Yoon",
      "description": "South Korean prosecutors called on Tuesday for the death penalty to be handed down to former president Yoon Suk Yeol for his December 2024 declaration of martial law, which plunged the country into chaos. Yoon triggered a political crisis when he announced an end to civilian rule in December 2024 and sent troops to parliament to enforce it. FRANCE 24's Monte Francis reports.",
      "url": "https://www.france24.com/en/south-korean-prosecutors-demand-death-penalty-for-ex-leader-yoon",
      "published": "Tue, 13 Jan 2026 20:22:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN World Court begins landmark hearings on Rohingya genocide case against Myanmar",
      "description": "Public hearings opened on Monday at the International Court of Justice (ICJ) in a landmark case brought by the Gambia against Myanmar, alleging violations of the Genocide Convention over the military’s treatment of the Rohingya minority.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166746",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Repression in Uganda, fighting in Syria’s Aleppo continues, Gaza and West Bank updates",
      "description": "The UN has raised serious concerns ahead of Uganda’s elections scheduled for 15 January, warning they will take place in an environment marked by widespread repression, intimidation and shrinking civic space.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166735",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: Increase in abductions and sexual violence ‘unacceptable’",
      "description": "Despite reductions in the overall number of conflict-related incidents in South Sudan, a rise in abductions and sexual violence is concerning, the UN peacekeeping mission in the country, UNMISS, said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166734",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Tyler Robinson prosecutors say Charlie Kirk shooting texts show confusion, not bias, to rebut conflict claim",
      "description": "Accused Charlie Kirk assassin Tyler Robinson seeks to disqualify prosecutor whose child witnessed the fatal shooting at Utah Valley University campus.",
      "url": "https://www.foxnews.com/us/tyler-robinson-prosecutors-say-charlie-kirk-shooting-texts-show-confusion-not-bias-rebut-conflict-claim",
      "published": "Mon, 12 Jan 2026 19:25:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘Day of reckoning, retribution’ coming to Minnesota amid ICE outrage: Trump",
      "description": "US president issues latest threat to midwestern state, where protests have continued after ICE agent killed woman.",
      "url": "https://www.aljazeera.com/news/2026/1/13/day-of-reckoning-retribution-coming-to-minnesota-amid-ice-outrage-trump?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 18:18:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "US labels Muslim Brotherhood in Egypt, Lebanon, Jordan as ‘terrorists’",
      "description": "Egyptian Muslim Brotherhood official says group rejects US designation and 'pursue all legal avenues to challenge' it.",
      "url": "https://www.aljazeera.com/news/2026/1/13/us-labels-muslim-brotherhood-orgs-in-egypt-lebanon-jordan-as-terrorist?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 14:31:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Attempt to overturn the Gambia’s ban on FGM heard by supreme court",
      "description": "Case brought by Muslim leaders and MP follows failed 2024 bid and seen as part of global anti-women’s rights backlash A group of religious leaders and an MP in the Gambia have launched efforts to overturn a ban on female genital mutilation at the country’s supreme court. The court case, due to resume this month, comes after two babies bled to death after undergoing FGM in the Gambia last year. Almameh Gibba, an MP and one of the plaintiffs, tabled a bill to decriminalise FGM that was rejected by the country’s parliament in 2024. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/09/the-gambia-female-genital-mutilation-fgm-supreme-court-case-overturn-ban",
      "published": "Fri, 09 Jan 2026 06:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protests death toll tops 2,000, activists say, in worst upheaval since 1979 revolution",
      "description": "US-based activists said the death toll in the Iranian government's crackdown on the largest protest movement since the 1979 revolution had passed 2,000. While an enduring internet blackout has made it impossible to know the full scale of the violence, some Iranians have been able to report what they've seen via phone calls.",
      "url": "https://www.france24.com/en/asia-pacific/20260113-iran-protests-death-toll-tops-2-000-activists-say-in-worst-upheaval-since-1979-revolution",
      "published": "Tue, 13 Jan 2026 21:29:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian on trial in France in case that could help release of French hostages",
      "description": "With the situation tense over in Iran, one of the country's national's is facing justice here in France. Mahdieh Esfandiari, a professional translator, is on trial in Paris, facing accusations of promoting terrorism. Her case is being closely watched in Tehran, where two French nationals have been detained since 2022. With Esfan-diari's trial now underway, the pair's release could be on the horizon, depending on the outcome.",
      "url": "https://www.france24.com/en/iranian-on-trial-in-france-in-case-that-could-help-release-of-french-hostages",
      "published": "Tue, 13 Jan 2026 15:01:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "What to know about the Muslim Brotherhood after the US terrorist designation",
      "description": "The Trump administration has designated the Lebanese, Jordanian and Egyptian chapters of the Muslim Brotherhood as terrorist organizations",
      "url": "https://abcnews.go.com/International/wireStory/muslim-brotherhood-after-us-terrorist-designation-129171305",
      "published": "Tue, 13 Jan 2026 12:18:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: ‘The killing of peaceful demonstrators must stop,’ UN rights chief says",
      "description": "As anti-government demonstrations continue across Iran, the UN human rights chief said on Tuesday that he was horrified at the mounting violence directed by security forces against protestors, with reports of hundreds killed and thousands arrested.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166752",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump admin labels Muslim Brotherhood branches as terrorist organizations",
      "description": "The U.S. designates the Lebanese, Jordanian and Egyptian chapters of the Muslim Brotherhood as terrorist organizations, saying they pose risks to the U.S.",
      "url": "https://www.foxnews.com/world/trump-admin-labels-muslim-brotherhood-branches-terrorist-organizations",
      "published": "Tue, 13 Jan 2026 11:13:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump tells Iranian protesters 'help is on its way' and cancels talks with officials",
      "description": "US President Donald Trump said on January 13 he’s cancelled talks with Iranian officials amid a protest crackdown, telling Iranian citizens “help is on its way.” Trump did not offer any details about what the help would entail, but it comes after the Republican president earlier said Iran wants to negotiate with Washington after his threat to strike the Islamic Republic that has killed more than 2,000, according to human right monitors. FRANCE 24's Kethevane Gorjestani tells us more.",
      "url": "https://www.france24.com/en/trump-tells-iranian-protesters-help-is-on-its-way-and-cancels-talks-with-officials",
      "published": "Tue, 13 Jan 2026 15:45:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Verifying protests and deaths in Iran - amid brutal crackdown and internet shutdown",
      "description": "Footage posted today on social media shows protesters gathered on the streets of the city of Marvdasht in the southern Iranian Fars province, as a fire burns in the background.",
      "url": "https://news.sky.com/story/number-of-iranian-dead-passes-2000-as-protests-continue-13493859",
      "published": "Tue, 13 Jan 2026 16:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine war: UN appeals for $2.3 billion to support aid teams’ ‘heroic work’",
      "description": "Amid ongoing and intensifying Russian attacks across Ukraine, the UN on Tuesday launched a $2.3 billion humanitarian appeal for 2026 to support 4.1 million of the country’s most vulnerable people.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166749",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Deadly Russian strikes push civilians deeper into winter crisis",
      "description": "Ukraine has entered the new year under intensifying and deadly Russian attacks which have crippled energy systems and left millions without heating, electricity or water amid freezing temperatures, senior UN officials told the Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166748",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Germany: Gelsenkirchen bank thieves used 'manipulated' door",
      "description": "Police say a manipulated emergency exit, that shouldn't open from the outside, gave thieves access in last month's major bank heist in Gelsenkirchen. They warned customers that investigations would likely take months.",
      "url": "https://www.dw.com/en/germany-gelsenkirchen-bank-thieves-used-manipulated-door/a-75489784?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 16:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran’s ‘distinctive’ drone deployment sees death toll soar amid violent protests",
      "description": "Iran allegedly deploys drones amid nationwide protests as Human Rights Activists News Agency reports at least 544 confirmed deaths and over 10,000 arrests.",
      "url": "https://www.foxnews.com/world/irans-distinctive-drone-deployment-sees-death-toll-soar-amid-violent-protests",
      "published": "Sun, 11 Jan 2026 21:08:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Netanyahu and Rubio discuss US military intervention in Iran amid ongoing nationwide protests: report",
      "description": "Israeli Prime Minister Benjamin Netanyahu and U.S. Secretary of State Marco Rubio spoke as Israel goes on high alert and Iran faces mounting anti-regime protests.",
      "url": "https://www.foxnews.com/world/netanyahu-rubio-discuss-us-military-intervention-iran-amid-ongoing-nationwide-protests-report",
      "published": "Sun, 11 Jan 2026 04:32:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "China pressing European countries to bar Taiwan politicians or face crossing a ‘red line’",
      "description": "Exclusive: Chinese officials are using a ‘highly specific’ interpretation of EU rules to suggest Taiwanese figures should not be granted visas, officials say Chinese officials have been pushing “legal advice” on European countries, saying their own border laws require them to ban entry to Taiwanese politicians, according to more than half a dozen diplomats and officials familiar with the matter. The officials made demarches to European embassies in Beijing, or through local embassies directly to European governments in their capital cities, warning the European countries not to “trample on China’s red lines”, according to the European diplomats and ministries who spoke to the Guardian. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/china-europe-pressure-block-taiwanese-politicians-visas",
      "published": "Tue, 13 Jan 2026 01:26:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Coal power generation falls in China and India for first time since 1970s",
      "description": "‘Historic’ moment in biggest coal-consuming countries could bring decline in global emissions, analysis says Coal power generation fell in China and India for the first time since the 1970s last year, in a “historic” moment that could bring a decline in global emissions, according to analysis. The simultaneous fall in coal-powered electricity in the world’s biggest coal-consuming countries had not happened since 1973, according to analysts at the Centre for Research on Energy and Clean Air, and was driven by a record roll-out of clean energy projects. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/13/coal-power-generation-falls-china-india-since-1970s",
      "published": "Tue, 13 Jan 2026 00:01:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Four people killed in Gaza after walls collapse on tents during strong winds - health officials",
      "description": "Four people have been killed in Gaza after walls collapsed on to tents during strong winds and rainfall, hospital authorities have said.",
      "url": "https://news.sky.com/story/four-people-killed-in-gaza-after-walls-collapse-on-tents-during-strong-winds-hospital-authorities-say-13493740",
      "published": "Tue, 13 Jan 2026 13:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iranians able to make some international calls as internet remains blocked amid protests",
      "description": "Iranians could make phone calls abroad after a communications blackout during a crackdown on anti-regime protests, but internet and text messaging remain restricted.",
      "url": "https://www.foxnews.com/world/iranians-able-make-some-international-calls-internet-remains-blocked-amid-protests",
      "published": "Tue, 13 Jan 2026 03:24:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Family dog rescued after chewing battery-powered heated glove, sparking house fire",
      "description": "A dog was rescued from a house fire after accidentally starting the blaze by chewing a battery-powered glove, Ottawa authorities said. No injuries were reported.",
      "url": "https://www.foxnews.com/world/family-dog-rescued-after-chewing-battery-powered-heated-glove-sparking-house-fire",
      "published": "Mon, 12 Jan 2026 11:29:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran at geopolitical crossroads as protests pressure regime",
      "description": "The Islamic Republic is a key player in the Middle East, with close ties to Russia and China. As the regime in Tehran comes under fire, DW looks at Iran's place on the global stage.",
      "url": "https://www.dw.com/en/iran-at-geopolitical-crossroads-as-protests-pressure-regime/a-75492953?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 16:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Fact-finding mission urges Iran to end protest violence and restore internet",
      "description": "The UN-mandated independent human rights fact-finding mission on Iran has urged authorities to immediately restore internet access and halt the violent crackdown of the ongoing, nationwide protest.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166737",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran state TV acknowledges 'a lot of martyrs' as death toll surpasses 3,000: report",
      "description": "Iran state TV reportedly acknowledges 'martyrs' as death toll from ongoing anti-government protests reaches over 2,000, according to activist groups.",
      "url": "https://www.foxnews.com/world/iran-state-tv-acknowledges-a-lot-martyrs-death-toll-surpasses-3000-report",
      "published": "Tue, 13 Jan 2026 13:56:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "As Trump urges deal, Cuban president warns that the country will defend itself 'to the last drop of blood'",
      "description": "As Trump pressured Cuba to strike a deal, Cuban President Miguel Díaz-Canel Bermúdez asserted that the country will defend itself \"to the last drop of blood.\"",
      "url": "https://www.foxnews.com/world/trump-urges-deal-cuban-president-warns-country-defend-itself-to-last-drop-blood",
      "published": "Mon, 12 Jan 2026 05:59:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump administration ends temporary protected status for Somalis in US",
      "description": "Noem claims conditions have improved in east African country so Somalis no longer qualify for legal protections The Trump administration is terminating temporary protected status (TPS) for Somalis living in the United States, giving hundreds of people two months to leave the country or face deportation. The homeland security secretary, Kristi Noem , said in a statement that conditions in the east African country had improved sufficiently and that Somalis no longer qualified for the designation under federal law. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/13/trump-administration-ends-tps-somalia",
      "published": "Tue, 13 Jan 2026 15:31:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump continues to threaten military action against Iran",
      "description": "Amid a deadly crackdown on protesters in Iran, President Trump continues to threaten military action against Tehran and warned countries that do business with Iran that he could impose a tariff.",
      "url": "https://www.npr.org/2026/01/13/nx-s1-5674819/trump-continues-to-threaten-military-action-against-iran",
      "published": "Tue, 13 Jan 2026 06:51:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "As Australia burns, locals learn to adapt",
      "description": "Another Australian summer, another spate of catastrophic wildfires. As DW's Stuart Braun watched the flames rip through Victoria in recent days, he says the response has been very different to those in the past.",
      "url": "https://www.dw.com/en/as-australia-burns-locals-learn-to-adapt/a-75486064?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 13:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iran says 'ready for war' as Trump weighs strikes",
      "description": "US ⁠President Donald Trump urged Iranians on Tuesday to keep protesting and said help was on the way, without giving details. The US-based Human Rights Activists News Agency said Tuesday that at least 2,000 people have died in the ongoing protests in Iran and brutal government crackdown.",
      "url": "https://www.france24.com/en/video/20260113-iran-says-ready-for-war-as-trump-weighs-strikes-1",
      "published": "Tue, 13 Jan 2026 16:50:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Uganda's military deployed in national capital ahead of upcoming presidential election",
      "description": "Uganda President Yoweri Museveni and his opponents have held their final rallies ahead of the country's next election",
      "url": "https://abcnews.go.com/International/wireStory/ugandas-military-deployed-national-capital-ahead-upcoming-presidential-129160978",
      "published": "Tue, 13 Jan 2026 08:25:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Russia launches another major attack on Ukraine's power grid and other sites, 4 dead",
      "description": "Russia has launched another major drone and missile attack on Ukraine that targeted the country's power grid",
      "url": "https://abcnews.go.com/International/wireStory/russia-launches-major-attack-ukraines-power-grid-sites-129157015",
      "published": "Tue, 13 Jan 2026 07:02:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Increase taxes on sugary drinks and alcohol to save lives, urges WHO",
      "description": "Beverages like sugary drinks and alcohol are too accessible and cost too little in most of the world – helping fuel obesity, diabetes, cancer and injury, the World Health Organization (WHO) warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166754",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "At the heart of change: Spotlight Initiative highlights breakthroughs in tackling gender-based violence",
      "description": "When it comes to protecting women and girls from gender-based violence, change happens when they are “at the heart of every decision,” according to Erin Kenny, Global Coordinator of the Spotlight Initiative a United Nations–European Union partnership aimed at tackling all forms of abuse against women and girls.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166721",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Florida sheriff Grady Judd fires off warning to gangsters after 'Sex, Money, Murder' kingpin taken down",
      "description": "Gang leader Hernando Thompson convicted on 17 felony counts including racketeering, faces up to five life sentences in Florida \"Sex, Money, Murder\" case.",
      "url": "https://www.foxnews.com/us/florida-sheriff-grady-judd-fires-off-warning-gangsters-after-sex-money-murder-kingpin-taken-down",
      "published": "Tue, 13 Jan 2026 09:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iranian ambassador summoned over country's response to protests",
      "description": "Yvette Cooper has confirmed the government has summoned the Iranian ambassador in a statement to the Commons.",
      "url": "https://news.sky.com/story/iranian-ambassador-summoned-over-countrys-response-to-protests-13493754",
      "published": "Tue, 13 Jan 2026 15:05:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "'He was shot in the heart... many of his friends are dead': Family's shock over teen's death in Iran",
      "description": "In a large warehouse on the outskirts of Tehran, the floor is covered in dozens - or possibly hundreds - of black plastic body bags.",
      "url": "https://news.sky.com/story/he-was-shot-in-the-heart-the-teen-victims-of-irans-ruthless-crackdown-13493544",
      "published": "Mon, 12 Jan 2026 21:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Landslide in eastern Congo kills at least 13, leaves over 30 missing",
      "description": "A landslide in eastern Congo has killed at least 13 people and left over 30 missing",
      "url": "https://abcnews.go.com/International/wireStory/landslide-eastern-congo-kills-13-leaves-30-missing-129164104",
      "published": "Tue, 13 Jan 2026 09:45:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "More than 2,000 people reported killed at Iran protests as Trump says 'help is on its way'",
      "description": "A US-based rights group says it has confirmed the killing of 1,850 protesters during a crackdown by authorities, as the US president urges Iranians to keep demonstrating.",
      "url": "https://www.bbc.com/news/articles/cr57vmznmd9o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 21:16:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Bowen: Authoritarian regimes die gradually then suddenly, but Iran is not there yet",
      "description": "The regime's opponents will hope for more pressure to accelerate the process, writes the BBC's international editor.",
      "url": "https://www.bbc.com/news/articles/cedwgn4pqv4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 16:47:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Korean prosecutors demand death penalty for former president Yoon Suk Yeol",
      "description": "Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol",
      "published": "Tue, 13 Jan 2026 16:29:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Malaysia blocks Elon Musk’s Grok AI over fake, sexualised images",
      "description": "Country follows Indonesia in restricting access after global outcry over X’s AI tool Malaysia has become the second country to temporarily block access to Elon Musk’s Grok after a global outcry over the AI tool and its ability to produce fake, sexualised images. Malaysia said it would restrict access to Grok until effective safeguards were implemented, a day after similar action was taken by Indonesia. Continue reading...",
      "url": "https://www.theguardian.com/technology/2026/jan/12/malaysia-blocks-elon-musk-grok-ai-fake-sexualised-images-indonesia-x-chatbot",
      "published": "Mon, 12 Jan 2026 12:12:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "UN International Court of Justice to hear 1st genocide case in over a decade",
      "description": "The United Nations International Court of Justice is hearing a genocide case for the first time in more than a decade. The case is focused on the persecution of Rohingya Muslims in Myanmar.",
      "url": "https://www.npr.org/2026/01/13/nx-s1-5675142/un-international-court-of-justice-to-hear-1st-genocide-case-in-over-a-decade",
      "published": "Tue, 13 Jan 2026 06:50:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Dozens of people killed in ferry boat accident in northern Mali",
      "description": "Residents and local officials in northern Mali say a ferry boat trying to land at a Niger River town in the Timbuktu region hit stones and sank in an accident that left dozens of people dead",
      "url": "https://abcnews.go.com/International/wireStory/dozens-people-killed-ferry-boat-accident-northern-mali-129182553",
      "published": "Tue, 13 Jan 2026 16:49:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "What the US withdrawal from UN bodies could mean for climate, trade and development",
      "description": "The United States’ intention to withdraw from a host of UN bodies announced this week targets programmes and initiatives focusing on a wide range of crucial areas, including the climate crisis, trade, gender and development.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166736",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Fireworks-wielding agitators clash with federal agents outside Minneapolis federal building",
      "description": "Federal agents deployed tear gas and rubber bullets against Minneapolis protesters after snowballs were allegedly thrown at vehicles, authorities said.",
      "url": "https://www.foxnews.com/us/federal-agents-deploy-tear-gas-rubber-bullets-protesters-outside-minneapolis-federal-building",
      "published": "Tue, 13 Jan 2026 09:22:21 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump admin exit from UN, international organizations raises question of who’s next",
      "description": "U.S. officials say more international organizations could face future cuts after withdrawing from 66 groups, with U.N. agencies potentially targeted next.",
      "url": "https://www.foxnews.com/world/trump-admin-exit-from-un-international-organizations-raises-question-whos-next",
      "published": "Tue, 13 Jan 2026 12:39:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran set to hang protester in what would mark first execution tied to anti-regime demonstrations",
      "description": "Iran is reportedly set to execute its first protester linked to mass arrests over the widespread anti-regime demonstrations. More than 500 people were also killed in the crackdown.",
      "url": "https://www.foxnews.com/world/iran-set-hang-protester-what-would-mark-first-execution-tied-anti-regime-demonstrations",
      "published": "Mon, 12 Jan 2026 21:28:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "World central bank chiefs 'stand in solidarity' with US Fed chair Powell",
      "description": "Eleven central banks have backed Jerome Powell after the US launched a criminal investigation into the US Fed.",
      "url": "https://www.bbc.com/news/articles/c041dp0z95yo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 14:30:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Workers at Chinese factory that produces Labubu toys are being exploited, says NGO",
      "description": "Exclusive: China Labor Watch says people aged 16-18 employed without required special protections A labour rights NGO says it has found evidence of worker exploitation in the supply chain of Labubus, the furry toys that took the world by storm last year and which are expected to continue to grow in popularity in 2026. Labubus, toothy gremlins made by the Chinese toy company Pop Mart, have become one of China’s hottest cultural exports. In the first half of 2025 alone, “the Monsters” line of toys, which includes Labubus, generated 4.8bn yuan (£511m) in sales for the Hong Kong-listed company. In August, Pop Mart’s chief executive, Wang Ning, said the company was on track to reach 20bn yuan in revenues in 2025. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/workers-at-chinese-factory-that-produces-labubu-toys-are-being-exploited-says-ngo",
      "published": "Tue, 13 Jan 2026 09:55:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "'Little appetite for regime change’: Trump offers 'help' for Iran's protesters, but what can he do?",
      "description": "US President Donald Trump told Iranian protesters on Tuesday that “help is on its way” as he weighed options to punish Tehran for its brutal crackdown. As the threat of military action looms, analysts say Trump's inclination for one-off strikes means he is unlikely to push for the regime change craved by many protesters.",
      "url": "https://www.france24.com/en/asia-pacific/20260113-trump-tells-iran-protesters-help-on-its-way-weighs-military-strikes",
      "published": "Tue, 13 Jan 2026 17:49:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Five severed heads found hanging on Ecuador beach amid escalating gang clashes",
      "description": "Ecuador gang violence escalates as five severed heads discovered on tourist beach in Puerto Lopez, highlighting country's record homicide rate amid military crackdown.",
      "url": "https://www.foxnews.com/world/five-severed-heads-found-hanging-tourist-beach-ecuador-amid-escalating-gang-massacre-violence",
      "published": "Sun, 11 Jan 2026 22:45:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Key questions for FBI investigators to unpick in Minneapolis shooting",
      "description": "Officials will examine video footage and policy guidelines as part of the investigation, experts told the BBC.",
      "url": "https://www.bbc.com/news/articles/cvgnvqrxl0xo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 03:17:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "South Korea prosecutors seek death penalty for ex-President Yoon",
      "description": "Prosecutors say Yoon, who was impeached over a failed 2024 martial law declaration, threatened 'constitutional order'.",
      "url": "https://www.aljazeera.com/news/2026/1/13/south-korea-prosecutors-seek-death-penalty-for-ex-president-yoon?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 20:09:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump says Iran protest death toll too high",
      "description": "US President Donald Trump said the death toll from protests in Iran is too high.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/trump-says-iran-protest-death-toll-too-high?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 19:47:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Can EU exert more pressure on Iran with sanctions?",
      "description": "The European Union is contemplating more sanctions against Iran amid a deadly crackdown on anti-government protests that has killed thousands. But could the bloc apply more pressure on the Islamic Republic's regime?",
      "url": "https://www.dw.com/en/can-eu-exert-more-pressure-on-iran-with-sanctions/a-75484027?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 21:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Germany news: 2 men charged with planning attacks for Russia",
      "description": "Two Ukrainians have been accused of planning sabotage attacks for Russian spy services. Meanwhile, Germany's foreign minister has played down the US threat to Greenland.",
      "url": "https://www.dw.com/en/germany-news-2-men-charged-with-planning-attacks-for-russia/live-75481448?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 15:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Kazakhstan oil output plunges as Ukrainian drones strike Russia",
      "description": "Kyiv's attacks on Russian oil terminals and refineries may damage their enemy, but they are also having an impact on other economies such as Kazakhstan's and risk alienating allies.",
      "url": "https://www.dw.com/en/kazakhstan-oil-output-plunges-as-ukrainian-drones-strike-russia/a-75455865?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 15:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'We choose Denmark' over the US, Greenland’s PM says",
      "description": "Greenlandic Prime Minister Jens-Frederik Nielsen said the Arctic territory was facing a \"geopolitical crisis\" as Trump threatens to take it over. Denmark's Mette Frederiksen condemned \"unacceptable pressure\" from the US.",
      "url": "https://www.dw.com/en/we-choose-denmark-over-the-us-greenland-s-pm-says/a-75493398?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 14:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump tells Iranian protesters 'help is on its way'",
      "description": "US President Donald Trump called upon demonstrators in Iran to \"keep protesting\" against state institutions. Trump has previously threatened to intervene in response to the crackdown meted out on protesters. DW has more.",
      "url": "https://www.dw.com/en/trump-tells-iranian-protesters-help-is-on-its-way/live-75483027?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 09:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump to lead largest ever US delegation to Davos",
      "description": "President Donald Trump will attend the World Economic Forum in Davos next week as head of the largest ever US delegation to attend the annual meeting, including five cabinet members, and a host of congressional representatives and state governors.",
      "url": "https://news.sky.com/story/trump-to-lead-largest-ever-us-delegation-to-davos-13493791",
      "published": "Tue, 13 Jan 2026 14:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russian ship captain in court accused of 'grossly negligent' behaviour over North Sea crash",
      "description": "A Russian ship captain has been accused in court of \"grossly negligent conduct\" after a fatal collision with an oil tanker near the Humber Estuary last year.",
      "url": "https://news.sky.com/story/russian-ship-captain-accused-in-court-of-grossly-negligent-behaviour-leading-to-entirely-avoidable-death-of-crew-member-13493804",
      "published": "Tue, 13 Jan 2026 14:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "A sculptor, a teenage footballer and a hairdresser: Here are the stories of some of those killed in Iran protests",
      "description": "A sculptor, a promising teenage footballer and a hairdresser with tens of thousands of followers on Instagram are among at least 2,000 people killed in two weeks of protests in Iran.",
      "url": "https://news.sky.com/story/a-sculptor-a-teenage-footballer-and-a-hairdresser-here-are-the-stories-of-some-of-those-killed-in-iran-protests-13493798",
      "published": "Tue, 13 Jan 2026 18:48:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iranian student shot in head at close range amid protests, body buried along roadside",
      "description": "Iranian student Rubina Aminian was shot in the head at close range, joining thousands allegedly killed by government forces, according to Iran Human Rights, a Norway-based group.",
      "url": "https://www.foxnews.com/world/iranian-student-shot-head-close-range-amid-protests-body-buried-along-roadside",
      "published": "Tue, 13 Jan 2026 17:16:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Cuba’s president defiant, says no negotiations scheduled as Trump moves to choke off oil lifeline",
      "description": "Cuba rejects Trump's deal demands as Venezuelan oil lifeline ends. President Díaz-Canel says no negotiations with Washington despite energy crisis threats.",
      "url": "https://www.foxnews.com/world/cubas-president-defiant-says-no-negotiations-scheduled-trump-moves-choke-oil-lifeline",
      "published": "Mon, 12 Jan 2026 21:55:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "US opens new air defense operations cell at Qatar base that Iran targeted in retaliatory attack",
      "description": "U.S. opens new air defense cell at Al Udeid Air Base in Qatar amid Iran tensions, enhancing regional missile defense cooperation across Middle East.",
      "url": "https://www.foxnews.com/world/us-opens-new-air-defense-operations-cell-qatar-base-iran-targeted-retaliatory-attack",
      "published": "Tue, 13 Jan 2026 11:02:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens to block ExxonMobil from Venezuela after CEO calls country ‘uninvestable’",
      "description": "US president says company is ‘playing too cute’ after CEO responds sceptically to his push for oil investment after deposing Nicolás Maduro Donald Trump has said he might block ExxonMobil from investing in Venezuela after the oil company’s chief executive called the country “uninvestable” during a White House meeting last week. Darren Woods told the US president that Venezuela would need to change its laws before it could be an attractive investment opportunity, during the high-profile meeting on Friday with at least 17 other oil executives. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/12/donald-trump-threatens-block-exxonmobil-venezuela",
      "published": "Mon, 12 Jan 2026 03:11:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Australian author Craig Silvey charged with possessing and distributing child exploitation material",
      "description": "Jasper Jones and Runt writer charged after search warrant issued at his Fremantle home on Monday Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Prominent Australian author Craig Silvey has been charged with possessing and distributing child exploitation material. Silvey, 43, had a search warrant issued at his Fremantle home on Monday, 12 January, where detectives allegedly found him “actively engaging with other child exploitation offenders online”. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/13/australian-author-craig-silvey-charged-child-exploitation-ntwnfb",
      "published": "Tue, 13 Jan 2026 11:35:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Turkish Cypriots: The EU's invisible Europeans",
      "description": "The unresolved Cyprus problem leaves Turkish Cypriots in a state of limbo within the European Union, without full EU rights, recognition or political certainty and economically and diplomatically isolated.",
      "url": "https://www.dw.com/en/turkish-cypriots-the-eu-s-invisible-europeans/a-75493865?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 15:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Russian investigators launch criminal case after nine babies die at Siberian maternity hospital",
      "description": "Russian authorities have opened a criminal investigation into a Siberian maternity hospital where nine babies died over the country’s New Year holidays, officials said Tuesday",
      "url": "https://abcnews.go.com/International/wireStory/russian-investigators-launch-criminal-case-after-babies-die-129165238",
      "published": "Tue, 13 Jan 2026 09:53:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US frackers were already facing a global oil supply glut. Trump’s Venezuelan dream could make it worse",
      "description": "Picture is as murky as a barrel of oil, with US companies in 2026 expecting their first production drop in four years US shale-oil producers were already contending with oil prices at four-year lows. News that they may soon face a significant competitor in their back yard probably wasn’t how frackers wanted to greet 2026. The US capture of Venezuela’s President Nicolás Maduro and his wife, Cilia Flores, hit the share prices of independent shale-oil producers, such as Diamondback Energy and Devon Energy, last week. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/12/us-oil-producers-global-supply-glut-venezuela",
      "published": "Mon, 12 Jan 2026 11:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'Fly, Wild Swans' is Jung Chang's painfully personal tribute to her mother",
      "description": "A historian of modern China, Jung Chang turns the lens back on herself in her newest book to understand how she sees the world and why she writes about China today.",
      "url": "https://www.npr.org/2026/01/13/g-s1-99142/fly-wild-swans-jung-chang-review-china",
      "published": "Tue, 13 Jan 2026 05:03:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Clintons refuse to testify in Epstein probe as Republicans threaten contempt charges",
      "description": "Bill and Hillary Clinton have refused to testify in a Republican-controlled congressional committee's investigation into convicted sex trafficker Jeffrey Epstein, accusing Republican chair James Comer of leading a partisan campaign against them.",
      "url": "https://www.france24.com/en/americas/20260113-clintons-refuse-testify-epstein-probe-as-republicans-threaten-contempt-charges",
      "published": "Tue, 13 Jan 2026 17:28:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Artist Kathia St Hilaire's deceptively delicate visions of chaos and resistance",
      "description": "Her intricately layered artwork uses metal, rubber, canvas and printmaking to create scenes of oppression, trauma and renewal. As she stages her first major exhibition in Paris, Kathia St Hilaire joins us to talk about weaving her Haitian ancestry into her pieces, how Vodun practices inspire her work and why the late Haitian poet Frankétienne is a kindred spirit when it comes to his cyclical vision of a chaotic world.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260113-artist-kathia-st-hilaire-s-deceptively-delicate-visions-of-chaos-and-resistance",
      "published": "Tue, 13 Jan 2026 15:33:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds in Venezuela come forward to say their loved ones are 'political prisoners'",
      "description": "Edilson Torres was set to be buried in his hometown after dying in a Venezuelan prison",
      "url": "https://abcnews.go.com/International/wireStory/hundreds-venezuela-forward-loved-political-prisoners-129167859",
      "published": "Tue, 13 Jan 2026 10:51:07 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump set to lead largest-ever US delegation to World Economic Forum in Davos next week",
      "description": "Organizers of the World Economic Forum say that U.S. President Donald Trump will return to the group's annual meeting of business, political and cultural elites in Davos, Switzerland next week, leading a record-large U.S. delegation for the event",
      "url": "https://abcnews.go.com/International/wireStory/trump-set-lead-largest-us-delegation-world-economic-129164203",
      "published": "Tue, 13 Jan 2026 09:45:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran protests spark regime survival question as exiled dissident says it feels like a ‘revolution’",
      "description": "Iran faces unprecedented protests as citizens unite around overthrowing the Islamic Republic, marking the most serious threat to the regime since 1979.",
      "url": "https://www.foxnews.com/world/iran-protests-spark-regime-survival-question-exiled-dissident-says-feels-like-revolution",
      "published": "Tue, 13 Jan 2026 06:52:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Prosecutors seek death penalty for ex-South Korean president Yoon",
      "description": "Yoon is accused of leading an insurrection when he tried to impose martial law in 2024.",
      "url": "https://www.bbc.com/news/articles/cq6vyqq5r0do?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 17:39:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Controversial Dilbert cartoonist Scott Adams dies aged 68",
      "description": "His ex-wife announced his death on Tuesday during a live stream of his podcast.",
      "url": "https://www.bbc.com/news/articles/c5y320k72vyo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 17:38:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Rubbish landslide death toll in Philippines rises to 11",
      "description": "The landslide occurred at the Binaliw landfill while more than 100 workers were on site.",
      "url": "https://www.bbc.com/news/articles/c9wxg4e09jzo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 04:03:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Cold weather and data centres drive up US greenhouse gas emissions",
      "description": "US emissions of planet-warming gases rise for the first time in three years.",
      "url": "https://www.bbc.com/news/articles/cj9r3832j47o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 11:40:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump to meet Venezuelan opposition leader Machado at the White House",
      "description": "Machado, the winner of 2025 Nobel Peace Prize, had offered to share the honour with Trump, an award the president has long coveted.",
      "url": "https://www.bbc.com/news/articles/cr7jzpr95yvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 20:51:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN chief warns he could refer Israel to ICJ over laws targetting UNRWA",
      "description": "In October 2024, Israel passed a law banning the agency for Palestinian refugees in Israel and occupied East Jerusalem.",
      "url": "https://www.aljazeera.com/news/2026/1/13/un-chief-warns-he-could-refer-israel-to-icj-over-laws-targetting-unrwa?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 22:08:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Clintons reject US Congress subpoena to testify in Epstein investigation",
      "description": "Former US president and former secretary of state accuse Republicans of seeking to 'harass and embarrass' with probe.",
      "url": "https://www.aljazeera.com/news/2026/1/13/clintons-reject-us-congress-subpoena-to-testify-in-epstein-investigation?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 21:30:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death",
      "description": "Lawyers for Adichie and her husband serve Euracare hospital with legal notice after death of 21-month-old The Nigerian author Chimamanda Ngozi Adichie has accused a Lagos hospital of negligence after the death of one of her 21-month-old twin boys. Nkanu Nnamdi died on 6 January after a brief illness. He was one of twin boys born to Adichie and Ivara Esege, a doctor, in 2024 by surrogacy, eight years after the birth of their first child, a girl. Continue reading...",
      "url": "https://www.theguardian.com/books/2026/jan/12/chimamanda-ngozi-adichie-accuses-lagos-hospital-negligence-son-death",
      "published": "Mon, 12 Jan 2026 14:26:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Apprehension in Denmark ahead of talks about Greenland with Vance",
      "description": "Leaders from Denmark and Greenland will meet with top U.S. officials in Washington on Wednesday to try to find a way out of a crisis caused by President Trump repeated demands to annex Greenland.",
      "url": "https://www.npr.org/2026/01/13/nx-s1-5675921/apprehension-in-denmark-ahead-of-talks-about-greenland-with-vance",
      "published": "Tue, 13 Jan 2026 17:17:21 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iran expert talks about the Trump administration's strategy with Iran",
      "description": "NPR's Steve Inskeep speaks with Iran expert Karim Sadjadpour about the U.S. strategy toward Iran and why he believes Iran's regime could collapse.",
      "url": "https://www.npr.org/2026/01/13/nx-s1-5674817/iran-expert-talks-about-the-trump-administrations-strategy-with-iran",
      "published": "Tue, 13 Jan 2026 06:50:58 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia: Writers' festival called off amid boycott",
      "description": "The Adelaide Writers' Week retracted an invitation to an Australian-Palestinian author, citing the the Bondi Beach attack. Dozens, including the event's director and the former PM of New Zealand, withdrew in response.",
      "url": "https://www.dw.com/en/australia-writers-festival-called-off-amid-boycott/a-75485050?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 12:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Tracking the ships delivering sanctioned Russian LNG to China",
      "description": "Since late August 2025, China has taken delivery of at least 24 liquefied natural gas (LNG) shipments from two sanctioned Russian facilities, Arctic LNG 2 and Portovaya. This underscores increased cooperation between China and Russia as the Kremlin seeks to boost LNG exports in order to fund its war in Ukraine.",
      "url": "https://www.france24.com/en/tv-shows/the-observers/20260113-tracking-ships-delivering-sanctioned-russian-lng-china",
      "published": "Tue, 13 Jan 2026 16:43:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Counsel seeks death sentence for ex-S. Korean leader Yoon over martial law imposition",
      "description": "A Seoul court says an independent counsel has demanded a death sentence for former South Korean President Yoon Suk Yeol",
      "url": "https://abcnews.go.com/International/wireStory/independent-counsel-seeks-death-sentence-south-korean-leader-129160208",
      "published": "Tue, 13 Jan 2026 09:32:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "College basketball player gunned down on Nashville freeway, police hunting for suspects",
      "description": "Tennessee basketball player Andre Bell, 20, was fatally shot on Nashville freeway while returning to Fisk University, police said. Suspect vehicle fled.",
      "url": "https://www.foxnews.com/us/college-basketball-player-gunned-nashville-freeway-police-hunting-suspects",
      "published": "Tue, 13 Jan 2026 15:58:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Afghan illegal immigrant who stabbed sister for being 'bad Muslim girl' arrested by ICE agents in New York",
      "description": "ICE arrested an Afghan illegal immigrant convicted of attempting to murder his teenage sister in 'honor' attack. Called her a 'bad Muslim girl' before stabbing her.",
      "url": "https://www.foxnews.com/us/afghan-illegal-immigrant-stabbed-sister-being-bad-muslim-girl-arrested-ice-agents-new-york",
      "published": "Tue, 13 Jan 2026 15:18:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ohio dentist double murder: Fmr police chief reveals ‘multitude’ of reasons ex-husband allegedly killed couple",
      "description": "Former police chief reveals why Ohio dentist's ex-husband allegedly killed couple. Michael McKee charged with murdering Spencer and Monique Tepe.",
      "url": "https://www.foxnews.com/us/ohio-dentist-double-murder-fmr-police-chief-reveals-multitude-reasons-ex-husband-allegedly-killed-couple",
      "published": "Tue, 13 Jan 2026 08:00:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Mom killed shielding kids after husband erupts in rage over NFL game: police",
      "description": "Florida mom Crystal Roure shot protecting children when husband Jason Kenney flew into rage over NFL game, police say. Roure died after telling son to call 911.",
      "url": "https://www.foxnews.com/us/mom-killed-shielding-kids-after-husband-erupts-rage-over-nfl-game-police",
      "published": "Mon, 12 Jan 2026 17:35:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Video: Greenland PM dodges question on Donald Trump rhetoric",
      "description": "Greenland PM Jens-Frederik Nielsen dodged a reporter’s question about US President Donald Trump's threats.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/video-greenland-pm-dodges-question-on-donald-trump-rhetoric?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 15:16:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Ten Sydney Harbours’ worth of threatened species habitat approved for destruction in 2025, report finds",
      "description": "ACF analysis finds amount of habitat approved by Albanese government for land-clearing hit a 15-year high last year Follow our Australia news live blog for latest updates Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here More than 57,000 hectares of threatened species habitat was approved for destruction by the Australian government in 2025 – the most in 15 years, according to analysis by the Australian Conservation Foundation. The ACF’s latest annual “extinction wrapped” report has revealed that the threatened species habitat greenlit for land clearing was about 10 times the size of Sydney Harbour – more than double the 2024 figure , and over five times the 10,426 hectares approved for razing in 2023 . Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/13/threatened-species-habitat-destruction-australia-15-year-high",
      "published": "Tue, 13 Jan 2026 19:38:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "'We choose Denmark,' says Greenland PM ahead of W. House talks",
      "description": "Greenland would choose to remain Danish over a US takeover, its leader said Tuesday, ahead of crunch White House talks on the future of the Arctic island which President Donald Trump has repeatedly threatened. FRANCE 24's Emerald Maxwell reports.",
      "url": "https://www.france24.com/en/we-choose-denmark-says-greenland-pm-ahead-of-w-house-talks",
      "published": "Tue, 13 Jan 2026 20:19:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian regime targeting Starlink users in bid to squash leaking protest footage",
      "description": "Iran's internet blockade fails to stop protest footage leaks via Starlink as authorities reportedly kill at least 646 demonstrators in ongoing crackdown.",
      "url": "https://www.foxnews.com/world/iranian-regime-targeting-starlink-users-bid-squash-leaking-protest-footage",
      "published": "Tue, 13 Jan 2026 08:33:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "UK targets Elon Musk’s X with fines and possible ban over Grok deepfake abuse",
      "description": "The U.K.'s communications regulator, Ofcom, launched a formal investigation into Elon Musk's X platform following reports of AI chatbot Grok creating illegal deepfake images.",
      "url": "https://www.foxnews.com/world/uk-targets-elon-musks-x-fines-possible-ban-over-grok-deepfake-abuse",
      "published": "Mon, 12 Jan 2026 17:30:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "We choose Denmark over US, Greenland's PM says",
      "description": "It is the strongest statement by a leader of the Danish territory since US President Donald Trump renewed plans to annex it.",
      "url": "https://www.bbc.com/news/articles/c4g3kw5ezepo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 22:03:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration moves to end deportation protection for Somalis",
      "description": "As the US cracks down on illegal immigration in Minneapolis, home to a large Somali community, it will end protections for many in the country legally.",
      "url": "https://www.bbc.com/news/articles/cz0p9ld5egjo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 16:43:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Niger revokes licences of tanker drivers who refuse to go to Mali amid jihadist blockade",
      "description": "Jihadists have been targeting tankers entering Mali, worsening the country’s fuel shortage.",
      "url": "https://www.bbc.com/news/articles/cr578g7v082o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 10:24:30 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "‘Last straw’: Somalia cuts UAE ties after Yemen separatist’s illegal entry",
      "description": "Somalia cuts UAE ties after Aidarous al-Zubaidi's illegal entry through Somaliland, exposing federal divisions.",
      "url": "https://www.aljazeera.com/news/2026/1/13/last-straw-somalia-cuts-uae-ties-after-yemen-separatists-illegal-entry?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 14:49:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Built on care and connection: How one Somali-British woman is strengthening diaspora communities",
      "description": "When her family moved from Somalia to London in the 1980s, Safia Jama watched women in her community help her mother navigate a new life in the UK — booking doctor’s appointments, enrolling children in school, and learning how to access everyday services in a new country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166725",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "LA County eyes 'ICE-free zones' on government property despite $1B in federal funding at risk",
      "description": "Los Angeles County considers creating \"ICE-free zones\" to block federal immigration enforcement operations, risking over $1 billion in federal funding.",
      "url": "https://www.foxnews.com/us/la-county-eyes-ice-free-zones-government-property-despite-1b-federal-funding-risk",
      "published": "Tue, 13 Jan 2026 13:45:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Affluent Virginia suburb rocked as trial begins for ex-federal agent husband in nanny love-triangle murders",
      "description": "Former IRS agent accused of orchestrating double murder with Brazilian au pair to hide affair. Trial begins in shocking Virginia criminal case.",
      "url": "https://www.foxnews.com/us/affluent-virginia-suburb-rocked-trial-begins-ex-federal-agent-husband-nanny-love-triangle-murders",
      "published": "Tue, 13 Jan 2026 07:00:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland's prime minister says 'we choose Denmark' over the US",
      "description": "Greenland's prime minister said if his territory had to choose between the United States and Denmark, it would choose Denmark, a report said.",
      "url": "https://www.foxnews.com/world/greenlands-prime-minister-says-we-choose-denmark-over-us",
      "published": "Tue, 13 Jan 2026 12:24:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump cancels US-Iran meetings, urges protesters to take over institutions",
      "description": "Donald Trump declares 'help is on the way' for Iranian protesters, again floats 'very strong actions' against Tehran.",
      "url": "https://www.aljazeera.com/news/2026/1/13/trump-cancels-iran-meetings-urges-protesters-to-take-over-institutions?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 16:48:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump announces new 25% tariff: How will it impact Iran’s trading partners?",
      "description": "US president threatens a 25 percent tariff on countries that do business with Iran as he piles pressure on Tehran.",
      "url": "https://www.aljazeera.com/news/2026/1/13/trump-announces-new-25-tariff-how-will-it-impact-irans-trading-partners?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 14:45:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "As Iran's protests continue, Israelis and Palestinians watch closely",
      "description": "There is broad support for the protests among Israeli officials, but Palestinians say they hope the Iranian regime stays in place and the protests die down soon.",
      "url": "https://www.npr.org/2026/01/13/g-s1-105849/iran-protests-israel-palestinian-reaction",
      "published": "Tue, 13 Jan 2026 10:47:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Elon Musk's X faces bans and investigations over nonconsensual bikini images",
      "description": "After the social media app's AI chatbot started generating sexualized images of women and children, two countries have blocked it and several more have launched investigations.",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5672579/grok-women-children-bikini-elon-musk",
      "published": "Mon, 12 Jan 2026 17:57:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Contempt threat after Clintons refuse Epstein testimony",
      "description": "Bill and Hillary Clinton have refused to comply with a Congressional subpoena to testify in a Jeffrey Epstein probe and could face contempt charges.",
      "url": "https://www.dw.com/en/contempt-threat-after-clintons-refuse-epstein-testimony/a-75496671?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 20:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran's communication blackout is 'more serious' than ever before, and this time, the restrictions may become permanent",
      "description": "Iran's communication blackout is \"more serious\" than ever before. Restrictions may last beyond the current protests, according to one expert.",
      "url": "https://www.dw.com/en/iran-s-communication-blackout-is-more-serious-than-ever-before-and-this-time-the-restrictions-may-become-permanent/a-75487555?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 14:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "X replaces Iran’s flag emoji to historic Lion and Sun flag in support of protests",
      "description": "Elon Musk’s social media platform X changed its Iranian flag emoji, from the current Islamic Republic flag - featuring a red emblem - to the historic pre-Revolution Lion and Sun symbol widely used by protesters of the regime. In Truth or Fake, Vedika Bahl goes through how this came to be, the online reactions, and how useful this could realistically be on the ground.",
      "url": "https://www.france24.com/en/tv-shows/truth-or-fake/20260113-x-replaces-iran-s-flag-emoji-to-historic-lion-and-sun-flag-in-support-of-protests",
      "published": "Tue, 13 Jan 2026 20:30:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Macron brandishing 'threat of dissolution' as budget talks resume, although 'unlikely'",
      "description": "Crucial budget talks are resuming in French parliament, as MPs have failed to secure the 2026 budget in time last year. President Emmanuel Macron has brandished the threat of dissolution in case parties can't compromise on the text, but in practice it is unlikely to happen. FRANCE 24's Angela Diffley tells us more about the inflammable political context in which these talks are taking place.",
      "url": "https://www.france24.com/en/macron-brandishing-threat-of-dissolution-as-budget-talks-resume-although-unlikely",
      "published": "Tue, 13 Jan 2026 15:47:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian protester faces 'imminent' execution, claims human rights group",
      "description": "A 26-year-old protester faces \"imminent\" execution in Iran after he was arrested in connection with anti-regime demonstrations, a human rights group has said.",
      "url": "https://news.sky.com/story/iranian-protester-faces-imminent-execution-claims-human-rights-group-13493858",
      "published": "Tue, 13 Jan 2026 16:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Red-Washing: How the media sanitizes a Marxist-Leninist revolutionary as a ‘preschool teacher’",
      "description": "Far-left consultants recommend protest groups \"lead with sympathetic characters.\" A Grand Rapids, Mich., socialist activist got just that with an arrested member rebranded a \"preschool teacher.\"",
      "url": "https://www.foxnews.com/us/how-media-sanitizes-marxist-leninist-revolutionary-preschool-teacher",
      "published": "Mon, 12 Jan 2026 17:35:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "NYC hospital accuses nurses’ union of seeking protections for workers arriving drunk, high as strike begins",
      "description": "Historic nurses strike hits NYC as 15,000 workers walk off. Hospitals accuse union of unreasonable demands including protections for impaired staff.",
      "url": "https://www.foxnews.com/us/nyc-hospital-accuses-nurses-union-seeking-protections-workers-arriving-drunk-high-strike-begins",
      "published": "Mon, 12 Jan 2026 17:21:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Former Navy SEAL convicted for trying to harm police with explosives during California 'No Kings' protests",
      "description": "Former Navy SEAL convicted of transporting explosives with the intent to harm law enforcement officers at California \"No Kings\" protests.",
      "url": "https://www.foxnews.com/us/former-navy-seal-convicted-trying-harm-police-explosives-during-la-no-kings-protest",
      "published": "Mon, 12 Jan 2026 15:03:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US hostages in Iran face heightened risk as protests spread, experts say number held may exceed estimates",
      "description": "Iran's systematic hostage-taking policy targets American citizens as political leverage, with experts calling for automatic sanctions and consequences to combat the regime's strategy.",
      "url": "https://www.foxnews.com/world/us-hostages-iran-face-heightened-risk-protests-spread-experts-say-number-held-may-exceed-estimates",
      "published": "Mon, 12 Jan 2026 10:00:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian army declares military zones in rural Aleppo as SDF destroys bridges",
      "description": "The Syrian army has declared a rural area east of Aleppo a “closed military zone” amid fears of renewed clashes.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/syrian-army-declares-military-zones-in-rural-aleppo-as-sdf-destroys-bridges?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 17:12:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "‘We choose Denmark’ over joining US, says Greenland PM Nielsen",
      "description": "\"If we have to choose between the United States and Denmark here and now, we choose Denmark,\" said Greenland's PM.",
      "url": "https://www.aljazeera.com/news/2026/1/13/we-choose-denmark-over-joining-us-says-greenland-pm-nielsen?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 16:01:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Minnesota sues over Trump's ICE enforcement. And, SCOTUS hears trans athlete cases",
      "description": "Minnesota officials sued the Trump administration over unconstitutional ICE conduct. And, SCOTUS hears two cases on whether states can bar transgender athletes from women's sports.",
      "url": "https://www.npr.org/2026/01/13/g-s1-105846/up-first-newsletter-trump-iran-minneapolis-ice-shooting-scotus-trans-sports",
      "published": "Tue, 13 Jan 2026 07:13:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syrian army declares closed military zone east of Aleppo as tensions rise with Kurds",
      "description": "The Syrian army has declared an area east of Aleppo a \"closed military zone,\" signaling potential escalation with the Kurdish-led Syrian Democratic Forces (SDF)",
      "url": "https://abcnews.go.com/International/wireStory/syrian-army-declares-closed-military-zone-east-aleppo-129157546",
      "published": "Tue, 13 Jan 2026 06:25:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: UN independent investigators call for immediate release of all political prisoners",
      "description": "More than 100 political prisoners have been released in Venezuela, the Government announced on Monday, just over a week after the seizure and rendition of President Nicolás Maduro in Caracas by the United States.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166745",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "As Iran weakens, questions grow over Mohammed bin Salman’s regional ambitions",
      "description": "Saudi Arabia asserts bold foreign policy as Iran weakens, reshaping Middle East power dynamics through strategic partnerships and regional realignments.",
      "url": "https://www.foxnews.com/world/saudi-arabia-recalibrates-foreign-policy-approach-middle-east-region-iran-weakens",
      "published": "Tue, 13 Jan 2026 07:00:07 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Costa Rica's security director says plot to assassinate president uncovered",
      "description": "Costa Rican security officials have reported an alleged plot to assassinate President Rodrigo Chaves",
      "url": "https://abcnews.go.com/International/wireStory/costa-ricas-security-director-plot-assassinate-president-uncovered-129178953",
      "published": "Tue, 13 Jan 2026 15:25:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘Beyond GDP’ economists push for clearer metrics on wellbeing, sustainability",
      "description": "Top finance experts are meeting at UN Geneva this week to push for a radical shake up in the way economic growth is gauged, in response to concerns that GDP measurements provide little insight about progress on key sustainability targets that are vital to our survival.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166740",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Students for Life report finds massive uptick in Christian colleges' support for abortion, Planned Parenthood",
      "description": "Abortion support among Christian colleges has reportedly surged 38% since Roe v. Wade was overturned, with one in seven now connected to abortion.",
      "url": "https://www.foxnews.com/us/students-life-report-finds-massive-uptick-christian-colleges-support-abortion-planned-parenthood",
      "published": "Tue, 13 Jan 2026 06:00:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Mexico arrests 6 alleged Tren de Aragua gang members",
      "description": "Mexican authorities have arrested six alleged members of the Tren de Aragua gang in Mexico City for crimes related to drug trafficking, extortion, and human trafficking",
      "url": "https://abcnews.go.com/International/wireStory/mexico-arrests-6-alleged-tren-de-aragua-gang-129169985",
      "published": "Tue, 13 Jan 2026 11:45:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Ex-congressional IT aide accused of stealing 240 government phones and selling them at pawn shop",
      "description": "A former congressional IT aide is accused of stealing 240 taxpayer-funded cellphones worth $150K, shipping them to his home and then selling most at a local pawn shop.",
      "url": "https://www.foxnews.com/us/ex-congressional-aide-accused-stealing-240-government-phones-selling-them-pawn-shop",
      "published": "Mon, 12 Jan 2026 19:15:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Republicans vow to hold Bill Clinton in contempt as he skips Epstein testimony",
      "description": "The former president didn't show up on Tuesday to testify before a committee investigating Epstein, saying its subpoena wasn't enforceable",
      "url": "https://www.bbc.com/news/articles/cj6w17ykd89o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 18:51:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'We were tricked': How one woman lures foreign men to fight on Russia's front line",
      "description": "Recruits tell the BBC an ex-teacher who operates on Telegram misled them, saying they could avoid combat.",
      "url": "https://www.bbc.com/news/articles/ce9yv4gmn9lo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 00:21:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "BTS stand to make $1bn as they announce mammoth comeback tour",
      "description": "It's the K-pop band's first tour since completing compulsory military service in South Korea.",
      "url": "https://www.bbc.com/news/articles/c79rqzv1e7ro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 15:34:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Le Pen blames European Parliament in appeal that could decide political fate",
      "description": "\"We had no sense of having committed an offence,\" France's far-right leader tells an appeal to overturn a ban from contesting the next election.",
      "url": "https://www.bbc.com/news/articles/c62vnvx2x2po?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 17:34:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hunt for gunman after Corsican exile is shot dead at mother's funeral",
      "description": "Alain Orsoni, 71, was a well-known separatist figure in Corsica who had been living in exile for years in Nicaragua.",
      "url": "https://www.bbc.com/news/articles/c0mk80lyw09o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 12:27:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senator Mark Kelly sues Defence Secretary Pete Hegseth over attempted demotion",
      "description": "The US senator and former Navy captain is contesting a move to review his retirement grade after he criticised the Trump administration.",
      "url": "https://www.bbc.com/news/articles/c8j31728187o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 13:44:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pioneering gay footballer Josh Cavallo accuses former club of homophobia",
      "description": "Adelaide United says it \"categorically rejects\" Cavallo's claims he was sidelined because of his sexuality.",
      "url": "https://www.bbc.com/news/articles/cjrznw9e243o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 03:24:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jailed Venezuelan politician's son says Trump shouldn't be 'fooled' by pledge of prisoner releases",
      "description": "Ramón Guanipa's father was accused of treason for challenging the disputed 2024 presidential election result.",
      "url": "https://www.bbc.com/news/articles/c801kypkl3ko?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 13:12:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says trade agreement with Mexico, Canada ‘irrelevant’ to US",
      "description": "But car makers have urged an extension to the USMCA, saying it is crucial to US auto production.",
      "url": "https://www.aljazeera.com/economy/2026/1/13/trump-says-trade-agreement-with-mexico-canada-irrelevant-to-us?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 21:35:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Le Pen ‘hopeful’ ban from public office will be overturned",
      "description": "French far-right leader Marine Le Pen arrived for the first day of her appeal against a five-year ban from office.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/le-pen-hopeful-ban-from-public-office-will-be-overturned?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 18:57:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda cuts internet days before presidential election",
      "description": "The blackout comes as President Yoweri Museveni, criticised for cracking down on opponents, vies for his seventh term.",
      "url": "https://www.aljazeera.com/news/2026/1/13/uganda-cuts-internet-days-before-presidential-election?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 18:37:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Greenland will not be part of the USA,’ territory’s PM asserts",
      "description": "“Greenland will not be part of the USA,\" the territory’s prime minister said.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/greenland-will-not-be-part-of-the-usa-territorys-pm-asserts?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 17:29:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria vs Morocco: AFCON semifinal – team news, start time and lineups",
      "description": "Host nation Morocco chase their dream of winning AFCON on home soil against heavyweights Nigeria in Semifinal 2.",
      "url": "https://www.aljazeera.com/sports/2026/1/13/nigeria-vs-morocco-afcon-2025-semifinal-lineups-start-time-osimhen-lookman-diaz?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 16:53:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somali minister explains why UAE ‘smuggling’ of fugitive was ‘last straw’",
      "description": "Somali government minister Ali Omar says the UAE improperly used Somali airspace to smuggle a Yemeni separatist leader.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/13/somali-minister-explains-why-uae-smuggling-of-fugitive-was-last?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 15:39:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian politicians are condemning X and Grok, so why won’t they leave the platform?",
      "description": "Anthony Albanese has said the AI chatbot generating sexualised images of women and children is ‘abhorrent’ but has an account posting on the site Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Anthony Albanese condemned X’s AI chatbot Grok generation of sexualised images of women and children as “abhorrent”, but don’t expect the prime minister – or seemingly any politician in Australia – to stop using the site any time soon. Albanese condemned the use of generative AI to exploit or sexualise people without their consent, saying on Saturday that Australians deserved better. He added that the online safety regulator would look into it. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/13/grok-x-anthony-albanese-australia-politicians-condemn-post-platform",
      "published": "Tue, 13 Jan 2026 14:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 16 km ESE of Baculin, Philippines",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - V Time 2026-01-07 03:02:56 UTC 2026-01-07 03:02:56 UTC at epicenter Location 7.390°N 126.722°E Depth 35.00 km (21.75 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rn2z",
      "published": "2026-01-10T16:27:43.386Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets and restaurants return to Gaza, but few can afford the expensive price tag",
      "description": "New eateries are popping up in Gaza after months of famine, but it's pricey and many people still rely on aid to survive.",
      "url": "https://www.npr.org/2026/01/13/nx-s1-5668321/markets-and-restaurants-return-to-gaza-but-few-can-afford-the-expensive-price-tag",
      "published": "Tue, 13 Jan 2026 04:46:18 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Should EU leaders sit on Trump's 'Board of Peace' for Gaza?",
      "description": "The next phase of the US-sponsored Gaza peace plan involves setting up a \"Board of Peace.\" Trump wants to chair it and, even though it's been heavily criticized, Europeans also want a seat.",
      "url": "https://www.dw.com/en/should-eu-leaders-sit-on-trump-s-board-of-peace-for-gaza/a-75495127?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 20:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda: Crackdown, internet blackout ahead of vote",
      "description": "Uganda's authorities have shut down rights groups, arrested opponents and their supporters, now they've turned off the internet. After 40 years in office, President Yoweri Museveni has no intention of stepping down now.",
      "url": "https://www.dw.com/en/uganda-crackdown-internet-blackout-ahead-of-vote/a-75495205?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 17:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan, South Korea vow stronger ties amid China challenge",
      "description": "Japan and South Korea are seeking to strengthen cooperation amid growing geopolitical risks and Tokyo’s worsening relations with Beijing.",
      "url": "https://www.dw.com/en/japan-south-korea-vow-stronger-ties-amid-china-challenge/a-75494508?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 15:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Will Trump risk a clash with China over Iran tariff?",
      "description": "Donald Trump's sudden 25% tariff on nations trading with Iran puts Beijing squarely in the spotlight. China knows how to evade sanctions and has the muscle to retaliate. DW explores what this showdown could mean.",
      "url": "https://www.dw.com/en/will-trump-risk-a-clash-with-china-over-iran-tariff/a-75483264?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 14:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France: Le Pen in court to appeal 2027 election ban",
      "description": "Marine Le Pen, the far-right heavyweight of French politics is seeking to overturn a court ruling that blocked her presidential bid.",
      "url": "https://www.dw.com/en/france-le-pen-in-court-to-appeal-2027-election-ban/a-75483470?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 09:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Will Uganda's election bring change or further hardship?",
      "description": "Ahead of Uganda's presidential election, optimists hope for change while others fear chaos, repression, and another term for President Yoweri Museveni.",
      "url": "https://www.dw.com/en/will-uganda-s-election-bring-change-or-further-hardship/a-75434407?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 08:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump to meet with Venezuelan opposition leader Machado",
      "description": "After winning the Nobel Peace Prize Trump had wanted and then being sidelined from a post-Maduro Venezuela, Machado is now set to meet with the US president.",
      "url": "https://www.dw.com/en/trump-to-meet-with-venezuelan-opposition-leader-machado/a-75481739?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 06:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German Chancellor Merz visits India's tech hub Bengaluru",
      "description": "Merz is due in Bengaluru, often called India's Silicon Valley, after meeting PM Modi in Ahmedabad. The visit comes just weeks ahead of plans to sign a long-awaited free trade agreement between India and the EU.",
      "url": "https://www.dw.com/en/german-chancellor-merz-visits-india-s-tech-hub-bengaluru/live-75434261?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 03:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marine Le Pen's Appeal: Will trial torpedo far-right leader's presidential hopes?",
      "description": "Big stress test for the West’s rules-based order or will French judges take it all in stride.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260113-marine-le-pen-s-appeal-will-trial-torpedo-far-right-leader-s-presidential-hopes",
      "published": "Tue, 13 Jan 2026 19:12:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Cultural, political, social phenomenon': Surge in support for far right in US, UK, France, Italy",
      "description": "In a turbulent political landscape marked by disillusionment and shifting loyalties, France stands at a critical juncture. The far-right’s rise is not an isolated French phenomenon but a mirror of broader political trends taking root in the West, driven by what Professor Paul Smith, Head of Modern Languages at the University of Nottingham, calls “the politics of frustration” and the feeling of being “left behind”. As France prepares for a post-Macron future, will the center continue their descent, giving way to the far right and far left?",
      "url": "https://www.france24.com/en/video/20260113-cultural-political-social-phenomenon-surge-in-support-for-far-right-in-us-uk-france-italy-2",
      "published": "Tue, 13 Jan 2026 16:49:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marine Le Pen ‘feels hopeful’ as appeal trial begins",
      "description": "French far-right leader Marine Le Pen is set to return to court on Tuesday to appeal a graft conviction, with her 2027 presidential ambitions hanging in the balance. Le Pen was banned from standing for office for five years, which effectively disqualified her from running in next year's presidential race.",
      "url": "https://www.france24.com/en/video/20260113-marine-le-pen-feels-hopeful-as-appeal-trial-begins-1",
      "published": "Tue, 13 Jan 2026 15:14:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian author charged over child exploitation material",
      "description": "Australian author Craig Silvey has been charged with possessing and distributing child exploitation material.",
      "url": "https://news.sky.com/story/australian-author-craig-silvey-charged-with-possessing-and-distributing-child-exploitation-material-13493704",
      "published": "Tue, 13 Jan 2026 11:56:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Airports close and flights disrupted as freezing rain and snow hits Europe",
      "description": "Airports were forced to close and flights were disrupted in parts of Europe due to icy weather.",
      "url": "https://news.sky.com/story/airports-close-and-flights-disrupted-across-europe-due-to-icy-weather-13493226",
      "published": "Tue, 13 Jan 2026 10:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Puerto Rico announces compulsory visits to assess conditions in housing projects",
      "description": "Puerto Rico is announcing compulsory visits to the island’s 328 public housing projects to check on residents and their living conditions",
      "url": "https://abcnews.go.com/International/wireStory/puerto-rico-announces-compulsory-visits-assess-conditions-housing-129169049",
      "published": "Tue, 13 Jan 2026 11:21:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraq's prime minister steps aside for rival in post-election wrangling over government",
      "description": "Iraq’s caretaker Prime Minister Mohammed Shia al-Sudani has stepped aside to clear the way for former Prime Minister Nouri al-Maliki, according to two Iraqi officials",
      "url": "https://abcnews.go.com/International/wireStory/iraqs-prime-minister-steps-aside-rival-post-election-129162655",
      "published": "Tue, 13 Jan 2026 09:06:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark provided US support on intercepting oil tanker, Danish official says",
      "description": "A Danish government official says Denmark provided the U.S. with support seizing an oil tanker violating sanctions amid the dispute over Greenland",
      "url": "https://abcnews.go.com/International/wireStory/denmark-provided-us-support-intercepting-oil-tanker-danish-129161665",
      "published": "Tue, 13 Jan 2026 10:49:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Czech Prime Minister Babiš faces confidence vote as government shifts Ukraine policy",
      "description": "The Czech Republic’s new government of populist Prime Minister Andrej Babiš faces a mandatory confidence vote in Parliament",
      "url": "https://abcnews.go.com/International/wireStory/czech-prime-minister-babi-faces-confidence-vote-government-129160759",
      "published": "Tue, 13 Jan 2026 08:25:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungary sets April 12 election date as Orbán faces tough challenge",
      "description": "Hungary's parliamentary election is set for April 12, with Prime Minister Viktor Orbán expected to face his toughest challenge in 16 years",
      "url": "https://abcnews.go.com/International/wireStory/hungary-sets-april-12-election-date-orbn-faces-129160136",
      "published": "Tue, 13 Jan 2026 07:54:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marine Le Pen's appeal trial opens in Paris, with far-right leader's 2027 presidential bid at stake",
      "description": "Marine Le Pen's appeal trial opens in Paris, with far-right leader's 2027 presidential bid at stake",
      "url": "https://abcnews.go.com/International/wireStory/marine-le-pens-appeal-trial-opens-paris-leaders-129159758",
      "published": "Tue, 13 Jan 2026 08:01:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Freezing rain and ice disrupt travel across central and eastern Europe",
      "description": "Freezing rain and icy conditions have caused widespread travel disruptions across central and eastern Europe",
      "url": "https://abcnews.go.com/International/wireStory/freezing-rain-ice-disrupt-travel-central-eastern-europe-129159848",
      "published": "Tue, 13 Jan 2026 07:57:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China urges Canada to break from US influence as PM Carney visits Beijing",
      "description": "China is hoping President Trump's economic and military actions against other countries will weaken the U.S.-Canada relationship",
      "url": "https://abcnews.go.com/International/wireStory/china-urges-canada-break-us-influence-pm-carney-129158649",
      "published": "Tue, 13 Jan 2026 07:45:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Amidst uncertainty, a helpline in Pakistan becomes a lifeline for Afghans",
      "description": "They ask heartbreaking questions: “What will happen to us?” “Is it true they will deport us?” “We don’t want to go back. How can I live in Afghanistan?” The words of Sumaiya, who staffs a helpline for refugees and asylum-seekers living in Pakistan but facing the eventuality of having to return to neighbouring Afghanistan.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166741",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Family 'quickly believed' surgeon ex was involved in Ohio dentist couple's murder as co-worker details mishaps",
      "description": "Ex-husband of Ohio dentist allegedly kills her and new spouse in Columbus. Michael McKee charged with premeditated murder of Monique and Spencer Tepe.",
      "url": "https://www.foxnews.com/us/family-quickly-believed-surgeon-ex-was-involved-ohio-dentist-couples-murder-co-worker-details-mishaps",
      "published": "Tue, 13 Jan 2026 16:13:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mississippi synagogue arson suspect's dad turns him in after laughing confession, FBI says",
      "description": "A man accused of a Mississippi synagogue arson confessed to his father, saying he \"finally got them,\" the FBI said. Stephen Pittman faces charges.",
      "url": "https://www.foxnews.com/us/mississippi-synagogue-arson-suspects-dad-turns-him-after-laughing-confession-fbi-says",
      "published": "Tue, 13 Jan 2026 07:32:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Supreme Court hears arguments over trans athletes in girls' sports and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/supreme-court-hears-arguments-over-trans-athletes-girls-sports-more-top-headlines",
      "published": "Tue, 13 Jan 2026 07:19:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former US Navy sailor learns sentence for spying for China",
      "description": "Former Navy sailor Jinchao Wei sentenced to 200 months in prison for selling classified military secrets to Chinese intelligence officer for $12,000.",
      "url": "https://www.foxnews.com/us/former-us-navy-sailor-learns-sentence-spying-china",
      "published": "Tue, 13 Jan 2026 06:58:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Minnesota sues Trump admin over sweeping immigration raids in Twin Cities",
      "description": "Minnesota sues Trump administration over alleged militarized immigration raids in Twin Cities, naming DHS Secretary Kristi Noem and ICE officials.",
      "url": "https://www.foxnews.com/us/minnesota-sues-trump-admin-over-sweeping-immigration-raids-twin-cities",
      "published": "Mon, 12 Jan 2026 19:40:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New Jersey man fractures girl's skull by allegedly throwing rock through school bus window, arrest made",
      "description": "A New Jersey man was arrested after allegedly throwing a rock that smashed through a school bus window, fracturing a young girl’s skull, police said.",
      "url": "https://www.foxnews.com/us/new-jersey-man-fractures-girls-skull-allegedly-throwing-rock-school-bus-window-arrest-made",
      "published": "Mon, 12 Jan 2026 18:09:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}