{
  "last_updated": "2026-01-22T17:30:14.826231Z",
  "event_count": 226,
  "events": [
    {
      "title": "Iran will retaliate 'with everything we have' if US attacks, senior diplomat warns",
      "description": "More than 4,500 protesters killed in Iran as foreign minister threatens forceful response to potential U.S. military strikes in escalating regional crisis.",
      "url": "https://www.foxnews.com/world/iran-retaliate-with-everything-we-have-us-attacks-senior-diplomat-warns",
      "published": "Wed, 21 Jan 2026 07:44:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Trump's 'Board of Peace' initially aimed at rebuilding Gaza, could have 'global role'",
      "description": "US President Donald Trump has unveiled his “Board of Peace,” a $1 billion initiative aimed at resolving international conflicts through permanent membership. Meanwhile, medical sources at Al-Shifa Hospital report that at least four people have been killed by Israeli fire in Gaza, and an infant has died from exposure to the cold. France24 correspondent Noga Tarnopolsky reports the latest from Jerusalem.",
      "url": "https://www.france24.com/en/trump-s-board-of-peace-initially-aimed-at-rebuilding-gaza-could-have-global-role",
      "published": "Thu, 22 Jan 2026 15:02:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 42,
      "severity_level": "Critical"
    },
    {
      "title": "'If we're not at the table, we're on the menu': What global leaders have said",
      "description": "The world order is in the \"midst of a rupture\", leaders have warned - telling how international law is being \"trampled underfoot\" and \"imperial ambitions are resurfacing\".",
      "url": "https://news.sky.com/story/is-a-new-world-without-rules-emerging-what-global-leaders-have-said-13497144",
      "published": "Wed, 21 Jan 2026 13:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Pakistan: Death toll soars in Karachi mall fire",
      "description": "Rescuers have retrieved remains of many more victims from a gutted mall in Pakistan's Karachi, with dozens still missing. The cause of the disaster is still not known.",
      "url": "https://www.dw.com/en/pakistan-death-toll-soars-in-karachi-mall-fire/a-75600651?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 08:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Rising hunger and displacement pose growing economic risk, UN tells Davos",
      "description": "As global leaders gather at the World Economic Forum in Davos this week, UN agencies are warning that rising hunger and displacement are not only humanitarian emergencies but growing threats to global economic stability.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166791",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Shooting in Australian town leaves 3 dead and 1 wounded",
      "description": "Three people were killed and another was wounded on Thursday in a shooting at an Australian country town, police said",
      "url": "https://abcnews.go.com/International/wireStory/shooting-australian-town-leaves-3-dead-1-wounded-129445257",
      "published": "Thu, 22 Jan 2026 03:06:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "In the ashes of Lirquén: How a small town is rising from Chile's devastating wildfires",
      "description": "Wildfires continue to devastate central and southern Chile, consuming over 170 square miles and causing at least 20 deaths",
      "url": "https://abcnews.go.com/International/wireStory/ashes-lirqun-small-town-rising-chiles-devastating-wildfires-129441749",
      "published": "Thu, 22 Jan 2026 02:01:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of 'catastrophic' hunger crisis in Nigeria as food aid funding runs out",
      "description": "The U.N. World Food Program warns that over a million people in northeast Nigeria could lose emergency food aid soon without new funding",
      "url": "https://abcnews.go.com/International/wireStory/warns-catastrophic-hunger-crisis-nigeria-food-aid-funding-129449369",
      "published": "Thu, 22 Jan 2026 07:50:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Why Chile’s wildfires are spreading faster and burning hotter",
      "description": "Chile is facing a severe wildfire emergency marked by unusually large and fast-moving fires that have killed people, destroyed homes and forced tens of thousands to flee",
      "url": "https://abcnews.go.com/International/wireStory/chiles-wildfires-spreading-faster-burning-hotter-129452922",
      "published": "Thu, 22 Jan 2026 09:21:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "World enters era of ‘global water bankruptcy’",
      "description": "The world has moved beyond a water crisis and into a state of global water bankruptcy, says a new flagship report released on Tuesday by UN researchers.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166800",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: Atrocities ‘repeated town by town’, ICC prosecutor tells UN Security Council",
      "description": "Atrocities in Sudan’s Darfur region are spreading from town to town in an organized campaign of violence that includes mass executions, rape and ethnic targeting, amounting to war crimes and crimes against humanity, the prosecutor of the International Criminal Court told the UN Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166790",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Armed militias fire heavy machine guns through Tehran streets in deadly night attacks",
      "description": "Iran protests entered day 24 with 4,519 confirmed deaths. Supreme Leader Ayatollah Ali Khamenei backs security forces amid nationwide demonstrations.",
      "url": "https://www.foxnews.com/world/armed-militias-fire-heavy-machine-guns-tehran-streets-deadly-night-attacks",
      "published": "Tue, 20 Jan 2026 21:06:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian soldier sentenced to death for refusing to fire on protesters during nationwide unrest",
      "description": "Iranian soldier Javid Khales was reportedly sentenced to death for refusing orders to shoot protesters during nationwide unrest, a human rights group says.",
      "url": "https://www.foxnews.com/world/iranian-soldier-sentenced-death-refusing-fire-protesters-nationwide-unrest",
      "published": "Tue, 20 Jan 2026 21:56:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Global effort underway to recover stolen Louvre jewels",
      "description": "French police continue the search for jewels stolen from the Louvre, private investigators are also stepping in. All eight missing pieces have already been added to the world’s largest stolen art database, which lists some 700,000 works. In London, a team of experts that has been tracing lost artworks for more than 30 years is working to help return them to their rightful owners. Camille Knight reports.",
      "url": "https://www.france24.com/en/global-effort-underway-to-recover-stolen-louvre-jewels",
      "published": "Thu, 22 Jan 2026 14:02:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Cold and dark: UN rights chief condemns Russian strikes on Ukraine’s power grid",
      "description": "Russian attacks on Ukraine’s energy infrastructure have cut heat, electricity and water to hundreds of thousands of civilians in freezing winter conditions, prompting the UN human rights chief to denounce the strikes as “cruel” and a clear violation of international law.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166798",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli UN ambassador sends stark warning to Iran amid growing unrest",
      "description": "Israel warns Iran not to test its military readiness amid tensions over ballistic missiles and nuclear capabilities following summer 2025 operations.",
      "url": "https://www.foxnews.com/world/israeli-un-ambassador-sends-stark-warning-iran-amid-growing-unrest",
      "published": "Tue, 20 Jan 2026 19:38:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Gunman at large in Australian town after three people shot dead",
      "description": "A gunman is reported to be at large in an Australian town following shootings that killed three people and wounded one.",
      "url": "https://news.sky.com/story/gunman-at-large-in-lake-cargelligo-australia-after-three-people-shot-dead-13497500",
      "published": "Thu, 22 Jan 2026 09:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Mozambique floods heighten disease, malnutrition risks – UN agencies",
      "description": "Catastrophic flooding across Mozambique is devastating lives and livelihoods, sharply increasing the risk of disease outbreaks and malnutrition, while also forcing dangerous wildlife – including crocodiles – into flooded urban areas, the UN warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166793",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Trump takes spotlight at 2026 World Economic Forum in Davos",
      "description": "After a week of twists and turns, US President Donald Trump delivered a highly anticipated speech at the World Economic Forum in Davos on Wednesday. Earlier at Davos, French President Emmanuel Macron decried bullying on the global stage and Canadian Prime Minister Mark Carney warned that \"the old order is not coming back\". For analysis, FRANCE 24's Charles Pellegrin talks to Brett Bruen, president and CEO of the Global Situation Room, who is just back from Davos.",
      "url": "https://www.france24.com/en/tv-shows/people-profit/20260122-trump-takes-spotlight-at-2026-world-economic-forum-in-davos",
      "published": "Thu, 22 Jan 2026 15:47:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Rising coal demand overshadows Southeast Asia's transition to renewable energy",
      "description": "Southeast Asia’s need for coal is growing faster than anywhere else in the world, undermining progress on cutting carbon emissions that contribute to global warming",
      "url": "https://abcnews.go.com/International/wireStory/rising-coal-demand-overshadows-southeast-asias-transition-renewable-129444203",
      "published": "Thu, 22 Jan 2026 01:29:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Silence marks moment of sorrow as Australians mourn victims of Bondi terror attack",
      "description": "Survivors join families of victims on stage of Sydney Opera House as PM apologises that nation ‘could not protect your loved ones’ Children cook meals for the needy and mourners lay wreaths for Bondi attack victims on national day of mourning Get our breaking news email , free app or daily news podcast At 7.01pm on Thursday evening, a crowd of 1,500 mourners packed into the Sydney Opera House descended into a heavy silence. Television stations paused their coverage. Gatherings fell still. Six weeks after 15 people were gunned down celebrating the first night of Hanukah in Bondi, in the worst terror attack on Australian soil, the nation was still coming to terms with the weight of its loss. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/silence-marks-moment-of-sorrow-as-australians-mourn-victims-of-bondi-terror-attack-ntwnfb",
      "published": "Thu, 22 Jan 2026 11:02:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "About 30 countries expected to join Trump's 'Board of Peace'",
      "description": "US President Donald Trump has unveiled his “Board of Peace,” a $1 billion initiative aimed at resolving international conflicts through permanent membership. Initially designed to oversee Gaza’s reconstruction, a draft of the board’s charter suggests its mandate could extend beyond the Palestinian territory. France24 Senior reporter James André shares his insights.",
      "url": "https://www.france24.com/en/about-30-countries-expected-to-join-trump-s-board-of-peace",
      "published": "Thu, 22 Jan 2026 13:59:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘Alarming’ increase in use of death penalty last year, despite global trend towards abolition",
      "description": "Despite a downward trend in the use of the death penalty globally, 2025 saw an ‘alarming’ increase in the number of executions in a small number of retentionist countries, the UN human rights office (OHCHR) warned on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166789",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN Assembly president defends multilateralism, UN Charter in Davos",
      "description": "From Davos, the President of the UN General Assembly on Wednesday warned that the world has entered a “make‑or‑break” moment for multilateralism, saying the rules‑based order can survive only if states speak the truth and act when it’s hard. She called for a cross‑regional alliance to push back against growing lawlessness, disinformation, and power‑based politics.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166803",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Hong Kong national security trial of three pro-democracy activists begins",
      "description": "Chow Hang-tung, Lee Cheuk-yan and Albert Ho, who led Tiananmen Square vigils, are accused of inciting subversion The national security trial of three pro-democracy activists who organised an annual memorial in Hong Kong to mark the Tiananmen Square massacre opened on Thursday, in another landmark case brought under the Beijing-imposed law that has practically crushed protests in the semiautonomous Chinese city. Chow Hang-tung , Lee Cheuk-yan and Albert Ho are charged with inciting subversion under Hong Kong’s national security law . Their trial is one of the most high-profile national security cases to be heard in Hong Kong since Beijing imposed the law in 2020 . The defendants face a maximum penalty of 10 years’ imprisonment if convicted. The law has a near-100% conviction rate. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/hong-kong-national-security-trial-pro-democracy-activists-chow-hang-tung-lee-cheuk-yan-albert-ho",
      "published": "Wed, 21 Jan 2026 23:45:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Ryan Coogler's Jim Crow-era vampire film 'Sinners' makes Hollywood history with 16 Oscar nominations",
      "description": "Ryan Coogler’s vampire epic \"Sinners\" dominated Oscar nominations on Thursday with a record 16 nods. The Academy also rewarded international films and handed a strong showing to Warner Bros.",
      "url": "https://www.france24.com/en/culture/20260122-coogler-sinners-makes-hollywood-history-with-16-oscar-nominations",
      "published": "Thu, 22 Jan 2026 15:57:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: War crimes probe pledges to continue work for justice and accountability",
      "description": "As President Trump launched the international Board of Peace plan for Gaza on Thursday, top independent rights experts tasked by the UN Human Rights Council with investigating grave abuses linked to the Hamas-Israel war pledged to continue their work seeking justice and accountability for all.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166807",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti explained: why the crisis is deepening — and what comes next",
      "description": "Haiti is entering 2026 facing one of the most complex crises in its recent history. On Wednesday, the Caribbean island nation will be high on the international agenda as the UN Security Council holds its first meeting of the year to update ambassadors.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166801",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At the edge of war: the Central African Republic's uneasy border with Sudan",
      "description": "The land flattens on the approach to Birao, a cut-off town ringed by savannah in the far north of the Central African Republic, where roads dissolve into dust and motorcycles vastly outnumber cars. Less than two hours’ drive from the Sudanese border, this is the edge of a fractured country still piecing itself back together, while absorbing the shockwaves of a neighbouring conflict.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166794",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Two dead and several missing in New Zealand landslides",
      "description": "Heavy rains have ravaged the country's North Island, with a minister comparing it to a \"war zone\".",
      "url": "https://www.bbc.com/news/articles/cje11x527n4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 09:14:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "World leaders to hold emergency summit on Greenland. And, SCOTUS weighs Fed case",
      "description": "European leaders hold an emergency summit on a possible U.S.-Greenland deal. And, the Supreme Court weighs whether the president can fire Fed governors.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106787/up-first-newsletter-eu-emergency-meeting-trump-greenland-canada-scotus-fed",
      "published": "Thu, 22 Jan 2026 07:06:59 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti crisis at breaking point as gangs tighten grip ahead of transition deadline",
      "description": "Haiti’s deepening crisis has reached a critical phase, senior UN officials warned the Security Council on Wednesday, as powerful gangs continue to expand their control across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166806",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Japan suspends world's largest nuclear plant hours after restart",
      "description": "The operator says reactor remains \"stable\" and has no \"radioactive impact outside\".",
      "url": "https://www.bbc.com/news/articles/cx2yy8z91n4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 13:13:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Spain: Train collides with crane in wake of 2 deadly crashes",
      "description": "Emergency crews are responding after a train collided with a construction crane in near Spain's Cartagena. The incident has added to growing scrutiny of rail safety after two serious accidents this week.",
      "url": "https://www.dw.com/en/spain-train-collides-with-crane-in-wake-of-2-deadly-crashes/a-75606801?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 12:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Flooding causes widespread damage across southern Africa",
      "description": "Deadly floodings across southern Africa has submerged roads, homes and schools, forcing evacuations.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/flooding-causes-widespread-damage-across-southern-africa?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 15:47:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Trump's provocative rhetoric about Greenland threatens long-standing world order",
      "description": "President Trump says he won't take Greenland by force, but he delivered provocative statements that have threatened to tear down the pillars of the world order constructed by the U.S. 80 years ago.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5684112/trumps-provocative-rhetoric-about-greenland-threatens-long-standing-world-order",
      "published": "Thu, 22 Jan 2026 04:44:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Rescue efforts underway after landslides hit New Zealand campground, house, 2 dead",
      "description": "Landslides have hit a house and a campground in New Zealand, killing at least two people while emergency crews are trying to rescue people buried in rubble",
      "url": "https://abcnews.go.com/International/wireStory/rescue-efforts-underway-after-landslides-hit-new-zealand-129438465",
      "published": "Thu, 22 Jan 2026 03:29:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "62 Nigerian hostages rescued, 2 militants killed, army says",
      "description": "Nigeria's military rescued 62 hostages and killed two militants in operations across Zamfara, Kebbi and Sokoto states after weekend church kidnappings.",
      "url": "https://www.foxnews.com/world/62-nigerian-hostages-rescued-2-militants-killed-army-says",
      "published": "Wed, 21 Jan 2026 14:08:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "'Assassination culture' is on the rise, especially among women, study warns",
      "description": "New survey reveals women are 15% more likely to tolerate political violence, with heavy social media use driving concerning \"assassination culture\" trends.",
      "url": "https://www.foxnews.com/us/assassination-culture-rise-especially-among-women-study-warns",
      "published": "Thu, 22 Jan 2026 06:00:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of sex assaults on teenage prisoners, while families charged to recover remains of loved ones",
      "description": "Iran's prosecutor general Mohammad Movahedi claims government crushed nationwide protests as death toll reaches 544 with over 10,681 arrested.",
      "url": "https://www.foxnews.com/world/iran-accused-sex-assaults-teenage-prisoners-families-charged-recover-remains-loved-ones",
      "published": "Wed, 21 Jan 2026 21:38:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "American flags torched, riot police clash with protesters ahead of Trump Davos arrival",
      "description": "Swiss riots erupt in multiple cities as anti-Trump protesters march against President Trump's World Economic Forum appearance, with police deploying water cannons.",
      "url": "https://www.foxnews.com/world/american-flags-torched-riot-police-clash-protesters-trump-davos-arrival",
      "published": "Tue, 20 Jan 2026 20:11:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Israeli strike in Gaza kills three journalists, first responders say",
      "description": "Another eight Palestinians were killed by Israeli artillery and gunfire across Gaza on Wednesday, according to medics.",
      "url": "https://www.bbc.com/news/articles/c98pnzp50nqo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 20:44:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump says Canada should be grateful for ‘freebies’ it gets from the US",
      "description": "US president singles out Mark Carney day after prime minister warned world is undergoing geopolitical ‘rupture’ Trump news at a glance: at Davos, president rambles, backs down and touts ‘future deal’ on Greenland Donald Trump has said Canada should be “grateful” for the “freebies” it gets from the US, a day after its prime minister, Mark Carney , warned the world was undergoing a geopolitical “rupture”. Speaking those attending the World Economic Forum annual meeting in Switzerland, the US president singled out Carney’s speech that was sharply critical of US foreign policy. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/21/trump-canada-mark-carney",
      "published": "Wed, 21 Jan 2026 20:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Chile’s president-elect names staunch abortion opponent as gender equality minister",
      "description": "Far-right incoming president picked Judith Marín, who has publicly decried bills to decriminalise abortion, for the role Chile’s incoming far-right president José Antonio Kast has named a vehement opponent of abortion who has repeatedly stated her support for life “from conception to natural death” as the country’s new women and gender equality minister. Judith Marín, 30, was once ejected from Chile’s senate by police for screaming “return to the Lord” during a vote to decriminalise abortion under restricted circumstances. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/chile-abortion-opponent-gender-equality-minister",
      "published": "Wed, 21 Jan 2026 16:56:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Filipino journalist Frenchie Cumpio found guilty of terror financing in verdict rights groups call ‘absurd’",
      "description": "Reporters Without Borders said the ruling against the 26-year-old journalist showed a ‘blatant disregard for press freedom’ in the Southeast Asian nation A young Filipino journalist who spent nearly six years in a crowded provincial prison was found guilty of terror financing on Thursday, in a case rights groups and a UN rapporteur labelled a “travesty of justice”. Community journalist and radio broadcaster Frenchie Cumpio, 26, and former roommate Marielle Domequil broke down in tears and hugged each other as the guilty verdict was read and they were sentenced to 12-18 years in prison by judge Georgina Uy Perez of the Tacloban regional court. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/frenchie-mae-cumpio-philippine-journalist-found-guilty",
      "published": "Thu, 22 Jan 2026 03:28:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Israeli fire strikes journalists and children in Gaza",
      "description": "Israeli forces on Wednesday killed at least 11 Palestinians in Gaza, including two boys, three journalists and a woman, hospitals said, on one of the enclave 's deadliest days since the ceasefire took effect.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106775/israel-strikes-gaza",
      "published": "Thu, 22 Jan 2026 01:56:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Guterres in London: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ISIS takes credit for Kabul suicide bombing at Chinese restaurant",
      "description": "ISIS-K claims responsibility for deadly suicide blast at Chinese restaurant in Kabul, killing seven people, including one Chinese national.",
      "url": "https://www.foxnews.com/world/isis-takes-credit-kabul-suicide-bombing-chinese-restaurant",
      "published": "Tue, 20 Jan 2026 08:24:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Ugandan MP and Bobi Wine ally arrested over election violence",
      "description": "The opposition politician is accused of election violence in which at least seven people were killed.",
      "url": "https://www.bbc.com/news/articles/cq844z9y4q9o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 13:14:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Several missing after New Zealand landslide hits campsite at beauty spot",
      "description": "Rescue efforts are under way to free people buried under rubble after landslides hit a campsite and house in New Zealand.",
      "url": "https://news.sky.com/story/several-missing-after-new-zealand-campsite-landslide-with-no-sign-of-life-detected-for-hours-official-says-13497417",
      "published": "Thu, 22 Jan 2026 06:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Police officer cleared of failing to stop school shooting gunman who killed 21",
      "description": "A former police officer has been acquitted of criminal child-endangerment charges related to his role in the flawed law enforcement response to the 2022 Uvalde school shooting that left 19 children and two teachers dead.",
      "url": "https://news.sky.com/story/texas-jury-clears-police-officer-accused-of-failing-to-stop-uvalde-school-shooting-gunman-13497447",
      "published": "Thu, 22 Jan 2026 07:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Phoenix gas station murder suspect had weapons charge tossed before fatal shooting, records show",
      "description": "Man accused of killing Danny Lyn Kaster at Phoenix QuikTrip allegedly shot victim over bathroom dispute. Family says ordinary interaction turned deadly.",
      "url": "https://www.foxnews.com/us/phoenix-gas-station-murder-suspect-had-weapons-charge-tossed-before-fatal-shooting-records-show",
      "published": "Thu, 22 Jan 2026 10:00:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Teen mass killer pleads guilty to NC rampage that left five dead, including brother, police officer",
      "description": "Eighteen-year-old Austin Thompson pleaded guilty to the 2022 Raleigh mass shooting that killed five, including his brother and a police officer. Sentencing is in February.",
      "url": "https://www.foxnews.com/us/teen-mass-killer-pleads-guilty-nc-rampage-left-five-dead-including-brother-police-officer",
      "published": "Wed, 21 Jan 2026 21:55:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Fact check: Trump's speech at the World Economic Forum",
      "description": "At Davos, Trump made bold claims about Greenland, NATO spending and China’s wind power. DW Fact Check examines where his statements clash with historical records and current data.",
      "url": "https://www.dw.com/en/fact-check-trump-s-speech-at-the-world-economic-forum/a-75601073?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 13:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "The looted list: Louvre jewels added to international database",
      "description": "As surveillance footage comes to light revealing the circumstances of the Louvre heist three months ago, police are still searching for the stolen jewels. Valued at some €88 million, these precious treasures have now been added to a catalogue of stolen artworks.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260122-the-looted-list-louvre-jewels-added-to-international-database",
      "published": "Thu, 22 Jan 2026 14:56:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Conservative Utah student says radical left-wing classmate threatened to 'Kirk' him before campus arrest",
      "description": "University of Utah student arrested after allegedly threatening conservative peers with death, mimicking rifle gestures at campus event in concerning incident.",
      "url": "https://www.foxnews.com/us/conservative-utah-student-says-radical-left-wing-classmate-threatened-kirk-him-before-campus-arrest",
      "published": "Thu, 22 Jan 2026 08:00:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Video shows severely damaged building in Ukraine from Russian attack",
      "description": "A Russian drone strike hit a residential building in the Ukrainian city of Dnipro, injuring seven people.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/video-shows-severely-damaged-building-in-ukraine-from-russian-attack?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 16:23:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Bangladesh adamant on playing T20 World Cup in Sri Lanka despite ICC threat",
      "description": "Bangladesh's government and cricket officials stick to their stance despite ICC's threat of replacing it with Scotland.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/bangladesh-adamant-on-playing-t20-world-cup-in-sri-lanka-despite-icc-threat?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 12:58:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump vs. U.S. allies: How will this end?",
      "description": "The president has backed off his threat to take Greenland by force. But his highly inflammatory remarks in Switzerland rattled U.S. allies and threatened to tear down the pillars of the world order.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106678/trump-allies-nato",
      "published": "Thu, 22 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "From Hollywood to Fort Worth: Film and TV productions move to Texas",
      "description": "As Hollywood faces an unprecedented crisis, Texas eyes an opportunity. Thanks to new tax incentives, the state is attracting producers and studios, with the ambition of promoting content aligned with family and Christian values. While the official goal is to create jobs in the industry, some lawmakers openly want to build a counterweight to Hollywood, which they see as ideologically hostile. FRANCE 24's Valérie Defert and Pierrick Leurent report from Fort Worth, with Wassim Cornet.",
      "url": "https://www.france24.com/en/tv-shows/focus/20260122-from-hollywood-to-fort-worth-film-and-tv-productions-move-to-texas",
      "published": "Thu, 22 Jan 2026 13:28:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "US government warns it will take action if Haitian politicians destabilize country",
      "description": "The U.S. has warned the transitional council in charge of Haiti against making changes to the troubled country’s government, as pressure mounts for the unelected body to move toward elections for the first time in a decade",
      "url": "https://abcnews.go.com/International/wireStory/us-government-warns-action-haitian-politicians-destabilize-country-129441923",
      "published": "Thu, 22 Jan 2026 00:10:14 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Who were the Palestinian journalists Israeli forces just killed?",
      "description": "Three Palestinian journalists were killed in a targeted Israeli strike in Gaza while working for an aid organisation.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/who-were-the-palestinian-journalists-israeli-forces-just-killed?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 14:46:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Australia’s worst heatwave since black summer made five times more likely by global heating, analysis finds",
      "description": "Extreme heat ‘is getting worse and whether we like it or not … there’s ultimately a limit to what we can actually physically cope with,’ scientist says Get our breaking news email , free app or daily news podcast Human-caused global heating made the intense heatwave that affected much of Australia in early January five times more likely, new analysis suggests. The heatwave earlier this month was the most severe since the 2019-20 black summer, with temperatures over 40C in Melbourne and Sydney, even hotter conditions in regional Victoria and New South Wales, and extreme heat also affecting Western Australia, South Australia and Tasmania. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/23/australias-worst-heatwave-since-black-summer-made-five-times-more-likely-by-global-heating-analysis-finds",
      "published": "Thu, 22 Jan 2026 13:01:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "European leaders to meet for emergency summit about the U.S. and Greenland",
      "description": "European leaders will gather in Brussels Thursday night for an emergency meeting on tensions with the U.S. over Greenland and President Trump's tariff threats.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5684116/european-leaders-to-meet-for-emergency-summit-about-the-u-s-and-greenland",
      "published": "Thu, 22 Jan 2026 06:58:58 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "EU leaders gather to chart a new course for transatlantic ties after Trump threats over Greenland",
      "description": "European Union leaders are gathering for emergency talks to address transatlantic relations after a turbulent two weeks dominated by U.S. President Donald Trump's renewed threats to take control of Greenland",
      "url": "https://abcnews.go.com/International/wireStory/eu-leaders-gather-chart-new-transatlantic-ties-after-129447474",
      "published": "Thu, 22 Jan 2026 07:05:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Food insecurity in Lebanon, Libya migrants freed, UNHCR tackles multiple emergencies – despite cuts",
      "description": "Since 2026, nearly 17 percent of Lebanon’s population has been living in a state of major food insecurity – a situation that is likely to worsen in the coming year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166787",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen: Children are dying and it’s going to get worse, warns aid veteran",
      "description": "In Yemen, renewed political instability and economic woes linked to the war threaten to complicate the already difficult task of helping vulnerable people suffering from deepening hunger, illness and displacement, the UN’s top aid official there said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166786",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yale hosts controversial speaker Trita Parsi accused of promoting Iranian regime interests",
      "description": "Controversial Iranian American Trita Parsi to speak at Yale, sparking outrage amid deadly Iran protests that allegedly killed over 16,000 people.",
      "url": "https://www.foxnews.com/us/yale-hosts-controversial-speaker-trita-parsi-accused-promoting-iranian-regime-interests",
      "published": "Thu, 22 Jan 2026 06:00:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump slams UK island handoff deal that could put key US military base at risk",
      "description": "President Donald Trump calls the United Kingdom's Chagos Islands transfer plan \"an act of great stupidity,\" warning China could exploit the deal.",
      "url": "https://www.foxnews.com/world/trump-slams-uk-island-handoff-deal-put-key-us-military-base-risk",
      "published": "Wed, 21 Jan 2026 18:25:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Top EU official warns Trump's tariff threat over Greenland pushback is 'a mistake'",
      "description": "EU chief calls President Donald Trump's Greenland tariff threats \"a mistake\" as European leaders warn of downward spiral in transatlantic trade relations.",
      "url": "https://www.foxnews.com/world/top-eu-official-warns-trumps-tariff-threat-over-greenland-pushback-a-mistake",
      "published": "Tue, 20 Jan 2026 13:23:56 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Three dead in shooting in Australia's New South Wales",
      "description": "Residents have been told to stay indoors and avoid the area of the shooting.",
      "url": "https://www.bbc.com/news/articles/c4g00mv29j5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 11:38:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Torrential rains displace thousands in Mozambique as floods wreak havoc",
      "description": "More than 620,000 affected by Mozambique floods, as vital infrastructure and tens of thousands of homes are destroyed.",
      "url": "https://www.aljazeera.com/gallery/2026/1/22/torrential-rains-displace-thousands-in-mozambique-as-floods-wreak-havoc?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 15:28:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The business of saving nature",
      "description": "Global financing is heavily skewed to industries that harm rather than preserve nature, according to a new report that calls for an urgent scale-up of nature-positive spending.",
      "url": "https://www.dw.com/en/the-business-of-saving-nature/a-75594438?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 09:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Philippine court convicts journalist of terror financing charge in ruling condemned by media groups",
      "description": "A Philippine court has found a Filipina journalist guilty of financing terrorism in a verdict that was condemned by press freedom watchdogs but welcomed by anti-communist insurgency officials",
      "url": "https://abcnews.go.com/International/wireStory/philippine-court-convicts-journalist-terror-financing-charge-ruling-129445362",
      "published": "Thu, 22 Jan 2026 04:01:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UN strongly condemns demolition of UNRWA headquarters in East Jerusalem",
      "description": "The reported demolition underway early Tuesday of the headquarters of UN agency UNRWA by Israeli forces in occupied East Jerusalem - reportedly “under the watch of lawmakers and a member of the Government” - has prompted swift condemnation from the global body.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166792",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Jury reaches verdict in trial of ex-Uvalde school police officer accused of failing to confront gunman",
      "description": "Former Uvalde school district officer Adrian Gonzales was acquitted by a jury on Wednesday evening on charges in connection with the 2022 Robb Elementary School shooting.",
      "url": "https://www.foxnews.com/us/jury-reaches-verdict-trial-ex-uvalde-school-police-officer-accused-failing-confront-gunman",
      "published": "Wed, 21 Jan 2026 20:46:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Iran blocked the internet amid deadly protests. Some voices are still getting through",
      "description": "Weeks into an internet blackout in Iran, NPR speaks to a protester who is still online and a U.S.-based activist who is trying to get more Starlink terminals into the country to get more people online.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5680784/iran-blocked-the-internet-amid-deadly-protests-some-voices-are-still-getting-through",
      "published": "Thu, 22 Jan 2026 04:44:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Germany news: Berlin mulls sending migrants to third nations",
      "description": "Germany has joined a group of five nations to explore the deportations to third-country migrant hubs. Meanwhile, firefighters tackled a blaze at a property once belonging to prominent Nazi Joseph Goebbels. DW has more.",
      "url": "https://www.dw.com/en/germany-news-berlin-mulls-sending-migrants-to-third-nations/live-75604347?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 12:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "What we know about Trump's  'framework of future deal' over Greenland",
      "description": "Denmark and Greenland have made it clear they will not relinquish sovereignty of the world's largest island.",
      "url": "https://www.bbc.com/news/articles/c86vvjxe9z7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 17:02:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Oldest cave painting of red claw hand could rewrite human creativity timeline",
      "description": "A stencilled outline of a hand found on the Indonesian island of Sulawesi is the world's oldest known cave painting, researchers say.",
      "url": "https://www.bbc.com/news/articles/czx1pnlzer5o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 16:00:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Real Madrid remain football’s top earners but Liverpool overtake Man Utd",
      "description": "Real Madrid remain the top earner in world football but Liverpool leap in ranking, while Manchester United slide.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/liverpool-overtake-man-utd-but-real-madrid-remain-footballs-top-earners?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 16:39:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli settlers forcibly displacing largest Palestinian Bedouin village",
      "description": "Settler violence in the occupied West Bank has emptied nearly three-quarters of this Palestinian Bedouin village.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/israeli-settlers-forcibly-displacing-largest-palestinian-bedouin-village?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 12:58:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Hand shape in Indonesian cave may be world’s oldest known rock art",
      "description": "Archaeologists say stencil painted with ochre in limestone cave on Muna Island was created at least 67,800 years ago The faded outline of a hand on a cave wall in Indonesia may be the world’s oldest known rock art, according to archaeologists who say it was created at least 67,800 years ago. The ancient hand stencil was discovered in a limestone cave popular with tourists on Muna Island, part of south-eastern Sulawesi, where it had gone unnoticed between more recent paintings of animals and other figures. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/21/hand-shape-indonesia-cave-rock-art-67800-years-old",
      "published": "Wed, 21 Jan 2026 16:00:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The U.S. is leaving the WHO. But like most breakups, the details are complicated",
      "description": "The U.S.'s break from the World Health Organization is almost finalized. But the details of the breakup are complicated - as are the post-divorce dynamics.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5679546/the-u-s-is-leaving-the-who-but-like-most-breakups-the-details-are-complicated",
      "published": "Thu, 22 Jan 2026 04:44:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Fact check: Are fans cancelling World Cup 2026 tickets over US immigration fears?",
      "description": "Fears over US immigration policies are fueling viral claims that thousands are canceling World Cup 2026 tickets. Are fans really backing out—and could ICE target visitors?",
      "url": "https://www.dw.com/en/fact-check-are-fans-cancelling-world-cup-2026-tickets-over-us-immigration-fears/a-75562821?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 16:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Davos 2026: Zelenskyy repeats call for Europe to 'act now'",
      "description": "\"Without action now, there is no tomorrow,\" Ukrainian President Zelenskyy tells world leaders at Davos, adding that Europe needs to be able to protect itself. Follow DW for more.",
      "url": "https://www.dw.com/en/davos-2026-zelenskyy-repeats-call-for-europe-to-act-now/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 15:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "India's dilemma over Trump's Gaza 'Board of Peace'",
      "description": "Trump's 'Board of Peace' is testing India's long held balancing act between Israel and the Palestinians, raising questions about costs, strategy, and global leadership.",
      "url": "https://www.dw.com/en/india-s-dilemma-over-trump-s-gaza-board-of-peace/a-75607689?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 15:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Where is the US-China AI 'race' heading in 2026?",
      "description": "With American tech continuing to dominate developing the frontier of artificial intelligence, China is holding its own with globally popular cheaper models and plans for building an AI-powered economy in the near future.",
      "url": "https://www.dw.com/en/where-is-the-us-china-ai-race-heading-in-2026/a-75608670?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 14:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Davos: Germany's Merz says old world order 'unraveling'",
      "description": "German Chancellor Merz said the world has \"entered an era of great power politics\" where Russia and China challenge the US. In his speech at Davos, Merz said Europe must boost competitiveness and invest in defense.",
      "url": "https://www.dw.com/en/davos-germany-s-merz-says-old-world-order-unraveling/a-75606240?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 13:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Cup 2026: Could Europe drive a boycott?",
      "description": "Just as it did in Russia 2018 and Qatar 2022, politics is dominating the build up to World Cup 2026. Could discontent with Donald Trump in Europe see football heavyweights united behind such a cause?",
      "url": "https://www.dw.com/en/world-cup-2026-could-europe-drive-a-boycott/a-75598538?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 10:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "REPLAY: Zelenzky speaks after meeting with Trump",
      "description": "Volodymyr Zelensky speaks at World Economic Forum after meeting Donald Trump.",
      "url": "https://www.france24.com/en/replay-zelenzky-speaks-after-meeting-with-trump",
      "published": "Thu, 22 Jan 2026 15:00:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Who's on Trump's Board of Peace - and who said no",
      "description": "Donald Trump says \"a lot of great people\" want to join his Board of Peace - but some world leaders are clearly worried the controversial initiative could undermine the United Nations.",
      "url": "https://news.sky.com/story/what-is-trumps-board-of-peace-and-is-it-going-to-replace-the-un-13497460",
      "published": "Thu, 22 Jan 2026 08:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump is rolling out his Board of Peace at Davos at a time when US leadership is being questioned",
      "description": "President Donald Trump is set to unveil his proposed Board of Peace at the World Economic Forum",
      "url": "https://abcnews.go.com/International/wireStory/trump-rolling-board-peace-davos-time-us-leadership-129443374",
      "published": "Thu, 22 Jan 2026 02:17:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World leaders join Trump to sign Board of Peace agreement and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/world-leaders-join-trump-board-peace-agreement-more-top-headlines",
      "published": "Thu, 22 Jan 2026 07:01:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump floats ‘Board of Peace’ to replace UN, signals major global power shift",
      "description": "President Donald Trump invited dozens of countries including Russia, China, and Ukraine to join his Board of Peace initiative, with a signing ceremony planned for Davos, Switzerland.",
      "url": "https://www.foxnews.com/world/trump-floats-board-peace-replace-un-signals-major-global-power-shift",
      "published": "Tue, 20 Jan 2026 17:36:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Vampire film Sinners breaks Oscar nominations record",
      "description": "The horror is up for 16 awards - setting a new record for the most Oscar nominations for a single film.",
      "url": "https://www.bbc.com/news/articles/cz0ppdjmjy9o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 15:10:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘War has to end:’ Trump on Ukraine after Zelenskyy meeting",
      "description": "After meeting Ukrainian President Volodymyr Zelenskyy, US President Donald Trump says Russia’s ‘war has to end’.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/war-has-to-end-trump-on-ukraine-after-zelenskyy-meeting?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 15:13:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nearly 200 arrested in cross-border crackdown on gold mining in Amazon",
      "description": "Cash, gold, mercury and firearms seized in operations in Brazil, French Guiana, Guyana and Suriname Police and prosecutors from Brazil, French Guiana, Guyana and Suriname have arrested nearly 200 people in their first joint cross-border operation targeting illegal gold mining in the Amazon region, authorities said. The operation was backed by Interpol, the EU and Dutch police specialising in environmental crime. It involved more than 24,500 checks on vehicles and people across remote border areas and led to the seizure of cash, unprocessed gold, mercury, firearms, drugs and mining equipment, Interpol said. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/cross-border-crackdown-illegal-gold-mining-amazon",
      "published": "Thu, 22 Jan 2026 13:08:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela’s Delcy Rodríguez assured US of cooperation before Maduro’s capture",
      "description": "Exclusive: sources say powerful figures in the regime secretly pledged US and Qatari officials they would welcome Maduro’s departure Before the US military snatched Venezuela ’s president, Nicolás Maduro , earlier this month, Delcy Rodríguez and her powerful brother pledged to cooperate with the Trump administration once the strongman was gone, four sources involved at high levels with the discussions told the Guardian. Rodríguez, who was sworn in on 5 January as acting president to replace Maduro, and her brother Jorge, the head of the national assembly, secretly assured US and Qatari officials through intermediaries ahead of time that they would welcome Maduro’s departure, according to the sources. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/delcy-rodriguez-capture-maduro-venezuela",
      "published": "Thu, 22 Jan 2026 12:55:53 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Sheinbaum defends transfer of Mexican cartel members amid efforts to appease Trump",
      "description": "Analysts warn that Trump will probably demand more action from Mexico to counter drug-trafficking groups Mexico’s President Claudia Sheinbaum has defended the latest transfer of 37 Mexican cartel operatives to the US as a “sovereign decision”, as her government strives to alleviate pressure from the Trump administration to do more against drug-trafficking groups. It was the third such flight in the year since Donald Trump returned to the White House, but analysts warn that while it remains an effective pressure valve, the returns may be diminishing. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/sheinbaum-mexican-cartel-trump",
      "published": "Wed, 21 Jan 2026 20:05:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘Manosphere’ influencers pushing testosterone tests are convincing healthy young men there is something wrong with them, study finds",
      "description": "Researcher points to ‘medicalisation of masculinity’ after investigating how men’s health is being monetised online “If you’re not waking up in the morning with a boner, there’s a large possibility that you have low testosterone levels,” an influencer on TikTok with more than 100,000 followers warns his viewers. Despite screening for low testosterone being medically unwarranted in most young men, this group is being aggressively targeted online by influencers and wellness companies promoting hormone tests and treatments as essential to being a “real man”, a study published in the journal Social Science and Medicine has found. Continue reading...",
      "url": "https://www.theguardian.com/society/2026/jan/22/manosphere-influencers-testosterone-tests-young-men",
      "published": "Thu, 22 Jan 2026 14:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Former U.S. ambassador discusses the path forward after Trump's Davos speech",
      "description": "NPR's A Martinez speaks with Alan Leventhal, a former U.S. ambassador to Denmark, about developments following President Trump's speech in Davos.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5684143/former-u-s-ambassador-discusses-the-path-forward-after-trumps-davos-speech",
      "published": "Thu, 22 Jan 2026 06:58:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Sinners' breaks records at 2026 Oscar nominations",
      "description": "The film by Ryan Coogler earned 16 nods for the 98th Academy Awards, which will be presented on March 15. A new Oscar category was also introduced for the first time in 25 years.",
      "url": "https://www.dw.com/en/sinners-breaks-records-at-2026-oscar-nominations/a-75606280?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 15:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Vampire horror 'Sinners' leads Oscar nominees, followed by 'One Battle After Another'",
      "description": "The Academy of Motion Picture Arts and Sciences have announced the nominees for the 98th Academy Awards, with Ryan Coogler's vampire horror \"Sinners\" leading the charge. Racking up a record 16 nominations in various categories, \"Sinners\" is followed by Paul Thomas Anderson's \"One Battle After Another\", on 13 nominations. FRANCE 24's Olivia Salazar-Winspear takes us through the movies and the movie stars who could be in line for a gold statuette on March 15.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260122-vampire-horror-sinners-leads-oscar-nominees-followed-by-one-battle-after-another",
      "published": "Thu, 22 Jan 2026 16:53:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky says US 'security guarantees' for Ukraine ready after meeting with Trump",
      "description": "Ukrainian President Volodymyr Zelensky said Thursday he and US President Donald Trump had agreed on post-war US security guarantees for Ukraine, without providing further details. The deal, which awaits signatures and parliamentary approval, would be a key step in plans to end the Russian invasion.",
      "url": "https://www.france24.com/en/europe/20260122-zelensky-says-us-security-guarantees-ready-after-meeting-with-trump",
      "published": "Thu, 22 Jan 2026 16:33:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky says that \"nothing has changed\" since last Davos summit",
      "description": "Ukrainian President Volodymyr Zelensky criticised what he called the EU’s lack of “political will” towards his Russian counterpart Vladimir Putin at Davos.",
      "url": "https://www.france24.com/en/video/20260122-zelensky-says-that-nothing-has-changed-since-last-davos-summit",
      "published": "Thu, 22 Jan 2026 15:59:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine's Zelensky laments EU lack of 'political will' in dealing with Russia",
      "description": "Ukrainian President Volodymyr Zelensky on Thursday criticised what he called the EU’s lack of “political will” towards his Russian counterpart Vladimir Putin at Davos. Meanwhile, Denmark said NATO chief Mark Rutte could not negotiate over Greenland after the head of the transatlantic alliance discussed a “framework” for the island's future with US President Donald Trump. France24 journalist Angela Diffley tells us more.",
      "url": "https://www.france24.com/en/ukraine-s-zelensky-laments-eu-lack-of-political-will-in-dealing-with-russia",
      "published": "Thu, 22 Jan 2026 14:58:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Strong Roots': Ukrainian chef Olia Hercules on her family history",
      "description": "A Ukrainian woman has spoken to FRANCE 24 about how she's written a book about her family history to try to help her people's efforts in the war against Russia. Olia Hercules is a Ukrainian-born, London-based chef, cookbook writer and activist. In her latest book \"Strong Roots: A Memoir of Food, Family and Ukraine\", she combines her journalism background and passion for food to recount the story of her family through four generations, from life under Soviet rule to the war-torn present day. She spoke to us in Perspective.",
      "url": "https://www.france24.com/en/tv-shows/perspective/20260122-strong-roots-ukrainian-chef-olia-hercules-on-her-family-history",
      "published": "Thu, 22 Jan 2026 14:48:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US allies need to learn key lesson from Trump's Greenland obsession",
      "description": "Donald Trump's grandstanding on Greenland betrays a disdain for NATO that means this crisis for the alliance is far from over despite his sudden climbdown.",
      "url": "https://news.sky.com/story/trumps-greenland-climbdown-dont-let-it-fool-you-this-crisis-is-far-from-over-for-nato-13497397",
      "published": "Thu, 22 Jan 2026 00:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany expels a Russian diplomat after a suspect is arrested in an espionage case",
      "description": "The German government has expelled a Russian diplomat over a case involving espionage related to the war in Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/germany-expels-russian-diplomat-after-suspect-arrested-espionage-129451704",
      "published": "Thu, 22 Jan 2026 09:20:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "After presidential election, Ugandan police detain a key ally of opposition figure Bobi Wine",
      "description": "Police have detained a key ally of Ugandan opposition figure Bobi Wine, accusing him of involvement in election-related violence",
      "url": "https://abcnews.go.com/International/wireStory/after-presidential-election-ugandan-police-detain-key-ally-129447736",
      "published": "Thu, 22 Jan 2026 07:29:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Indiana judge shooting leaves ‘long list’ of potential suspects days into manhunt: defense attorney",
      "description": "Indiana Judge Steven Meyer and wife shot allegedly after shooter used dog ruse to get them to open door. Multiple law enforcement agencies investigating.",
      "url": "https://www.foxnews.com/us/indiana-judge-shooting-leaves-long-list-potential-suspects-days-manhunt-defense-attorney",
      "published": "Thu, 22 Jan 2026 07:00:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Border Patrol chief targeted in alleged murder-for-hire plot focused on Snapchat messages",
      "description": "A jury weighs a murder-for-hire case against a Chicago man accused of targeting a Border Patrol official through Snapchat messages offering cash rewards.",
      "url": "https://www.foxnews.com/us/border-patrol-chief-targeted-alleged-murder-hire-plot-focused-snapchat-messages",
      "published": "Wed, 21 Jan 2026 20:04:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Federal officials say anti-ICE agitators 'going after the dogs' after Minneapolis kennel incident",
      "description": "An anti-ICE message was reportedly scrawled on a CBP K-9's feed chart at a Minneapolis kennel, prompting outrage from homeland security officials.",
      "url": "https://www.foxnews.com/us/federal-officials-say-anti-ice-agitators-going-after-dogs-following-minneapolis-kennel-incident",
      "published": "Wed, 21 Jan 2026 19:34:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fourth shark attack in three days rocks Australia as authorities close beaches and deploy drumlines",
      "description": "A string of shark attacks near Sydney prompted beach closures across New South Wales. The latest victim attacked at Point Plomer suffered only minor cuts.",
      "url": "https://www.foxnews.com/world/fourth-shark-attack-three-days-rocks-australia-authorities-close-beaches-deploy-drumlines",
      "published": "Tue, 20 Jan 2026 07:24:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US to transfer Islamic State prisoners from Syria to Iraq",
      "description": "The move comes as Syrian government forces take control of north-eastern areas where Kurdish-led forces have long controlled.",
      "url": "https://www.bbc.com/news/articles/cx20pwqkgp9o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 20:09:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "A bid to clean up shipping industry intensified a coral bleaching event on Great Barrier Reef, study says",
      "description": "The removal of sulphur from shipping fuels caused ‘a lot of extra sunlight’ to get through atmosphere and hit reef in 2022 Steps to clean up the shipping industry by removing sulphur from fuels intensified a major coral bleaching event on the Great Barrier Reef by allowing more of the sun’s energy to hit the oceanic wonder, according to a new study. Sulphur pollution can cause respiratory problems for humans and cause acid rain, but it also has a shading effect and can make clouds brighter, providing more shade to areas underneath. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/22/great-barrier-reef-coral-bleaching-shipping-industry-sulphur",
      "published": "Thu, 22 Jan 2026 11:00:53 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Danish leader says her country can't negotiate on sovereignty",
      "description": "Denmark’s prime minister is saying after U_S_ President Donald Trump announced he agreed a “framework of a future deal” on Arctic security with the head of NATO that her country can’t negotiate on its sovereignty and she has been “informed that this ha...",
      "url": "https://abcnews.go.com/International/wireStory/danish-leader-country-negotiate-sovereignty-shes-told-case-129445256",
      "published": "Thu, 22 Jan 2026 03:08:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Campaigning starts for Bangladesh's first national election after Hasina's ouster",
      "description": "Campaigning has begun for Bangladesh’s elections next month",
      "url": "https://abcnews.go.com/International/wireStory/campaigning-starts-bangladeshs-national-election-after-hasinas-ouster-129444573",
      "published": "Thu, 22 Jan 2026 02:09:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Human trafficking depends on corruption at every step",
      "description": "In 2011, a trafficker in Chile was convicted for recruiting economically vulnerable Peruvian citizens and arranging for them to be brought into the country – destined to become victims of sexual exploitation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166797",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota agitators stalk, pelt Border Patrol agents with food and spit at gas stations, DHS says",
      "description": "Anti-ICE agitators allegedly stalked, threw food at and spit on federal agents in Minneapolis, forcing crowd control measures, according to DHS.",
      "url": "https://www.foxnews.com/us/minnesota-agitators-stalk-pelt-border-patrol-agents-food-spit-gas-stations-dhs-says",
      "published": "Thu, 22 Jan 2026 08:02:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Former Iowa school superintendent arrested by ICE expected to plead guilty to federal charges",
      "description": "Former Des Moines Public Schools Superintendent Ian Roberts is set to plead guilty to a pair of federal charges following his September 2025 arrest by ICE.",
      "url": "https://www.foxnews.com/us/former-iowa-school-superintendent-arrested-ice-expected-plead-guilty-federal-charges",
      "published": "Thu, 22 Jan 2026 07:34:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US immigration authorities allow suspect in $100M jewelry heist to self-deport before trial",
      "description": "A suspect in a $100 million jewelry heist was allowed by U.S. immigration officials to self-deport to Ecuador, avoiding a federal trial and potential prison time.",
      "url": "https://www.foxnews.com/us/us-immigration-authorities-allow-suspect-100-million-jewelry-heist-self-deport-before-trial",
      "published": "Thu, 22 Jan 2026 02:08:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump claims to have secured ‘total access’ to Greenland in NATO deal",
      "description": "Trump's comments come as European allies scramble to respond to his about-face on US tariffs, Greenland threats.",
      "url": "https://www.aljazeera.com/news/2026/1/22/trumps-greenland-pact-will-demand-allies-boost-arctic-security-nato-chief?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 13:31:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: far-right extremist 'Saxon Separatists' stand trial",
      "description": "The trial of 8 suspected right-wing extremists accused of planning a coup is beginning in the German city of Dresden. Their goal: A Nazi state.",
      "url": "https://www.dw.com/en/germany-far-right-extremist-saxon-separatists-stand-trial/a-75601683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 14:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Donald Trump's latest visa ban hits African countries hard",
      "description": "A decision by the US government to suspend visa procedures for numerous countries, including African ones, has come into effect. Experts say it is part of Donald Trump's strategy of portraying immigrants as a threat.",
      "url": "https://www.dw.com/en/donald-trump-s-latest-visa-ban-hits-african-countries-hard/a-75590864?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 11:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Key US allies keep their distance as Trump launches 'Board of Peace' initiative for Gaza",
      "description": "US President Donald Trump on Thursday unveiled a new US-led \"Board of Peace\" to oversee the Israel-Hamas ceasefire and shape Gaza’s future, pitching it as a potential rival to the UN – even as several close US allies declined to take part.",
      "url": "https://www.france24.com/en/americas/20260122-donald-trump-launches-board-of-peace-initiative-for-gaza-as-key-us-allies-stay-away",
      "published": "Thu, 22 Jan 2026 14:58:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Spain sees fourth train crash in five days",
      "description": "A commuter train has crashed into a construction crane in southeastern Spain, the fourth rail incident in the space of a week.",
      "url": "https://news.sky.com/story/commuter-train-crashes-into-crane-in-murcia-marking-spains-fourth-train-crash-in-five-days-13497591",
      "published": "Thu, 22 Jan 2026 13:03:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "NATO chief Mark Rutte's shows he's the 'Trump Whisperer' after Greenland diplomacy with Trump",
      "description": "NATO Secretary-General Mark Rutte appears to have been instrumental in persuading U.S. President Donald Trump to scrap his threat of tariffs as he presses for control over Greenland",
      "url": "https://abcnews.go.com/International/wireStory/nato-chief-mark-ruttes-shows-trump-whisperer-after-129448435",
      "published": "Thu, 22 Jan 2026 07:29:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fire at Cox's Bazar refugee camp in Bangladesh destroyed homes and displaced thousands of Rohingya",
      "description": "A massive fire this week has destroyed hundreds of makeshift homes in a Rohingya refugee camp in Cox's Bazar, Bangladesh, displacing more than 2,000 people",
      "url": "https://abcnews.go.com/International/wireStory/fire-coxs-bazar-refugee-camp-bangladesh-destroyed-homes-129445988",
      "published": "Thu, 22 Jan 2026 06:09:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Cambodia will send 73 online scam suspects to South Korea",
      "description": "73 South Koreans detained in Cambodia for alleged involvement in online scams will be brought back home this week to face criminal investigation",
      "url": "https://abcnews.go.com/International/wireStory/cambodia-send-73-online-scam-suspects-south-korea-129443648",
      "published": "Thu, 22 Jan 2026 01:37:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Idaho murder victims' families express outrage after crime scene photos accidentally released",
      "description": "Crime scene photos from the 2022 Idaho student murders were accidentally released, sparking outrage from victims' families who called for respect.",
      "url": "https://www.foxnews.com/us/idaho-murder-victims-families-express-outrage-after-crime-scene-photos-accidentally-released",
      "published": "Thu, 22 Jan 2026 08:39:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Can China rely on domestic oil after Iran, Venezuela shocks?",
      "description": "Donald Trump's moves against two key suppliers have revived debate over China’s fragile oil balance. With domestic output flat and oil fields aging, how much capacity — if any — exists to raise production?",
      "url": "https://www.dw.com/en/can-china-rely-on-domestic-oil-after-iran-venezuela-shocks/a-75516569?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 13:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Hong Kong: Organizers of Tiananmen vigil put on trial",
      "description": "Two of the defendants pleaded not guilty before the Hong Kong court, while the other pleaded guilty but pledged to keep working to end one-party rule in China. They're accused of \"inciting subversion of state power.\"",
      "url": "https://www.dw.com/en/hong-kong-organizers-of-tiananmen-vigil-put-on-trial/a-75604100?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 12:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US moves 150 Islamic State prisoners out of Syria with thousands more to follow",
      "description": "US troops have transferred 150 Islamic State (IS) prisoners from Syria to Iraq under plans that could see 7,000 detainees moved across the border.",
      "url": "https://news.sky.com/story/us-moves-150-islamic-state-prisoners-out-of-syria-with-thousands-more-to-follow-13497338",
      "published": "Wed, 21 Jan 2026 21:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Virginia Dems introduce classroom DEI curriculum law on day 1 of legislative session",
      "description": "Virginia Democrats introduce HB 614 requiring DEI curriculum in schools, mandating instruction on \"historically marginalized communities\" across all districts.",
      "url": "https://www.foxnews.com/us/virginia-dems-introduce-classroom-dei-curriculum-law-day-1-legislative-session",
      "published": "Thu, 22 Jan 2026 11:20:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters break free from Syrian jail amid chaotic government handover",
      "description": "U.S. military boosts regional presence with F-15 fighter jets and USS Abraham Lincoln deployment as ISIS prison break highlights security risks amid Syria's political realignment.",
      "url": "https://www.foxnews.com/world/isis-fighters-break-free-from-syrian-jail-amid-chaotic-government-handover",
      "published": "Mon, 19 Jan 2026 22:10:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Gunmen abduct dozens of worshippers from multiple Nigerian churches using sophisticated weapons",
      "description": "Gunmen allegedly abducted dozens of worshippers from two churches in Nigeria's Kaduna state, with security forces deployed to track the captors.",
      "url": "https://www.foxnews.com/world/gunmen-abduct-dozens-worshippers-multiple-nigerian-churches-using-sophisticated-weapons",
      "published": "Mon, 19 Jan 2026 21:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "UK holds off joining Trump's Board of Peace over Putin concerns",
      "description": "Foreign Secretary Yvette Cooper says the Russian president has shown no commitment to peace in Ukraine.",
      "url": "https://www.bbc.com/news/articles/cp9jj1j74ggo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 15:40:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Gaza’s Rafah crossing with Egypt to open next week: Palestinian official",
      "description": "US-backed technocrat leader Ali Shaath made the announcement as President Trump launched his 'Board of Peace' for Gaza.",
      "url": "https://www.aljazeera.com/news/2026/1/22/gazas-rafah-crossing-with-egypt-to-open-next-week-palestinian-official?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 12:44:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Keir Starmer to visit China with British business leaders next week, say reports",
      "description": "Prime minister’s reported trip follows approval by UK government for Beijing to build new embassy in London UK politics live – latest updates Davos live – latest updates Keir Starmer will reportedly visit China next week after controversial plans for Beijing to build a vast embassy in London were approved by his government. The UK prime minster will lead a delegation of blue-chip British companies, according to Reuters. The same firms, which include BP, HSBC, Intercontinental Hotels Group, Jaguar Land Rover and Rolls-Royce were also said to be among those who will join a revamped “UK-China CEO council”. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/21/keir-starmer-visit-china-british-business-leaders",
      "published": "Wed, 21 Jan 2026 10:09:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Kangaroos’ giant ancestor probably able to hop despite 250kg weight, scientists say",
      "description": "Research for first time suggests tendon and bones in heavier species would have made bounding possible Giant 250kg kangaroos that once roamed Australia would probably have been able to hop despite their enormous size, researchers have said. While modern kangaroos are known for their ability to travel large distances by jumping with both hind legs at the same time, it has long been debated whether their extinct relatives would have been so springy. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/giant-kangaroo-ancestor-hop-250kg-weight",
      "published": "Thu, 22 Jan 2026 16:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2026-01-22T17:29:53.372315Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Nanterre prison: Symptom of France's overflowing carceral system",
      "description": "Located in the suburbs of #Paris, the #prison in Nanterre was opened in 1991 and built to take in nearly 600 inmates. Today, there are over 1,200 sharing tiny cells. Nanterre is the symptom of a broader problem: the French #carceral system is one of the most overpopulated in #Europe.",
      "url": "https://www.france24.com/en/video/20260122-nanterre-prison-symptom-of-france-s-overflowing-carceral-system",
      "published": "Thu, 22 Jan 2026 14:43:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Japan records a 5th straight yearly trade deficit",
      "description": "Japan has reported it posted a trade deficit for the fifth straight year in 2025 as exports were hit by President Donald Trump’s tariffs and a diplomatic rift with neighboring China",
      "url": "https://abcnews.go.com/International/wireStory/japan-records-5th-straight-yearly-trade-deficit-129441650",
      "published": "Thu, 22 Jan 2026 00:12:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Prison breaks and renewed clashes raise alarm in northeast Syria",
      "description": "The United Nations continues to monitor developments in northeast Syria following clashes between government troops and the Kurdish-led SDF militia during which scores of detained ISIL militants reportedly escaped from prison.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166799",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump told to 'f--- off' by Danish lawmaker during European Parliament debate about Greenland",
      "description": "European Parliament member Anders Vistisen confronts President Donald Trump's Greenland interest with profanity-laced rebuke, drawing a reprimand from parliament leadership.",
      "url": "https://www.foxnews.com/world/trump-told-f-k-off-danish-lawmaker-european-parliament-greenland-debate",
      "published": "Tue, 20 Jan 2026 16:27:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "ICE detains 5-year-old during Minnesota operation",
      "description": "Local school officials say the boy was taken with his father. A government spokeswoman denied ICE was targeting the boy.",
      "url": "https://www.bbc.com/news/articles/cwyrrqwxpz7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 16:04:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump holds 'very good talks' with Zelensky as US pushes for Ukraine deal",
      "description": "The meeting came as US envoy Steve Witkoff headed to Moscow for a meeting with Russia's Vladimir Putin.",
      "url": "https://www.bbc.com/news/articles/c4g44r22j5jo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 14:23:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rapid rollback of Kurdish-led forces reshapes Sharaa's Syria",
      "description": "The retreat of the Syrian Democratic Forces (SDF) in the north-east marks the biggest change of control in Syria since the fall of Bashar al-Assad.",
      "url": "https://www.bbc.com/news/articles/c9311l0d40qo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 12:08:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Son-in-law of Venezuelan opposition candidate freed from jail, wife says",
      "description": "Rafael Tudares was arrested after his father-in-law, Edmundo González, ran against Nicolás Maduro in the election.",
      "url": "https://www.bbc.com/news/articles/cq5yywx39e7o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 11:35:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU suspends approval of US trade deal",
      "description": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland.",
      "url": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 23:41:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South African police not yet able to defeat gangs, minister says",
      "description": "Police Minister Firoz Cachalia says organised crime is growing more complex, requiring new strategies.",
      "url": "https://www.bbc.com/news/articles/cx2ll9wr562o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 08:23:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-intelligence officer accused of betraying Austria in Russia spying trial",
      "description": "Egisto Ott, 63, denies charges of handing over information to Russian agents.",
      "url": "https://www.bbc.com/news/articles/cz0pnjv1zy5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 14:03:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ghislaine Maxwell to testify before US Congress in Epstein probe",
      "description": "The convicted sex trafficker has previously said she would decline to answer questions unless she is granted immunity.",
      "url": "https://www.bbc.com/news/articles/cr7jlylp5keo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 05:14:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump ratcheted up the Greenland rhetoric - but has he been talked down?",
      "description": "Despite talk of a deal over Greenland, it will be hard for US allies to return to business as usual, writes the BBC’s diplomatic correspondent.",
      "url": "https://www.bbc.com/news/articles/cj3vv1kv1rdo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 01:52:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fact-checking Trump's Davos speech",
      "description": "The US president made a series of contested claims, ranging from the status of Greenland to Nato spending.",
      "url": "https://www.bbc.com/news/articles/c301jgd1qj6o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 19:19:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Inside Trump’s plan to rebuild Gaza without Palestinians",
      "description": "The US launches a \"Board of Peace\" for Gaza, but Palestinians have no seat at the table.",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/22/aje-onl-pal_phasetwoceasefire_av_v2-210126?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 16:49:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who got the most nods? The complete list of 2026 Oscar nominations",
      "description": "Ryan Coogler's film Sinners makes history with a record 16 nominations, followed by One Battle After Another with 13.",
      "url": "https://www.aljazeera.com/news/2026/1/22/who-got-the-most-nods-the-complete-list-of-2026-oscar-nominations?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 15:29:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Belgium’s Lumumba case raises a question Africa still avoids",
      "description": "Much of postcolonial Africa still fails to confront the political vision for which Patrice Lumumba was eliminated.",
      "url": "https://www.aljazeera.com/opinions/2026/1/22/belgiums-lumumba-case-raises-a-question-africa-still-avoids?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 15:11:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A Song for My Land: Children highlight pesticide use in Argentina",
      "description": "A teacher and his students in rural Argentina use music to raise the alarm about the dangers of pesticide spraying.",
      "url": "https://www.aljazeera.com/video/witness/2026/1/22/a-song-for-my-land-children-highlight-pesticide-use-in-argentina?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 15:00:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why did Israel join Trump’s ‘Board of Peace’ after raising objections?",
      "description": "Israeli PM Benjamin Netanyahu's flip-flop is part of disruption tactics to stall any peace in Gaza, say analysts.",
      "url": "https://www.aljazeera.com/features/2026/1/22/why-did-israel-join-trumps-board-of-peace-after-raising-objections?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 14:46:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Club Brugge fans jailed for impersonating Borat in Kazakhstan",
      "description": "Club Brugge were in Kazakhstan to face Kairat Almaty in the league phase of the UEFA Champions League.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/club-brugge-fans-jailed-for-impersonating-borat-in-kazakhstan?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 14:28:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Azeez Al-Shaair’s anti-genocide note: Muslims tackle NFL fine with charity",
      "description": "Houston Texans' linebacker faces $11,593 penalty for displaying nose tape message that says, 'Stop the Genocide'.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/azeez-al-shaairs-anti-genocide-note-muslims-tackle-nfl-fine-with-charity?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 14:09:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump’s Greenland ‘framework’ deal: What we know about it, what we don’t",
      "description": "Trump says he reached a 'framework of a future deal' on Greenland during a meeting with NATO's Mark Rutte in Davos.",
      "url": "https://www.aljazeera.com/news/2026/1/22/trumps-greenland-framework-deal-what-we-know-about-it-what-we-dont?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 13:50:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Which teams can still qualify for the UEFA Champions League knockouts?",
      "description": "Barcelona are the biggest name outside UCL last 16 spots, but Real Madrid, Liverpool and holders PSG are also at risk.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/who-can-still-qualify-in-the-uefa-champions-league?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 13:48:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump opens ‘Board of Peace’ by listing countries the US has bombed",
      "description": "During the signing of his ‘Board of Peace’, US President Donald Trump talked about the countries the US had bombed.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/trump-opens-board-of-peace-by-listing-countries-the-us-has-bombed?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 12:51:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former South Korean PM jailed for 23 years for role in martial law insurrection",
      "description": "Han Duck-soo verdict marks first judicial ruling stemming from ex-president Yoon Suk Yeol’s 2024 martial law decree South Korea’s former prime minister Han Duck-soo has been sentenced to 23 years in prison for his role in an insurrection stemming from the former president Yoon Suk Yeol’s failed martial law declaration . The judge, Lee Jin-kwan, ordered Han’s immediate detention. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/former-south-korea-pm-han-duck-soo-jailed-martial-law-insurrection",
      "published": "Wed, 21 Jan 2026 11:13:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-22T17:25:46.739Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-22T17:11:05.505Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-22T16:20:36.612Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-22T17:16:54.556Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-22T03:36:02.156Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The Taiwanese president's proposal to hike defense spending faces gridlock at home",
      "description": "Opposition parties are slamming the brakes on billions in defense funding as the China escalates military pressure.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5683130/taiwan-defense-spending",
      "published": "Thu, 22 Jan 2026 11:54:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Some Britons wonder if the U.S. and U.K.'s 'special relationship' may end in divorce",
      "description": "Some people in Britain are asking what it would look like for their government to sever security and intelligence ties with its closest ally, the U.S.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5682016/some-britons-wonder-if-the-u-s-and-u-k-s-special-relationship-may-end-in-divorce",
      "published": "Wed, 21 Jan 2026 18:01:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India: Woman arrested over suicide of man she accused",
      "description": "Police in India have arrested a woman who accused a man of sexual misconduct on a bus on social media, who then took his own life soon after. His family accused the woman of engagement farming with a spurious claim.",
      "url": "https://www.dw.com/en/india-woman-arrested-over-suicide-of-man-she-accused/a-75610488?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 16:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From Vikings to Trump: The history of Greenland",
      "description": "After being inhabited only by Indigenous peoples for centuries, the Arctic island saw the Vikings in the 10th century and the Danes in 1721, and it attracted US interest back in 1867.",
      "url": "https://www.dw.com/en/from-vikings-to-trump-the-history-of-greenland/a-75604169?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 14:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany expels Russian diplomat, summons ambassador over espionage case",
      "description": "Germany has expelled an individual after uncovering espionage linked to Russia and summoned Moscow's ambassador. Berlin says the move signals zero tolerance for spying under diplomatic cover.",
      "url": "https://www.dw.com/en/germany-expels-russian-diplomat-summons-ambassador-over-espionage-case/a-75609339?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 13:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Elizabeth Holmes asks Trump to commute her prison sentence",
      "description": "Elizabeth Holmes led people to believe that her now-defunct company, Theranos, had developed a medical device that could revolutionize blood tests. She is serving an 11-year sentence for fraud and conspiracy.",
      "url": "https://www.dw.com/en/elizabeth-holmes-asks-trump-to-commute-her-prison-sentence/a-75599260?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 04:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Books, after hours: France celebrates reading for pleasure",
      "description": "In this edition of Entre Nous we dive into reading! As France celebrates its tenth edition of les Nuits de la lecture, or Reading Nights, we find out how time spent reading literature, in France and elsewhere, is dropping. We also discuss whether this widespread dip in reading is changing society – namely, whether it is making politics dumber. Finally, we tackle a divisive question: is listening to audiobooks actually reading?",
      "url": "https://www.france24.com/en/tv-shows/entre-nous/20260122-books-after-hours-france-celebrates-reading-for-pleasure",
      "published": "Thu, 22 Jan 2026 15:27:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'We will let nothing pass': France intercepts Russia-linked oil tanker in Mediterranean",
      "description": "France’s navy on Thursday intercepted an oil tanker suspected of belonging to Russia’s sanctioned \"shadow fleet\" in the Mediterranean Sea. French President Emmanuel Macron said the operation, which took place between Spain and Morocco, was carried out with the help of several allies.",
      "url": "https://www.france24.com/en/france/20260122-we-will-let-nothing-pass-france-intercepts-russia-linked-oil-tanker-in-mediterranean",
      "published": "Thu, 22 Jan 2026 15:24:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Academy unveils 2025 Oscar nominees: from Marty Supreme to Bugonia",
      "description": "Actors Danielle Brooks and Lewis Pullman announced the nominees for the 2026 Oscars on Thursday morning from the Academy’s Samuel Goldwyn Theater. France24 Journalist Olivia Salazar-Winspear tells us more.",
      "url": "https://www.france24.com/en/academy-unveils-2025-oscar-nominees-from-marty-supreme-to-bugonia",
      "published": "Thu, 22 Jan 2026 14:50:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Academy unveils 2026 Oscar nominees",
      "description": "Actors Danielle Brooks and Lewis Pullman announced the nominees for the 2026 Oscars on Thursday morning from the Academy’s Samuel Goldwyn Theater. France24 journalist Olivia Salazar-Winspear shares her insights on films and actors nominated.",
      "url": "https://www.france24.com/en/academy-unveils-2026-oscar-nominees",
      "published": "Thu, 22 Jan 2026 14:48:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Exploring France's media landscape: A billionaire's playground?",
      "description": "France has a rich media landscape, offering a wide range of TV and radio stations, newspapers and magazines. The French media ecosystem is a mix of public service entities and private commercial players. Currently, about a dozen billionaires own or co-own most private media organisations. So what impact does this have on the content offered to the public, as well as editorial independence and media credibility? We take a closer look in French Connections.",
      "url": "https://www.france24.com/en/tv-shows/french-connections/20260122-exploring-france-s-media-landscape-a-billionaire-s-playground",
      "published": "Thu, 22 Jan 2026 14:08:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The penny dropped over Trump's Greenland plans - self-defeating, undeliverable and frankly mad",
      "description": "European governments and their diplomats here in Washington are as relieved as they are exasperated by this extraordinary Greenland show and latest act which played out in the Swiss Alps over the past 24 hours.",
      "url": "https://news.sky.com/story/the-truth-behind-trumps-greenland-deal-13497401",
      "published": "Thu, 22 Jan 2026 02:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why is Ryanair fighting with Elon Musk?",
      "description": "Elon Musk has said he could buy Ryanair amid an ongoing public spat with the budget airline's boss Michael O'Leary.",
      "url": "https://news.sky.com/story/elon-musk-vs-ryanair-could-tech-billionaire-actually-buy-budget-airline-and-what-started-online-spat-13497018",
      "published": "Wed, 21 Jan 2026 08:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's Navy intercepts an oil tanker in the Mediterranean sailing from Russia",
      "description": "Officials say that France’s Navy, working with intelligence provided by the United Kingdom, intercepted an oil tanker in the Mediterranean Sea that traveled from Russia, in a mission targeting the sanctioned Russian shadow fleet",
      "url": "https://abcnews.go.com/International/wireStory/frances-navy-intercepts-oil-tanker-mediterranean-sailing-russia-129453344",
      "published": "Thu, 22 Jan 2026 09:37:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The Philippine president is dismissed from hospital and says he's fine after an abdominal ailment",
      "description": "Philippine President Ferdinand Marcos Jr. has been taken to hospital overnight for an abdominal ailment that he says may be due to stress and age",
      "url": "https://abcnews.go.com/International/wireStory/philippine-president-dismissed-hospital-fine-after-abdominal-ailment-129447278",
      "published": "Thu, 22 Jan 2026 07:13:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cold kills another infant in Gaza as West Bank displacement intensifies",
      "description": "Another child in the Gaza Strip has died from hypothermia as winter weather continues to whip the enclave, the UN said on Wednesday, citing information from the health authorities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166804",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Casey Anthony claims US is racist and sexist, says White men have ‘never been marginalized’",
      "description": "Casey Anthony claims America has \"long-standing history\" of systemic racism against non-White men in controversial Substack post about DEI policies.",
      "url": "https://www.foxnews.com/us/casey-anthony-claims-us-racist-sexist-says-white-men-never-marginalized",
      "published": "Thu, 22 Jan 2026 11:24:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "California ‘party mom’ accused of grooming victims for sex, drinking in ritzy mansion, teens testify at trial",
      "description": "California mom Shannon O'Connor faces 63 charges for allegedly hosting alcohol parties where 14-year-old freshmen were encouraged to engage sexually.",
      "url": "https://www.foxnews.com/us/california-party-mom-accused-grooming-victims-sex-drinking-ritzy-mansion-teens-testify-trial",
      "published": "Thu, 22 Jan 2026 09:00:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jealous Texas woman allegedly launches 25-pound gym weight at romantic rival in fitness center",
      "description": "A jealous woman allegedly hurled a 25-pound weight at her romantic rival's head during a gym confrontation in Houston. The victim narrowly escaped serious injury.",
      "url": "https://www.foxnews.com/us/jealous-texas-woman-allegedly-launches-25-pound-gym-weight-romantic-rival-fitness-center",
      "published": "Wed, 21 Jan 2026 19:42:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NYPD detectives mistaken for ICE, treated rudely by hospital staff after scuffle with suspect",
      "description": "NYPD detectives were allegedly mistaken for ICE agents at a NYC hospital and treated rudely while seeking care after an arrest. The hospital apologized to the police commissioner.",
      "url": "https://www.foxnews.com/us/nypd-detectives-mistaken-ice-treated-rudely-hospital-staff-scuffle-suspect",
      "published": "Wed, 21 Jan 2026 19:10:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "PETA suggests replacing Punxsutawney Phil with hologram for Groundhog Day: 'Let Phil and his family retire'",
      "description": "PETA proposes a high-tech hologram replace Punxsutawney Phil at the annual Groundhog Day celebration, offering a 3D projection with weather predictions.",
      "url": "https://www.foxnews.com/us/peta-suggests-replacing-punxsutawney-phil-hologram-groundhog-day-let-phil-his-family-retire",
      "published": "Wed, 21 Jan 2026 18:54:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark's prime minister insists sovereignty is non-negotiable as Trump announces Greenland deal 'framework'",
      "description": "Denmark's prime minister said she won't negotiate her nation's sovereignty after President Donald Trump said a \"framework\" on a Greenland deal was reached.",
      "url": "https://www.foxnews.com/world/denmarks-prime-minister-insists-sovereignty-non-negotiable-trump-announces-greenland-deal-framework",
      "published": "Thu, 22 Jan 2026 08:19:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US begins transferring ISIS detainees from Syria to Iraq amid security transition",
      "description": "U.S. forces moved 150 ISIS detainees from Syria to Iraq as CENTCOM began a transfer operation involving up to 7,000 radical prisoners.",
      "url": "https://www.foxnews.com/world/us-begins-transferring-isis-detainees-from-syria-iraq-amid-security-transition",
      "published": "Wed, 21 Jan 2026 14:20:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu agrees to join Trump’s Gaza Board of Peace after initial pushback",
      "description": "Israeli Prime Minister Benjamin Netanyahu said he will join President Donald Trump’s newly formed Gaza Board of Peace after initially criticizing its structure.",
      "url": "https://www.foxnews.com/world/netanyahu-agrees-join-trumps-gaza-board-peace-after-initial-pushback",
      "published": "Wed, 21 Jan 2026 03:35:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces apprehend sanctioned vessel in Caribbean maritime operation targeting illicit oil transport",
      "description": "U.S. military forces apprehended Motor Vessel Sagitta in the Caribbean as part of Operation Southern Spear targeting sanctioned tanker vessels.",
      "url": "https://www.foxnews.com/world/us-forces-apprehend-sanctioned-vessel-caribbean-maritime-operation-targeting-illicit-oil-transport",
      "published": "Tue, 20 Jan 2026 16:40:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump confirms he invited Putin to join his Board of Peace: 'He's been invited'",
      "description": "U.S. President Donald Trump on Monday confirmed Russian President Vladimir Putin was invited to the Board of Peace for supervision of the Gaza plan.",
      "url": "https://www.foxnews.com/world/trump-confirms-he-invited-putin-join-his-board-peace-hes-been-invited",
      "published": "Tue, 20 Jan 2026 02:40:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}