{
  "last_updated": "2025-12-30T19:18:43.192397Z",
  "event_count": 223,
  "events": [
    {
      "title": "US military kills 2 alleged narco-terrorists in Eastern Pacific strike operation targeting vessel",
      "description": "U.S. Southern Command's Joint Task Force killed two alleged narco-terrorists in international waters on Dec. 29, marking the 30th strike since September.",
      "url": "https://www.foxnews.com/us/us-military-kills-2-narco-terrorists-eastern-pacific-strike-operation-targeting-vessel",
      "published": "Mon, 29 Dec 2025 18:25:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Facebook slow to act on posts celebrating Bondi beach massacre, anti-hate group says",
      "description": "Exclusive: CST highlights volume of IS-supporting accounts and says social media firms ‘putting all of us in danger’ Facebook hosted terrorist propaganda that celebrated the murder of Jews and praised Islamic State, a leading anti-hate group has alleged. The posts included celebrations of the Bondi beach massacre that the Community Security Trust says Facebook has been too slow to take down. The posts were still on Facebook on 16 December, two days after the attack, and received shares and likes. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/30/facebook-slow-to-act-on-posts-celebrating-of-jews-anti-hate-group-says",
      "published": "Tue, 30 Dec 2025 09:57:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 41,
      "severity_level": "Critical"
    },
    {
      "title": "Looking back at 2025 - in satellite images",
      "description": "An earthquake, wildfires, war and a funeral are among the world events that satellite images have helped Sky News cover this year.",
      "url": "https://news.sky.com/story/looking-back-at-2025-in-satellite-images-13488715",
      "published": "Tue, 30 Dec 2025 14:21:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s camp confirm two of his close friends died in Nigeria car crash",
      "description": "British former boxing champion sustained minor injuries Sina Ghami and Kevin ‘Lateef’ Ayodel killed in accident The British heavyweight boxer Anthony Joshua has issued a statement after he was injured in a car crash in Nigeria on Monday morning which killed two of his close friends. The former world heavyweight boxing champion was taken to an undisclosed hospital after his car hit a stationary vehicle at about 11am on the Lagos-Ibadan Expressway, the Ogun state police commissioner, Lanre Ogunlowo, said. The driver of Joshua’s vehicle was also injured, he added. Continue reading...",
      "url": "https://www.theguardian.com/sport/2025/dec/29/anthony-joshua-injured-car-crash-nigeria",
      "published": "Tue, 30 Dec 2025 00:17:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "China launches live-fire drills around Taiwan simulating blockade of major ports",
      "description": "Taipei condemns exercise that Chinese army calls ‘a stern warning’ against separatist and external forces China has launched live-fire military drills around Taiwan, simulating a blockade of major ports, attacking maritime targets, and fending off international “interference”, in what it calls a warning to “separatist” forces in Taiwan. The People’s Liberation Army (PLA) – the military wing of the ruling Communist party in China – sent its navy, air force, rocket force and coastguard to surround Taiwan on Monday morning for a surprise exercise called “Justice Mission 2025”, which began less than an hour after it was announced. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/china-live-fire-military-drills-around-taiwan",
      "published": "Mon, 29 Dec 2025 13:40:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "UN, US sign $2 billion humanitarian funding agreement for 17 crisis-hit countries",
      "description": "The United Nations and the United States on Monday formalized an agreement under which the US committed $2 billion in humanitarian assistance for global relief programmes, a move the UN’s top relief official hailed as a landmark commitment to saving lives amid escalating humanitarian needs worldwide.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166678",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Hamas confirms five leaders killed, including 'masked spokesperson' in major blow to terror group",
      "description": "Five Hamas military commanders confirmed dead by terrorist group's armed wing, marking significant blow to Palestinian militant organization's leadership structure in Gaza conflict.",
      "url": "https://www.foxnews.com/world/hamas-confirms-five-leaders-killed-including-masked-spokesperson-major-blow-terror-group",
      "published": "Mon, 29 Dec 2025 20:15:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan civil war: Health system ‘on the verge of collapse’",
      "description": "The war in Sudan has been tearing the country apart for almost 1,000 days, putting the country’s health system under intolerable pressure. The World Health Organization (WHO) is reporting widespread disease outbreaks, severe shortages, malnutrition and rising deaths.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166673",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns of ‘severe’ response in wake of Trump’s new strikes threat",
      "description": "US president says he would back attacks if Tehran rebuilds nuclear or missile programmes.",
      "url": "https://www.aljazeera.com/news/2025/12/30/iran-warns-of-severe-response-in-wake-of-trumps-new-strikes-threat?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 13:54:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Turkey arrests 357 people in operation against Islamic State group",
      "description": "Turkey said it arrested 357 people on Tuesday linked to the Islamic State group, following intelligence reports that the terrorist organisation was \"planning attacks\" during Christmas and New Year.",
      "url": "https://www.france24.com/en/asia-pacific/20251230-turkey-arrests-357-people-in-operation-against-islamic-state-group",
      "published": "Tue, 30 Dec 2025 17:13:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: Guterres deplores deadly mosque blast in Homs",
      "description": "UN Secretary-General António Guterres “unequivocally condemns” the deadly terrorist attack on a mosque in Homs, Syria during Friday prayers, his spokesperson said in a statement",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166674",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Africa’s Christian Crisis: How 2025’s deadly attacks finally drew global attention after Trump’s intervention",
      "description": "Christian communities in Africa reportedly under siege as Islamist groups target churches and believers across multiple countries during Christmas 2025.",
      "url": "https://www.foxnews.com/world/16m-christians-displaced-islamist-persecution-sweeps-across-africa-during-2025",
      "published": "Sun, 28 Dec 2025 08:00:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Australian police find no evidence of 'broader terrorist cell' in Bondi Beach antisemitic shooting",
      "description": "Police say an investigation that extended to the Philippines of two men accused of killing 15 people at a Sydney Jewish festival has found no evidence they were part of a “broader terrorist cell.”",
      "url": "https://abcnews.go.com/International/wireStory/australian-police-find-evidence-broader-terrorist-cell-bondi-128770999",
      "published": "Mon, 29 Dec 2025 22:49:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Japanese town reeling from year of record bear encounters",
      "description": "Bears are becoming a growing problem in some of Japan’s urban areas as they are forced to venture further in search of food It came as no surprise, least of all to the residents of Osaki, that “bear” was selected as Japan’s kanji character of the year earlier this month. The north-eastern town of 128,000 people is best known for its Naruko Onsen hot springs, autumn foliage and kokeshi – cylindrical dolls carved from a single piece of wood. But this year it has made the headlines as a bear hotspot, as the country reels from a year of record ursine encounters and deaths, with warnings that winter will not bring immediate respite. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/osaki-japan-town-record-bear-encounters-2025",
      "published": "Mon, 29 Dec 2025 11:00:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Hamas builds new terror regime in Gaza, recruiting teens amid problematic election",
      "description": "Hamas is recruiting teenage fighters during Gaza ceasefire after Israeli forces withdrew in October. This as national security analyst Professor Kobi Michael warns about growing militant control.",
      "url": "https://www.foxnews.com/world/hamas-builds-new-terror-regime-gaza-recruiting-teens-amid-problematic-election",
      "published": "Sun, 28 Dec 2025 21:25:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "At least 13 people killed and 98 injured in train derailment in Mexico",
      "description": "Train accident in Oaxaca is likely to raise criticisms about public works projects from the previous administration At least 13 people were killed when a train derailed in the Mexican state of Oaxaca, in an accident which is likely to revive opposition criticisms of the speed and dealings with which the country’s government builds its flagship public works projects. The incident took place on the Interoceanic Train, which was built to link the Atlantic and Pacific oceans across the narrowest part of the Isthmus of Tehuantepec, creating an alternative rail cargo route to the Panama canal intended to drive development in the region. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/mexico-train-derailment-oaxaca",
      "published": "Mon, 29 Dec 2025 18:48:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief urges world leaders to ‘get priorities straight’ as New Year message calls for peace over war",
      "description": "As the world enters 2026 amid mounting crises, the UN Secretary-General António Guterres has issued a stark but hopeful New Year appeal, urging global leaders to shift resources away from destruction and towards development, peace and people.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166677",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Sri Lanka cyclone: More than a million still need aid weeks after Ditwah floods",
      "description": "Nearly a month after Cyclone Ditwah tore across Sri Lanka, more than a million people – including over half a million children – remain in urgent need of humanitarian assistance, as floods, landslides and renewed rainfall continue to compound one of the country’s worst disasters in decades.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166671",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Peruvian shamans predict Maduro's fall, continued global conflicts in 2026",
      "description": "A group of Peruvian shamans gathered in front of the sea in the Miraflores district of Peru’s capital city to carry out an annual ritual in which they make predictions for the upcoming year",
      "url": "https://abcnews.go.com/International/wireStory/peruvian-shamans-predict-maduros-fall-continued-global-conflicts-128760987",
      "published": "Mon, 29 Dec 2025 17:29:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran reportedly developing chemical, biological missile warheads as protests spread over collapsing economy",
      "description": "As Netanyahu meets Trump, intelligence suggests Iran accelerating chemical weapons work while facing unprecedented domestic unrest and economic crisis.",
      "url": "https://www.foxnews.com/world/iran-reportedly-developing-chemical-biological-missile-warheads-protests-spread-over-collapsing-economy",
      "published": "Mon, 29 Dec 2025 10:52:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Nashville shooter Audrey Hale allegedly used federal student aid to buy guns for school attack",
      "description": "Audrey Elizabeth Hale used federal Pell Grant money to purchase firearms for Covenant School shooting in Nashville, according to newly released FBI records.",
      "url": "https://www.foxnews.com/us/nashville-shooter-audrey-hale-allegedly-used-federal-student-aid-buy-guns-school-attack",
      "published": "Mon, 29 Dec 2025 21:29:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine updates: Putin house attack claim threatens talks",
      "description": "Peace talks to end the war in Ukraine were dealt a setback after Russia claimed that Ukrainian forces launched a drone strike on one of Vladimir Putin's residences. Follow DW for the latest.",
      "url": "https://www.dw.com/en/ukraine-updates-putin-house-attack-claim-threatens-talks/live-75337215?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 03:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Why China is bringing out the big guns for military drills around Taiwan",
      "description": "China stepped up its military drills around Taiwan with live-fire exercises on Tuesday, the second day of an operation dubbed “Justice Mission 2025\". The massive show of force comes at a crucial time as Beijing seeks to capitalise on domestic political tensions in Taiwan and issue a warning to foreign powers supporting Taipei.",
      "url": "https://www.france24.com/en/asia-pacific/20251230-why-china-is-bringing-out-the-big-guns-for-military-drills-around-taiwan",
      "published": "Tue, 30 Dec 2025 16:58:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN peacekeeper injured in gunfire near ‘Blue Line’ in south Lebanon",
      "description": "One United Nations peacekeeper was injured on Friday after heavy machine gunfire from Israel Defense Forces (IDF) positions south of the Blue Line, following a nearby grenade explosion, impacted close to a UN patrol in southern Lebanon.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166676",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Historic vote looms in Central African Republic as UN urges peaceful participation",
      "description": "With Central Africans set to vote in presidential, legislative, regional and long-delayed municipal elections this weekend, the United Nations has appealed for calm and restraint, warning that the credibility of the process will be critical to consolidating peace after years of conflict and instability.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166665",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "2025 Most Memorable Heartwarming Moments: December 30, 2025",
      "description": "Choose between Robert Irwin winning Dancing with the Stars, the Nation raising money and supporting LA after the wildfires, or the Election of Pope Leo XIV.",
      "url": "https://www.foxnews.com/us/2025-most-memorable-heartwarming-moments-december-30-2025",
      "published": "Tue, 30 Dec 2025 07:52:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian president says his country is at 'total war' with the US, Israel and Europe: reports",
      "description": "Iranian President Masoud Pezeshkian says his country is at 'total war' with the U.S., Israel and Europe, claiming the conflict is more complex than Iran's 1980s war with Iraq.",
      "url": "https://www.foxnews.com/world/iranian-president-says-country-total-war-us-israel-europe",
      "published": "Sat, 27 Dec 2025 21:58:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "SECURITY COUNCIL LIVE: Briefing on threats to international peace and security",
      "description": "The UN Security Council meets today to hear a briefing on threats to international peace and security following Israel’s recent recognition of the northern region of Somalia as an independent and sovereign state. Follow live below and UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166679",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Italian authorities arrest 9 people who allegedly used charities to funnel more than $8m to Hamas",
      "description": "Italy arrested nine people linked to three charities that allegedly funneled approximately $8.2 million to the Hamas terrorist organization.",
      "url": "https://www.foxnews.com/world/italian-authorities-arrest-9-people-who-allegedly-used-charities-funnel-more-than-8m-hamas",
      "published": "Sat, 27 Dec 2025 12:04:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "North Korea says it tested long-range cruise missiles",
      "description": "North Korea says it fired long-range strategic cruise missiles into the sea to test the country’s nuclear deterrence",
      "url": "https://abcnews.go.com/International/wireStory/north-korea-tested-long-range-cruise-missiles-128740138",
      "published": "Mon, 29 Dec 2025 00:06:16 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How climate change is threatening human rights",
      "description": "With rising effects of climate change across the globe, the world has started recognising that climate change is not just an ecological collapse, but also a human rights crisis.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166649",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Industrialisation without destruction: A UN blueprint for the future",
      "description": "Since the 19th century, industrialisation has had a transformative effect on the world, both positive and negative. It has created jobs and lifted millions out of poverty. But it has also had devastating consequences; destroying ecosystems, polluting the air, and driving the climate crisis that threatens to make large parts of the planet uninhabitable.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166635",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian protesters clash with security forces as tear gas fills Tehran streets amid nationwide unrest",
      "description": "Iran protests escalated as demonstrators clashed with security forces in Tehran and Mashhad, with tear gas deployed amid nationwide strikes, reports say.",
      "url": "https://www.foxnews.com/world/iranian-protesters-clash-security-forces-tear-gas-fills-tehran-streets-amid-nationwide-unrest",
      "published": "Mon, 29 Dec 2025 20:05:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump vows to 'knock the hell out of' Iran if nuclear program is rebuilt again after high-stakes meeting",
      "description": "Trump warns Iran he'll 'knock the hell out of them' if nuclear program rebuilds, as new reports allegedly detail chemical weapons development for missiles.",
      "url": "https://www.foxnews.com/world/trump-vows-knock-hell-out-of-iran-nuclear-program-rebuilt-again-after-high-stakes-meeting",
      "published": "Mon, 29 Dec 2025 14:40:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua injured in Nigeria car crash that killed two team members",
      "description": "The British heavyweight boxer suffered minor injuries in the crash, which killed two team members and close friends.",
      "url": "https://www.bbc.com/news/articles/c8989e1wnj2o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 07:45:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Trump ‘not worried’ as China’s live-fire Taiwan wargame enters second day",
      "description": "US president says Chinese leader did not notify him of drills that have involved live missile launches into Taiwan strait Taiwan-China tensions – explained in 30 seconds Donald Trump has said he is not worried by China’s live-fire military drills surrounding Taiwan and that he has a great relationship with the Chinese leader, Xi Jinping, who “hasn’t told me anything about it”. The US president’s comments came amid a large two-day surprise attack simulation launched by the People’s Liberation Army (PLA) on Monday and Tuesday, which China has called “Justice Mission 2025”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/trump-not-worried-china-military-live-fire-drills-taiwan",
      "published": "Tue, 30 Dec 2025 10:56:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "UN renews ceasefire push in Sudan",
      "description": "The UN has urged Sudan’s warring parties to pursue compromise and an immediate ceasefire, even as drone attacks, displacement and the killing of peacekeepers underscore the growing risks to civilians and humanitarians.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166675",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Anti-Iran regime protests grow across country as Trump admin boosts demonstrators offering support",
      "description": "U.S. officials voice support for Iranian demonstrators as protests intensify following currency crisis, with reports of tear gas and security crackdowns.",
      "url": "https://www.foxnews.com/world/anti-iran-regime-protests-grow-across-country-trump-admin-boosts-demonstrators-offering-support",
      "published": "Tue, 30 Dec 2025 12:47:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Nigeria: Can US airstrikes weaken Islamist militants?",
      "description": "Details remain sparse on the effectiveness of the United States' airstrikes on Islamist militants in Nigeria last week. However, the event signals a shift in US-Nigeria cooperation on fighting terror.",
      "url": "https://www.dw.com/en/nigeria-can-us-airstrikes-weaken-islamist-militants/a-75333828?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 16:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "'I risked my life for innocent humans': Bondi beach hero reveals why he stopped gunman",
      "description": "The two men accused of committing the Bondi Beach antisemitic terror attack \"acted alone\", Australian police have said.",
      "url": "https://news.sky.com/story/bondi-attack-suspects-acted-alone-say-police-as-hero-reveals-why-he-tackled-gunman-13488626",
      "published": "Tue, 30 Dec 2025 07:42:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Russia's nuclear-capable Oreshnik missiles have entered active service, Moscow says",
      "description": "Russia’s nuclear-capable Oreshnik missile system has entered active service, Russia’s Ministry of Defense says, as negotiators continue to search for a breakthrough in peace talks to end Moscow’s war in Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/russias-nuclear-capable-oreshnik-missiles-entered-active-service-128774458",
      "published": "Tue, 30 Dec 2025 07:13:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Pakistan police detain teen girl radicalized online in suspected suicide bombing plot",
      "description": "Pakistan police have detained a teenage girl they say was radicalized and recruited online by an outlawed separatist group to carry out a suicide attack",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-police-detain-teen-girl-radicalized-online-suspected-128748054",
      "published": "Mon, 29 Dec 2025 09:13:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Tennessee officers rescue woman considering jumping from bridge on day after Christmas",
      "description": "New video shows a dramatic bridge rescue as law enforcement agencies worked together to save a woman in crisis on Interstate 81 in Sullivan County.",
      "url": "https://www.foxnews.com/us/tennessee-officers-rescue-woman-considering-jumping-from-bridge-day-after-christmas",
      "published": "Mon, 29 Dec 2025 13:18:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘Only Trump can stop Russia’: Millions face freezing winter, Ukraine energy executive warns",
      "description": "Ukraine's largest private energy company reports 90% of generation capacity damaged by Russian attacks, leaving over 1 million without power during freezing temperatures.",
      "url": "https://www.foxnews.com/world/only-trump-can-stop-russia-millions-face-freezing-winter-ukraine-energy-executive-warns",
      "published": "Mon, 29 Dec 2025 17:18:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "The 'thorny' issues that threaten to derail a Russia-Ukraine peace deal",
      "description": "Two of the main sticking points involve territory and the fate of Europe's biggest nuclear plant, which is currently occupied by Russia.",
      "url": "https://www.bbc.com/news/articles/c78v5dj3x39o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 17:33:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump says US hit 'big facility' linked to alleged Venezuelan drug boats",
      "description": "The US president would not confirm US media reports that the explosion was caused by a CIA drone strike.",
      "url": "https://www.bbc.com/news/articles/cp8484p7ggmo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 09:13:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "What challenges does the world economy face in 2026?",
      "description": "From trade tensions and high debt burdens to fears of an AI stocks bubble, the global economy will face an array of risks that could dampen growth in the new year.",
      "url": "https://www.dw.com/en/what-challenges-does-the-world-economy-face-in-2026/a-75238039?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 11:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UAE to withdraw forces from Yemen amid crisis with Saudi Arabia",
      "description": "The UAE said Tuesday it would withdraw its remaining forces from Yemen after Saudi Arabia led an airstrike on a southern Yemeni port targeting what it said was a UAE-linked weapons shipment. Following the strike, Saudi Arabia backed calls for UAE forces to leave the country within 24 hours.",
      "url": "https://www.france24.com/en/middle-east/20251230-yemeni-separatists-reject-calls-to-withdraw-after-saudi-port-strike",
      "published": "Tue, 30 Dec 2025 15:31:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UN Security Council hears warnings over escalating US-Venezuela standoff",
      "description": "Tensions between the United States and Venezuela have sharply escalated amid increased US military operations in the Southern Caribbean, prompting accusations of sovereignty violations, concerns over civilian harm and growing calls at the UN Security Council for restraint and de-escalation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166668",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Influx of cheap Chinese imports could drive down UK inflation, economists say",
      "description": "As Trump’s tariffs take effect, Britain is likely alternative destination for cars, telecoms and sound equipment Business live – latest updates The UK is poised for an influx of cheap Chinese imports that could bring down inflation amid the fallout from Donald Trump’s global trade war, leading economists have said. After figures showed China’s trade surplus surpassed $1tn (£750bn) despite Washington’s tariff policies hitting exports to the US, the Bank of England said the UK was among the nations emerging as alternative destinations for the goods. Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/29/chinese-imports-uk-inflation-trump-tariffs",
      "published": "Mon, 29 Dec 2025 11:19:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Six charged after police allegedly find man and teen travelling with loaded guns in Sydney taxi",
      "description": "Police allege a 16-year-old and 20-year-old were in the car with firearms and a dedicated encrypted phone Get our breaking news email , free app or daily news podcast Four men and two teenage boys have been charged after police allegedly caught two of them travelling in a Sydney taxi with loaded guns. The arrests are part of an ongoing investigation into a shooting in Sydney’s north-west in November where police allege two men fired shots and a stun grenade into a home in Tallawong. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/30/six-charged-nsw-police-loaded-guns-sydney-taxi-ntwnfb",
      "published": "Tue, 30 Dec 2025 10:13:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Russia accuses Ukraine of attempted drone strike, threatens to harden peace stance",
      "description": "Russia says Ukraine tried to hit one of Putin's homes with a drone. Kyiv denies it, calling the claim staged to justify war. The Kremlin now warns it may toughen its stance in the ongoing peace talks.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660691/russia-accuses-ukraine-of-attempted-drone-strike-threatens-to-harden-peace-stance",
      "published": "Tue, 30 Dec 2025 04:52:22 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Families of Bondi Beach victims demand more federal action",
      "description": "Families of victims of the recent Sydney massacre are urging more federal action to investigate rising antisemitism and security failures",
      "url": "https://abcnews.go.com/International/wireStory/families-bondi-beach-victims-demand-federal-action-antisemitism-128744170",
      "published": "Mon, 29 Dec 2025 03:14:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Texas man charged with attempting to provide material support to ISIS in federal terrorism case",
      "description": "Texas man John Michael Garza Jr., 21, was charged with attempting to provide material support to ISIS after allegedly paying cryptocurrency to undercover agent.",
      "url": "https://www.foxnews.com/us/texas-man-charged-attempting-provide-material-support-isis-federal-terrorism-case",
      "published": "Mon, 29 Dec 2025 18:52:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Alleged Bondi gunmen acted alone and did not train in the Philippines, police say",
      "description": "The father-and-son duo spent a month in the Philippines before the attack that killed 15 people in Bondi.",
      "url": "https://www.bbc.com/news/articles/ce8q8l08j2vo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 02:17:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Bitter recriminations between Russia, Ukraine as war eclipses peace push",
      "description": "Kremlin says alleged drone attack on presidential residence - called a fabrication by Kyiv - will affect peace talks.",
      "url": "https://www.aljazeera.com/news/2025/12/30/bitter-recriminations-between-russia-ukraine-as-war-eclipses-peace-push?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 14:45:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Tensions between Saudis and Emiratis over future of Yemen reach boiling point",
      "description": "Dispute has potential to create civil war in south of Yemen and spill over into neighbouring countries Tensions between the United Arab Emirates and Saudi Arabia over the future of Yemen and the imminent possibility of the declaration of an independent southern state have reached boiling point with Saudi Arabia in effect accusing the UAE of threatening its future security. The dispute has the potential to create a civil war within the south of Yemen and also spill over into other disputes including in Sudan and the Horn of Africa where the two countries often find themselves backing opposite sides. Yemen could yet become only one theatre in which the two vastly wealthy Gulf states vie for political influence, control of shipping lanes and commercial access. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/saudi-arabia-uae-tension-future-yemen-boiling-point",
      "published": "Tue, 30 Dec 2025 17:19:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "George and Amal Clooney become French after naturalisation process",
      "description": "US actor and British-Lebanese international human rights lawyer George and Amal Clooney have become French citizens after they were naturalised with their two children. The family bought a house on a vineyard in the south of France in 2021 and have become involved in the local life. The naturalisation of the Clooneys comes as some Americans, including a number of celebrities, are seeking citizenship in European nations, partially motivated by the Trump administration.",
      "url": "https://www.france24.com/en/video/20251230-george-and-amal-clooney-become-french-after-naturalisation-process",
      "published": "Tue, 30 Dec 2025 15:34:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Indonesian rescuers find a body while searching for soccer coach and 3 children",
      "description": "Indonesian rescuers say they have recovered the body of a female victim believed to be part of the family of a Spanish soccer coach and his three children, missing after a tour boat sank Friday",
      "url": "https://abcnews.go.com/International/wireStory/indonesian-rescuers-find-body-searching-spanish-soccer-coach-128744261",
      "published": "Mon, 29 Dec 2025 11:14:18 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Turkey detains 357 suspected IS members in nationwide raids",
      "description": "The arrests come just a day after three police officers were killed during a siege in the town of Yalova.",
      "url": "https://www.bbc.com/news/articles/c4g5gq19n9zo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 10:38:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Central African Republic goes to polls as president seeks third term",
      "description": "Opposition hopes to tap into frustrations of people living in country where conflict remains a daily reality Central African Republic goes to the polls on Sunday with the president, Faustin-Archange Touadéra, seeking a third term. As many as 2.3 million registered voters will cast ballots for what observers are calling a quadruple election: votes for the presidency and parliament as well as local and municipal offices. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/central-african-republic-goes-to-polls-as-president-seeks-third-term",
      "published": "Sun, 28 Dec 2025 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela says it released 99 people detained for 2024 election protests",
      "description": "Government said the move was due to its ‘unrestricted respect for human rights’ in the face of US aggression Venezuela has said it has carried out its largest release of political prisoners this year, claiming to have freed 99 people detained for taking part in protests after the 2024 election, widely believed to have been stolen by the dictator Nicolás Maduro , as it comes under increasing military pressure from the US. Civil society organisations have treated the news with caution and stressed that the releases were insufficient, noting that at least 900 political prisoners remain in the country. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/venezuela-political-prisoner-release",
      "published": "Fri, 26 Dec 2025 14:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "A professor breaks down Russia's negotiating tactics with Ukraine",
      "description": "Nina Khrushcheva, professor of International Affairs at New York's New School, talks about the negotiating tactics Russia is using in peace talks with Ukraine.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660716/a-professor-breaks-down-russias-negotiating-tactics-with-ukraine",
      "published": "Tue, 30 Dec 2025 04:52:01 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "An escalation in Yemen threatens to reignite civil war and widen tensions in the Gulf",
      "description": "Saudi Arabia bombed Yemen's port city of Mukalla, targeting a shipment of weapons from the United Arab Emirates for separatist forces. The UAE later said it would withdraw its forces from Yemen.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103991/yemen-conflict",
      "published": "Tue, 30 Dec 2025 11:48:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Sudan defying war to bring joy at AFCON 2025",
      "description": "A brutal civil war has been raging in Sudan since 2023. The national football team is participating in the Africa Cup of Nations in Morocco with more than just sporting success in mind.",
      "url": "https://www.dw.com/en/sudan-defying-war-to-bring-joy-at-afcon-2025/a-75341174?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Bashar al-Assad disappears of Syrian banknotes as country brings in new currency",
      "description": "More than a year after the fall of Bashar al-Assad, images of the former dictator persist throughout Syria, not least on the country's banknotes. On December 30, the country's current president Ahmed al-Sharaa announced the introduction of new notes, which will no longer bear the likeness of Assad or his father Hafez. For the country, it's an opportunity to turn the page on a long painful period but also to bring economic stability to a country weakened by 13 years of civil war.",
      "url": "https://www.france24.com/en/video/20251230-bashar-al-assad-disappears-of-syrian-banknotes-as-country-brings-in-new-currency",
      "published": "Tue, 30 Dec 2025 12:58:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump hopes to reach phase two of Gaza ceasefire 'very quickly'",
      "description": "The US president also warns Hamas will have \"hell to pay\" if it does not disarm, after talks with Netanyahu.",
      "url": "https://www.bbc.com/news/articles/cdj8jmxyzneo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 05:04:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "UAE says it will withdraw from Yemen after Saudi strike on separatist-held port",
      "description": "The UAE and Saudi have been allies in the war against the Houthis, but infighting between the rival factions they support has caused a rift between them.",
      "url": "https://www.bbc.com/news/articles/c8xdxz48l7yo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 18:22:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US says it killed or captured 25 ISIL operatives in Syria over nine days",
      "description": "US Central Command says military campaign follows killing of US soldiers, 'massive strikes' across central Syria.",
      "url": "https://www.aljazeera.com/news/2025/12/30/us-says-it-killed-or-captured-25-isil-operatives-in-syria-over-nine-days?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 15:46:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump bombs Venezuelan land for first time: Is war imminent?",
      "description": "US president says strike in Venezuela targeted a dock allegedly used to load boats with narcotics.",
      "url": "https://www.aljazeera.com/news/2025/12/30/trump-bombs-venezuelan-land-for-first-time-is-war-imminent?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 15:28:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russia opens new Mariupol theater after devastating siege",
      "description": "The bombing of the Mariupol Drama Theater became a symbol of Russia's three-month siege of the city. Exiled Ukrainian municipal authorities condemned inauguration of the new theater as \"singing and dancing on bones.\"",
      "url": "https://www.dw.com/en/russia-opens-new-mariupol-theater-after-devastating-siege/a-75337653?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 03:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The UAE denies shipping weapons to Yemen after overnight Saudi strike",
      "description": "In an overnight strike, the Saudi military hit a Yemeni port saying they were neutralising a weapons shipments arriving from UAE and meant for the STC separatist group. The UAE has denied the shipment contained weapons and claimed the vehicles were not intended for any groups. Both countries have supported the fighting sides in the over-decade long war in Yemen, but this strike has turned this rivalry into an open dispute.",
      "url": "https://www.france24.com/en/video/20251230-the-uae-denies-shipping-weapons-to-yemen-after-overnight-saudi-strike",
      "published": "Tue, 30 Dec 2025 14:49:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Animated film 'David' showcases growing South African film industry",
      "description": "With the animated film 'David' breaking records, the South African studio which produced it wants to showcase the growing local film industry, the continent's strongest in the sector. Released in South Africa and the United States, the faith-based animated film follows the biblical figure David in his fight towards the giant Goliath. Our journalists take a look.",
      "url": "https://www.france24.com/en/video/20251230-animated-film-david-showcases-growing-south-african-film-industry",
      "published": "Tue, 30 Dec 2025 13:32:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Anthony Joshua stable after crash - as tributes paid to his 'inspirational' friend",
      "description": "Boxer Anthony Joshua is in a \"stable\" condition after a car crash in Nigeria - as tributes have been paid to two of his friends who were killed in the collision.",
      "url": "https://news.sky.com/story/anthony-joshua-stable-after-nigeria-car-crash-as-tributes-paid-to-inspirational-friend-13488669",
      "published": "Mon, 29 Dec 2025 20:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "China fires rockets into waters off Taiwan in second day of military drills",
      "description": "China has fired rockets into the waters off Taiwan on a second day of large-scale war games around the island aimed at rehearsing a blockade.",
      "url": "https://news.sky.com/story/china-fires-rockets-into-waters-off-taiwan-in-second-day-of-military-drills-13488623",
      "published": "Tue, 30 Dec 2025 07:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "U.S. announces more military actions against ISIS: 'We will not relent'",
      "description": "CENTCOM declared that the U.S. and partner forces in Syria killed and captured ISIS figures in the time since a December 19 strike in Syria.",
      "url": "https://www.foxnews.com/world/u-s-announces-more-military-actions-against-isis-we-not-relent",
      "published": "Tue, 30 Dec 2025 10:17:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Displaced Palestinians lose shelters as heavy rain floods camp",
      "description": "Heavy rain has flooded displacement camps in Gaza, submerging tents and the belongings of families in mud and water.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/30/displaced-palestinians-lose-shelters-as-heavy-rain-floods-camp?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 12:57:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "M 6.0 - 2025 Taitung, Taiwan Earthquake",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VI Time 2025-12-24 09:47:06 UTC 2025-12-24 09:47:06 UTC at epicenter Location 22.851°N 121.207°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rkjm",
      "published": "2025-12-27T15:33:29.814Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "India overtakes Japan as 4th-largest economy, report says",
      "description": "India has pushed ahead of Japan as the world's fourth-biggest economy after sustained high growth, New Delhi says. Economic pace has apparently picked up more quickly than expected and India may soon claim third place.",
      "url": "https://www.dw.com/en/india-overtakes-japan-as-4th-largest-economy-report-says/a-75341063?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 11:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Former Bangladesh PM Khaleda Zia dies aged 80",
      "description": "⁠Khaleda ‍Zia has died after battling serious illness at a hospital in the capital, Dhaka. Her Bangladesh Nationalist Party was seen as a frontrunner in next year's election.",
      "url": "https://www.dw.com/en/former-bangladesh-pm-khaleda-zia-dies-aged-80/a-75337247?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 01:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "'A combination of adaptation, preparedness and mitigation' is needed to tackle climate change",
      "description": "Climate change worsened by human behaviour made 2025 one of the three hottest years on record, according to a new report by World Weather Attribution. It was also the first time that the three-year temperature average broke through the 1.5 degrees Celsius thresshold. Jean-Pascal Van Ypersele, Professor of Climatology and Environmental Sciences at University College Louvain in Belgium, tells us more.",
      "url": "https://www.france24.com/en/video/20251230-a-combination-of-adaptation-preparedness-and-mitigation-is-needed-to-tackle-climate-change",
      "published": "Tue, 30 Dec 2025 14:03:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Recognition of Somaliland by Israel divides the country",
      "description": "People gathered in several towns in the breakaway region of Somaliland on Sunday to celebrate its recognition by Israel -- a decision condemned by the Somali president as a \"threat\" to stability in the Horn of Africa. Israel's recognition of Somaliland was criticised by the African Union, Egypt, Turkey, the six-nation Gulf Cooperation Council and the Saudi-based Organisation of Islamic Cooperation, and the European Union insisted Somalia's sovereignty should be respected.",
      "url": "https://www.france24.com/en/video/20251230-recognition-of-somaliland-by-israel-divides-the-country",
      "published": "Tue, 30 Dec 2025 13:26:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Eurostar warns of ongoing delays after services resume",
      "description": "Passengers detail how they have been left stranded and looking for other routes after power issues in the Channel Tunnel.",
      "url": "https://www.bbc.com/news/articles/c3w7wg93yeeo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 17:58:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "UAE to withdraw forces from Yemen after Saudi strike",
      "description": "The UAE said it was withdrawing voluntarily after Yemen's Saudi-backed presidential council canceled a defense pact with the UAE and asked its forces to leave the country within 24 hours.",
      "url": "https://www.dw.com/en/uae-to-withdraw-forces-from-yemen-after-saudi-strike/a-75338239?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 14:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Eurostar suspends 'all trains' between London and Europe",
      "description": "Eurostar suspended services in the ⁠tunnel that links Britain and continental Europe. The company warned earlier of disruptions due to an overhead power supply issue.",
      "url": "https://www.dw.com/en/eurostar-suspends-all-trains-between-london-and-europe/a-75342682?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran protests spread to students on third day",
      "description": "The drop in value in Iran's rial and the country getting close to hyperinflation has increased the cost of living for many Iranians. After shopkeepers started protesting on December 28, Iranian students joined in on December 30. The protests are the biggest the country has known since the 'Woman, Life, Freedom' movement in 2022. FRANCE 24's Philip Turle tells us more.",
      "url": "https://www.france24.com/en/video/20251230-iran-protests-spread-to-students-on-third-day",
      "published": "Tue, 30 Dec 2025 16:53:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Alleged strikes on Vladimir Putin residence 'not good', Trump says",
      "description": "Donald Trump said he was \"very angry\" to hear reports of an alleged Ukrainian drone strike on one of Vladimir Putin's state residences in Russia.",
      "url": "https://news.sky.com/story/alleged-strikes-on-vladimir-putin-residence-not-good-donald-trump-says-13488414",
      "published": "Mon, 29 Dec 2025 19:57:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Sudan: UN warns of unprecedented child hunger in Darfur as fighting fuels refugee exodus",
      "description": "Sudan’s deepening war is driving unprecedented levels of hunger, child malnutrition and displacement, UN agencies report, as new data from Darfur and a renewed refugee influx into Chad underscore the rapidly deteriorating situation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166682",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Gaza battered by heavy rains as humanitarian response continues",
      "description": "Severe weather conditions have led to further casualties and heightened health risks in Gaza over the past 24 hours, the UN aid coordination office (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166680",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Feds launch 'massive' investigation after viral video alleges Minnesota daycare fraud",
      "description": "Federal agents launch investigation into alleged Minnesota childcare fraud following viral video exposing suspicious daycare centers receiving millions.",
      "url": "https://www.foxnews.com/us/feds-launch-massive-investigation-after-viral-video-alleges-minnesota-daycare-fraud",
      "published": "Mon, 29 Dec 2025 13:03:39 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens Hamas while praising Israel on Gaza ceasefire",
      "description": "Trump says Israel has complied with the Gaza ceasefire as he urges Netanyahu to move to phase two.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/30/trump-threatens-hamas-while-praising-israel-on-gaza-ceasefire?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 13:42:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump, Netanyahu meet over ceasefire. And, Russia accuses Ukraine of attempted strike",
      "description": "Conditions are dire for people in Gaza as President Trump and Israel's prime minister discuss the next phase of the ceasefire deal. And, Russia accuses Ukraine of an attempted drone strike.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103964/up-first-newsletter-trump-benjamin-netanyahu-ukraine-peace-talk-doge",
      "published": "Tue, 30 Dec 2025 07:12:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Morning news brief",
      "description": "Trump and Israel's prime minister discuss next phase of Gaza peace plan, Russia threatens to harden stance in peace talks after accusing Ukraine attempted strike, the impact of DOGE in 2025.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5653382/morning-news-brief",
      "published": "Tue, 30 Dec 2025 04:52:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Turkey detains 357 suspects after 'Islamic State' clashes",
      "description": "Turkish police have made hundreds of arrests in nationwide raids against suspected \"Islamic State\" networks. The sweep followed hours-long street fighting that left police and militants dead.",
      "url": "https://www.dw.com/en/turkey-detains-357-suspects-after-islamic-state-clashes/a-75343106?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 13:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cyprus back at the helm of EU Council presidency",
      "description": "After 14 years, Cyprus takes over the rotating presidency of the Council of the European Union on January 1. It will lead during a politically sensitive moment, and aims to shape the EU's role on the global stage.",
      "url": "https://www.dw.com/en/cyprus-back-at-the-helm-of-eu-council-presidency/a-75328041?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Victim families demand answers in Mexico train crash; officials promise investigation",
      "description": "Survivors and families of the victims of a deadly train crash in southern Mexico are demanding answers as the government vows to investigate what caused a train to derail on a rail line connecting the Pacific Ocean with the Gulf of Mexico",
      "url": "https://abcnews.go.com/International/wireStory/victims-families-demand-answers-deadly-mexico-train-crash-128761009",
      "published": "Mon, 29 Dec 2025 15:42:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "First Person: Felipe Paullier, the youngest ever senior UN official, charged with giving a voice to young people around the world",
      "description": "A paediatrician by training, Felipe Paullier has long been an advocate for youth. Formerly Director of the Uruguayan Government's Youth Institute, a role which involved several joint actions with various UN agencies, he was appointed to run the UN Youth Office in 2023, the youngest senior appointment in United Nations history.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166651",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Paper and wood: Forest products show signs of recovery, UN agency says",
      "description": "From wood-based panels used in construction, to charcoal for cooking food, forest products are valued and traded all around the world.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166666",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Feds launch 'massive operation' in Minnesota amid fraud scandal",
      "description": "Federal authorities launched a massive operation in Minnesota targeting fraud suspects in a major crackdown on criminal activity across the state Tuesday.",
      "url": "https://www.foxnews.com/us/feds-launch-massive-operation-minnesota-fraud-scandal",
      "published": "Tue, 30 Dec 2025 12:14:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Texas businessman, Gov Abbott appointee shot dead in border city: police",
      "description": "Texas businessman and Greg Abbott appointee Eddy Betancourt shot and killed at McAllen business. Police identify suspect Reynaldo Mata-Rios in homicide.",
      "url": "https://www.foxnews.com/us/texas-businessman-gov-abbott-appointee-shot-dead-border-city-police",
      "published": "Mon, 29 Dec 2025 16:21:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Russia's losses in Ukraine rise faster than ever as US pushes for peace deal",
      "description": "A steep rise in soldiers' obituaries is documented by the BBC as part of its work in counting Russian war losses.",
      "url": "https://www.bbc.com/news/articles/c62n922dnw7o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 00:12:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine denies drone attack on Putin's residence",
      "description": "Russia has accused Ukraine of targeting a presidential residence, which President Zelensky called \"typical Russian lies\".",
      "url": "https://www.bbc.com/news/articles/c4g4g5lgngvo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 11:43:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brazil’s election looms amid gang rule",
      "description": "As Brazil heads toward elections in 2026, millions live in fear. Nearly one in five Brazilians is affected by gangs.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/30/brazils-election-looms-amid-gang-rule?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 17:40:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Have Russian claims of Ukraine attack on Putin home ended hopes for peace?",
      "description": "Ukrainian President Zelenskyy denies that Kyiv attacked the Novgorod residence of Russian President Putin.",
      "url": "https://www.aljazeera.com/news/2025/12/30/have-russian-claims-of-ukraine-attack-on-putin-home-ended-hopes-for-peace?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 13:45:22 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "What is Lebanon’s ‘gap law’ that attempts to end the financial crisis?",
      "description": "Lebanon's cabinet has passed a draft law aimed at repaying depositors up to $100,000 of their own money.",
      "url": "https://www.aljazeera.com/news/2025/12/30/what-is-lebanons-gap-law-that-attempts-to-end-the-financial-crisis?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 13:02:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Weather tracker: Deep freeze grips Canada as US records warmest Christmas",
      "description": "Temperatures plunge below -50C in the Yukon, while swaths of US experience springlike weather Northern Canada has been gripped by an intense and prolonged cold spell, with temperatures hovering between -20C and -40C for weeks. On Tuesday, Braeburn in the Yukon recorded -55.7C, its coldest December temperature since 1975. Meanwhile, Mayo and Dawson endured 16 consecutive nights below -40C, with Mayo plunging to -50.4C on Monday. Whitehorse also recorded 10 nights when temperatures dropped below -30C. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/weather-tracker-deep-freeze-canada-us-records-warmest-christmas",
      "published": "Fri, 26 Dec 2025 11:52:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says US hit Venezuela drug boat loading facility",
      "description": "The attack marks the first known land operation in Venezuela since the US started what it says is a campaign against drugs cartels in the region.",
      "url": "https://www.dw.com/en/trump-says-us-hit-venezuela-drug-boat-loading-facility/a-75337920?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 06:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Danish post office delivers last letter, ending a 400-year run to adapt to the digital age",
      "description": "It's the end of an era for the Danish post office. Citing a 90% drop in letter-sending over the past quarter-century, PostNord has ended delivering paper letters in the country, a service first started in 1624. Plus, France is set to issue €310 billion in new sovereign bonds next year, a move that's set to complicate its effort to reduce its debt pile, already at over 117% of GDP.",
      "url": "https://www.france24.com/en/tv-shows/business/20251230-danish-post-office-delivers-last-letter-ending-a-400-year-run-to-adapt-to-the-digital-age",
      "published": "Tue, 30 Dec 2025 18:08:07 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Situation in Gaza is 'catastrophic’, foreign ministers from 10 countries warn",
      "description": "A group of 10 countries, including France, warned on Tuesday that the situation in Gaza was \"catastrophic\" due to the \"renewed deterioration of the humanitarian situation\" in the Palestinian enclave. They called on Israel to allow greater access for NGOs and to lift restrictions on importing essential medical and shelter equipment.",
      "url": "https://www.france24.com/en/live-news/20251230-10-countries-warn-of-catastrophic-gaza-situation",
      "published": "Tue, 30 Dec 2025 17:15:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "DRC army's spokesperson suspended after anti-Tutsi remarks during TV address",
      "description": "In the Democratic Republic of Congo, a spokesperson for the army has been suspended after speaking about the conflict in eastern Congo when he implied that the Tutsi community is treacherous, language held in Rwanda in 1994 before the genocide. It cuts to the core of some of the deep tensions in eastern Congo, where the Tutsi community is often unfairly blamed for the M23 rebel conflict. FRANCE 24's Emmet Livingstone tells us more from Kinshasa.",
      "url": "https://www.france24.com/en/video/20251230-drc-army-s-spokesperson-suspended-after-anti-tutsi-remarks-during-tv-address",
      "published": "Tue, 30 Dec 2025 14:12:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia offers no proof that Ukraine targeted Putin residence in drone attack",
      "description": "The Kremlin said on Tuesday that it could not prove its claim that Ukrainian drones targeted one of President Vladimir Putin's residences because the drones were all \"shot down\". Moscow accused Ukraine of launching 91 long-range drones at Putin's home in the Novgorod region in what it called a \"personal attack against Putin\", vowing to retaliate.",
      "url": "https://www.france24.com/en/live-news/20251230-kyiv-says-no-evidence-for-putin-residence-attack",
      "published": "Tue, 30 Dec 2025 12:51:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Leaders from Europe and Canada discuss US-led peace efforts as Russia-Ukraine tensions spike",
      "description": "Leaders from Europe and Canada have held talks on U.S.-led peace efforts to end the war between Russia and Ukraine",
      "url": "https://abcnews.go.com/International/wireStory/european-leaders-discuss-us-led-peace-efforts-russia-128775457",
      "published": "Tue, 30 Dec 2025 09:13:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Missing Camila Mendoz Olmos: Dashcam captures last sighting of Texas teen who vanished Christmas Eve",
      "description": "Texas authorities release dashcam video showing missing 19-year-old Camila Mendoza Olmos walking alone on Christmas Eve, believed in imminent danger.",
      "url": "https://www.foxnews.com/us/missing-camila-mendoz-olmos-dashcam-captures-last-sighting-texas-teen-who-vanished-christmas-eve",
      "published": "Tue, 30 Dec 2025 10:01:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Armed Americans fight back: Inside 2025’s most gripping self-defense shootings across the US",
      "description": "Self-defense shootings made headlines across America in 2025. Texas donut shop owner, Virginia homeowner fight back against alleged armed robbers.",
      "url": "https://www.foxnews.com/us/armed-americans-fight-back-inside-2025-most-gripping-self-defense-shootings-across-us",
      "published": "Tue, 30 Dec 2025 08:00:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "These crimes exposed America's deepest fractures and kept millions glued to their screens",
      "description": "The most gripping crime stories of 2025 included Charlie Kirk's assassination, an ISIS-inspired New Orleans attack and murder trials that revealed deep fractures in society.",
      "url": "https://www.foxnews.com/us/crimes-exposed-americas-deepest-fractures-kept-millions-glued-screens",
      "published": "Tue, 30 Dec 2025 06:00:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Illegal immigrant allegedly severs man's thumb with machete at Georgia Christmas holiday party",
      "description": "Christmas party in Georgia turns violent as man allegedly attacks guest with machete, severing thumb. Victim hospitalized with serious injuries.",
      "url": "https://www.foxnews.com/us/illegal-immigrant-allegedly-severs-mans-thumb-machete-georgia-christmas-holiday-party",
      "published": "Mon, 29 Dec 2025 11:40:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy denies Russian claim that Ukraine attacked Putin residence",
      "description": "Ukrainian President Volodymyr Zelenskyy calls alleged drone attack on Russian President Vladimir Putin's residence a \"complete fabrication\" as tensions escalate between Ukraine and Russia.",
      "url": "https://www.foxnews.com/world/zelenskyy-denies-russian-claim-ukraine-attacked-putin-residence",
      "published": "Mon, 29 Dec 2025 11:56:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump meets with Zelenskyy; talks could unlock first Zelenskyy-Putin call in five years: source",
      "description": "President Donald Trump assumes mediator role as talks with President Volodymyr Zelenskyy focus on a U.S.-backed 20-point peace plan that could end the war in Ukraine.",
      "url": "https://www.foxnews.com/world/trump-meets-zelenskyy-talks-could-unlock-first-zelenskyy-putin-call-five-years-source",
      "published": "Sun, 28 Dec 2025 16:30:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK flag clash as foreign banners fly, citizens push back against woke policies reshaping Britain",
      "description": "New polling reveals deep splits over Union Jack symbolism as Britain's changing demographics fuel heated debate about national flags and identity.",
      "url": "https://www.foxnews.com/world/uk-flag-clash-foreign-banners-fly-citizens-push-back-against-woke-policies-reshaping-britain",
      "published": "Sun, 28 Dec 2025 11:57:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Stabbing spree, chemical attack at Japan factory injures 15",
      "description": "A 38-year-old male suspect is in custody following an alleged stabbing spree and chemical attack at a Yokohama Rubber Co. tire factory in central Japan.",
      "url": "https://www.foxnews.com/world/stabbing-spree-chemical-attack-japan-factory-injures-15",
      "published": "Sat, 27 Dec 2025 09:50:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "SoftBank to acquire DigitalBridge for $4bn in move to deepen ties to AI",
      "description": "Acquisition would further expand SoftBank’s investments in artificial intelligence as it tries to center itself in the boom SoftBank Group will acquire digital infrastructure investor DigitalBridge Group in a deal valued at $4bn, the companies said on Monday, as the Japanese investment firm looks to deepen its AI-related portfolio. The acquisition would expand SoftBank’s exposure to digital infrastructure as the Japanese conglomerate is positioning its portfolio to focus on artificial intelligence. SoftBank’s billionaire founder Masayoshi Son is seeking to capitalize on surging demand for the computing capacity that underpins artificial intelligence applications. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/29/softbank-digitalbridge-deal-artificial-intelligence",
      "published": "Mon, 29 Dec 2025 15:05:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "French right pushes for national tribute to film star Brigitte Bardot",
      "description": "A petition for a national homage to Brigitte Bardot - who died on Sunday - attracts more than 23,000 signatures.",
      "url": "https://www.bbc.com/news/articles/cp848g51zd3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 11:20:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Judge blocks Trump effort to strip South Sudan deportation protections",
      "description": "Trump is seeking to end protected status for South Sudan, claiming country no longer poses danger to those returning.",
      "url": "https://www.aljazeera.com/news/2025/12/30/judge-blocks-trump-effort-to-strip-south-sudan-deportation-protections?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 16:21:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Indian cinema: National pride meets box office success",
      "description": "A wave of Bollywood films reflecting the BJP government's narratives is reshaping Indian cinema and finding major commercial success.",
      "url": "https://www.dw.com/en/indian-cinema-national-pride-meets-box-office-success/a-75345014?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 16:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "What's inside Mexico's Popocatépetl volcano? Scientists obtain first 3D images",
      "description": "Scientists from Mexico’s National Autonomous University have created the first three-dimensional image of the Popocatépetl volcano's interior",
      "url": "https://abcnews.go.com/International/wireStory/inside-mexicos-popocatpetl-volcano-scientists-obtain-3d-images-128772717",
      "published": "Tue, 30 Dec 2025 00:26:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "South Korean President Lee returns to presidential palace avoided by predecessor",
      "description": "South Korean President Lee Jae Myung on Monday commuted to Cheong Wa Dae, the country’s traditional presidential palace, for the first time since taking office in June, more than three years after his ousted predecessor Yoon Suk Yeol moved the presiden...",
      "url": "https://abcnews.go.com/International/wireStory/south-korean-president-lee-returns-presidential-palace-avoided-128742176",
      "published": "Mon, 29 Dec 2025 04:09:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Police sergeant denies hearing Luigi Mangione mother's alleged damning statement about CEO killing",
      "description": "Attorney Karen Friedman Agnifilo says Luigi Mangione's mother never made the statement about the UnitedHealthcare CEO assassination that police claimed.",
      "url": "https://www.foxnews.com/us/police-sergeant-denies-hearing-luigi-mangione-mothers-alleged-damning-statement-about-ceo-killing",
      "published": "Mon, 29 Dec 2025 12:19:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Judge rules redacted transcript, audio recording of sealed Charlie Kirk hearing can be released",
      "description": "Accused assassin of Charlie Kirk appeared remotely in court Monday for hearing on media access to his capital murder case proceedings in Provo, Utah, this week.",
      "url": "https://www.foxnews.com/us/suspected-charlie-kirk-assassin-fights-how-much-public-can-see",
      "published": "Mon, 29 Dec 2025 10:50:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "George Clooney ditches Hollywood culture for France, gains citizenship with wife and twins",
      "description": "George Clooney and wife Amal become French citizens with their twins, trading Hollywood glamor for peaceful farm life in the French countryside together.",
      "url": "https://www.foxnews.com/world/george-clooney-ditches-hollywood-culture-france-gains-citizenship-wife-twins",
      "published": "Mon, 29 Dec 2025 16:37:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Protests spread across Iran for third day after currency hits record low",
      "description": "The Iranian rial hit a record low against the US dollar on Sunday, prompting shopkeepers in Tehran to stage protests, which have quickly spread.",
      "url": "https://www.bbc.com/news/articles/cqj2llkjv8vo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 16:31:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Nigeria vs Uganda 3-1: AFCON 2025 – as it happened",
      "description": "All the updates as Nigeria reach the last 16 with a 100 percent win record in Group C, while 10-man Uganda crash out.",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/12/30/live-uganda-vs-nigeria-afcon-2025?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 13:00:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thailand delays release ‍of Cambodian troops over alleged truce breaches",
      "description": "While the ceasefire has held since Saturday, Thailand says Cambodia violated deal with drone flights over the border.",
      "url": "https://www.aljazeera.com/news/2025/12/30/thailand-delays-release-of-cambodian-troops-over-alleged-truce-breaches?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 12:22:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US struck ‘big facility’ in Venezuela, Trump claimed without offering details",
      "description": "Trump alleged that US forces hit ‘very hard’ in what would mark his team’s first land strike on Venezuela if confirmed Donald Trump has claimed that US forces struck a “big facility” in Venezuela last week – but the president did not specify what it was, or where, and the White House has not commented further. “We just knocked out – I don’t know if you read or you saw – they have a big plant, or a big facility, where the ships come from. Two nights ago, we knocked that out. So we hit them very hard,” Trump told Republican donor and New York supermarket owner John Catsimatidis on Friday. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/29/trump-venezuela-facility-strike",
      "published": "Mon, 29 Dec 2025 17:30:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China flexes blockade capabilities near Taiwan on second day of military drills",
      "description": "China's People's Liberation Army is staging a second day of large-scale military drills around Taiwan. It's unleashing live-fire exercises as part of what it calls \"Justice Mission 2025.\"",
      "url": "https://www.npr.org/2025/12/30/g-s1-103963/china-flexes-blockade-capabilities-near-taiwan-on-second-day-of-military-drills",
      "published": "Tue, 30 Dec 2025 06:52:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump and Netanyahu meet to discuss next phase of Gaza ceasefire plan",
      "description": "Israel's prime minister met President Trump at the White House Monday to discuss next steps in the peace plan with Gaza and across the region.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660783/trump-and-netanyahu-meet-to-discuss-next-phase-of-gaza-ceasefire-plan",
      "published": "Tue, 30 Dec 2025 06:50:54 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China fires rockets on second day of drills around Taiwan",
      "description": "China's military exercises come less than two weeks after the US announced a record $11.1 billion arms package to Taiwan. Taipei condemned the drills as irresponsible but said it would not escalate tensions.",
      "url": "https://www.dw.com/en/china-fires-rockets-on-second-day-of-drills-around-taiwan/a-75338221?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 07:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Eurostar services gradually resuming after major power supply issue",
      "description": "Eurostar said on December 30 it was restarting services over a power supply problem in the Channel tunnel. Travellers were left scrambling to find alternatives after the operator postponed all services between London, Paris, Amsterdam and Brussels. FRANCE 24's Olivia Bizot spoke to some in Gare du Nord in Paris.",
      "url": "https://www.france24.com/en/video/20251230-eurostar-services-gradually-resuming-after-major-power-supply-issue",
      "published": "Tue, 30 Dec 2025 16:50:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran: Protests over the cost of living",
      "description": "Iran's president Masoud Pezeshkian said he had asked the Interior Ministry to \"listen to the legitimate demands\" of the protesters after several days of demonstrations by shopkeepers in Tehran as Iran's embattled currency hit new lows on the unofficial market.",
      "url": "https://www.france24.com/en/video/20251230-iran-protests-over-the-cost-of-living",
      "published": "Tue, 30 Dec 2025 13:17:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Why China is holding military drills around Taiwan — and the history behind it",
      "description": "China’s decision to bring serious firepower to bear for military drills in the waters off Taiwan this week has deep roots both in the past several weeks and the past several decades",
      "url": "https://abcnews.go.com/International/wireStory/china-holding-military-drills-taiwan-history-128748930",
      "published": "Mon, 29 Dec 2025 13:59:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Cheaper medicines, rules for cash and new state laws: what will change in Australia on 1 January?",
      "description": "Changes include the Victorian government expanding land taxes and Queensland introducing a child sex offender register Get our breaking news email , free app or daily news podcast Cheaper medicines on the PBS, a Medicare phone service and new laws mandating businesses to accept cash payments are just some of the major changes coming into effect in the first week of 2026. Indexation increases to social security payments, changes to childcare settings and a new online mental health service will also kick in from the beginning of January. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/31/government-rules-new-laws-benefit-changes-on-1-january",
      "published": "Tue, 30 Dec 2025 14:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany: €30 million stolen in elaborate bank vault heist",
      "description": "Investigators have been piecing together how burglars drilled into a secure area from outside and ransacked thousands of safe-deposit boxes. Police say the evidence points to a highly organized operation.",
      "url": "https://www.dw.com/en/germany-€30-million-stolen-in-elaborate-bank-vault-heist/a-75344406?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 15:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Turkish police detain 357 suspects in raids against the Islamic State group",
      "description": "Turkish police have conducted large-scale operations against the Islamic State group across Turkey, detaining 357 suspects",
      "url": "https://abcnews.go.com/International/wireStory/turkish-police-detain-357-suspects-raids-islamic-state-128773939",
      "published": "Tue, 30 Dec 2025 04:09:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Development cooperation agreement marks new phase in UN-Iraq partnership",
      "description": "Better access to education, the protection of the environment and good governance are some of the areas in which the United Nations helps countries improve.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166670",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "State officials and daycare manager push back on viral video fraud allegations in Minnesota",
      "description": "Minnesota officials deny daycare fraud allegations after viral video questioned state-funded centers, sparking widespread controversy over taxpayer money usage.",
      "url": "https://www.foxnews.com/us/state-officials-daycare-manager-push-back-viral-video-fraud-allegations-minnesota",
      "published": "Mon, 29 Dec 2025 22:15:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Illegal immigrants allegedly ran multi-million-dollar gift card fraud scheme hitting stores daily across Texas",
      "description": "Texas authorities arrested three illegal immigrants from Eastern Europe accused of running a sophisticated $14 million gift card fraud scheme across several states.",
      "url": "https://www.foxnews.com/us/illegal-immigrants-allegedly-ran-multi-million-gift-card-fraud-scheme-hitting-stores-daily-texas",
      "published": "Mon, 29 Dec 2025 15:45:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Texas substitute teacher charged with child sex offenses, 'no longer employed' by school district",
      "description": "Texas substitute teacher charged with aggravated sexual assault of a child in case involving multiple felony counts and child pornography possession.",
      "url": "https://www.foxnews.com/us/texas-substitute-teacher-charged-child-sex-offenses-no-longer-employed-school-district",
      "published": "Mon, 29 Dec 2025 11:13:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "'No worries': Trump downplays Chinese military drills around Taiwan",
      "description": "The US President has downplayed the drills which follow a US announcement of an $11bn arms sale to Taiwan.",
      "url": "https://www.bbc.com/news/articles/cdxwxkeg9w6o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 03:22:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US issues Iran-Venezuela sanctions over alleged drone trade",
      "description": "Washington accuses Tehran and Caracas of 'reckless proliferation of deadly weapons' amid spiraling tensions.",
      "url": "https://www.aljazeera.com/news/2025/12/30/us-issues-iran-venezuela-sanctions-over-alleged-drone-trade?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 17:43:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar suspends all Europe trains over power issue during holiday travel",
      "description": "Eurostar services between London and Europe disrupted as Channel Tunnel undergoes 'technical intervention'.",
      "url": "https://www.aljazeera.com/news/2025/12/30/eurostar-suspends-all-europe-trains-due-to-power-issue-amid-holiday-period?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 17:06:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "South Korea announces end to controversial bear bile farming",
      "description": "South Korea has announced it's ending bear bile farming over animal cruelty concerns.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/30/south-korea-announces-end-to-controversial-bear-bile-farming?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 14:25:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar: Hundreds of passengers stranded in stations",
      "description": "Eurostar suspended all trains between London, Paris, Amsterdam and Brussels on Tuesday and advised passengers to postpone their journeys to a later date, citing a power supply problem in the Channel tunnel.",
      "url": "https://www.france24.com/en/video/20251230-eurostar-hundreds-of-passengers-stranded-in-stations",
      "published": "Tue, 30 Dec 2025 16:16:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "AFCON knockout race intensifies as groups C and D to wrap up",
      "description": "The Africa's Football Cup of Nations will see two group wrap up as Groups C and D teams play their last games in Morocco on December 30. Teams will be looking to qualify for the competition's round of 16, with Senegal being the big favourites alongside host nation Morocco. FRANCE 24's Selina Sykes reports directly from Rabat and tells us what to know ahead of the coming games.",
      "url": "https://www.france24.com/en/video/20251230-afcon-knockout-race-intensifies-as-groups-c-and-d-to-wrap-up",
      "published": "Tue, 30 Dec 2025 15:31:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar cancels all services after power issue",
      "description": "Eurostar suspended train services in Europe on December 30 after a power supply issue in the Channel tunnel, sparking travel chaos for passengers during the very busy New Year period. Its services to and from London “are suspended until further notice\" and the company advised its passengers to rebook their journeys for other days. FRANCE 24's Olivia Bizot tells us more from Gare du Nord in Paris.",
      "url": "https://www.france24.com/en/video/20251230-eurostar-cancels-all-services-after-power-issue",
      "published": "Tue, 30 Dec 2025 14:53:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar to resume services to and from London after 'major disruption' in Channel Tunnel forced cancellations",
      "description": "Eurostar suspends all London services due to major power supply issues in Channel Tunnel and failed LeShuttle train, forcing passengers to rebook journeys.",
      "url": "https://www.foxnews.com/world/eurostar-forced-cancel-all-services-from-london-after-major-disruption-channel-tunnel",
      "published": "Tue, 30 Dec 2025 10:25:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "From Gaza to Iran: What’s at stake in Trump-Netanyahu Mar-a-Lago talks?",
      "description": "Gaza peace plan and Iran both reportedly on agenda as President Donald Trump is set to meet Israeli Prime Minister Benjamin Netanyahu at Mar-a-Lago on Monday.",
      "url": "https://www.foxnews.com/world/from-gaza-iran-whats-stake-trump-netanyahu-mar-a-lago-talks",
      "published": "Mon, 29 Dec 2025 06:00:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Thieves use drill to steal €30m in German bank heist",
      "description": "Gelsenkirchen Police say thieves used the \"quiet\" days after Christmas to break into the high street branch.",
      "url": "https://www.bbc.com/news/articles/c4grzz60kp3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 16:54:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bangladesh's first female prime minister Khaleda Zia dies aged 80",
      "description": "For decades, Zia and ousted PM Sheikh Hasina were bitter rivals - and their feud defined Bangladesh's politics.",
      "url": "https://www.bbc.com/news/articles/cm2v256vdkyo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 05:14:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea junta chief takes lead in controversial election as social media restricted",
      "description": "TikTok, YouTube and Facebook are down, as the nation awaits the final result from the presidential poll.",
      "url": "https://www.bbc.com/news/articles/cx2520nyp8yo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 14:52:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "K-pop band member sued for $30m after bitter record label feud",
      "description": "Record label Ador says it has dropped NewJeans member Danielle Marsh while the return of Minji remains uncertain.",
      "url": "https://www.bbc.com/news/articles/cdxwxqrde29o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 14:14:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Great white sharks face extinction in Mediterranean, say researchers",
      "description": "Overfishing and illegal fishing are contributing to the loss of sharks, including great whites.",
      "url": "https://www.bbc.com/news/articles/c9qe9wvq534o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 01:15:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Spanish woman who found fame for botching fresco restoration dies",
      "description": "Cecilia Giménez's effort to restore the painting Ecce Homo earned the artwork the nickname \"Monkey Christ\".",
      "url": "https://www.bbc.com/news/articles/cr5z5p633q5o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 03:26:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's Bolsonaro undergoes second medical procedure for hiccups",
      "description": "The former far-right leader receives second treatment in three days for chronic hiccups.",
      "url": "https://www.bbc.com/news/articles/c4g4g0y4m1do?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 30 Dec 2025 00:53:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria beat Uganda 3-1 to head into AFCON last 16 with perfect record",
      "description": "Elsewhere in Group C, Tanzania scrape through to the knockout stages for first time after 1-1 draw with Tunisia.",
      "url": "https://www.aljazeera.com/sports/2025/12/30/nigeria-beat-uganda-3-1-to-head-into-afcon-last-16-with-perfect-record?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 18:38:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How has Trump’s second term transformed the US Justice Department in 2025?",
      "description": "Critics fear the ideal of 'prosecutorial independence' has been jettisoned in favour of more partisan goals under Trump.",
      "url": "https://www.aljazeera.com/news/longform/2025/12/30/how-has-trumps-second-term-transformed-the-us-justice-department-in-2025?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 18:28:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu’s Mar-a-Lago win that wasn’t",
      "description": "The Israeli prime minister’s failure to secure any assurances from Trump is yet another signal Israel is losing ground.",
      "url": "https://www.aljazeera.com/opinions/2025/12/30/netanyahus-mar-a-lago-win-that?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 17:03:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Arsenal vs Aston Villa – Premier League",
      "description": "Follow our live build-up, with team news coverage, before our text commentary stream of the EPL title clash in London.",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/12/30/live-arsenal-vs-aston-villa-english-premier-league?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 16:46:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New Syrian banknotes unveiled amid push to rebuild economy",
      "description": "President Ahmed al-Sharaa has unveiled Syria’s revamped currency in Damascus.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/30/new-syrian-banknotes-unveiled-amid-push-to-rebuild-economy?traffic_source=rss",
      "published": "Tue, 30 Dec 2025 13:33:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "More than 3,000 migrants died trying to reach Spain in 2025",
      "description": "Tighter border controls caused arrivals to decline sharply but forced people on to more dangerous routes, activists say More than 3,000 people died trying to reach Spain by sea over the past year, a sharp fall from the previous 12 months. However, activists cautioned that the drop reflected tighter border controls that have forced migrants to take increasingly dangerous routes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/more-than-3000-migrants-died-spain-figure-down",
      "published": "Mon, 29 Dec 2025 17:31:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Opposition anger as Guinea’s junta leader is frontrunner to be elected president",
      "description": "Mamady Doumbouya accused of betraying his promise to be the restorer of democracy after leading 2021 coup In September 2021, a tall, young colonel in the Guinean army announced that he and his comrades had forcibly seized power and toppled the longtime leader Alpha Condé. “The will of the strongest has always supplanted the law,” Mamady Doumbouya said in a speech, stressing that the soldiers were acting to restore the will of the people. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/27/guinea-junta-leader-mamady-doumbouya-frontrunner-president-election",
      "published": "Sat, 27 Dec 2025 08:00:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jair Bolsonaro undergoes second procedure to treat persistent hiccups",
      "description": "Former Brazilian president underwent a phrenic nerve block while temporarily released from prison for surgery Jair Bolsonaro underwent a second “phrenic nerve block procedure” on Monday to treat persistent hiccups. The treatment went well and the former Brazilian president’s condition is stable, according to his medical team. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/brazil-ex-president-jair-bolsonaro-hiccups-treatment",
      "published": "Mon, 29 Dec 2025 22:07:50 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pauline Hanson travelled to US on Gina Rinehart’s private jet to attend CPAC",
      "description": "Exclusive: One Nation senator travelled on mining magnate’s Gulfstream 700 in October and stayed at Rinehart’s US$66m Palm Beach mansion Get our breaking news email , free app or daily news podcast Pauline Hanson and her chief of staff, James Ashby, flew to Florida on Gina Rinehart’s private jet in October and stayed at the mining magnate’s Palm Beach mansion, close to US President Donald Trump’s Mar-a-Lago resort. Guardian Australia can reveal the One Nation senator and her staffer travelled with Rinehart on the mining magnate’s Gulfstream 700 on 27 October, with publicly available flight tracking data showing that the aircraft travelled from Brisbane to Perth before flying via Osaka to Palm Beach. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/30/pauline-hanson-travelled-to-us-on-gina-rineharts-private-jet-to-attend-cpac",
      "published": "Tue, 30 Dec 2025 10:37:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian cruise ship refloated after becoming stuck on reef off coast of Papua New Guinea",
      "description": "Coral Adventurer, being investigated for allegedly leaving behind passenger who died, ran aground with 124 people on board on Saturday Get our breaking news email , free app or daily news podcast An Australian cruise ship has been refloated after becoming stuck on a reef off Papua New Guinea despite efforts to free the vessel. The Coral Adventurer, which ran aground on Saturday morning , was freed on Tuesday afternoon and was anchored nearby awaiting inspections. Passengers will be flown home early. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/29/passengers-on-cruise-ship-that-ran-aground-off-png-to-be-flown-home-after-refloat-efforts-fail",
      "published": "Tue, 30 Dec 2025 09:03:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.2 - 36 km W of Puerto Santa, Peru",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-28 02:51:50 UTC 2025-12-28 02:51:50 UTC at epicenter Location 8.960°S 78.974°W Depth 66.41 km (41.27 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl57",
      "published": "2025-12-30T06:39:20.863Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.6 - 31 km ESE of Yilan, Taiwan",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-27 15:05:56 UTC 2025-12-27 15:05:56 UTC at epicenter Location 24.657°N 122.041°E Depth 67.53 km (41.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl2n",
      "published": "2025-12-30T03:24:14.885Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel says it will bar aid groups, including Doctors Without Borders, from Gaza",
      "description": "Israel accused Doctors Without Borders, one of the largest health organizations operating in Gaza, of failing to clarify the roles of some staff that Israel accused of cooperation with militants.",
      "url": "https://www.npr.org/2025/12/30/g-s1-103986/israel-gaza-aid-ngos",
      "published": "Tue, 30 Dec 2025 11:04:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Israeli negotiator talks about the next phase of the Gaza peace plan",
      "description": "NPR's Michel Martin talks about the prospects for Phase Two of the Gaza peace plan with former Israeli negotiator Daniel Levy, president of the U.S./Middle East Project.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660699/former-israeli-negotiator-talks-about-the-next-phase-of-the-gaza-peace-plan",
      "published": "Tue, 30 Dec 2025 06:50:48 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China conducting military drills around Taiwan, demonstrating blockade capabilities",
      "description": "China is conducting big military drills that encircle the island of Taiwan on Tuesday, demonstrating its ability to blockade Taiwan completely.",
      "url": "https://www.npr.org/2025/12/30/nx-s1-5660680/china-conducting-military-drills-around-taiwan-demonstrating-blockade-capabilities",
      "published": "Tue, 30 Dec 2025 06:50:44 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fact check: The disinformation we debunked in 2025",
      "description": "From doctored images to fabricated stories, we uncovered the most viral fakes of 2025 — deepfakes, election myths and health hoaxes. Here's what dominated the disinformation landscape.",
      "url": "https://www.dw.com/en/fact-check-the-disinformation-we-debunked-in-2025/a-75283770?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 17:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Female empowerment: Arab women rise to the mic",
      "description": "More and more Middle Eastern women thrive as comedians. Could their success on stage, in the film industry, at comedy festivals and on social media foster empowerment for the next generation of girls?",
      "url": "https://www.dw.com/en/female-empowerment-arab-women-rise-to-the-mic/a-75343404?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 16:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's 'nengajo' New Year card tradition losing its charm",
      "description": "A Japanese year-end rite that can trace its roots back more than 1,000 years is disappearing as people have less free time, feel less connected to work colleagues and prefer to send New Year greetings via social media.",
      "url": "https://www.dw.com/en/japan-s-nengajo-new-year-card-tradition-losing-its-charm/a-75341258?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 12:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "George and Amal Clooney get French citizenship",
      "description": "The Hollywood star, now a dual US-French citizen, has previously praised France's strict privacy laws, saying they protect his children from paparazzi.",
      "url": "https://www.dw.com/en/george-and-amal-clooney-get-french-citizenship/a-75337792?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 06:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rise and fall of Khaleda Zia, Bangladesh's first female PM",
      "description": "Bangladesh's first female prime minister, Khaleda Zia — once praised for restoring democracy and empowering millions of women — has died at the age of 80.",
      "url": "https://www.dw.com/en/rise-and-fall-of-khaleda-zia-bangladesh-s-first-female-pm/a-75337536?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 30 Dec 2025 02:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French ban on ‘forever chemicals' in cosmetics and clothes to enter into force",
      "description": "A French ban on the production and sale of PFAS chemicals – known as 'forever chemicals' as it takes them so long to break down – comes into effect on Thursday. The ban targets a wide range of cosmetics and clothes and will also require French authorities to regularly test drinking water for all kinds of PFAS.",
      "url": "https://www.france24.com/en/live-news/20251230-french-ban-on-forever-chemicals-in-cosmetics-clothing-to-enter-force",
      "published": "Tue, 30 Dec 2025 14:37:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Eurostar chaos leaves cancer patient set to lose &#163;3.5k",
      "description": "A cancer patient who was taking her family to Disneyland is among the thousands of passengers whose travel plans were ruined by Eurostar cancellations on Tuesday.",
      "url": "https://news.sky.com/story/eurostar-chaos-leaves-cancer-patient-set-to-lose-16335k-as-another-family-is-stranded-in-london-13488738",
      "published": "Tue, 30 Dec 2025 16:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I have sunburn and whiplash after a head-spinning two days of Trump diplomacy... only one of them is his fault'",
      "description": "Two December days in Palm Beach and I have sunburn and whiplash.",
      "url": "https://news.sky.com/story/a-head-spinning-two-days-of-trump-diplomacy-but-how-much-was-theatrical-hot-air-13488600",
      "published": "Tue, 30 Dec 2025 02:57:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thieves drill into bank vault to steal valuables worth tens of millions of euros",
      "description": "Thieves have drilled into a German savings bank vault to steal millions of pounds worth of valuables from safety deposit boxes.",
      "url": "https://news.sky.com/story/thieves-drill-into-german-bank-vault-to-steal-valuables-worth-tens-of-millions-of-euros-13488710",
      "published": "Tue, 30 Dec 2025 13:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bangladesh's first female prime minister dies",
      "description": "Bangladesh's first female prime minister Khaleda Zia has died following a prolonged illness, her political party has said.",
      "url": "https://news.sky.com/story/bangladeshs-first-female-prime-minister-khaleda-zia-dies-at-80-13488601",
      "published": "Tue, 30 Dec 2025 03:42:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist",
      "description": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist.",
      "url": "https://news.sky.com/story/foreign-secretary-orders-review-of-serious-failures-in-case-of-british-egyptian-activist-alaa-abd-el-fattah-13488426",
      "published": "Mon, 29 Dec 2025 21:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungary's 'water guardian' farmers fight back against desertification",
      "description": "Southern Hungary landowner Oszkár Nagyapáti has been battling severe drought on his land",
      "url": "https://abcnews.go.com/International/wireStory/hungarys-water-guardian-farmers-fight-back-desertification-128742465",
      "published": "Mon, 29 Dec 2025 00:11:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Khaleda Zia, former Bangladeshi prime minister and archrival of a previous premier, dies at 80",
      "description": "Former Bangladeshi Prime Minister Khaleda Zia has died at 80, her political party has announced Tuesday",
      "url": "https://abcnews.go.com/International/wireStory/khaleda-zia-former-bangladeshi-prime-minister-archrival-hasina-128768275",
      "published": "Tue, 30 Dec 2025 04:09:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Turkey and Armenia agree to simplify visa procedures to normalize ties",
      "description": "Turkey and Armenia have agreed to simplify visa procedures to normalize ties, Turkey's Foreign Ministry announced Monday",
      "url": "https://abcnews.go.com/International/wireStory/turkey-armenia-agree-simplify-visa-procedures-normalize-ties-128752979",
      "published": "Mon, 29 Dec 2025 13:57:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mexican president says 13 people died in the Interoceanic Train derailment in southern Mexico",
      "description": "Mexican president says 13 people died in the Interoceanic Train derailment in southern Mexico",
      "url": "https://abcnews.go.com/International/wireStory/mexican-president-13-people-died-interoceanic-train-derailment-128741805",
      "published": "Sun, 28 Dec 2025 23:59:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Taiwan's aviation authority says more than 100,000 air travelers will be affected by China military drills",
      "description": "Taiwan's aviation authority says more than 100,000 air travelers will be affected by China military drills",
      "url": "https://abcnews.go.com/International/wireStory/taiwans-aviation-authority-100000-air-travelers-affected-china-128746402",
      "published": "Mon, 29 Dec 2025 08:17:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China flexes blockade capabilities near Taiwan on second day of military drills",
      "description": "China's People's Liberation Army is conducting large-scale military drills around Taiwan as part of \"Justice Mission 2025.\"",
      "url": "https://abcnews.go.com/International/wireStory/china-flexes-blockade-capabilities-taiwan-day-military-drills-128773369",
      "published": "Tue, 30 Dec 2025 09:05:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Young Africans find hope in farming as urban life becomes too expensive",
      "description": "Farming has long been seen as low-status work across much of Africa, pushing young people to cities in search of office jobs",
      "url": "https://abcnews.go.com/International/wireStory/young-africans-find-hope-farming-urban-life-expensive-128744653",
      "published": "Mon, 29 Dec 2025 04:41:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: General Assembly decides on 2026 UN budget",
      "description": "Follow our live coverage as the General Assembly and its Fifth Committee meet today to finalize negotiations and vote on the United Nations’ regular budget for 2026. The Fifth Committee is responsible for administrative and budgetary matters, including the Organization’s finances and staffing. UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166681",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza: Humanitarian response ongoing despite restrictions",
      "description": "Although “significant restrictions and impediments” continue to hamper humanitarian operations in Gaza, teams are still responding to the population’s needs, the UN aid coordination office OCHA said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166669",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN celebrates 10 years of progress in youth, peace and security agenda",
      "description": "The UN has long been at the forefront of efforts to involve young people in decision-making, and the last decade has seen significant progress, thanks to the adoption of a Security Council resolution on youth, peace and security which led to widespread changes in the ways that the voices of young people are not just heard, but also incorporated in peace plans and policies.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166637",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Slender Man stabber Morgan Geyser ordered back to psychiatric hospital after group home escape",
      "description": "Judge orders Morgan Geyser back to psychiatric hospital after escaping group home. Woman convicted in 2014 Slender Man stabbing loses privileges.",
      "url": "https://www.foxnews.com/us/slender-man-stabber-morgan-geyser-ordered-back-psychiatric-hospital-after-group-home-escape",
      "published": "Tue, 30 Dec 2025 14:00:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kentucky freight train carrying molten sulfur derails, leaks hazardous chemical in Todd County",
      "description": "Thirty-one freight train cars derailed in rural Todd County, Kentucky on Thursday, prompting a shelter-in-place after molten sulfur leaked from one car.",
      "url": "https://www.foxnews.com/us/kentucky-freight-train-carrying-molten-sulfur-derails-leaks-hazardous-chemical-todd-county",
      "published": "Tue, 30 Dec 2025 13:52:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Unearthed video allegedly shows rampant Minnesota fraud and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/unearthed-video-allegedly-shows-rampant-minnesota-fraud-more-top-headlines",
      "published": "Tue, 30 Dec 2025 06:53:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy claims Trump said US will consider giving Ukraine decades of security guarantees",
      "description": "Ukrainian President Volodymyr Zelenskyy indicated that American President Donald Trump said the U.S. will entertain the prospect of providing Ukraine with decades of security guarantees.",
      "url": "https://www.foxnews.com/world/zelenskyy-claims-trump-said-us-consider-giving-ukraine-decades-security-guarantees",
      "published": "Mon, 29 Dec 2025 10:58:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK prime minister slammed for welcoming home freed Egyptian prisoner after social media posts resurface",
      "description": "U.K. Prime Minister Keir Starmer is facing criticism after welcoming human rights activist Alaa Abd el-Fattah home, as the man's past posts sparked political backlash.",
      "url": "https://www.foxnews.com/world/uk-prime-minister-slammed-welcoming-home-freed-egyptian-prisoner-after-social-media-posts-resurface",
      "published": "Mon, 29 Dec 2025 03:42:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}