{
  "last_updated": "2026-01-13T06:36:45.053619Z",
  "event_count": 223,
  "events": [
    {
      "title": "Security Council LIVE: Attacks against Ukrainian civilians unacceptable, unjustifiable and must stop, says UN",
      "description": "The UN Security Council is meeting in emergency session in New York over Russia’s ongoing deadly missile and drone strikes targeting Ukrainian civilians and energy infrastructure, as frigid winter conditions grip the war-torn country. Millions have been deprived of electricity, heating and water. The UN Secretary-General has called the stepped up attacks an unacceptable violation of international humanitarian law. Follow live below and find all our in-depth meetings coverage here. UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166743",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: After 1,000 days of war, millions of civilians still bearing brunt",
      "description": "Aid agencies marked 1,000 days of war in Sudan on Friday with a grim reminder that the conflict has created the world’s biggest hunger crisis and largest displacement emergency. Every day, civilians have been “paying the price for a war they did not choose”, said UN aid coordination office, OCHA.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166730",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s other Latin American feud: why Colombia’s Petro is not Maduro",
      "description": "Leftwing leader rallies his supporters as US president accuses him of drug trafficking and threatens military action A leftwing South American firebrand calls for his followers to rally in public squares nationwide to defend his country’s sovereignty and decry verbal attacks from Donald Trump. The US president accuses the leader of personally flooding American streets with illegal drugs and imposes sanctions against him and his wife. Threats of military action are followed by a phone conversation between the two leaders. One might imagine that this is a description of the buildup of tensions that led to the 3 January special forces raid on Caracas to capture the Venezuelan leader, Nicolás Maduro, and his wife, Cilia Flores, to face several criminal charges in New York. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/12/trump-latin-america-feud-colombia-gustavo-petro",
      "published": "Mon, 12 Jan 2026 12:07:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Russian attack on Ukrainian city of Kharkiv kills two, wounds several others",
      "description": "A Russian overnight attack on Ukraine’s northeastern city of Kharkiv killed two people and wounded several others, regional and city officials said on Tuesday, as Moscow continues near-daily strikes across the country.",
      "url": "https://www.france24.com/en/europe/20260113-russian-attack-on-ukrainian-city-of-kharkiv-kills-two-wounds-several-others",
      "published": "Tue, 13 Jan 2026 03:40:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s driver charged with dangerous driving after fatal crash in Nigeria",
      "description": "British boxer was injured in collision that killed his personal trainer Latif Ayodele and strength coach Sina Ghami Nigerian police have charged Anthony Joshua’s driver with causing death by dangerous driving after a fatal crash that killed two people. Adeniyi Mobolaji Kayode, 46, was also charged with driving without a valid driving licence and “driving without due care and attention, causing bodily harm and damage to property”. He is due to appear in court on 20 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/anthony-joshuas-driver-charged-with-dangerous-driving-after-fatal-crash-in-nigeria",
      "published": "Fri, 02 Jan 2026 17:54:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN human rights chief ‘deeply disturbed’ by protest-related violence",
      "description": "The UN human rights chief has called for an independent and transparent investigation into reports of deaths and widespread arrests during ongoing nationwide protests in Iran, amid mounting concerns over the use of force by security forces.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166733",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Ending famine, refugee solidarity in Kenya, Ukraine civilian casualties update",
      "description": "The head of the UN’s emergency food agency has urged world leaders on Monday to end “man-made famines” and conflicts that “drive hunger and desperation”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166744",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Armed Iranian protesters battle police in Tehran streets as Trump warns of forceful US response",
      "description": "Protests in Iran turn more violent with 65 reportedly killed by Friday and over 2,300 arrested as authorities imposed an internet blackout amid nationwide anti-regime unrest.",
      "url": "https://www.foxnews.com/world/armed-iran-protesters-battle-police-tehran-streets-trump-warns-forceful-us-response",
      "published": "Sat, 10 Jan 2026 17:18:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "After Venezuela, is the world order shifting from diplomacy towards aggression?",
      "description": "NPR's Sacha Pfeiffer talks with Peter Krause of Boston College about the Trump Administration's willingness to act unilaterally against other countries and what this means for international relations.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5671132/after-venezuela-is-the-world-order-shifting-from-diplomacy-towards-aggression",
      "published": "Sun, 11 Jan 2026 08:05:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Minnesota sues Trump administration over immigration crackdown and ICE shooting",
      "description": "Minnesota and its two largest cities have filed a lawsuit against the Trump administration, seeking to halt or curtail a sweeping immigration enforcement surge that followed the fatal shooting of a Minneapolis woman by a federal officer and sparked protests nationwide.",
      "url": "https://www.france24.com/en/americas/20260113-minnesota-sues-trump-administration-over-immigration-crackdown-ice-shooting",
      "published": "Tue, 13 Jan 2026 02:36:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Two weeks on, questions linger over targeting and impact of US airstrikes in Nigeria",
      "description": "Very little information has been shared about strikes in Sokoto state Two weeks after the US carried out Christmas Day airstrikes in north-west Nigeria on what it described as Islamic State fighters, questions remain over the specific group that was targeted and the operation’s impact. In the aftermath of the strikes, Donald Trump said in a post on his Truth Social platform that “ISIS Terrorist Scum in Northwest Nigeria , who have been targeting and viciously killing, primarily, innocent Christians” were hit with “numerous perfect strikes”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/questions-targeting-impact-us-airstrikes-in-nigeria",
      "published": "Thu, 08 Jan 2026 05:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran flips ‘kill switch’ to hide alleged crimes as death toll rises amid protests",
      "description": "Iran protests spread to 180 cities as authorities allegedly use lethal force against demonstrators, with human rights activists in Iran reporting 65 killed and 2,300 arrested.",
      "url": "https://www.foxnews.com/world/iran-flips-kill-switch-hide-alleged-crimes-death-toll-rises-amid-protests",
      "published": "Sat, 10 Jan 2026 20:51:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "US plan to exploit Venezuela’s oil could eat up 13% of carbon budget to keep 1.5C limit",
      "description": "Exclusive: ClimatePartner analysis shows how move would risk plunging Earth further into climate catastrophe US plans to exploit Venezuela’s oil reserves could by 2050 consume more than a tenth of the world’s remaining carbon budget to limit global heating to 1.5C, according to an exclusive analysis. The calculation highlights how any moves to further exploit the South American nation’s oil reserves – the largest in the world, at least on paper – would put increasing pressure on climate goals, and risk plunging the Earth further into climate catastrophe. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/12/us-plan-to-exploit-venezuelas-oil-could-eat-up-13-of-carbon-budget-to-keep-15c-limit",
      "published": "Mon, 12 Jan 2026 17:38:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "As industry hiring slows and AI automation grows, EU workers are increasingly wary of switching jobs",
      "description": "The pandemic gave workers increased options as home offices became the norm in some fields. Now, with the EU experiencing industrial slowdown and AI automation, workers are growing increasingly wary of switching jobs.",
      "url": "https://www.dw.com/en/as-industry-hiring-slows-and-ai-automation-grows-eu-workers-are-increasingly-wary-of-switching-jobs/a-75394016?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 12:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's Khamenei issues direct warning to United States in Russian-language posts",
      "description": "Iran's Supreme Leader Ali Khamenei issues warning to U.S. in Russian on social media, signaling Tehran's growing alignment with Moscow amid nationwide protests.",
      "url": "https://www.foxnews.com/world/irans-khamenei-issues-direct-warning-united-states-russian-language-posts",
      "published": "Mon, 12 Jan 2026 12:35:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Trump says Iran wants to negotiate as the death toll in protests rises to at least 544",
      "description": "President Donald Trump says Iran wants to negotiate with the U.S. after his threat to strike the country over its crackdown on protesters",
      "url": "https://abcnews.go.com/International/wireStory/iran-alleges-protests-turned-violent-give-trump-excuse-129123028",
      "published": "Mon, 12 Jan 2026 06:33:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns U.S. and Israel against military actions after deadly protests crackdown",
      "description": "Iran warned the U.S. and Israel against military action as activists said at least 203 people have been killed in the nationwide protests, a toll they say is likely far higher.",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5673918/iran-warns-u-s-and-israel-against-military-actions-after-deadly-protests-crackdown",
      "published": "Mon, 12 Jan 2026 04:42:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Carney heads to Beijing as Trump’s America First agenda forces Canada into trade rethink",
      "description": "Canada’s PM seeks to smooth over past ructions in relationship with China as trade war takes its toll During the final stretch of Canada’s spring election campaign, Mark Carney told a debate audience that China was the country’s “biggest geopolitical risk”. He pointed to its attempts to meddle in elections and its recent efforts to disrupt Canada’s Arctic claims. When Carney’s government plane touches down in Beijing this week, it will be the first time a Canadian prime minister has been welcomed in nearly a decade. The trip, undertaken amid the rupturing of global economic and political alliances , reflects a desire by Ottawa to mend a broken relationship with a global superpower that uses its vast and lucrative market to both woo and punish countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/12/carney-heads-to-beijing-as-trump-america-first-agenda-forces-canada-into-trade-rethink",
      "published": "Mon, 12 Jan 2026 09:39:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Trump threatens 'strong' military action as Iran protest deaths rise",
      "description": "Hundreds of protesters have been killed in Iran, rights groups say, as President Trump threatened \"strong\" military action.",
      "url": "https://www.npr.org/2026/01/12/g-s1-105652/trump-military-action-iran-protests-deaths",
      "published": "Mon, 12 Jan 2026 01:24:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Storms worsen already dire humanitarian situation, UN warns",
      "description": "The humanitarian crisis across the Gaza Strip remains extremely serious, with harsh winter weather threatening to reverse recent gains in aid delivery, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166747",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘shocked’ by reports of excessive force against protesters in Iran",
      "description": "The UN Secretary-General is shocked by reports of violence and excessive use of force by Iranian authorities against protesters across the country, urging restraint and the immediate restoration of communications as unrest enters its third week.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166739",
      "published": "Sun, 11 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan war leaves millions hungry and displaced as health system nears collapse",
      "description": "Sudan’s protracted conflict has spiralled into one of the world’s most severe humanitarian crises, with hunger, displacement and the collapse of basic services exacting a daily toll on civilians.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166738",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN World Court begins landmark hearings on Rohingya genocide case against Myanmar",
      "description": "Public hearings opened on Monday at the International Court of Justice (ICJ) in a landmark case brought by the Gambia against Myanmar, alleging violations of the Genocide Convention over the military’s treatment of the Rohingya minority.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166746",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Repression in Uganda, fighting in Syria’s Aleppo continues, Gaza and West Bank updates",
      "description": "The UN has raised serious concerns ahead of Uganda’s elections scheduled for 15 January, warning they will take place in an environment marked by widespread repression, intimidation and shrinking civic space.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166735",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: Increase in abductions and sexual violence ‘unacceptable’",
      "description": "Despite reductions in the overall number of conflict-related incidents in South Sudan, a rise in abductions and sexual violence is concerning, the UN peacekeeping mission in the country, UNMISS, said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166734",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Tyler Robinson prosecutors say Charlie Kirk shooting texts show confusion, not bias, to rebut conflict claim",
      "description": "Accused Charlie Kirk assassin Tyler Robinson seeks to disqualify prosecutor whose child witnessed the fatal shooting at Utah Valley University campus.",
      "url": "https://www.foxnews.com/us/tyler-robinson-prosecutors-say-charlie-kirk-shooting-texts-show-confusion-not-bias-rebut-conflict-claim",
      "published": "Mon, 12 Jan 2026 19:25:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "DOJ charges illegal immigrant with Tren de Aragua ties after Border Patrol shooting in Portland",
      "description": "An alleged Tren de Aragua gang member faces federal charges for ramming Border Patrol vehicle in Portland shooting incident that sparked nationwide protests.",
      "url": "https://www.foxnews.com/us/doj-charges-illegal-immigrant-tren-de-aragua-ties-after-border-patrol-shooting-portland",
      "published": "Mon, 12 Jan 2026 13:43:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Attempt to overturn the Gambia’s ban on FGM heard by supreme court",
      "description": "Case brought by Muslim leaders and MP follows failed 2024 bid and seen as part of global anti-women’s rights backlash A group of religious leaders and an MP in the Gambia have launched efforts to overturn a ban on female genital mutilation at the country’s supreme court. The court case, due to resume this month, comes after two babies bled to death after undergoing FGM in the Gambia last year. Almameh Gibba, an MP and one of the plaintiffs, tabled a bill to decriminalise FGM that was rejected by the country’s parliament in 2024. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/09/the-gambia-female-genital-mutilation-fgm-supreme-court-case-overturn-ban",
      "published": "Fri, 09 Jan 2026 06:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran protests enter third week under internet blackout",
      "description": "As Iran's protests enter a third week, the country's president blames foreign powers for the unrest, and warns it will retaliate if the US intervenes militarily.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5673939/iran-protests-enter-third-week-under-internet-blackout",
      "published": "Sun, 11 Jan 2026 17:00:26 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar vote a ‘facade’ to entrench military rule, independent rights expert says",
      "description": "An independent human rights expert has urged the international community to reject the electoral process organised by Myanmar’s military government, after the first round of voting revealed widespread coercion, exclusion and violence.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166729",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Live: Trump threatens Iran’s trade partners with 25% tariff",
      "description": "After two weeks of government crackdowns on protestors in Iran, US President Donald Trump threatened air strikes and a 25 percent tariff on countries that do business with Iran, as senior aides in the Trump administration urged him to pursue diplomacy with Tehran. At least 648 people have been killed so far, though the actual toll could be much higher. Follow our liveblog for all the latest developments.",
      "url": "https://www.france24.com/en/middle-east/20260113-live-vance-urges-diplomacy-as-trump-weighs-possible-strikes-on-iran",
      "published": "Tue, 13 Jan 2026 04:04:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Deadly Russian strikes push civilians deeper into winter crisis",
      "description": "Ukraine has entered the new year under intensifying and deadly Russian attacks which have crippled energy systems and left millions without heating, electricity or water amid freezing temperatures, senior UN officials told the Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166748",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Australia news live: Queensland stock losses from floods and cyclone top 50,000 amid fears ‘that is only the beginning’, premier says",
      "description": "Follow updates live Adelaide writers’ week 2026 cancelled as board apologises to Randa Abdel-Fattah for ‘how decision was represented’ Get our breaking news email , free app or daily news podcast New role a ‘continuation of Rudd’s public service’, PM says Albanese said the decision to step down was “entirely” Rudd ’s, but said the ambassador’s next role will only continue his work to advance the public interest. Kevin Rudd has a work ethic unlike anyone I’ve ever met. … He sees this as a continuation of his public service, not just to Australia but to the global community. I have seen first-hand how hard he works, not just in the last few years but throughout his public life. He’s always brought an extraordinary level of energy and discipline to public service. He applied his relentless effort, his experience, intellect and determination to advance Australia’s interests in Washington, and Kevin Rudd has served the nation well. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/13/anthony-albanese-labor-hate-speech-laws-politics-coalition-sussan-ley-adelaide-festival-writers-week-reactions-victoria-bushfires-queensland-floods-ntwnfb",
      "published": "Tue, 13 Jan 2026 06:29:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Wildfires in south Argentina rip through nearly 12,000 hectares of forest, threatening communities",
      "description": "Wildfires in the Argentine Patagonia have burned nearly 12,000 hectares of land, threatening a power plant, a school and rural properties",
      "url": "https://abcnews.go.com/International/wireStory/wildfires-south-argentina-rip-12000-hectares-forest-threatening-129108264",
      "published": "Sun, 11 Jan 2026 16:17:56 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Secret Service aware of UMass Lowell-funded radio DJ’s directive to ‘kill JD Vance’",
      "description": "Radio host resigns after allegedly posting death threat against VP JD Vance on Bluesky. FBI, Secret Service investigate UMass volunteer's rhetoric.",
      "url": "https://www.foxnews.com/us/secret-service-aware-umass-lowell-funded-radio-djs-directive-kill-jd-vance",
      "published": "Mon, 12 Jan 2026 11:31:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran’s ‘distinctive’ drone deployment sees death toll soar amid violent protests",
      "description": "Iran allegedly deploys drones amid nationwide protests as Human Rights Activists News Agency reports at least 544 confirmed deaths and over 10,000 arrests.",
      "url": "https://www.foxnews.com/world/irans-distinctive-drone-deployment-sees-death-toll-soar-amid-violent-protests",
      "published": "Sun, 11 Jan 2026 21:08:14 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Netanyahu and Rubio discuss US military intervention in Iran amid ongoing nationwide protests: report",
      "description": "Israeli Prime Minister Benjamin Netanyahu and U.S. Secretary of State Marco Rubio spoke as Israel goes on high alert and Iran faces mounting anti-regime protests.",
      "url": "https://www.foxnews.com/world/netanyahu-rubio-discuss-us-military-intervention-iran-amid-ongoing-nationwide-protests-report",
      "published": "Sun, 11 Jan 2026 04:32:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Trump says any country doing business with Iran will face 25 percent tariff",
      "description": "The US president has threatened Iran with military strikes amid widespread antigovernment protests there.",
      "url": "https://www.aljazeera.com/news/2026/1/12/trump-says-any-country-doing-business-with-iran-will-face-25-percent-tariff?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 23:24:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "China pressing European countries to bar Taiwan politicians or face crossing a ‘red line’",
      "description": "Exclusive: Chinese officials are using a ‘highly specific’ interpretation of EU rules to suggest Taiwanese figures should not be granted visas, officials say Chinese officials have been pushing “legal advice” on European countries, saying their own border laws require them to ban entry to Taiwanese politicians, according to more than half a dozen diplomats and officials familiar with the matter. The officials made demarches to European embassies in Beijing, or through local embassies directly to European governments in their capital cities, warning the European countries not to “trample on China’s red lines”, according to the European diplomats and ministries who spoke to the Guardian. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/china-europe-pressure-block-taiwanese-politicians-visas",
      "published": "Tue, 13 Jan 2026 01:26:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Coal power generation falls in China and India for first time since 1970s",
      "description": "‘Historic’ moment in biggest coal-consuming countries could bring decline in global emissions, analysis says Coal power generation fell in China and India for the first time since the 1970s last year, in a “historic” moment that could bring a decline in global emissions, according to analysis. The simultaneous fall in coal-powered electricity in the world’s biggest coal-consuming countries had not happened since 1973, according to analysts at the Centre for Research on Energy and Clean Air, and was driven by a record roll-out of clean energy projects. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/13/coal-power-generation-falls-china-india-since-1970s",
      "published": "Tue, 13 Jan 2026 00:01:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Justice Department of the United States now 'a political arm of the Trump administration'",
      "description": "Axios is reporting that US ‍Treasury ​Secretary ⁠Scott Bessent warned President Donald Trump ​on ‍Sunday ​that the ​federal probe into Federal Reserve Chair Jerome Powell has \"made a ‍mess\" of things ​and could harm financial ‌markets. For insight and analysis, François Picard welcomes Frederick T. Davis, Lecturer in Law at Columbia University and former US federal prosecutor. Mr. Davis warns the Justice Department is being used as a political weapon, the Federal Reserve is under siege, and the federal courts have been potentially neutered by unchecked executive power.",
      "url": "https://www.france24.com/en/video/20260112-justice-department-of-the-united-states-now-a-political-arm-of-the-trump-administration",
      "published": "Mon, 12 Jan 2026 21:25:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Los Angeles wildfire recovery enters second year as frustration and uncertainty linger",
      "description": "One year after massive wildfires devastated Los Angeles County, many families remain displaced, frustrated by slow rebuilding, permit delays and ongoing housing challenges.",
      "url": "https://www.foxnews.com/us/los-angeles-wildfire-recovery-enters-second-year-frustration-uncertainty-linger",
      "published": "Sun, 11 Jan 2026 23:26:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Family dog rescued after chewing battery-powered heated glove, sparking house fire",
      "description": "A dog was rescued from a house fire after accidentally starting the blaze by chewing a battery-powered glove, Ottawa authorities said. No injuries were reported.",
      "url": "https://www.foxnews.com/world/family-dog-rescued-after-chewing-battery-powered-heated-glove-sparking-house-fire",
      "published": "Mon, 12 Jan 2026 11:29:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "'They just kept killing': Eyewitnesses describe deadly crackdown in Iran",
      "description": "The BBC has received eyewitness accounts of security forces attacking anti-government protesters across the country.",
      "url": "https://www.bbc.com/news/articles/cvgp70ynx1po?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 19:54:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Fact-finding mission urges Iran to end protest violence and restore internet",
      "description": "The UN-mandated independent human rights fact-finding mission on Iran has urged authorities to immediately restore internet access and halt the violent crackdown of the ongoing, nationwide protest.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166737",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "As Trump urges deal, Cuban president warns that the country will defend itself 'to the last drop of blood'",
      "description": "As Trump pressured Cuba to strike a deal, Cuban President Miguel Díaz-Canel Bermúdez asserted that the country will defend itself \"to the last drop of blood.\"",
      "url": "https://www.foxnews.com/world/trump-urges-deal-cuban-president-warns-country-defend-itself-to-last-drop-blood",
      "published": "Mon, 12 Jan 2026 05:59:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Nigerian stars dominate All Africa Music Awards",
      "description": "Global superstar Burna Boy claimed the prestigious Album of the Year award for his latest work No Sign of Weakness.",
      "url": "https://www.bbc.com/news/articles/c5y2gkydpp5o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 11:25:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Asio chief given powers to recommend organisations be proscribed as hate groups under Labor’s new laws",
      "description": "Neo-Nazi group the National Socialist Network claims it will disband before hate speech legislation is introduced to parliament on Monday Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Australia’s spy boss will be given powers to recommend an organisation be proscribed as a hate group under the Labor government’s new religious vilification protections . The draft bill, which the government released on Tuesday, includes new hate speech and anti-vilification laws, powers to formally designate groups as proscribed organisations, and provisions for the largest gun buy-back scheme since the 1996 Port Arthur massacre. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/13/asio-chief-given-powers-to-recommend-organisations-be-proscribed-as-hate-groups-under-labors-new-laws",
      "published": "Tue, 13 Jan 2026 06:15:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iran protests: Trump open to airstrikes, wants diplomacy",
      "description": "The White House says the president is considering military action against Iran to halt its clampdown on protests — but a channel for diplomacy remains open. A rights group say nearly 650 people have been killed.",
      "url": "https://www.dw.com/en/iran-protests-trump-open-to-airstrikes-wants-diplomacy/live-75471666?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 09:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "At the heart of change: Spotlight Initiative highlights breakthroughs in tackling gender-based violence",
      "description": "When it comes to protecting women and girls from gender-based violence, change happens when they are “at the heart of every decision,” according to Erin Kenny, Global Coordinator of the Spotlight Initiative a United Nations–European Union partnership aimed at tackling all forms of abuse against women and girls.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166721",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "US warns Americans to leave Venezuela immediately as armed militias set up roadblocks",
      "description": "The U.S. government issued an urgent security alert for Americans in Venezuela to leave immediately due to safety concerns and an inability to provide continued assistance.",
      "url": "https://www.foxnews.com/world/us-warns-americans-leave-venezuela-immediately-armed-militias-set-up-roadblocks",
      "published": "Sat, 10 Jan 2026 17:00:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iranian hospitals overwhelmed with injuries as protests rage across Islamic Republic",
      "description": "Iranian hospitals are reportedly overwhelmed as anti-government protests rage, with doctors treating gunshot wounds to heads and eyes amid nationwide unrest.",
      "url": "https://www.foxnews.com/world/iranian-hospitals-overwhelmed-injuries-protests-rage-across-islamic-republic",
      "published": "Sat, 10 Jan 2026 15:00:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "US slams Russia’s ‘dangerous escalation’ in Ukraine amid new deadly strikes",
      "description": "The Trump administration denounces Russia's use of a nuclear-capable Oreshnik missile in a UN Security Council meeting.",
      "url": "https://www.aljazeera.com/news/2026/1/13/us-slams-russias-dangerous-escalation-in-ukraine-amid-new-deadly-strikes?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 04:18:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Underground church says leaders detained as China steps up crackdown",
      "description": "Early Rain pastor said to be among those held in sweep that followed arrests of members of other unregistered churches Leaders of a prominent underground church have been detained in south-west China, according to a church statement, the latest blow in what appears to be a sweeping crackdown on unregistered Christian groups in the country. On Tuesday, Li Yingqiang, the leader of the Early Rain Covenant Church, was taken by police from his home in Deyang, a small city in Sichuan province, according to the statement. Li’s wife, Zhang Xinyue, has also been detained, along with two other church members: Dai Zhichao, a pastor; and Ye Fenghua, a lay member. At least a further four members were taken and later released, while some others remain out of contact. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/11/underground-church-early-rain-leaders-detained-china-crackdown",
      "published": "Sun, 11 Jan 2026 13:00:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Germany news: Ice warnings force closure of schools",
      "description": "Schools in many parts of Germany have closed their doors following warnings of extremely icy conditions. Meanwhile, German Chancellor Friedrich Merz has started his first state visit to India.",
      "url": "https://www.dw.com/en/germany-news-ice-warnings-force-closure-of-schools/live-75469555?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 08:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Writer Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death",
      "description": "In tonight's edition, iconic Nigerian author Chimamanda Ngozi Adichie accuses the Lagos Euracare hospital of negligence over the death of her infant son. Also, Uganda opposition leader Bobi Wine says that he will call for protests if there are any signs of corruption in Thursday's presidential vote. And kids in Kaduna state struggle with their return to school as students are excited to see their friends, but worries about safety remain.",
      "url": "https://www.france24.com/en/writer-chimamanda-ngozi-adichie-accuses-lagos-hospital-of-negligence-after-son-s-death",
      "published": "Mon, 12 Jan 2026 21:27:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Massive overnight attack leaves millions in the dark",
      "description": "UN agencies are supporting efforts on Friday to keep energy services up and running in Ukraine, and families warm amid freezing winter temperatures, following a large-scale overnight attack.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166732",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Malaysia blocks Elon Musk’s Grok AI over fake, sexualised images",
      "description": "Country follows Indonesia in restricting access after global outcry over X’s AI tool Malaysia has become the second country to temporarily block access to Elon Musk’s Grok after a global outcry over the AI tool and its ability to produce fake, sexualised images. Malaysia said it would restrict access to Grok until effective safeguards were implemented, a day after similar action was taken by Indonesia. Continue reading...",
      "url": "https://www.theguardian.com/technology/2026/jan/12/malaysia-blocks-elon-musk-grok-ai-fake-sexualised-images-indonesia-x-chatbot",
      "published": "Mon, 12 Jan 2026 12:12:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens Iran as country cracks down on protesters",
      "description": "President Trump has threatened Iran amid a deadly crackdown on protesters. NPR's Leila Fadel speaks to Holly Dagres of the Washington Institute for Near East Policy about the protests.",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5672481/trump-threatens-iran-as-country-cracks-down-on-protesters",
      "published": "Mon, 12 Jan 2026 04:42:30 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Cheating scandal hits Winter Olympics skeleton qualifier",
      "description": "An international sports governing body is investigating after a Canadian coach was accused of manipulating an event — depriving racers of qualifying points ahead of February's Winter Olympics.",
      "url": "https://www.dw.com/en/cheating-scandal-hits-winter-olympics-skeleton-qualifier/a-75472837?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 10:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "What the US withdrawal from UN bodies could mean for climate, trade and development",
      "description": "The United States’ intention to withdraw from a host of UN bodies announced this week targets programmes and initiatives focusing on a wide range of crucial areas, including the climate crisis, trade, gender and development.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166736",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran set to hang protester in what would mark first execution tied to anti-regime demonstrations",
      "description": "Iran is reportedly set to execute its first protester linked to mass arrests over the widespread anti-regime demonstrations. More than 500 people were also killed in the crackdown.",
      "url": "https://www.foxnews.com/world/iran-set-hang-protester-what-would-mark-first-execution-tied-anti-regime-demonstrations",
      "published": "Mon, 12 Jan 2026 21:28:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump briefed on military and covert options for Iran, sources say",
      "description": "The US president also imposes a 25% tariff on countries that \"do business\" with Tehran, while Iran's foreign minister says his country is \"ready for war\".",
      "url": "https://www.bbc.com/news/articles/clyev0kpk77o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 05:03:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Five severed heads found hanging on Ecuador beach amid escalating gang clashes",
      "description": "Ecuador gang violence escalates as five severed heads discovered on tourist beach in Puerto Lopez, highlighting country's record homicide rate amid military crackdown.",
      "url": "https://www.foxnews.com/world/five-severed-heads-found-hanging-tourist-beach-ecuador-amid-escalating-gang-massacre-violence",
      "published": "Sun, 11 Jan 2026 22:45:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "How will investigators determine if Minneapolis ICE shooting was justified?",
      "description": "Officials will examine video footage and policy guidelines as part of the investigation, experts told the BBC.",
      "url": "https://www.bbc.com/news/articles/cvgnvqrxl0xo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 03:17:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Minister Araghchi warns Iran ready for war as Trump weighs military options",
      "description": "Foreign minister says he hopes Washington will choose ‘wise option’ of dialogue after Trump threatens US intervention.",
      "url": "https://www.aljazeera.com/news/2026/1/12/iranian-fm-araghchi-warns-iran-ready-for-war-if-us-wants-to-test-it?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 20:42:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US investigation into Fed Chair Powell sparks chrus of criticism",
      "description": "Criticism has been pouring in from Republican and Democratic lawmakers, former Fed chairs and top officials after the US Justice Department launched a criminal investigation against Federal Reserve chairman Jerome Powell. After he described the move as retaliation against the Fed for not lowering interest rates as quickly as the President wanted, concern over the central bank's independence pushed prices of safe-haven assets like gold higher.",
      "url": "https://www.france24.com/en/tv-shows/business/20260112-us-investigation-into-fed-chair-powell-sparks-chrus-of-criticism",
      "published": "Mon, 12 Jan 2026 22:03:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "🔴 Live: Iran's Khamenei says strong turnout at pro-government rallies 'warning' to US",
      "description": "No description available.",
      "url": "https://www.france24.com/en/middle-east/20260112-live-trump-says-iran-wants-to-negotiate-after-us-threatens-military-intervention",
      "published": "Mon, 12 Jan 2026 18:26:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump announces new tariff on countries trading with Iran as number killed in protests rises",
      "description": "Donald Trump has announced fresh tariffs on Iran's trading partners in an apparent response to the rising number of people killed during recent protests.",
      "url": "https://news.sky.com/story/trump-announces-new-tariff-on-countries-trading-with-iran-as-number-killed-in-protests-rises-13493555",
      "published": "Mon, 12 Jan 2026 22:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Truck drives into crowd at Iran protest in LA",
      "description": "One person was injured and a man arrested after a vehicle drove into a crowd of Iranian protesters in Los Angeles on Sunday, authorities have said.",
      "url": "https://news.sky.com/story/one-person-injured-and-man-arrested-after-truck-drives-into-crowds-at-iran-protest-in-la-13493362",
      "published": "Mon, 12 Jan 2026 10:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Swiss court orders 3 months of pretrial detention for bar manager over fatal fire",
      "description": "A Swiss court has ordered three months of pretrial detention for a manager of a bar that burst into flames during a New Year’s Eve celebration",
      "url": "https://abcnews.go.com/International/wireStory/swiss-court-orders-3-months-pretrial-detention-bar-129135486",
      "published": "Mon, 12 Jan 2026 12:08:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators swarm vehicle of conservative influencer Nick Sortor",
      "description": "Nick Sortor says anti-ICE protesters swarmed his vehicle in Minnesota, smashing windows and blocking his route.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-swarm-vehicle-conservative-influencer-nick-sortor",
      "published": "Mon, 12 Jan 2026 12:38:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "LA protesters swarm U-Haul truck that drove through anti-Iranian regime gathering, driver arrested",
      "description": "Video shows anti-Iranian regime protesters swarming U-Haul that drove through Los Angeles demonstration, smashing windshield before police detain driver.",
      "url": "https://www.foxnews.com/us/la-protesters-swarm-u-haul-truck-drove-through-anti-iranian-regime-gathering-driver-arrested",
      "published": "Mon, 12 Jan 2026 07:52:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Cuba’s president defiant, says no negotiations scheduled as Trump moves to choke off oil lifeline",
      "description": "Cuba rejects Trump's deal demands as Venezuelan oil lifeline ends. President Díaz-Canel says no negotiations with Washington despite energy crisis threats.",
      "url": "https://www.foxnews.com/world/cubas-president-defiant-says-no-negotiations-scheduled-trump-moves-choke-oil-lifeline",
      "published": "Mon, 12 Jan 2026 21:55:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'Miracle baby' born in a tree above Mozambique floodwaters dies aged 25",
      "description": "Rosita Salvador Mabuiango's mother was sheltering for days before giving birth perched above the water.",
      "url": "https://www.bbc.com/news/articles/c79re5415n2o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 17:39:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Adelaide writers’ week 2026 cancelled as board apologises to Randa Abdel-Fattah for ‘how decision was represented’",
      "description": "Almost all remaining festival board members have resigned after backlash to decision to disinvite the Palestinian Australian author Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Adelaide writers’ week 2026 has been cancelled after days of turmoil as more than 180 authors and speakers dropped out in protest of the decision to disinvite the Palestinian Australian author Randa Abdel-Fattah. In a statement on Tuesday afternoon, the Adelaide festival board announced the event, which was scheduled to begin on 28 February, would no longer go ahead. The three remaining members of the festival board have resigned immediately, following the resignations of four others – with the exception of the Adelaide city council representative, whose term expires in February. Continue reading...",
      "url": "https://www.theguardian.com/culture/2026/jan/13/adelaide-writers-week-cancelled-as-board-apologises-to-randa-abdel-fattah-for-how-decision-was-represented-ntwnfb",
      "published": "Tue, 13 Jan 2026 05:13:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Venezuela begins releasing political prisoners, but hundreds remain behind bars",
      "description": "Venezuela has freed a handful of detainees in what it calls a gesture of national unity. Rights groups say releases are slow and the country's repressive system remains in place.",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5672535/venezuela-releases-political-prisoners-days-after-u-s-removes-nicolas-maduro",
      "published": "Mon, 12 Jan 2026 04:43:17 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Trump is no chump and won't allow slaughter in Iran, says US ambassador to Israel",
      "description": "America's ambassador to Israel has told Sky News that the United States has no plans to launch a military attack against Iran - but admitted that those plans could change.",
      "url": "https://news.sky.com/story/donald-trump-is-no-chump-and-wont-allow-slaughter-in-iran-says-us-ambassador-to-israel-13493515",
      "published": "Mon, 12 Jan 2026 19:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "More federal agents to be sent to Minnesota, Trump administration says",
      "description": "The move comes after protests against immigration enforcement have been held across the US after a woman was shot by an ICE agent.",
      "url": "https://www.bbc.com/news/articles/cpv7knz8e8mo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 22:21:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "‘A nightmare’: Fear grips Indian students in Bangladesh amid unrest",
      "description": "As anti-India sentiments soar in Bangladesh, Indian medical students in the country fear for their safety and degrees.",
      "url": "https://www.aljazeera.com/features/2026/1/13/a-nightmare-fear-grips-indian-students-in-bangladesh-amid-unrest?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 05:16:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "US prosecutors open investigation into Federal Reserve Chair Jerome Powell",
      "description": "US Federal Reserve Chair Jerome Powell said the new investigation is a pretext to undermine the bank’s independence.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/12/us-prosecutors-open-investigation-into-federal-reserve-chair-jerome-powell?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 20:43:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump threatens to block ExxonMobil from Venezuela after CEO calls country ‘uninvestable’",
      "description": "US president says company is ‘playing too cute’ after CEO responds sceptically to his push for oil investment after deposing Nicolás Maduro Donald Trump has said he might block ExxonMobil from investing in Venezuela after the oil company’s chief executive called the country “uninvestable” during a White House meeting last week. Darren Woods told the US president that Venezuela would need to change its laws before it could be an attractive investment opportunity, during the high-profile meeting on Friday with at least 17 other oil executives. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/12/donald-trump-threatens-block-exxonmobil-venezuela",
      "published": "Mon, 12 Jan 2026 03:11:30 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Australian author Craig Silvey charged with possessing and distributing child exploitation material",
      "description": "Jasper Jones and Runt writer charged after search warrant issued at his Fremantle home on Monday Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Prominent Australian author Craig Silvey has been charged with possessing and distributing child exploitation material. Silvey, 43, had a search warrant issued at his Fremantle home on Monday, 12 January, where detectives allegedly found him “actively engaging with other child exploitation offenders online”. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/13/australian-author-craig-silvey-charged-child-exploitation-ntwnfb",
      "published": "Tue, 13 Jan 2026 05:59:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump's feud with US Fed chair Powell rattles investors",
      "description": "Trump's fight with Federal Reserve Chair Powell just took a new twist — sending stocks and the dollar lower and lifting gold. DW looks into whether a new criminal investigation could put the Fed's independence at risk.",
      "url": "https://www.dw.com/en/trump-s-feud-with-us-fed-chair-powell-rattles-investors/a-75471668?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 17:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Blackout over Iran: Can the regime keep a lid on the nationwide uprising?",
      "description": "It’s no longer just about the cost of living. Protests in Iran entering their third week despite evidence of a ferocious crackdown and the shutting of the Internet.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260112-blackout-over-iran-can-the-regime-keep-a-lid-on-the-nationwide-uprising",
      "published": "Mon, 12 Jan 2026 19:18:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Seattle order to stop drug arrests ‘creating havoc’ for people fending off addicts surviving on theft: expert",
      "description": "Seattle's new drug enforcement approach sparks debate as police and advocates warn of rising crime and open-air drug markets returning to streets.",
      "url": "https://www.foxnews.com/us/seattle-order-stop-drug-arrests-creating-havoc-people-fending-off-addicts-surviving-theft-expert",
      "published": "Mon, 12 Jan 2026 08:00:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Gaza’s children study in tents as gunfire rages by Israel’s ‘yellow line’",
      "description": "Seven-year-old Toulin Al-Hindi faces the threat of sniper fire each day to reach her tented school in northern Gaza.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/12/gazas-children-study-in-tents-as-gunfire-rages-by-israels-yellow?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 20:05:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Portuguese Empire: Ports and Profits",
      "description": "Portugal’s global trading empire - from fortified ports to faith-fuelled profits - across Africa, Brazil, and Asia.",
      "url": "https://www.aljazeera.com/video/aljazeerauntangles/2026/1/12/portuguese-empire-ports-and-profits?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 18:30:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cremation pyre in Africa thought to be world’s oldest containing adult remains",
      "description": "9,500-year-old pyre uncovered in Malawi offers rare insight into rituals of ancient African hunter-gatherer groups A cremation pyre built about 9,500 years ago has been discovered in Africa, offering a fresh glimpse into the complexity of ancient hunter-gatherer communities. Researchers say the pyre, discovered in a rock shelter at the foot of Mount Hora in northern Malawi, is thought to be the oldest in the world to contain adult remains, the oldest confirmed intentional cremation in Africa, and the first pyre to be associated with African hunter-gatherers. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/01/cremation-pyre-in-africa-thought-to-be-worlds-oldest-containing-adult-remains",
      "published": "Thu, 01 Jan 2026 19:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US frackers were already facing a global oil supply glut. Trump’s Venezuelan dream could make it worse",
      "description": "Picture is as murky as a barrel of oil, with US companies in 2026 expecting their first production drop in four years US shale-oil producers were already contending with oil prices at four-year lows. News that they may soon face a significant competitor in their back yard probably wasn’t how frackers wanted to greet 2026. The US capture of Venezuela’s President Nicolaá Maduro and his wife, Cilia Flores, hit the share prices of independent shale-oil producers, such as Diamondback Energy and Devon Energy, last week. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/12/us-oil-producers-global-supply-glut-venezuela",
      "published": "Mon, 12 Jan 2026 11:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Mattel launches first Barbie with autism to promote inclusivity",
      "description": "Mattel creates a doll that it hopes represents some of the ways autistic people interact with the world.",
      "url": "https://www.dw.com/en/mattel-launches-first-barbie-with-autism-to-promote-inclusivity/a-75479162?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 18:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "French farmers drive tractors into Paris to protest EU-Mercosur trade deal",
      "description": "French farmers drove tractors into Paris for the second time in a week on Tuesday to protest an EU-Mercosur trade deal they say would undercut local agriculture with cheaper imports from South America. Backed by FNSEA, one of France's largest farm unions, the action adds pressure on President Emmanuel Macron’s government after most EU member states approved the pact despite Paris’s opposition.",
      "url": "https://www.france24.com/en/france/20260113-french-farmers-drive-tractors-into-paris-to-protest-eu-mercosur-trade-deal",
      "published": "Tue, 13 Jan 2026 06:22:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran protests: Fact-checking claims of AI manipulation, low turnout",
      "description": "For around two weeks - and despite an internet blackout - thousands of Iranians have been mobilising in large protests that threaten the future of the ruling regime. But some internet users are casting doubt over the protest images, claiming they’re in fact much smaller than they appear, or using camera trickery or AI manipulation. Vedika Bahl goes through the claims in Truth or Fake.",
      "url": "https://www.france24.com/en/iran-protests-fact-checking-claims-of-ai-manipulation-low-turnout",
      "published": "Mon, 12 Jan 2026 21:40:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran's rulers are more exposed than ever - protesters want them out of their lives",
      "description": "The big question as we watch the unrest continue in Iran: will it be enough to bring down the government?",
      "url": "https://news.sky.com/story/irans-rulers-are-more-exposed-than-ever-protestors-want-them-out-of-their-lives-13493448",
      "published": "Mon, 12 Jan 2026 15:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump to meet Venezuelan opposition leader Machado at the White House",
      "description": "Machado, the winner of 2025 Nobel Peace Prize, had offered to share the honour with Trump, an award the president has long coveted.",
      "url": "https://www.bbc.com/news/articles/cr7jzpr95yvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 20:51:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Rubbish landslide death toll in Philippines rises to 11",
      "description": "The landslide occurred at the Binaliw landfill while more than 100 workers were on site.",
      "url": "https://www.bbc.com/news/articles/c9wxg4e09jzo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 04:03:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,419",
      "description": "These are the key developments from day 1,419 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/13/russia-ukraine-war-list-of-key-events-day-1419?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 01:48:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death",
      "description": "Lawyers for Adichie and her husband serve Euracare hospital with legal notice after death of 21-month-old The Nigerian author Chimamanda Ngozi Adichie has accused a Lagos hospital of negligence after the death of one of her 21-month-old twin boys. Nkanu Nnamdi died on 6 January after a brief illness. He was one of twin boys born to Adichie and Ivara Esege, a doctor, in 2024 by surrogacy, eight years after the birth of their first child, a girl. Continue reading...",
      "url": "https://www.theguardian.com/books/2026/jan/12/chimamanda-ngozi-adichie-accuses-lagos-hospital-negligence-son-death",
      "published": "Mon, 12 Jan 2026 14:26:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Former Corsican separatist leader Orsoni assassinated at mother's funeral",
      "description": "Alain Orsoni, who led the separatist Corsican Movement for Self-Determination before becoming the president of Corsican football club ‍AC Ajaccio, was killed by a long-range shot at his mother's funeral on the French island.",
      "url": "https://www.france24.com/en/france/20260112-former-corsican-separatist-leader-orsoni-assassinated-mother-funeral",
      "published": "Mon, 12 Jan 2026 21:39:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'He was shot in the heart': The teen victims of Iran's ruthless crackdown",
      "description": "In a large warehouse on the outskirts of Tehran, the floor is covered in dozens - or possibly hundreds - of black plastic body bags.",
      "url": "https://news.sky.com/story/he-was-shot-in-the-heart-the-teen-victims-of-irans-ruthless-crackdown-13493544",
      "published": "Mon, 12 Jan 2026 21:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Roadside bomb targeting police vehicle kills 6 officers in northwest Pakistan",
      "description": "Police say a roadside bomb targeting a police vehicle has killed six officers in northwestern Pakistan near the Afghan border",
      "url": "https://abcnews.go.com/International/wireStory/roadside-bomb-targeting-police-vehicle-kills-6-officers-129124074",
      "published": "Mon, 12 Jan 2026 06:48:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Mom killed shielding kids after husband erupts in rage over NFL game: police",
      "description": "Florida mom Crystal Roure shot protecting children when husband Jason Kenney flew into rage over NFL game, police say. Roure died after telling son to call 911.",
      "url": "https://www.foxnews.com/us/mom-killed-shielding-kids-after-husband-erupts-rage-over-nfl-game-police",
      "published": "Mon, 12 Jan 2026 17:35:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Surgeon ex-husband accused in Ohio dentist double murder reveals plea in court",
      "description": "Ohio dentist's wife and husband allegedly killed by her ex-husband, who waived extradition from Illinois. Michael McKee faces double murder charges.",
      "url": "https://www.foxnews.com/us/ex-husband-charged-ohio-dentist-double-murder-appears-illinois-court-possible-extradition",
      "published": "Mon, 12 Jan 2026 06:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why political assassination cases aren't automatically death penalty eligible",
      "description": "Prosecutors struggle with charging alleged assassins Luigi Mangione and Tyler Robinson as U.S. law lacks clear penalties for political murders and assassinations.",
      "url": "https://www.foxnews.com/us/why-political-assassination-cases-arent-automatically-death-penalty-eligible",
      "published": "Mon, 12 Jan 2026 06:00:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nobel Institute shuts down talk of Venezuelan leader sharing Peace Prize with Trump",
      "description": "Nobel Institute rejects suggestion from Venezuelan leader María Corina Machado to transfer her Peace Prize to Trump, stating awards \"cannot be transferred.\"",
      "url": "https://www.foxnews.com/world/nobel-institute-shuts-down-talk-venezuelan-leader-sharing-peace-prize-trump",
      "published": "Sat, 10 Jan 2026 23:54:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump discusses whether he'd order a mission to capture Putin",
      "description": "President Donald Trump dismisses the idea of capturing Vladimir Putin, saying he's \"disappointed\" the Russia-Ukraine war remains without a resolution.",
      "url": "https://www.foxnews.com/world/trump-answers-whether-hed-order-mission-capture-putin",
      "published": "Sat, 10 Jan 2026 14:49:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Socialist dictator Maduro gone, but Venezuelans remain wary after years of oppression",
      "description": "Venezuelan citizens express cautious relief after Nicolas Maduro was ousted and taken to New York to face trial, ending years of controversial socialist rule.",
      "url": "https://www.foxnews.com/world/socialist-dictator-maduro-gone-venezuelans-remain-wary-after-years-oppression",
      "published": "Sat, 10 Jan 2026 06:00:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Custody extended for owner of Swiss ski bar after deadly fire",
      "description": "Jacques Moretti is being held as a potential flight risk, Swiss media reports say.",
      "url": "https://www.bbc.com/news/articles/c1klvp4v8vjo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 12:56:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Court says Trump illegally blocked clean energy grants to Democratic states",
      "description": "A US district judge ruled that Trump's decision singled out states that voted for Democrats in the 2024 elections.",
      "url": "https://www.aljazeera.com/news/2026/1/13/court-says-trump-illegally-blocked-clean-energy-grants-to-democratic-states?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 05:21:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "UK to investigate Elon Musk’s Grok over ‘deeply concerning’ deepfakes",
      "description": "Pressure on after Starmer said Musk's X needs to 'get a grip' on Grok; Downing Street has threatened to leave platform.",
      "url": "https://www.aljazeera.com/news/2026/1/12/uk-to-investigate-elon-musks-grok-over-deeply-disturbing-deepfakes?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 18:38:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "UK targets Elon Musk’s X with fines and possible ban over Grok deepfake abuse",
      "description": "The U.K.'s communications regulator, Ofcom, launched a formal investigation into Elon Musk's X platform following reports of AI chatbot Grok creating illegal deepfake images.",
      "url": "https://www.foxnews.com/world/uk-targets-elon-musks-x-fines-possible-ban-over-grok-deepfake-abuse",
      "published": "Mon, 12 Jan 2026 17:30:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Protester scales Iranian Embassy in London, tears down regime flag, hoists pre-revolution symbol",
      "description": "Drama played out in London when a protester reportedly scaled Iran's embassy building, tears down a regime flag and replaces it with a pre-1979 flag.",
      "url": "https://www.foxnews.com/world/protester-scales-iranian-embassy-in-london-tears-down-regime-flag-hoists-pre-revolution-symbol",
      "published": "Sat, 10 Jan 2026 17:03:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian army sends troops to rural Aleppo to stop any SDF attempt to regroup",
      "description": "The SDF denies accusations that it deployed military forces to the Deir Hafer front in the eastern Aleppo countryside.",
      "url": "https://www.aljazeera.com/news/2026/1/13/syrian-army-sends-troops-to-rural-aleppo-to-stop-any-sdf-attempt-to-regroup?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 06:04:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Thousands of nurses go on strike in New York City",
      "description": "Nurses were joined by elected leaders, including the city’s new mayor, Zohran Mamdani, as contract negotiations failed.",
      "url": "https://www.aljazeera.com/economy/2026/1/12/thousands-of-nurses-go-on-strike-in-new-york-city?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 23:49:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mamdani backs striking NYC nurses, denounces hospital bosses’ pay",
      "description": "Nearly 15,000 nurses walked off their jobs at major New York City hospitals in a health care strike.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/12/mamdani-backs-striking-nyc-nurses-denounces-hospital-bosses-pay?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 21:04:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Indonesia blocks Musk’s Grok chatbot due to risk of pornographic content",
      "description": "Move comes after governments and regulators from Europe to Asia have condemned the AI tool and some have opened inquiries into sexualised content Indonesia temporarily blocked Elon Musk’s Grok chatbot on Saturday due to the risk of AI-generated pornographic content, becoming the first country to deny access to the AI tool. The move comes after governments, researchers and regulators from Europe to Asia have condemned and some have opened inquiries into sexualised content on the app. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/10/indonesia-blocks-musks-grok-chatbot-due-to-risk-of-pornographic-content",
      "published": "Sat, 10 Jan 2026 07:52:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Historic upset in English soccer's FA Cup as Macclesfield beat holders Crystal Palace",
      "description": "The result marks the first time in 117 years that a side from outside the major national leagues has eliminated the reigning FA Cup holders.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5673942/historic-upset-soccer-fa-cup-macclesfield-beat-crystal-palace",
      "published": "Sun, 11 Jan 2026 12:26:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US: Minnesota sues federal gov't over immigration crackdown",
      "description": "The legal action comes after a 37-year-old woman was shot dead by a federal agent in Minneapolis last week. Minnesota Attorney General Keith Ellison says the federal government's actions have \"made us less safe.\"",
      "url": "https://www.dw.com/en/us-minnesota-sues-federal-gov-t-over-immigration-crackdown/a-75481197?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 01:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Powell probe: 'I don't think this is helping ordinary Americans at all', economist says",
      "description": "Speaking with FRANCE 24's Sharon Gaffney, Atakan Bakiskan, Economist at Berenberg Private Bank, says that the US Federal Reserve would lose its political independence should Chairman Jerome Powell resign and should the Supreme Court allow the firing of Fed Governor Lisa Cook, leaving the central bank with a majority of Trump appointees on its board.",
      "url": "https://www.france24.com/en/tv-shows/a-propos/20260112-powell-probe-i-don-t-think-this-is-helping-ordinary-americans-at-all-economist-says",
      "published": "Mon, 12 Jan 2026 22:20:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland rejects US takeover 'under any circumstance', government says",
      "description": "Greenland's government on Monday said it could not accept a US takeover of the Arctic island under \"any circumstance\", after US President Donald Trump said that the United States would take the territory \"one way or the other\". FRANCE 24's Monte Francis reports.",
      "url": "https://www.france24.com/en/greenland-rejects-us-takeover-under-any-circumstance-government-says",
      "published": "Mon, 12 Jan 2026 20:45:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Japan will host summit with S. Korea to bolster ties as relations with Beijing worsen",
      "description": "Japan’s Prime Minister Sanae Takaichi will host a summit with South Korean President Lee Jae Myung on Tuesday to ensure stable and friendly ties as her country faces growing tension with Beijing",
      "url": "https://abcnews.go.com/International/wireStory/japan-host-summit-south-korea-bolster-ties-tokyos-129123617",
      "published": "Mon, 12 Jan 2026 06:57:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Built on care and connection: How one Somali-British woman is strengthening diaspora communities",
      "description": "When her family moved from Somalia to London in the 1980s, Safia Jama watched women in her community help her mother navigate a new life in the UK — booking doctor’s appointments, enrolling children in school, and learning how to access everyday services in a new country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166725",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Luigi Mangione judge summons Pennsylvania cop to court to testify on backpack search",
      "description": "Federal judge reverses decision, will now hold hearing on Luigi Mangione backpack evidence seized at McDonald's during arrest for alleged CEO murder.",
      "url": "https://www.foxnews.com/us/luigi-mangione-wins-evidentiary-hearing-backpack-search-after-judges-about-face-decision",
      "published": "Mon, 12 Jan 2026 11:56:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Lyse Doucet: Iran's rulers face biggest challenge since 1979 revolution",
      "description": "The authorities are responding to protests with a ferocious security crackdown and near total internet shutdown.",
      "url": "https://www.bbc.com/news/articles/c3ve572edzqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 17:53:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Former Fed chairs condemn criminal investigation into Jerome Powell",
      "description": "Three former heads of the central bank say the probe seeks to undermine the Fed's independence and \"has no place\" in the US.",
      "url": "https://www.bbc.com/news/articles/c394xwdve9lo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 17:27:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration says still considering military strikes on Iran",
      "description": "The White House says that US could carry out air strikes against Iran, but would prefer diplomatic solution.",
      "url": "https://www.aljazeera.com/news/2026/1/12/trump-administration-says-still-considering-military-strikes-on-iran?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 20:52:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Could the US really take over Greenland?",
      "description": "Donald Trump's seizure threats unnerve islanders, Denmark, European Union and NATO.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/12/could-the-us-really-take-over-greenland?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 19:12:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Elon Musk's X faces bans and investigations over nonconsensual bikini images",
      "description": "After the social media app's AI chatbot started generating sexualized images of women and children, two countries have blocked it and several more have launched investigations.",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5672579/grok-women-children-bikini-elon-musk",
      "published": "Mon, 12 Jan 2026 17:57:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "NATO talks Arctic security for Greenland amid US pressure",
      "description": "NATO is signaling it will take steps to bolster Arctic security as the Trump administration has claimed that threats from Russia and China are among the reasons that the US government seeks to take over Greenland.",
      "url": "https://www.dw.com/en/nato-talks-arctic-security-for-greenland-amid-us-pressure/a-75479402?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 16:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Germany and Iran: Merz calls Tehran leadership 'weak'",
      "description": "German Chancellor Friedrich Merz has dubbed Iran's suppression of protests \"brutal and disproportionate.\" A government spokesperson in Berlin backed taking one step at a time, but many in Germany want faster action.",
      "url": "https://www.dw.com/en/germany-and-iran-merz-calls-tehran-leadership-weak/a-75477000?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 15:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US lawmakers to visit Denmark as Trump renews threats over Greenland",
      "description": "A bipartisan group of US lawmakers will travel to Denmark this week amid escalating tensions over President Donald Trump’s renewed threats to take control of Greenland, an autonomous territory within the Danish kingdom that hosts a US airbase.",
      "url": "https://www.france24.com/en/europe/20260113-us-lawmakers-to-visit-denmark-as-trump-renews-threats-over-greenland",
      "published": "Tue, 13 Jan 2026 03:16:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Absence of credible alternatives' has allowed Iranian regime to survive, analyst says",
      "description": "Speaking with FRANCE 24's Mark Owen, Trita Parsi, Executive Vice President of the Quincy Institute, says that 'we're seeing a dramatic radicalisation of the protest movement which is ultimately a reaction to the brutality of the regime', adding that the 'absence of credible alternatives' is one of the reasons that the Islamic Republic has been able to survive despite its unpopularity, incompetence and corruption.",
      "url": "https://www.france24.com/en/absence-of-credible-alternatives-has-allowed-iranian-regime-to-survive-analyst-says",
      "published": "Mon, 12 Jan 2026 20:24:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "The man Donald Trump keeps trying (and failing) to fire",
      "description": "👉 Follow Trump100 on your podcast app 👈",
      "url": "https://news.sky.com/story/the-man-donald-trump-keeps-trying-and-failing-to-fire-13493570",
      "published": "Tue, 13 Jan 2026 02:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Cuba's president says no current talks with the US after Trump threatens it",
      "description": "Cuban President Miguel Díaz-Canel says his administration is currently not in talks with the U.S. government",
      "url": "https://abcnews.go.com/International/wireStory/cubas-president-current-talks-us-after-trump-threatens-129130365",
      "published": "Mon, 12 Jan 2026 09:40:18 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "First responders enter devastated Aleppo neighborhood after days of deadly fighting",
      "description": "Residents have started returning to a contested neighborhood in Syria's Aleppo after deadly clashes between government and Kurdish-led forces",
      "url": "https://abcnews.go.com/International/wireStory/responders-enter-devastated-aleppo-neighborhood-after-days-deadly-129106929",
      "published": "Sun, 11 Jan 2026 13:59:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Red-Washing: How the media sanitizes a Marxist-Leninist revolutionary as a ‘preschool teacher’",
      "description": "Far-left consultants recommend protest groups \"lead with sympathetic characters.\" A Grand Rapids, Mich., socialist activist got just that with an arrested member rebranded a \"preschool teacher.\"",
      "url": "https://www.foxnews.com/us/how-media-sanitizes-marxist-leninist-revolutionary-preschool-teacher",
      "published": "Mon, 12 Jan 2026 17:35:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "NYC hospital accuses nurses’ union of seeking protections for workers arriving drunk, high as strike begins",
      "description": "Historic nurses strike hits NYC as 15,000 workers walk off. Hospitals accuse union of unreasonable demands including protections for impaired staff.",
      "url": "https://www.foxnews.com/us/nyc-hospital-accuses-nurses-union-seeking-protections-workers-arriving-drunk-high-strike-begins",
      "published": "Mon, 12 Jan 2026 17:21:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Former Navy SEAL convicted for trying to harm police with explosives during California 'No Kings' protests",
      "description": "Former Navy SEAL convicted of transporting explosives with the intent to harm law enforcement officers at California \"No Kings\" protests.",
      "url": "https://www.foxnews.com/us/former-navy-seal-convicted-trying-harm-police-explosives-during-la-no-kings-protest",
      "published": "Mon, 12 Jan 2026 15:03:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Smithsonian replaces Trump portrait display, strips Jan 6 and impeachment references from accompanying text",
      "description": "Smithsonian replaces Trump portrait, removes impeachment text after president calls museums \"woke\" and threatens funding cuts in sweeping review.",
      "url": "https://www.foxnews.com/us/smithsonian-replaces-trump-portrait-display-strips-jan-6-impeachment-references-from-accompanying-text",
      "published": "Sun, 11 Jan 2026 23:17:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US hostages in Iran face heightened risk as protests spread, experts say number held may exceed estimates",
      "description": "Iran's systematic hostage-taking policy targets American citizens as political leverage, with experts calling for automatic sanctions and consequences to combat the regime's strategy.",
      "url": "https://www.foxnews.com/world/us-hostages-iran-face-heightened-risk-protests-spread-experts-say-number-held-may-exceed-estimates",
      "published": "Mon, 12 Jan 2026 10:00:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US revokes more than 100,000 visas since Trump’s return to office",
      "description": "The US State Department says visa revocations have more than doubled as Trump continues his immigration crackdown.",
      "url": "https://www.aljazeera.com/news/2026/1/13/us-revokes-more-than-100000-visas-since-trumps-return-to-office?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 01:19:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "In Zambia, Great Lakes defense chiefs talk DRC insecurity",
      "description": "Over the weekend, regional defense ministers met in Livingstone to address the worsening security situation in the eastern Democratic Republic of Congo. However, an end to the fighting is not in sight.",
      "url": "https://www.dw.com/en/in-zambia-great-lakes-defense-chiefs-talk-drc-insecurity/a-75471930?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 13:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China says US shouldn't use other countries as 'pretext' to pursue its interests",
      "description": "China says the United States shouldn't use other countries as a pretext to pursue its interests in Greenland",
      "url": "https://abcnews.go.com/International/wireStory/china-us-countries-pretext-pursue-interests-greenland-129124332",
      "published": "Mon, 12 Jan 2026 07:45:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: UN independent investigators call for immediate release of all political prisoners",
      "description": "More than 100 political prisoners have been released in Venezuela, the Government announced on Monday, just over a week after the seizure and rendition of President Nicolás Maduro in Caracas by the United States.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166745",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Who will replace Rudd as US ambassador? Defence boss, career diplomat and former ministers in mix",
      "description": "Analysts and experts say the PM would do well to consider the Aukus alliance and reactions from Maga base in making his choice Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Former Labor ministers, the defence department boss and a career diplomat are among the names being touted by government figures to replace Kevin Rudd as Australia’s ambassador in Washington. Rudd, the former prime minister and foreign minister, won praise for stabilising relations with the US president, Donald Trump, on Monday, after the surprise announcement he would depart a year early to return to the Asia Society thinktank. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/13/who-will-replace-kevin-rudd-us-ambassador-australia",
      "published": "Tue, 13 Jan 2026 05:56:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Access to RSS feeds is rejected",
      "description": "Your large amount of concurrent requests for RSS data causes problems. Use the API or contact ops@reliefweb.int",
      "url": "https://api.reliefweb.int",
      "published": "2026-01-13T06:36:23.153708Z",
      "source": "ReliefWeb",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump announces 25% tariff on Iran's trading partners",
      "description": "US President Donald Trump announced a tariff of 25% on goods from countries doing business with Iran. The tariff announcement stands to impact China, Brazil, Turkey and Russia among others.",
      "url": "https://www.dw.com/en/trump-announces-25-tariff-on-iran-s-trading-partners/a-75481137?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 22:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Xinjiang whistleblower faces deportation to China — lawyer",
      "description": "After documenting Xinjiang's Uyghur detention network, a Chinese dissident faces deportation to China, his lawyer says. His case highlights the clash between US immigration policy and human rights concerns.",
      "url": "https://www.dw.com/en/xinjiang-whistleblower-faces-deportation-to-china-lawyer/a-75475876?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 15:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Mattel adds an autistic Barbie to doll line devoted to showcasing diversity and inclusion",
      "description": "Mattel Inc. is introducing an autistic Barbie on Monday as the newest member of its line intended to celebrate diversity, joining a collection that already includes Barbies with Down syndrome, a blind Barbie, a Barbie and a Ken with vitiligo, and other models the toymaker added to make its fashion dolls more inclusive. FRANCE 24's Monte Francis reports",
      "url": "https://www.france24.com/en/video/20260112-mattel-adds-an-autistic-barbie-to-doll-line-devoted-to-showcasing-diversity-and-inclusion",
      "published": "Mon, 12 Jan 2026 22:39:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Malaysia and Indonesia become the first countries to block Musk’s Grok over sexualized AI images",
      "description": "Malaysia and Indonesia have become the first countries to block Grok, the artificial intelligence chatbot developed by Elon Musk's company xAI, amid concerns that it is being misused to generate sexually explicit and nonconsensual images. Britain ​will bring ⁠into effect a law criminalising the creation ​of ‍non-consensual intimate images ​this week, technology minister ​Liz Kendall said Monday after regulator Ofcom launched a probe into ​X.",
      "url": "https://www.france24.com/en/malaysia-and-indonesia-become-the-first-countries-to-block-musk-s-grok-over-sexualized-ai-images",
      "published": "Mon, 12 Jan 2026 20:04:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Mexican president tells Trump that US intervention against cartels is 'unnecessary'",
      "description": "Mexican President Claudia Sheinbaum says she had a \"very good conversation\" with U.S. President Donald Trump about security issues",
      "url": "https://abcnews.go.com/International/wireStory/mexican-president-tells-trump-us-intervention-cartels-unnecessary-129136057",
      "published": "Mon, 12 Jan 2026 12:02:08 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘Beyond GDP’ economists push for clearer metrics on wellbeing, sustainability",
      "description": "Top finance experts are meeting at UN Geneva this week to push for a radical shake up in the way economic growth is gauged, in response to concerns that GDP measurements provide little insight about progress on key sustainability targets that are vital to our survival.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166740",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Who would rule Iran if the Islamic Republic falls?",
      "description": "From Crown Prince Reza Pahlavi to imprisoned activists, Iran's potential successors remain unclear. Opposition figures debate who could unify after regime change.",
      "url": "https://www.foxnews.com/world/who-would-rule-iran-islamic-republic-falls",
      "published": "Sat, 10 Jan 2026 09:00:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Escaped monkeys run wild in city as AI hinders efforts to catch them",
      "description": "A troop of monkeys have spent days running wild in a US city and artificial intelligence is complicating efforts to catch them.",
      "url": "https://news.sky.com/story/escaped-monkeys-run-wild-in-st-louis-as-ai-hinders-efforts-to-catch-them-13493505",
      "published": "Mon, 12 Jan 2026 18:42:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Frightening ordeal as Sky News team forced into cars and camera seized - with dissent in China rising dramatically",
      "description": "In an industrial corner of the city of Shenzhen, there was a sense the system was bracing.",
      "url": "https://news.sky.com/story/china-would-prefer-its-dissent-not-to-be-seen-but-it-is-increasingly-there-13493041",
      "published": "Mon, 12 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Displaced Aleppo residents return home after days of intense clashes",
      "description": "Hundreds of displaced residents have returned to Aleppo’s Achrafieh neighborhood in northern Syria",
      "url": "https://abcnews.go.com/International/wireStory/displaced-aleppo-residents-return-home-after-days-intense-129138016",
      "published": "Mon, 12 Jan 2026 12:34:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "India and Germany sign deals to deepen economic and security ties",
      "description": "Indian Prime Minister Narendra Modi and German Chancellor Friedrich Merz met on Monday in the Indian city of Gandhinagar to strengthen economic and security ties",
      "url": "https://abcnews.go.com/International/wireStory/india-germany-sign-deals-deepen-economic-security-ties-129123526",
      "published": "Mon, 12 Jan 2026 04:09:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Ex-congressional IT aide accused of stealing 240 government phones and selling them at pawn shop",
      "description": "A former congressional IT aide is accused of stealing 240 taxpayer-funded cellphones worth $150K, shipping them to his home and then selling most at a local pawn shop.",
      "url": "https://www.foxnews.com/us/ex-congressional-aide-accused-stealing-240-government-phones-selling-them-pawn-shop",
      "published": "Mon, 12 Jan 2026 19:15:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "'We were tricked': How one woman lures foreign men to fight on Russia's front line",
      "description": "Recruits tell the BBC an ex-teacher who operates on Telegram misled them, saying they could avoid combat.",
      "url": "https://www.bbc.com/news/articles/ce9yv4gmn9lo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 00:21:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pioneering gay footballer Josh Cavallo accuses former club of homophobia",
      "description": "Adelaide United says it \"categorically rejects\" Cavallo's claims he was sidelined because of his sexuality.",
      "url": "https://www.bbc.com/news/articles/cjrznw9e243o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 03:24:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jailed Venezuelan politician's son says Trump shouldn't be 'fooled' by pledge of prisoner releases",
      "description": "Ramón Guanipa's father was accused of treason for challenging the disputed 2024 presidential election result.",
      "url": "https://www.bbc.com/news/articles/c801kypkl3ko?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 13:12:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Meta blocks 550,000 accounts under Australia's social media ban",
      "description": "The new law, which came into effect in December, is aimed at protecting children from online harm.",
      "url": "https://www.bbc.com/news/articles/cpqye2yygl4o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 00:45:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Thousands of tourists stranded in Lapland as cold grounds flights",
      "description": "All flights out of Kittila airport in northern Finland were cancelled on Sunday with temperatures falling as low as -38C.",
      "url": "https://www.bbc.com/news/articles/c74vnxlvl40o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 10:42:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungary grants asylum to Polish ex-justice minister",
      "description": "Granting asylum to a citizen of a fellow EU member goes against the spirit of EU standards.",
      "url": "https://www.bbc.com/news/articles/cly9n3r2p7zo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 13:57:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Chalamet beats DiCaprio to Golden Globes glory",
      "description": "The Marty Supreme star is among the big winners at the Globes and gets a boost in his quest for an Oscar.",
      "url": "https://www.bbc.com/news/articles/c78e07m02jzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 04:13:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump tells Cuba to 'make a deal, before it is too late'",
      "description": "Trump has been turning his attention to Cuba since US forces seized Venezuelan leader Nicolás Maduro.",
      "url": "https://www.bbc.com/news/articles/cx2kv2gn62vo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 11 Jan 2026 16:33:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ai, Japanese chimpanzee who counted and painted, dies at 49",
      "description": "Ai's cognitive abilities had been studied extensively since she was brought to a Japanese institute in 1977.",
      "url": "https://www.bbc.com/news/articles/cj9r3zl2ywyo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 12 Jan 2026 08:54:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian writers’ festival cancelled after Palestinian author axed",
      "description": "Adelaide Writers' Week cancelled following wave of speaker withdrawals and board resignations.",
      "url": "https://www.aljazeera.com/news/2026/1/13/australian-writers-festival-boss-resigns-after-palestinian-author-axed?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 03:49:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senator Mark Kelly sues US Defense Department for ‘punitive retribution’",
      "description": "The Trump administration has sought to censure Kelly for a video encouraging the military to reject 'illegal orders'.",
      "url": "https://www.aljazeera.com/news/2026/1/13/senator-mark-kelly-sues-us-defense-department-for-punitive-retribution?traffic_source=rss",
      "published": "Tue, 13 Jan 2026 02:59:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Republican lawmakers break from US president on Fed chair indictment",
      "description": "Former fed chairs called the indictment an 'unprecedented attempt' to undermine the independence of the US central bank.",
      "url": "https://www.aljazeera.com/economy/2026/1/12/republican-lawmakers-break-from-us-president-on-fed-chair-indictment?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 20:07:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alonso sacked by Real Madrid; replaced by Arbeloa as head coach",
      "description": "Xabi Alonso splits from the club a day after their Super Cup loss to Barcelona, with Alvaro Arbeloa named in his place.",
      "url": "https://www.aljazeera.com/sports/2026/1/12/alonso-sacked-by-real-madrid-replaced-by-arbeloa-as-head-coach?traffic_source=rss",
      "published": "Mon, 12 Jan 2026 19:10:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 16 km ESE of Baculin, Philippines",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - V Time 2026-01-07 03:02:56 UTC 2026-01-07 03:02:56 UTC at epicenter Location 7.390°N 126.722°E Depth 35.00 km (21.75 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rn2z",
      "published": "2026-01-10T16:27:43.386Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysia, Indonesia become first to block Musk's Grok over AI deepfakes",
      "description": "Malaysia and Indonesia have become the first countries to block Grok, the artificial intelligence chatbot developed by Elon Musk's xAI, after authorities said it was being misused to generate sexually explicit and non-consensual images.",
      "url": "https://www.npr.org/2026/01/12/nx-s1-5674660/malaysia-indonesia-block-grok-ai-deepfakes",
      "published": "Mon, 12 Jan 2026 02:15:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Latin American left responds to Trump's pledge to take over of Venezuelan oil",
      "description": "Latin America's left is in disarray after the seizure of Nicolas Maduro and the U.S.'s pledge to take over Venezuela's oil industry. Many on the left are changing their rhetoric about President Trump.",
      "url": "https://www.npr.org/2026/01/11/nx-s1-5672420/latin-american-left-responds-to-the-trumps-pledge-to-take-over-of-venezuelan-oil",
      "published": "Sun, 11 Jan 2026 08:06:01 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump to meet with Venezuelan opposition leader Machado",
      "description": "After winning the Nobel Peace Prize Trump had wanted and then being sidelined from a post-Maduro Venezuela, Machado is now set to meet with the US president.",
      "url": "https://www.dw.com/en/trump-to-meet-with-venezuelan-opposition-leader-machado/a-75481739?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 06:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German Chancellor Merz visits India's tech hub Bengaluru",
      "description": "Merz is due in Bengaluru, often called India's Silicon Valley, after meeting PM Modi in Ahmedabad. The visit comes just weeks ahead of plans to sign a long-awaited free trade agreement between India and the EU.",
      "url": "https://www.dw.com/en/german-chancellor-merz-visits-india-s-tech-hub-bengaluru/live-75434261?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 03:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cannabis: Now you can measure how much is too much",
      "description": "At what point does smoking weed get dangerous? A British study measured cannabis consumption in THC units and determined which amounts increase health risks. The system comes with clear risk thresholds ― and weaknesses.",
      "url": "https://www.dw.com/en/cannabis-now-you-can-measure-how-much-is-too-much/a-75476803?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 16:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar faces Rohingya genocide case: What to know",
      "description": "A landmark case accusing Myanmar of committing genocide against minority Muslim Rohingya has opened at the United Nations' top court. The outcome will have repercussions beyond the Southeast Asian nation.",
      "url": "https://www.dw.com/en/myanmar-faces-rohingya-genocide-case-what-to-know/a-75476834?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 15:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Croatia reintroduces conscription after almost two decades",
      "description": "Croatia is bringing back compulsory military service for young men for the first time since 2008. What’s behind the shift — and could it signal a wider return of conscription in the Balkans?",
      "url": "https://www.dw.com/en/croatia-reintroduces-conscription-after-almost-two-decades/a-75472193?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 12:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why Venus Williams and other sports stars are playing longer",
      "description": "More than three decades after she burst onto the tennis scene, Venus Williams is still playing at the top level. Why are we seeing elite athletes carrying on into their 40s and beyond?",
      "url": "https://www.dw.com/en/why-venus-williams-and-other-sports-stars-are-playing-longer/a-75441900?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 08:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysia, Indonesia block Grok AI bot over explicit images",
      "description": "The move comes after the bot was found to be generating explicit images of women and children, without consent, on Elon Musk's X.",
      "url": "https://www.dw.com/en/malaysia-indonesia-block-grok-ai-bot-over-explicit-images/a-75470708?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 08:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Meta shuts over 544,000 Australian accounts after ban",
      "description": "The tech giant removed Facebook, Instagram and Threads accounts to comply with Australia's social media ban for under-16-year-olds.",
      "url": "https://www.dw.com/en/meta-shuts-over-544-000-australian-accounts-after-ban/a-75469113?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 12 Jan 2026 06:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump to meet with Venezuelan opposition leader Maria Corina Machado",
      "description": "Washington said on Monday that Venezuelan opposition figure Maria Corina Machado will meet President Donald Trump this week, a move that comes as pressure mounts on the interim leadership in Caracas to accelerate the release of political prisoners.",
      "url": "https://www.france24.com/en/americas/20260113-trump-to-meet-with-venezuelan-opposition-leader-maria-corina-machado",
      "published": "Tue, 13 Jan 2026 00:35:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ikoné stuns Paris Saint-Germain as Paris FC reach French Cup last 16",
      "description": "Former Paris Saint-Germain academy product Jonathan Ikoné struck a late winner against his old club as Paris FC shocked the holders 1-0 on Monday to book their place in the last 16 of the French Cup.",
      "url": "https://www.france24.com/en/sport/20260113-ikone-stuns-paris-saint-germain-as-paris-fc-reach-french-cup-last-16",
      "published": "Tue, 13 Jan 2026 00:15:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iranians being kept in the dark about crackdown, observer says",
      "description": "Speaking with FRANCE 24's Mark Owen, Kevan Gafaïti, lecturer at Sciences Po Paris, who has just left Iran, says that many Iranians are being kept in the dark about the demonstrations and the brutal crackdown by the authorities due to the Internet blackout, which is preventing the population from organising.",
      "url": "https://www.france24.com/en/iranians-being-kept-in-the-dark-about-crackdown-observer-says",
      "published": "Mon, 12 Jan 2026 19:49:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump wants a deal but insists US will acquire Greenland 'one way or the other'",
      "description": "Donald Trump has said he wants to make a deal with Greenland and won't let Russia or China take control of the Arctic territory.",
      "url": "https://news.sky.com/story/trump-wants-a-deal-but-insists-us-will-acquire-greenland-one-way-or-the-other-13493311",
      "published": "Mon, 12 Jan 2026 08:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar accused of genocide against Rohingya minority in landmark UN case",
      "description": "Myanmar stands accused of committing genocide against members of the Rohingya ethnic minority in a case opening at a United Nations court this week.",
      "url": "https://news.sky.com/story/myanmar-accused-of-genocide-against-rohingya-minority-in-landmark-un-case-13493404",
      "published": "Mon, 12 Jan 2026 13:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Families of prisoners in Venezuela wait in anguish as promised releases trickle",
      "description": "Yaxzodara Lozada has woken up freezing on a sidewalk outside a Venezuelan prison, hoping her husband, a police officer detained in November, will be released",
      "url": "https://abcnews.go.com/International/wireStory/families-prisoners-venezuela-wait-anguish-promised-releases-trickle-129143199",
      "published": "Tue, 13 Jan 2026 00:25:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cyprus president's top aide quits after online video alleging government corruption",
      "description": "A top aide to Cyprus President Nikos Christodoulides has resigned after an online video was posted recently in which it was suggested that he and others were using their close ties to the leader to earn favors for would-be investors in exchange for cash",
      "url": "https://abcnews.go.com/International/wireStory/cyprus-presidents-top-aide-quits-after-online-video-129142404",
      "published": "Mon, 12 Jan 2026 14:25:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "London’s homicide rate is at a record low as mayor says it disproves Trump's 'dystopian' claims",
      "description": "London's murder rate fell in 2025 to its lowest level in decades, officials said Monday",
      "url": "https://abcnews.go.com/International/wireStory/londons-homicide-rate-record-low-mayor-disproves-trumps-129134625",
      "published": "Mon, 12 Jan 2026 11:06:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK agrees to pay 'substantial sum' to settle lawsuit by Guantanamo detainee over torture claims",
      "description": "The British government has agreed to pay a substantial sum to settle a lawsuit by Abu Zubaydah, a Guantanamo Bay detainee",
      "url": "https://abcnews.go.com/International/wireStory/uk-agrees-pay-substantial-sum-settle-lawsuit-guantanamo-129134013",
      "published": "Mon, 12 Jan 2026 11:05:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope Leo XIV meets with Venezuelan opposition leader María Corina Machado",
      "description": "Pope Leo XIV has met with Venezuelan opposition leader María Corina Machado at the Vatican",
      "url": "https://abcnews.go.com/International/wireStory/pope-leo-xiv-meets-venezuelan-opposition-leader-mara-129126045",
      "published": "Tue, 13 Jan 2026 00:25:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Polish justice minister who faces prosecution at home says he's received asylum in Hungary",
      "description": "A former Polish justice minister who faces prosecution in his homeland over alleged abuse of power says he has been granted asylum in Hungary",
      "url": "https://abcnews.go.com/International/wireStory/former-polish-justice-minister-faces-prosecution-home-received-129125183",
      "published": "Mon, 12 Jan 2026 09:05:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New US ambassador to India pushes for deeper trade ties despite  oil tensions",
      "description": "The U.S. and India are actively working on a bilateral trade agreement to strengthen their economic and strategic partnership",
      "url": "https://abcnews.go.com/International/wireStory/new-us-ambassador-india-pushes-deeper-trade-ties-129123884",
      "published": "Mon, 12 Jan 2026 06:52:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN court to begin hearings on whether Myanmar committed genocide against the Rohingya",
      "description": "Myanmar heard accusations that it is responsible for genocide against the Rohingya ethnic minority at the top court of the United Nations, as long-awaited hearings began on Monday",
      "url": "https://abcnews.go.com/International/wireStory/court-begin-hearings-myanmar-committed-genocide-rohingya-129122831",
      "published": "Mon, 12 Jan 2026 06:25:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Off the ballot, Ugandan president's son waits in the wings this election",
      "description": "Muhoozi Kainerugaba, the Ugandan president’s military son, is not on the ballot in Thursday's presidential election",
      "url": "https://abcnews.go.com/International/wireStory/off-ballot-ugandan-presidents-son-waits-wings-election-129119451",
      "published": "Sun, 11 Jan 2026 22:33:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Amidst uncertainty, a helpline in Pakistan becomes a lifeline for Afghans",
      "description": "They ask heartbreaking questions: “What will happen to us?” “Is it true they will deport us?” “We don’t want to go back. How can I live in Afghanistan?” The words of Sumaiya, who staffs a helpline for refugees and asylum-seekers living in Pakistan but facing the eventuality of having to return to neighbouring Afghanistan.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166741",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Minnesota sues Trump admin over sweeping immigration raids in Twin Cities",
      "description": "Minnesota sues Trump administration over alleged militarized immigration raids in Twin Cities, naming DHS Secretary Kristi Noem and ICE officials.",
      "url": "https://www.foxnews.com/us/minnesota-sues-trump-admin-over-sweeping-immigration-raids-twin-cities",
      "published": "Mon, 12 Jan 2026 19:40:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New Jersey man fractures girl's skull by allegedly throwing rock through school bus window, arrest made",
      "description": "A New Jersey man was arrested after allegedly throwing a rock that smashed through a school bus window, fracturing a young girl’s skull, police said.",
      "url": "https://www.foxnews.com/us/new-jersey-man-fractures-girls-skull-allegedly-throwing-rock-school-bus-window-arrest-made",
      "published": "Mon, 12 Jan 2026 18:09:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Barry Morphew pleads not guilty to murdering wife Suzanne Morphew years after after Mother’s Day disappearance",
      "description": "Barry Morphew accused of killing wife Suzanne returns to court to enter plea on murder charges. Case began with her Mother's Day 2020 disappearance.",
      "url": "https://www.foxnews.com/us/barry-morphew-expected-enter-plea-wifes-killing-years-after-her-disappearance",
      "published": "Mon, 12 Jan 2026 13:23:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says Iran 'starting to' cross US red lines and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/trump-says-iran-starting-to-cross-us-red-lines-more-top-headlines",
      "published": "Mon, 12 Jan 2026 06:52:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland leaders push back on Trump's calls for US control of the island: 'We don’t want to be Americans'",
      "description": "Greenland leaders firmly reject President Donald Trump's proposed U.S. takeover as the American administration vows action regardless of their wishes.",
      "url": "https://www.foxnews.com/world/greenland-leaders-push-back-trumps-calls-us-control-island-we-dont-want-americans",
      "published": "Sat, 10 Jan 2026 12:51:21 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}