{
  "last_updated": "2026-01-23T20:28:18.468518Z",
  "event_count": 224,
  "events": [
    {
      "title": "Indonesia takes action against mining firms after floods devastate population of world’s rarest ape",
      "description": "Conservationists hail the ‘desperately needed’ measures and urge greater protection after up to 11% of endangered Tapanuli orangutans wiped out The floods and landslides that tore through Indonesia’s fragile Batang Toru ecosystem in November 2024 – killing up to 11% of the world’s Tapanuli orangutan population – prompted widespread scrutiny of the extractive companies operating in the area at the time of the ecological catastrophe. For weeks, investigators searched for evidence that the companies may have damaged the Batang Toru and Garoga watersheds before the disaster, which washed torrents of mud and logs into villages, claiming the lives of more than 1,100 people . Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/23/tapanuli-orangutans-floods-indonesia-government-mining-extraction-companies-aoe",
      "published": "Fri, 23 Jan 2026 05:00:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 46,
      "severity_level": "Critical"
    },
    {
      "title": "Iran will retaliate 'with everything we have' if US attacks, senior diplomat warns",
      "description": "More than 4,500 protesters killed in Iran as foreign minister threatens forceful response to potential U.S. military strikes in escalating regional crisis.",
      "url": "https://www.foxnews.com/world/iran-retaliate-with-everything-we-have-us-attacks-senior-diplomat-warns",
      "published": "Wed, 21 Jan 2026 07:44:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Police fight gangs in Haiti and Guatemala",
      "description": "Jan. 16-22, 2026 Police patrolled a gang-controlled area of ​​Port-au-Prince, Haiti, where violence has displaced 1.4 million. Guatemalan police and soldiers used new powers under a state of emergency. And police in Venezuela watched the relatives of prisoners kneel before them in Caracas, as some political prisoners are released. A cat survived devastating wildfires in Chile. This gallery was curated by photo editor Leslie Mazoch, based in Mexico City. ___ AP photography: https://apnews.com/photography Instagram: https://www.instagram.com/apnews",
      "url": "https://abcnews.go.com/International/wireStory/police-fight-gangs-haiti-guatemala-top-photos-latin-129481209",
      "published": "Fri, 23 Jan 2026 01:02:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Japan pauses restart of world’s largest nuclear power plant one day after it went online",
      "description": "Operator says it does not know when the problem at the Kashiwazaki-Kariwa plant in Niigata province will be solved, after an alarm sounded during start-up The restart of the world’s largest nuclear power plant was suspended in Japan on Thursday just a day after it went online for the first time in about 14 years, with the operator saying it does not know when the problem will be solved. The Kashiwazaki-Kariwa plant in Niigata province had been closed since the 2011 Fukushima disaster, but operations to relaunch it began on Wednesday after it received the final green light from the nuclear regulator . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/japan-pauses-kashiwazaki-kariwa-worlds-largest-nuclear-power-plant",
      "published": "Fri, 23 Jan 2026 00:19:13 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of rising internet shutdowns as digital blackouts spread worldwide",
      "description": "A rising trend towards government-enforced internet shutdowns – with at least 300 incidents in more than 54 countries over the last two years – is prompting renewed warnings from the UN about the threat these digital blackouts pose to freedom of expression, access to information and human rights.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166813",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Trump threatens Iran with US fleet as death toll rises",
      "description": "An internet blackout has cut off much of Iran from the outside world, but reports of soaring protester death tolls are trickling out of the country. US President Trump said he was sending a \"massive fleet\" to the region.",
      "url": "https://www.dw.com/en/trump-threatens-iran-with-us-fleet-as-death-toll-rises/a-75618396?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 11:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "World enters era of ‘global water bankruptcy’",
      "description": "The world has moved beyond a water crisis and into a state of global water bankruptcy, says a new flagship report released on Tuesday by UN researchers.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166800",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Millions of Americans brace for winter storm. And, Zelenskyy's warning for Europe",
      "description": "Millions of Americans are bracing for a massive, life-threatening winter storm this weekend. And, Ukrainian President Zelenskyy delivers a stark message to Europe at the World Economic Forum in Davos.",
      "url": "https://www.npr.org/2026/01/23/g-s1-106988/up-first-newsletter-winter-storm-minnesota-immigration-zelenskyy-davos",
      "published": "Fri, 23 Jan 2026 06:59:29 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Armed militias fire heavy machine guns through Tehran streets in deadly night attacks",
      "description": "Iran protests entered day 24 with 4,519 confirmed deaths. Supreme Leader Ayatollah Ali Khamenei backs security forces amid nationwide demonstrations.",
      "url": "https://www.foxnews.com/world/armed-militias-fire-heavy-machine-guns-tehran-streets-deadly-night-attacks",
      "published": "Tue, 20 Jan 2026 21:06:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Mark Carney says Canada must ‘be a beacon to a world that’s at sea’",
      "description": "In post-Davos speech, Canadian PM jabs at Trump, saying the arc of history ‘can still bend towards progress and justice’ Canada’s prime minister, Mark Carney, said his country must be a “beacon to a world that’s at sea” and that national unity was critical as his government faces a dramatic reshaping of the world political order – and mounting domestic challenges The national address, given at a historic military fortress in Quebec City, was far narrower in scope than the prime minister’s remarks earlier in the week at the World Economic Summit in Davos, Switzerland. Dubbed the ‘Carney Doctrine’, the Davos speech lamented the disintegration of rules-based order amid a rise of “great powers” that used economic “coercion” as a weapon. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/carney-says-canada-must-be-a-beacon-to-a-world-thats-at-sea",
      "published": "Thu, 22 Jan 2026 21:53:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Scope of Ukrainian resistance in occupied territories revealed in new report",
      "description": "As we approach the fourth anniversary of Russia launching a full-scale invasion of Ukraine, we wanted to take a closer look at the state of the resistance inside areas of the country that have been occupied by Moscow. A report published by the Center for Strategic and International Studies sheds light on the scope of the Ukrainian underground movement.",
      "url": "https://www.france24.com/en/scope-of-ukrainian-resistance-in-occupied-territories-revealed-in-new-report",
      "published": "Fri, 23 Jan 2026 14:12:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian soldier sentenced to death for refusing to fire on protesters during nationwide unrest",
      "description": "Iranian soldier Javid Khales was reportedly sentenced to death for refusing orders to shoot protesters during nationwide unrest, a human rights group says.",
      "url": "https://www.foxnews.com/world/iranian-soldier-sentenced-death-refusing-fire-protesters-nationwide-unrest",
      "published": "Tue, 20 Jan 2026 21:56:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Partial return of Internet in Iran reveals wider scale of killing",
      "description": "Internet access was partially restored in Iran after two weeks of blackout during the anti-government protests which authorities violently cracked down on. This partial access allowed thousands of videos to surface, giving a better picture of the amount of protesters killed by the Khamenei regime. whether it is areas affected or the amount of people killed, FRANCE 24's Ershad Alijani tells us more. Warning: some viewers may find some of these images disturbing.",
      "url": "https://www.france24.com/en/partial-return-of-internet-in-iran-reveals-wider-scale-of-killing",
      "published": "Fri, 23 Jan 2026 16:24:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Air pollution in India's capital Delhi: An environmental and health disaster",
      "description": "In 2024, 40 of the 50 cities ranked as the most polluted in the world were located in India. Delhi topped the list. Over the past decade, air pollution has become the Indian capital's number one scourge. The situation is getting worse every year, but the authorities seem to be ignoring it, much to the dismay of residents. Our correspondents Alban Alvarez and Lisa Gamonet report.",
      "url": "https://www.france24.com/en/tv-shows/reporters/20260123-air-pollution-india-capital-delhi-environmental-and-health-disaster",
      "published": "Fri, 23 Jan 2026 14:24:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Cold and dark: UN rights chief condemns Russian strikes on Ukraine’s power grid",
      "description": "Russian attacks on Ukraine’s energy infrastructure have cut heat, electricity and water to hundreds of thousands of civilians in freezing winter conditions, prompting the UN human rights chief to denounce the strikes as “cruel” and a clear violation of international law.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166798",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli UN ambassador sends stark warning to Iran amid growing unrest",
      "description": "Israel warns Iran not to test its military readiness amid tensions over ballistic missiles and nuclear capabilities following summer 2025 operations.",
      "url": "https://www.foxnews.com/world/israeli-un-ambassador-sends-stark-warning-iran-amid-growing-unrest",
      "published": "Tue, 20 Jan 2026 19:38:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Mozambique floods heighten disease, malnutrition risks – UN agencies",
      "description": "Catastrophic flooding across Mozambique is devastating lives and livelihoods, sharply increasing the risk of disease outbreaks and malnutrition, while also forcing dangerous wildlife – including crocodiles – into flooded urban areas, the UN warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166793",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Police seek man wanted in fatal shootings of 3 in small Australian town",
      "description": "Police are urging people in a small Australian town to stay indoors as they look for the man suspected of killing three people in a domestic violence-related shooting",
      "url": "https://abcnews.go.com/International/wireStory/police-seek-man-wanted-fatal-shootings-3-small-129482549",
      "published": "Fri, 23 Jan 2026 03:48:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Two dead and six missing after landslides hit house and campground in New Zealand",
      "description": "Search-and-rescue teams worked through the night at the campground, but there had been no progress in finding missing people, officials say New Zealand is ‘full of grief”, the prime minister has said, after landslides tore through a house and busy campground, leaving two dead and at least six victims still missing. Police said emergency crews were still searching for at least six people, including two teenagers, believed missing beneath the debris of a landslide which struck a Mount Maunganui campsite on Thursday morning. Police were attempting to contact another three people. Families enjoying the summer school holiday were among the campers. Recreational vehicles and at least one structure were crushed, images showed. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/two-confirmed-dead-and-more-presumed-buried-after-landslides-hit-house-and-campground-in-new-zealand",
      "published": "Fri, 23 Jan 2026 01:44:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "At Davos, U.S. allies question a fraying world order",
      "description": "It was a volatile week for trans-Atlantic relations, marked by President Trump statements that unsettled global markets and strained ties with U.S. allies — on topics ranging from Greenland to Gaza.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5686526/trump-davos-world-order",
      "published": "Fri, 23 Jan 2026 14:27:42 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "'Dangerous' winter storm to sweep US with snow, ice and deadly cold",
      "description": "A massive winter storm is set to hit half of the US on Friday, prompting emergency declarations across states as forecasters warned of heavy snow, extreme temperatures and possible power outages.",
      "url": "https://www.france24.com/en/americas/20260123-catastrophic-ice-storm-set-to-sweep-across-us-over-weekend",
      "published": "Fri, 23 Jan 2026 16:13:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN rights chief decries US treatment of migrants, as deaths in ICE custody rise",
      "description": "The UN’s top human rights official has raised alarm over what he described as the growing dehumanisation of migrants in the United States, warning that current immigration enforcement practices are undermining due process, family unity and basic human dignity.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166816",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN Assembly president defends multilateralism, UN Charter in Davos",
      "description": "From Davos, the President of the UN General Assembly on Wednesday warned that the world has entered a “make‑or‑break” moment for multilateralism, saying the rules‑based order can survive only if states speak the truth and act when it’s hard. She called for a cross‑regional alliance to push back against growing lawlessness, disinformation, and power‑based politics.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166803",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Venezuelan national accused of claiming control over Arizona community, threatening residents: report",
      "description": "Venezuelan national accused of terrorism after allegedly claiming control over Arizona community at gunpoint. Javier Erazo-Zuniga faces multiple felonies.",
      "url": "https://www.foxnews.com/us/venezuelan-national-accused-claiming-control-over-arizona-community-threatening-residents-report",
      "published": "Fri, 23 Jan 2026 09:00:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US braces for 'extremely dangerous' winter storm",
      "description": "The National Weather Service warns the winter blast \"will pose a life-threatening risk of hypothermia\".",
      "url": "https://www.bbc.com/news/articles/c0r44l05q52o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 12:08:30 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Hong Kong national security trial of three pro-democracy activists begins",
      "description": "Chow Hang-tung, Lee Cheuk-yan and Albert Ho, who led Tiananmen Square vigils, are accused of inciting subversion The national security trial of three pro-democracy activists who organised an annual memorial in Hong Kong to mark the Tiananmen Square massacre opened on Thursday, in another landmark case brought under the Beijing-imposed law that has practically crushed protests in the semiautonomous Chinese city. Chow Hang-tung , Lee Cheuk-yan and Albert Ho are charged with inciting subversion under Hong Kong’s national security law . Their trial is one of the most high-profile national security cases to be heard in Hong Kong since Beijing imposed the law in 2020 . The defendants face a maximum penalty of 10 years’ imprisonment if convicted. The law has a near-100% conviction rate. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/hong-kong-national-security-trial-pro-democracy-activists-chow-hang-tung-lee-cheuk-yan-albert-ho",
      "published": "Wed, 21 Jan 2026 23:45:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Winter attacks in Ukraine, looming food aid cuts in Nigeria, drought in Kenya",
      "description": "Russian forces launched a fresh wave of strikes across Ukraine this week which have left hundreds of thousands of families without electricity and heating amid freezing temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166810",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: War crimes probe pledges to continue work for justice and accountability",
      "description": "As President Trump launched the international Board of Peace plan for Gaza on Thursday, top independent rights experts tasked by the UN Human Rights Council with investigating grave abuses linked to the Hamas-Israel war pledged to continue their work seeking justice and accountability for all.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166807",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti explained: why the crisis is deepening — and what comes next",
      "description": "Haiti is entering 2026 facing one of the most complex crises in its recent history. On Wednesday, the Caribbean island nation will be high on the international agenda as the UN Security Council holds its first meeting of the year to update ambassadors.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166801",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At the edge of war: the Central African Republic's uneasy border with Sudan",
      "description": "The land flattens on the approach to Birao, a cut-off town ringed by savannah in the far north of the Central African Republic, where roads dissolve into dust and motorcycles vastly outnumber cars. Less than two hours’ drive from the Sudanese border, this is the edge of a fractured country still piecing itself back together, while absorbing the shockwaves of a neighbouring conflict.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166794",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti crisis at breaking point as gangs tighten grip ahead of transition deadline",
      "description": "Haiti’s deepening crisis has reached a critical phase, senior UN officials warned the Security Council on Wednesday, as powerful gangs continue to expand their control across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166806",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Armed carjacker’s wild Corvette rampage turns downtown into war zone; sergeant wounded in deadly shootout",
      "description": "An armed carjacking suspect allegedly stole a Corvette and led police on a chase through the San Jose area before a deadly shootout that wounded a sergeant.",
      "url": "https://www.foxnews.com/us/armed-carjackers-wild-corvette-rampage-turns-downtown-war-zone-sergeant-wounded-deadly-shootout",
      "published": "Thu, 22 Jan 2026 20:08:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the sovereignty of the country’: Guinea-Bissau says US vaccine study suspended",
      "description": "Despite US pushback, officials in west Africa say controversial hepatitis B study on pause amid ethics concerns US health officials insisted it was still on. African health leaders said it was cancelled . At the heart of the controversy is the west African nation of Guinea-Bissau – one of the poorest countries in the world and the proposed site of a hotly debated US-funded study on vaccines. The study on hepatitis B vaccination, to be led by Danish researchers, became a flashpoint after major changes to the US vaccination schedule and prompted questions about how research is conducted ethically in other countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/guinea-bissau-hepatitis-b-vaccine-study",
      "published": "Fri, 23 Jan 2026 17:09:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Europe needs 'a huge wake-up call' on the housing crisis, EU commissioner says",
      "description": "One of the most pressing issues in the EU is the housing crisis. Wages are not keeping up with the rising costs of accommodation, and paying the rent is a challenge for many – never mind trying to get on the property ladder. Meanwhile, homelessness has got worse. Our guest is the EU's first housing commissioner, although his brief also covers energy – a key issue as the bloc tries to become more independent. Dan Jorgensen is a Danish Social Democrat, and in Denmark he was minister for climate and energy, and minister for development cooperation and global climate policy, before taking up the Energy and Housing portfolio for the EU in 2024.",
      "url": "https://www.france24.com/en/tv-shows/talking-europe/20260123-europe-needs-a-huge-wake-up-call-on-the-housing-crisis-eu-commissioner-says",
      "published": "Fri, 23 Jan 2026 16:37:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "62 Nigerian hostages rescued, 2 militants killed, army says",
      "description": "Nigeria's military rescued 62 hostages and killed two militants in operations across Zamfara, Kebbi and Sokoto states after weekend church kidnappings.",
      "url": "https://www.foxnews.com/world/62-nigerian-hostages-rescued-2-militants-killed-army-says",
      "published": "Wed, 21 Jan 2026 14:08:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Spanish track was fractured before high-speed train disaster, report finds",
      "description": "The preliminary report into the crash that left 45 people dead finds evidence of a fracture more than two hours earlier.",
      "url": "https://www.bbc.com/news/articles/c1m77dmxlvlo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 16:43:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Does the World Economic Forum still matter in a fractured global economy?",
      "description": "For decades, the World Economic Forum in Davos was a symbol of global cooperation. Today, its relevance is questioned.",
      "url": "https://www.aljazeera.com/video/counting-the-cost/2026/1/23/does-the-world-economic-forum-still-matter-in-a-fractured-global-economy?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 14:30:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "US residents brace for huge winter storm",
      "description": "Many US states issued a state of emergency as residents prepare for an ice storm. The cold front is expected to hit Texas and travel all the way to the northeastern cities of New York and Boston.",
      "url": "https://www.dw.com/en/us-residents-brace-for-huge-winter-storm/a-75621241?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 14:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of sex assaults on teenage prisoners, while families charged to recover remains of loved ones",
      "description": "Iran's prosecutor general Mohammad Movahedi claims government crushed nationwide protests as death toll reaches 544 with over 10,681 arrested.",
      "url": "https://www.foxnews.com/world/iran-accused-sex-assaults-teenage-prisoners-families-charged-recover-remains-loved-ones",
      "published": "Wed, 21 Jan 2026 21:38:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "American flags torched, riot police clash with protesters ahead of Trump Davos arrival",
      "description": "Swiss riots erupt in multiple cities as anti-Trump protesters march against President Trump's World Economic Forum appearance, with police deploying water cannons.",
      "url": "https://www.foxnews.com/world/american-flags-torched-riot-police-clash-protesters-trump-davos-arrival",
      "published": "Tue, 20 Jan 2026 20:11:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Danish PM in Greenland for 'show of support' after Trump threats",
      "description": "Mette Frederiksen visits the territory after weeks of tension over the US president's warnings that he could take control of it.",
      "url": "https://www.bbc.com/news/articles/c78ejd0xmp0o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 19:25:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump withdraws Canada's invitation to  Board of Peace",
      "description": "Trump did not provide a reason for the decision, which comes after Canada's PM Mark Carney warned of a \"rupture\" in the US-led global order.",
      "url": "https://www.bbc.com/news/articles/cn7jjp8gl0jo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 05:16:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "'Blood was all over' - victim of Nigeria church abduction describes escape",
      "description": "Some 160 people are believed to be missing after attackers raided three churches in a Nigerian village on Sunday.",
      "url": "https://www.bbc.com/news/articles/cn422q1py95o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 00:20:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump withdraws invitation for Canada to join his global ‘board of peace’",
      "description": "While leaders of many liberal democracies declined to sign on, Mark Carney had, before Davos, accepted in principle Donald Trump withdrew on Thursday an invitation for Canada to join his “board of peace” initiative aimed at resolving global conflicts. “Please let this Letter serve to represent that the Board of Peace is withdrawing its invitation to you regarding Canada’s joining, what will be, the most prestigious Board of Leaders ever assembled, at any time,” Trump wrote in a Truth Social post directed at the Canadian prime minister, Mark Carney . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/22/trump-withdraws-invitation-canada",
      "published": "Fri, 23 Jan 2026 02:28:24 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Filipino journalist Frenchie Cumpio found guilty of terror financing in verdict rights groups call ‘absurd’",
      "description": "Reporters Without Borders said the ruling against the 26-year-old journalist showed a ‘blatant disregard for press freedom’ in the Southeast Asian nation A young Filipino journalist who spent nearly six years in a crowded provincial prison was found guilty of terror financing on Thursday, in a case rights groups and a UN rapporteur labelled a “travesty of justice”. Community journalist and radio broadcaster Frenchie Cumpio, 26, and former roommate Marielle Domequil broke down in tears and hugged each other as the guilty verdict was read and they were sentenced to 12-18 years in prison by judge Georgina Uy Perez of the Tacloban regional court. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/frenchie-mae-cumpio-philippine-journalist-found-guilty",
      "published": "Thu, 22 Jan 2026 03:28:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Ukrainian President Zelenskyy gives scorching critique of Europe in Davos speech",
      "description": "At Davos, Ukrainian President Zelenskyy warned Europe is divided and unprepared for a more dangerous world, urging unity and less reliance on the U.S.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5685101/ukrainian-president-zelenskyy-gives-scorching-critique-of-europe-in-davos-speech",
      "published": "Fri, 23 Jan 2026 04:47:18 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Venezuela opens debate on an oil sector overhaul as Trump seeks role for US firms",
      "description": "Venezuela's legislature advanced a bill on Thursday to loosen state control over the country's vast oil sector, the first major overhaul since parts of the industry were nationalized in 2007.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5686169/venezuela-debate-oil-sector-trump-seeks-role-us-firms",
      "published": "Fri, 23 Jan 2026 01:58:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "'I saw people getting shot': Eyewitness tells of Iran protest crackdown",
      "description": "An Iranian who got out of the country describes scenes of chaos as security forces opened fire in her home town.",
      "url": "https://www.bbc.com/news/articles/c9dvvzzpwylo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 15:33:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "One-year-old twin girls missing after migrant crossing to Italy: NGO",
      "description": "Dozens of people rescued in Lampedusa after vessel crossed from Tunisia in dangerous conditions, Save the Children says.",
      "url": "https://www.aljazeera.com/news/2026/1/23/one-year-old-twin-girls-missing-after-migrant-crossing-to-italy-ngo?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 17:51:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Rodman becomes new 'highest paid' women's footballer",
      "description": "USA forward Trinity Rodman has re-signed with the Washington Spirit of the National Women's Soccer League in a deal that will reportedly pay her in excess of $2 million per season.",
      "url": "https://www.dw.com/en/rodman-becomes-new-highest-paid-women-s-footballer/a-75623666?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 13:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UN envoy highlights ‘window to advance peace’ in Colombia",
      "description": "The new year provides an opportunity for Colombia to keep advancing towards lasting peace, a decade after a landmark accord that ended more than 50 years of conflict, the UN Special Representative told the Security Council on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166818",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Brother killed after teen becomes 'enraged' over video game, stabs sibling: police",
      "description": "Oklahoma teenager allegedly calls 911 to confess stabbing his brother to death over a video game dispute. William Spencer, 19, now faces murder charges.",
      "url": "https://www.foxnews.com/us/brother-killed-after-teen-becomes-enraged-over-video-game-stabs-sibling-police",
      "published": "Thu, 22 Jan 2026 17:49:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump pressures UK over Hamas-linked figure as US intel flags potential terror threat",
      "description": "U.S. Treasury sanctioned Zaher Birawi, 64, alleging the Britain-based activist serves as a Hamas senior official through a Popular Conference for Palestinians Abroad leadership role.",
      "url": "https://www.foxnews.com/world/trump-pressures-uk-hamas-linked-figure-us-intel-flags-potential-terror-threat",
      "published": "Thu, 22 Jan 2026 16:46:05 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Harry says sacrifices by Nato troops in Afghanistan deserve 'respect'",
      "description": "The US president's comments have been condemned by international allies, including UK veterans and politicians.",
      "url": "https://www.bbc.com/news/articles/clym2l7d75eo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 18:54:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Greenland and the world order",
      "description": "Is there a deal between the U.S., Denmark and Greenland? Mary Louise Kelly and the team on NPR's national security podcast break it down.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5685021/greenland-and-the-world-order",
      "published": "Thu, 22 Jan 2026 16:13:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Laura Jedeed warns: 'Nothing legal, ethical,  or moral about what’s unfolding on America's streets'",
      "description": "François Picard is pleased to welcome independent journalist Laura Jedeed sharing a piercing exposé of systemic dysfunction, ethical erosion, and authoritarianism blossoming in the US. In an era marked by institutional opacity and profound public distrust, Ms. Jedeed’s firsthand account on Slate of her ICE candidacy offers a rare glimpse into a federal system in utter disarray. Her story sheds a cruel light on the collapse of due process, the normalisation of extreme force, and the silent corrosion of democratic values under the weight of unchecked power.",
      "url": "https://www.france24.com/en/there-s-nothing-legal-ethical-or-moral-about-what-s-unfolding-on-america-s-streets",
      "published": "Fri, 23 Jan 2026 14:19:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "A national tragedy 30 years ago united Australia. Why hasn't the Bondi shooting?",
      "description": "Political spats brewing since the tragedy last month have overshadowed a national day of mourning.",
      "url": "https://www.bbc.com/news/articles/cx2yy4n1vlgo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 23:23:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Kosovo authorities arrest over 100 people over alleged ballot manipulation in December vote",
      "description": "Authorities in Kosovo have detained 109 people in connection with alleged vote manipulation that has led to a recount of last month’s early parliamentary election in the Balkan country fueling fears that a yearlong political crisis could drag on",
      "url": "https://abcnews.go.com/International/wireStory/kosovo-authorities-arrest-100-people-alleged-ballot-manipulation-129494514",
      "published": "Fri, 23 Jan 2026 12:17:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria: Renewed clashes risk derailing fragile transition",
      "description": "A tense standoff between the Syrian Government and Kurdish-led forces in the country’s northeast risks igniting wider instability just as Syria struggles to emerge from years of conflict and authoritarian rule, senior UN officials told the Security Council on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166811",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Pakistan mall fire death toll jumps to 67",
      "description": "The process to identify the bodies recovered from the wreckage of Gul Plaza in Karachi continues.",
      "url": "https://www.bbc.com/news/articles/cwy11485jeno?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 10:40:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "After the US attack on Venezuela, will Cuba’s economy survive?",
      "description": "Donald Trump has threatened to cut Venezuelan shipments of oil to Cuba, exerting further pressure on its economy.",
      "url": "https://www.aljazeera.com/features/longform/2026/1/23/after-the-us-attack-on-venezuela-will-cubas-economy-survive?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 15:29:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Minnesota gears up for mass anti-ICE protest",
      "description": "Labor unions and civil society groups say they are ready to brave a dangerous winter storm to protest immigration enforcement across the state.",
      "url": "https://www.dw.com/en/minnesota-gears-up-for-mass-anti-ice-protest/a-75634207?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 19:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Should US newsrooms be bracing for more after FBI raids reporter's home?",
      "description": "On January 14, the FBI raided the home of Washington Post reporter Hannah Natanson as part of an investigation into a government contractor's handling of classified material. It is not illegal for a reporter in the United States to publish classified material, so the search has raised numerous concerns. In particular, free speech advocates say the dramatic raid could have a chilling effect on reporters and sources. Our guest is Marty Baron, a highly-regarded former editor of The Washington Post.",
      "url": "https://www.france24.com/en/tv-shows/scoop/20260123-should-us-newsrooms-be-bracing-for-more-after-fbi-raids-reporter-s-home",
      "published": "Fri, 23 Jan 2026 14:28:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "An avalanche in Pakistan and snowstorms in neighboring Afghanistan kill at least 20 people",
      "description": "Authorities say that an avalanche killed nine members of a single family in northwestern Pakistan while a heavy snowstorm in neighboring Afghanistan left 11 people dead",
      "url": "https://abcnews.go.com/International/wireStory/avalanche-pakistan-snowstorms-neighboring-afghanistan-kill-20-people-129496826",
      "published": "Fri, 23 Jan 2026 13:13:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Swiss court orders release on bail of bar owner in probe of fatal New Year's fire",
      "description": "A court has ordered the release on bail of one of the owners of the Swiss bar where a fire broke out during a New Year’s celebration, killing 40 people and injuring more than 100",
      "url": "https://abcnews.go.com/International/wireStory/swiss-court-orders-release-bail-bar-owner-probe-129496869",
      "published": "Fri, 23 Jan 2026 13:21:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump slams UK island handoff deal that could put key US military base at risk",
      "description": "President Donald Trump calls the United Kingdom's Chagos Islands transfer plan \"an act of great stupidity,\" warning China could exploit the deal.",
      "url": "https://www.foxnews.com/world/trump-slams-uk-island-handoff-deal-put-key-us-military-base-risk",
      "published": "Wed, 21 Jan 2026 18:25:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Pakistani military orders evacuations ahead of security sweep in Tirah",
      "description": "The Pakistani military is forcing thousands of families to evacuate from Khyber District’s Tirah Valley.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/23/pakistani-military-orders-evacuations-ahead-of-security-sweep-in-tirah?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 17:18:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Why Qatar is betting on diplomacy with Iran",
      "description": "For Gulf states exposed to the costs of war, diplomacy is not idealism but strategic risk management.",
      "url": "https://www.aljazeera.com/opinions/2026/1/23/why-qatar-is-betting-on-diplomacy-with-iran?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 15:33:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Intense heat could smash temperature records in south-east Australia with catastrophic fire danger forecast",
      "description": "High to extreme fire danger expected across several states as inland parts of SA, Victoria, NSW and Queensland may have more than five days above 40C Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast All-time temperature records could tumble in Victoria and New South Wales over coming days, as a dome of intense heat pushes into south-east Australia, bringing extreme to catastrophic fire conditions. Starting Saturday, the Bureau of Meteorology has forecast a prolonged period of intense heat across South Australia, Victoria, NSW and southern Queensland. Some inland areas could experience more than five days above 40C. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/23/intense-heat-across-south-east-australia-could-shatter-temperature-records-in-coming-days",
      "published": "Fri, 23 Jan 2026 07:01:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Vietnam leader To Lam consolidates power as country targets 10% growth",
      "description": "Lam, 68, pledged to accelerate economic growth and was reappointed unanimously by the 180-member Central Committee at the conclusion of the National Party Congress.",
      "url": "https://www.npr.org/2026/01/23/g-s1-106993/vietnam-leader-to-lam-consolidates-power-as-country-targets-10-growth",
      "published": "Fri, 23 Jan 2026 09:40:47 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Pakistan arrests rights lawyer, husband over 'cyber terrorism', family says",
      "description": "Pakistani rights lawyer Imaan Mazari-Hazir and her husband were arrested, according to her mother, politician and former minister Shireen Mazari. A judge ordered the couple's arrest in a cyber terrorism trial.",
      "url": "https://www.dw.com/en/pakistan-arrests-rights-lawyer-husband-over-cyber-terrorism-family-says/a-75624260?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 14:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Freezing cold? This town in Finland is keeping warm with sand",
      "description": "Keeping warm in the winter isn't easy in Finland, one of Europe's coldest countries. But in one Finnish town, residents are kept toasty warm thanks to cheap, efficient and renewable heat stored in a so-called \"sand battery\". Our France 2 colleagues report.",
      "url": "https://www.france24.com/en/freezing-cold-this-town-in-finland-is-keeping-warm-with-sand",
      "published": "Fri, 23 Jan 2026 15:44:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Gaza reconstruction talks must not distract from massive needs, say UN aid agencies",
      "description": "Amid reconstruction talks on Gaza linked to President Trump's just-launched Board of Peace, UN aid agencies insisted on Friday that what Gazans need most is immediate relief from the ongoing humanitarian catastrophe there.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166815",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "SA and Victoria brace for weekend of dangerous fire conditions – as it happened",
      "description": "This blog is now closed Andrew Hastie firms as a candidate to challenge for Liberal leadership amid push for Ley to stand down Get our breaking news email , free app or daily news podcast Liberal senator says party still ‘believes’ in the Coalition Anne Ruston, a Liberal senator, said the party still believes in the Coalition and would like to see it continue, but said Sussan Ley was left with “no option but to accept” multiple resignations after members of the Nationals broke a “fundamental rule”. We believe in the coalition and we would like to see a coalition continue, but the circumstances around the actions of the National party this week left the leader with no option but to accept the resignations of three people who, by their own admission, broke the very fundamental rule of a coalition and that is shadow cabinet solidarity. So I think the leader is absolutely right. The most important thing that we can do as of today is to focus on the future of responding to the needs of the Australian public because that’s what they elected us to do. That’s obviously a matter for the National party and their deliberations as to why they chose yesterday as a day to make public comment, and I’m not going to make any further comment than that. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/23/australia-news-live-sussan-ley-liberals-coalition-nationals-littleproud-hastie-taylor-anthony-albanese-labor-spill-ntwnfb",
      "published": "Fri, 23 Jan 2026 06:49:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Haiti's transitional council deepens political chaos by voting to oust the prime minister",
      "description": "A member of Haiti’s transitional presidential council has announced that a majority of the panel has voted to fire the country’s embattled Prime Minister Alix Didier Fils-Aimé as the country’s political chaos deepens",
      "url": "https://abcnews.go.com/International/wireStory/haitis-transitional-council-deepens-political-chaos-voting-oust-129498455",
      "published": "Fri, 23 Jan 2026 14:41:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Piper James autopsy finds ‘evidence consistent with drowning and injuries consistent with dingo bites’",
      "description": "Canadian backpacker, 19, was found dead on K’gari island earlier this week surrounded by pack of wild dingoes The autopsy of Piper James, whose body was found on K’gari surrounded by a pack of dingoes, has found “physical evidence consistent with drowning and injuries consistent with dingo bites”. The Canadian backpacker’s trip to Australia ended in tragedy when the 19-year-old was found dead on a beach on Monday on the world heritage-listed island formerly known as Fraser Island off the Queensland coast. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/23/piper-james-backpacker-kgari-dingoes-coroner-autopsy-evidence-drowning-dingo-bites",
      "published": "Fri, 23 Jan 2026 10:45:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump, Zelenskyy, Carney dominate Davos 2026: As it happened",
      "description": "The World Economic Forum has come to an end after a tense but ultimately anti-climactic week at Davos, with the US, Ukrainian and Canadian leaders attracting the most attention. Read DW's wrap of the summit.",
      "url": "https://www.dw.com/en/trump-zelenskyy-carney-dominate-davos-2026-as-it-happened/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 13:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Pressured by Damascus to integrate into the state, what does the future hold for Syria’s Kurds?",
      "description": "After Syrian forces on Wednesday seized Kurdish strongholds in the northeast of the country, the Syrian government gave Kurdish forces until Saturday to reach an agreement on how they will integrate into the state. Is the dream of an autonomous state over for Syria’s Kurds?",
      "url": "https://www.france24.com/en/middle-east/20260123-pressured-by-damascus-to-integrate-into-the-state-what-does-the-future-hold-for-syria-s-kurds",
      "published": "Fri, 23 Jan 2026 16:28:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian forces take control of prison housing IS members after Kurdish fighters leave",
      "description": "Syria's government forces have taken control of a prison housing Islamic State group members in the country's north",
      "url": "https://abcnews.go.com/International/wireStory/syrian-forces-control-prison-housing-members-after-kurdish-129483632",
      "published": "Fri, 23 Jan 2026 06:00:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Eighty years at the heart of global development",
      "description": "From humanitarian crises and youth unemployment, to climate resilience and development financing, many of today’s global challenges pass through a single United Nations body that is quietly turning 80 this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166814",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "For every $1 spent protecting nature, $30 goes to destroying it",
      "description": "The world spends billions to protect nature, but trillions are being invested in business activities that harm the environment.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166809",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "ICE rejects ‘false narrative’ about family separation, asserts Minnesota church rioters were not peaceful",
      "description": "A top ICE official provided new details about an incident involving a 5-year-old boy in Minnesota while also condemning the behavior of agitators who stormed a church.",
      "url": "https://www.foxnews.com/us/ice-rejects-false-narrative-about-family-separation-asserts-minnesota-church-rioters-were-not-peaceful",
      "published": "Fri, 23 Jan 2026 14:26:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Convicted pedophiles, sex predators arrested in Minnesota immigration sweep within the last 24 hours",
      "description": "Federal agents on Thursday arrested convicted pedophiles and drug traffickers in the ongoing Minnesota immigration sweep, sparking a clash between DHS officials and state leaders.",
      "url": "https://www.foxnews.com/us/convicted-pedophiles-sex-predators-arrested-minnesota-immigration-sweep-within-last-24-hours",
      "published": "Fri, 23 Jan 2026 14:04:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump floats ‘Board of Peace’ to replace UN, signals major global power shift",
      "description": "President Donald Trump invited dozens of countries including Russia, China, and Ukraine to join his Board of Peace initiative, with a signing ceremony planned for Davos, Switzerland.",
      "url": "https://www.foxnews.com/world/trump-floats-board-peace-replace-un-signals-major-global-power-shift",
      "published": "Tue, 20 Jan 2026 17:36:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli TikToker attacks activists in occupied West Bank",
      "description": "Israeli social media figure Roi Star was filmed harassing and attacking activists in the occupied West Bank.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/23/israeli-tiktoker-attacks-activists-in-occupied-west-bank?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 14:34:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela: In the Shadow of the US",
      "description": "How oil-rich Venezuela fell from 1970s stable democracy to a crisis that led to the January 2026 US raid on Caracas.",
      "url": "https://www.aljazeera.com/video/featured-documentaries/2026/1/23/venezuela-in-the-shadow-of-the-us?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 14:12:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "LIVE: Attacks continue in Russia, Ukraine as talks start in Abu Dhabi",
      "description": "Volodymyr Zelenskyy says officials from Ukraine, Russia and the US will hold trilateral ⁠meetings in the UAE.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/23/ukraine-talks-live?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 14:08:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A Canadian Olympic snowboarder turned alleged drug kingpin is arrested in Mexico",
      "description": "Ryan Wedding was among the FBI's top fugitives and faces charges related to drug trafficking and the killing of a federal witness. He reportedly turned himself in at the U.S. embassy in Mexico",
      "url": "https://www.npr.org/2026/01/23/g-s1-107051/ryan-wedding-arrest-canada-olympic-snowboarder-alleged-drug-kingpin",
      "published": "Fri, 23 Jan 2026 13:35:25 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Outrage as Trump undermines NATO role in Afghanistan war",
      "description": "President Trump suggested US allies in NATO were \"off the front lines\" during the war in Afghanistan. London has strongly opposed the suggestion, which comes amid tensions between the US and some NATO members.",
      "url": "https://www.dw.com/en/outrage-as-trump-undermines-nato-role-in-afghanistan-war/a-75630017?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 16:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Will US-Russia-Ukraine talks bring war to an end?",
      "description": "Ukraine, the US and Russia are set to hold their first-ever trilateral meeting to find ways to end the war.",
      "url": "https://www.dw.com/en/will-us-russia-ukraine-talks-bring-war-to-an-end/a-75625102?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 16:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "China saves Filipino sailors near South China Sea shoal",
      "description": "The Chinese Coast Guard launched a rescue effort to save Filipino sailors near the disputed Scarborough Shoal after their cargo ship capsized with 21 people on board.",
      "url": "https://www.dw.com/en/china-saves-filipino-sailors-near-south-china-sea-shoal/a-75615866?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 09:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "The age of female rage",
      "description": "This week we are talking about anger, the emotion that shaped 2025. So much so that \"rage bait\" was crowned the Oxford Dictionary's word of the year. But while anger has long been rewarded, even celebrated, when expressed by men, women's fury has remained something of a taboo; dismissed as hysteria or rudeness. But is a cultural reckoning underway, where women are finally being heard – not despite, but because of their anger?",
      "url": "https://www.france24.com/en/tv-shows/the-51/20260123-the-age-of-female-rage",
      "published": "Fri, 23 Jan 2026 16:21:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "EU leaders welcome Trump tariffs climbdown and call to move ahead with trade deal",
      "description": "EU leaders held a summit that was initially meant to discuss the use of the bloc's anticoercion instrument against the United States. But since the summit was called, US President Donald Trump backed down from his tariff threats and talks have started regarding Greenland. EU leaders ended up asking the European Parliament to ratify the EU-US trade deal which had been suspended. FRANCE 24's Dave Keating tells us more from Brussels.",
      "url": "https://www.france24.com/en/eu-leaders-welcome-trump-tariffs-climbdown-and-call-to-move-ahead-with-trade-deal",
      "published": "Fri, 23 Jan 2026 14:55:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "\"No one expecting any progress\" in Ukraine from UAE talks",
      "description": "Ukrainian, US and Russian officials will hold security talks in the United Arab Emirates on January 23, the Kremlin said, following a meeting of top US negotiators with President Vladimir Putin in Moscow on a US-drafted plan to end the Ukraine war. Yet, it's unlikely that the talks will lead anywhere. Russia asks that Ukraine give up the Donetsk region of the Donbas, which Ukraine refuses to do. FRANCE 24's Gulliver Cragg tells us about what to know ahead of these talks.",
      "url": "https://www.france24.com/en/video/20260123-no-one-expecting-any-progress-in-ukraine-from-uae-talks-1",
      "published": "Fri, 23 Jan 2026 14:16:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "First meeting since start of Ukraine war between US, Ukraine and Russia to take place in UAE",
      "description": "In a first since the start of the Ukraine war in February 2022, US, Ukraine and Russian officials are set to meet for peace talks in the UAE on January 23. There is however no sign of a softening of their positions to end the war, as Ukraine refuses to give up the Donetsk region as Russia asks for, which represents 20% of the Donbas. FRANCE 24's Rochelle Ferguson Bouyahi looks into why these stalks are unlikely to move forward.",
      "url": "https://www.france24.com/en/first-meeting-since-start-of-ukraine-war-between-us-ukraine-and-russia-to-take-place-in-uae",
      "published": "Fri, 23 Jan 2026 14:10:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "France PM survives no-confidence vote over forced budget",
      "description": "The French ​government survived two votes of no-confidence in parliament on ​January 23 that had been ​called over its decision ​to ram through the income part of the 2026 budget without giving the National ‍Assembly the final say. The motions were brought on by radical left Unbowed France and far right National Rally. \"When debate no longer allows a conclusion, someone has to take responsibility,\" he told the National Assembly just ahead of the votes.",
      "url": "https://www.france24.com/en/france-pm-survives-no-confidence-vote-over-forced-budget",
      "published": "Fri, 23 Jan 2026 14:08:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "457 British personnel died in Afghanistan. Trump 'dodged' the Vietnam War draft five times",
      "description": "After the damage done by the American president in Davos - and make no mistake, it was significant, with alliances further ruptured - he has now managed to amplify it with comments that are as disrespectful as they are false.",
      "url": "https://news.sky.com/story/i-was-in-helmand-with-uk-troops-draft-dodging-trumps-words-are-a-gut-punch-to-those-killed-13497851",
      "published": "Fri, 23 Jan 2026 04:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "British troops were in Afghanistan from start to finish - despite what Trump says",
      "description": "Over 1,000 non-US NATO troops died in Afghanistan and at least double that number were seriously wounded in supporting US policy there.",
      "url": "https://news.sky.com/story/british-troops-were-in-afghanistan-from-start-to-finish-despite-what-trump-says-13498041",
      "published": "Fri, 23 Jan 2026 12:57:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Envoys travel the globe to push a US plan for ending Russia's war in Ukraine",
      "description": "The U.S.-led push to end Russia’s nearly 4-year-old war in Ukraine gained momentum late last year and is moving ahead in 2026, with leaders, diplomats and envoys traveling to a flurry of meetings to discuss a potential deal",
      "url": "https://abcnews.go.com/International/wireStory/envoys-travel-globe-push-us-plan-ending-russias-129495824",
      "published": "Fri, 23 Jan 2026 12:57:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'The ultimate insult': Trump downplaying NATO's Afghanistan involvement causes distress in UK",
      "description": "U.S. President Donald Trump has provoked outrage and distress in the U.K. with his suggestion that troops from NATO countries stayed away from the frontline during the war in Afghanistan",
      "url": "https://abcnews.go.com/International/wireStory/ultimate-insult-trump-downplaying-natos-afghanistan-involvement-causes-129485391",
      "published": "Fri, 23 Jan 2026 07:37:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "China says 2 people are dead and 4 missing after boat capsizes near disputed shoal",
      "description": "Chinese authorities say two people are dead and four are missing after a boat with 21 Filipinos on board capsized in the South China Sea",
      "url": "https://abcnews.go.com/International/wireStory/china-2-people-dead-4-missing-after-boat-129482178",
      "published": "Fri, 23 Jan 2026 03:59:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Former Uvalde school officer says he doesn't regret actions after not guilty verdict",
      "description": "Former Uvalde officer speaks out after acquittal, says he has no regrets about his actions during deadly 2022 school shooting that left 21 people dead.",
      "url": "https://www.foxnews.com/us/former-uvalde-school-officer-says-he-doesnt-regret-actions-after-not-guilty-verdict",
      "published": "Fri, 23 Jan 2026 08:57:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Indiana judge shooting: Police arrest 3 on attempted murder charges, 2 others in custody",
      "description": "Five suspects arrested in shooting of Indiana judge Steven Meyer and his wife at their home, with charges including attempted murder and aggravated battery.",
      "url": "https://www.foxnews.com/us/indiana-judge-shooting-police-3-attempted-murder-charges-2-others-custody",
      "published": "Fri, 23 Jan 2026 07:49:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Armed husband confronts suspected Florida kidnapper after wife is followed home",
      "description": "Florida husband shoots man who allegedly tried to abduct his wife while she walked her dog on New Year's Day. Police rule shooting justified self-defense.",
      "url": "https://www.foxnews.com/us/armed-husband-confronts-suspected-florida-kidnapper-after-wife-followed-home",
      "published": "Thu, 22 Jan 2026 17:10:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Canadian PM Carney fires back at Trump over claim that 'Canada lives because of the United States'",
      "description": "Prime Minister Mark Carney rejected President Donald Trump's claim that \"Canada lives because of the United States,\" declaring Canada \"thrives because we are Canadian.\"",
      "url": "https://www.foxnews.com/world/canadian-pm-carney-fires-back-trump-over-claim-canada-lives-because-united-states",
      "published": "Fri, 23 Jan 2026 10:19:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Alleged drug kingpin and ex-Olympian Ryan Wedding arrested after years on the run",
      "description": "Wedding, who had been on the FBI's Ten Most Wanted Fugitives list, is accused of running a transnational drug trafficking operation.",
      "url": "https://www.bbc.com/news/articles/cj0nd8z1z59o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 18:49:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battle",
      "description": "The authorities tried to stop their export arguing they were part of the country's heritage.",
      "url": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 12:16:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Spanish prosecutors drop sexual assault complaint against Julio Iglesias",
      "description": "Court says alleged abuse and trafficking offences occurred outside Spain, leaving it without jurisdiction Spanish prosecutors have shelved a complaint brought by two women who have accused the singer Julio Iglesias of sexual assault and human trafficking , arguing the country’s courts have no jurisdiction as the alleged offences took place outside Spain. Two female former employees who worked at Iglesias’s Caribbean mansions 10 days ago accused the veteran entertainer of sexual assault, saying they had been subjected “to inappropriate touching, insults and humiliation … in an atmosphere of control and constant harassment”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/spanish-prosecutors-drop-julio-iglesias-complaint",
      "published": "Fri, 23 Jan 2026 18:20:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Andrew Hastie firms as Liberal leadership challenger amid push for Ley to step aside",
      "description": "Colleagues encourage former soldier to run as Sussan Ley declares she will remain opposition leader after Coalition split Get our breaking news email , free app or daily news podcast Andrew Hastie is emerging as a candidate to challenge Sussan Ley for the Liberal party’s leadership, as MPs privately push for the party’s first female leader to step aside. As a defiant Ley declared she would survive the fallout from the latest Coalition split, internal rivals were adamant she had lost the support of the party room. This is despite the Nationals leader, David Littleproud, being blamed for the break-up. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/23/sussan-ley-confident-she-will-survive-as-opposition-leader-and-says-door-is-open-to-nationals-rejoining-coalition",
      "published": "Fri, 23 Jan 2026 07:17:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Dollars trickle into Venezuela's economy after first sales of country's oil by U.S.",
      "description": "The first sales of Venezuelan oil by the U.S. seem to have stabilized prices for now, but there are many questions about the long-term viability of U.S. control of the Venezuelan economy.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5683913/dollars-trickle-into-venezuelas-economy-after-first-sales-of-countrys-oil-by-u-s",
      "published": "Fri, 23 Jan 2026 04:47:07 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "India: Can 'heritage walks' make learning history more fun?",
      "description": "Young Indians are not often excited by their country's history, but heritage walks are a way to make learning about the past more interactive while helping conserve historical sites.",
      "url": "https://www.dw.com/en/india-can-heritage-walks-make-learning-history-more-fun/a-75626180?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 14:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Former Olympic snowboarder linked to alleged drug trafficking and murder arrested",
      "description": "A former Olympic snowboarder accused of drug trafficking and setting up the murder of a federal witness, has been arrested, the head of the FBI has said.",
      "url": "https://news.sky.com/story/ryan-wedding-former-olympic-snowboarder-linked-to-alleged-drug-trafficking-and-murder-arrested-13498138",
      "published": "Fri, 23 Jan 2026 19:21:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Human trafficking depends on corruption at every step",
      "description": "In 2011, a trafficker in Chile was convicted for recruiting economically vulnerable Peruvian citizens and arranging for them to be brought into the country – destined to become victims of sexual exploitation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166797",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Former Des Moines schools chief pleads guilty to falsely claiming US citizenship and gun charge",
      "description": "Former Des Moines schools Superintendent Ian Andre Roberts pleaded guilty to federal charges, including falsely claiming U.S. citizenship and illegal gun possession.",
      "url": "https://www.foxnews.com/us/former-des-moines-schools-chief-pleads-guilty-falsely-claiming-us-citizenship-gun-charge",
      "published": "Thu, 22 Jan 2026 19:03:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Julio Iglesias sex assault investigation dropped by Spanish prosecutors",
      "description": "They say Spanish courts do not have the competence to investigate complaints committed overseas by non-residents.",
      "url": "https://www.bbc.com/news/articles/c9vx0p3gl71o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 17:53:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US sanctions Iran ‘shadow fleet’ it says fuels violent protest crackdown",
      "description": "Move targets vessels used by Iran to generate 'funds used to repress its own people', US treasury secretary says.",
      "url": "https://www.aljazeera.com/news/2026/1/23/us-sanctions-iran-shadow-fleet-it-says-fuels-violent-protest-crackdown?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 19:24:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Minneapolis businesses close doors for economic blackout protesting ICE",
      "description": "More than 700 small businesses, faith organisations, educators walked off the job to protest ICE raids",
      "url": "https://www.aljazeera.com/economy/2026/1/23/minneapolis-businesses-close-doors-for-economic-blackout-protesting-ice?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 19:14:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Winter storm to impact at least 160 million across southern, eastern US",
      "description": "Massive winter storm to affect half of the US population with snow, ice and extreme cold temperatures this weekend.",
      "url": "https://www.aljazeera.com/news/2026/1/23/winter-storm-to-impact-at-least-180-million-across-southern-eastern-us?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 16:51:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Leaked video shows Venezuela regime’s desperate struggle to control message",
      "description": "Interim leader Delcy Rodríguez told influencers of US threat to kill leaders if they did not cooperate after capture of Maduro The communications minister holds a phone up to a microphone before a gathering of regime-friendly influencers. On speakerphone is Venezuela’s acting president, Delcy Rodríguez , who claims that when US forces captured the dictator Nicolás Maduro , she and other members of his cabinet were given 15 minutes to decide whether to comply with Washington’s demands – “or they would kill us”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/venezuela-leaked-video-delcy-rodriguez-maduro",
      "published": "Fri, 23 Jan 2026 12:00:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fact check: Fakes spread online amid Syria's power shift",
      "description": "As clashes continue in northern Syria, viral videos make claims about IS relatives escaping, mass border crossings, and unrest. DW Fact check finds that some footage is old, miscaptioned, or unrelated to current events.",
      "url": "https://www.dw.com/en/fact-check-fakes-spread-online-amid-syria-s-power-shift/a-75618514?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 17:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "EU to stay 'cordial' with US after Trump's Greenland threats",
      "description": "Trump deciding to wind back on tariffs on countries opposed his takeover of Greenland reduced the pressure at a hastily arranged summit of EU leaders. But they used the meeting to prepare Europe for another barrage.",
      "url": "https://www.dw.com/en/eu-to-stay-cordial-with-us-after-trump-s-greenland-threats/a-75615299?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 09:37:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Swiss bar co-owner released on bail after deadly fire",
      "description": "The co-owner of the Swiss bar where 40 people died in a fire has been released on bail.",
      "url": "https://news.sky.com/story/swiss-bar-co-owner-released-on-bail-as-investigation-into-deadly-fire-continues-13498173",
      "published": "Fri, 23 Jan 2026 18:35:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea imposes travel bans on 3 civilians over alleged drone flights into North",
      "description": "South Korea has placed overseas travel bans on three people as part of an investigation into alleged drone flights over North Korea that have deepened animosities between the rivals",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-imposes-travel-bans-3-civilians-alleged-129483627",
      "published": "Fri, 23 Jan 2026 06:01:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Dangerous nostalgia’ is a threat to multilateralism, UN deputy chief tells Danish MPs",
      "description": "United Nations Deputy Secretary-General Amina Mohammed urged countries to protect the UN Charter in a powerful speech to the Danish Parliament on Thursday, urging countries to “stand up for a rules-based order” – or pay the price.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166812",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Idaho murders photos put police on damage control as families fume over accidental release",
      "description": "Idaho authorities address accidental release of crime scene photos from 2022 University of Idaho student murders, citing public records law challenges.",
      "url": "https://www.foxnews.com/us/idaho-murders-photos-put-police-damage-control-families-fume-over-accidental-release",
      "published": "Fri, 23 Jan 2026 12:12:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Husband of alleged Minnesota church invasion organizer dismisses 'Beavis and Butt-Head' DOJ prosecution",
      "description": "Husband of accused anti-ICE agitator slams \"Beavis and Butt-Head\" prosecution after wife's arrest for allegedly storming Minnesota church service.",
      "url": "https://www.foxnews.com/us/husband-alleged-minnesota-church-invasion-organizer-dismisses-beavis-butt-head-doj-prosecution",
      "published": "Fri, 23 Jan 2026 10:10:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Berlin, Rome sign cooperation agreement",
      "description": "Germany's Friedrich Merz and Italy's Giorgia Meloni signed a series of agreements for closer cooperation in areas of defense and economics. DW has more.",
      "url": "https://www.dw.com/en/germany-news-berlin-rome-sign-cooperation-agreement/live-75619034?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 13:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Tool-using cow shows skill not limited to humans and chimpanzees",
      "description": "While it's normally chimpanzees that are applauded for it, a team in Austria has just reported the first known case of a cow using tools. 13-year-old Veronika lives in a mountain village and has spent years perfecting the art of scratching herself with sticks, rakes and brooms. The exciting discovery suggests that cows not being very intelligent, may in fact be a moo(t) point!",
      "url": "https://www.france24.com/en/video/20260123-tool-using-cow-shows-skill-not-limited-to-humans-and-chimpanzees",
      "published": "Fri, 23 Jan 2026 16:18:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "EU moves closer to backing 'return hubs' for migrants: A right-wing turn on asylum policy",
      "description": "EU member states have backed a hardening of migration policy, endorsing the controversial idea of \"return hubs\" beyond EU borders to process asylum seekers whose applications have been rejected. This as a key EU Migration and Asylum Pact is set to come into effect in June. We ask why this more hardline approach is taking shape, and what our guests think of the \"hubs\" concept.",
      "url": "https://www.france24.com/en/tv-shows/talking-europe/20260123-eu-moves-closer-to-backing-return-hubs-for-migrants-a-right-wing-turn-on-asylum-policy",
      "published": "Fri, 23 Jan 2026 15:31:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Leftist prosecutor cites affordability in release of alleged tourist killer near Disney: 'Inability to pay'",
      "description": "Man allegedly kills three Florida tourists after being released from mental health custody. Florida prosecutor defends decision under state law.",
      "url": "https://www.foxnews.com/us/leftist-prosecutor-cites-affordability-release-alleged-tourist-killer-near-disney-inability-pay",
      "published": "Fri, 23 Jan 2026 14:21:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Video captures Detroit student allegedly wielding box cutter in classroom chase as teacher intervenes",
      "description": "Viral video shows a Detroit student allegedly chasing a classmate with a box cutter as a teacher tried to intervene. The school district said the student was arrested.",
      "url": "https://www.foxnews.com/us/video-captures-detroit-student-allegedly-wielding-boxcutter-classroom-chase-teacher-intervenes",
      "published": "Thu, 22 Jan 2026 21:38:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "High stakes but low expectations for Ukraine talks with Russia and US",
      "description": "Donald Trump is pushing hard for a peace deal - but major issues between Russia and Ukraine are still unresolved, writes Sarah Rainsford.",
      "url": "https://www.bbc.com/news/articles/c3edde1pwx8o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 15:36:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump’s fragile Greenland ‘framework’ with NATO",
      "description": "US-NATO talks over Greenland include discussion of US missile defense and mineral rights.",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/23/glb_davosframework_av_v1-230126?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 19:45:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Prison breaks and renewed clashes raise alarm in northeast Syria",
      "description": "The United Nations continues to monitor developments in northeast Syria following clashes between government troops and the Kurdish-led SDF militia during which scores of detained ISIL militants reportedly escaped from prison.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166799",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Iran's top prosecutor criticizes Trump's announcement that 800+ executions were halted: 'Completely false'",
      "description": "Iran’s top prosecutor Mohammad Movahedi is criticizing an announcement from President Donald Trump that Iran recently canceled more than 800 executions.",
      "url": "https://www.foxnews.com/world/irans-top-prosecutor-criticizes-trumps-announcement-800-executions-were-halted-completely-false",
      "published": "Fri, 23 Jan 2026 14:18:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump told to 'f--- off' by Danish lawmaker during European Parliament debate about Greenland",
      "description": "European Parliament member Anders Vistisen confronts President Donald Trump's Greenland interest with profanity-laced rebuke, drawing a reprimand from parliament leadership.",
      "url": "https://www.foxnews.com/world/trump-told-f-k-off-danish-lawmaker-european-parliament-greenland-debate",
      "published": "Tue, 20 Jan 2026 16:27:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Former UK local politician pleads guilty to drugging, raping ex-wife",
      "description": "Philip Young admits to 48 offences committed between 2010 and 2023 ‍against ex-wife Joanne Young.",
      "url": "https://www.aljazeera.com/news/2026/1/23/former-uk-local-politician-pleads-guilty-to-drugging-raping-ex-wife?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 17:49:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "The capsicum paradox: new Australian supermarket pricing a ‘massive transparency fail’ for customers",
      "description": "Exclusive: Comparison of online ‘per each’ price of 15 fruits and vegetables against price per kilogram found ‘completely arbitrary’ price variations Get our breaking news email , free app or daily news podcast Supermarkets are increasingly charging customers for fresh produce by the item, rather than by weight, in a strategy that is leading to “wild volatility” in pricing with some items more than 50% more expensive, new analysis shows. A Sydney-based data analyst who compared the “per each” price online with the actual “per kilo” shelf price of 15 fruits and vegetables at their local Woolworths store found the price variations were “completely arbitrary”. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/23/the-capsicum-paradox-new-australian-supermarket-pricing-a-massive-transparency-fail-for-customers",
      "published": "Fri, 23 Jan 2026 14:00:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Palestinians say Jared Kushner's vision for Gaza erases what's left of their homes",
      "description": "Jared Kushner unveiled a vision of a futuristic cityscape for Gaza that includes skyscrapers and advanced industrial zones, but Palestinians fear his vision erases what remains of their homes.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5685111/palestinians-say-jared-kushners-vision-for-gaza-erases-whats-left-of-their-homes",
      "published": "Fri, 23 Jan 2026 04:48:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Not only Americans risked life and limb to serve in Afghanistan",
      "description": "Brits, Canadians and Danes were among those who saw the toughest fighting, writes the BBC's Frank Gardner.",
      "url": "https://www.bbc.com/news/articles/cj3v2mlvzdvo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 19:02:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I didn't hear from my son for seven months': Inside Yemen's UAE-run secret prisons",
      "description": "The BBC sees sites on former United Arab Emirates bases in Yemen where detainees say they were abused.",
      "url": "https://www.bbc.com/news/articles/c3r117w55q4o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 14:43:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somaliland president pitches business opportunities to Trump's son",
      "description": "He also met his counterpart from Israel which has recognised the independence of the breakaway region.",
      "url": "https://www.bbc.com/news/articles/cje11eg7lp5o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 16:59:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Luxury watchmaker designs $1.5m model with Indian billionaire's statue",
      "description": "With statues of a lion and white tiger, the watch is modelled off the private zoo owned by Anant Ambani.",
      "url": "https://www.bbc.com/news/articles/c7011pllqe7o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 14:28:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian woman found dead on Australian beach likely died of drowning, autopsy finds",
      "description": "Piper James's body was found on a beach surrounded by dingoes, but a coroner found evidence \"consistent with drowning\".",
      "url": "https://www.bbc.com/news/articles/c8rmmzr87x0o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 16:03:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Taliban release female athlete, 22, after 13 days in jail",
      "description": "Khadija Ahmadzada was detained for being in \"violation\" of rules \"regarding women's sports gyms\", a Taliban spokesman said.",
      "url": "https://www.bbc.com/news/articles/c1evv6dz3e9o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 12:37:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump covets mineral-rich Greenland, but what natural resources does it actually have?",
      "description": "Greenland's natural resources include large reserves of rare earth deposits.",
      "url": "https://www.bbc.com/news/articles/cly9230yw15o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 23 Jan 2026 12:39:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "FBI arrests ex-Canadian snowboard Olympian turned alleged drug lord",
      "description": "Prosecutors allege Ryan Wedding, who was arrested in Mexico, behind multibillion-dollar drug trafficking scheme.",
      "url": "https://www.aljazeera.com/news/2026/1/23/fbi-arrests-ex-canadian-snowboard-olympian-turned-alleged-drug-lord?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 20:18:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Rights advocates welcome Canada’s exclusion from Trump’s ‘Board of Peace’",
      "description": "Mark Carney should not join US plan for Gaza that 'makes mockery of Palestinian self-determination', rights groups say.",
      "url": "https://www.aljazeera.com/news/2026/1/23/rights-advocates-welcome-canadas-exclusion-from-trump-board-of-peace?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 19:41:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Will the AI bubble burst or boom?",
      "description": "Hundreds of billions of dollars are being invested to ensure that AI succeeds, but what happens if it doesn’t pay off?",
      "url": "https://www.aljazeera.com/video/the-stream/2026/1/23/will-the-ai-bubble-burst-or-boom?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 19:30:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Five-year-old in blue bunny hat becomes symbol of US immigration raids",
      "description": "A five-year-old boy in a blue bunny hat was taken away by immigration agents outside his home in Minneapolis, Minnesota.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/23/five-year-old-in-blue-bunny-hat-becomes-symbol-of-us-immigration-raids?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 19:21:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s interim president’s oil law reform to break with Chavez model",
      "description": "Opposition declined to vote for bill to overhaul oil sector that they had only received just before it was tabled.",
      "url": "https://www.aljazeera.com/economy/2026/1/23/venezuelas-interim-presidents-oil-law-reform-to-break-with-chavez-model?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 18:31:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ice cloaks Lake Michigan ahead of US polar vortex",
      "description": "Drone footage shows ice building along the shores of Lake Michigan ahead of a polar vortex sweeping across the US.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/23/ice-cloaks-lake-michigan-ahead-of-us-polar-vortex?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 15:21:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russia targets Ukraine’s energy as trilateral talks loom",
      "description": "Lacking battlefield successes, Moscow is hitting Ukraine's energy facilities to force territorial concessions.",
      "url": "https://www.aljazeera.com/features/2026/1/23/russia-targets-ukraines-energy-as-trilateral-talks-loom?traffic_source=rss",
      "published": "Fri, 23 Jan 2026 14:57:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "House rejects resolution that would bar Trump from sending troops to Venezuela",
      "description": "Vote on legislation falls just short of number needed for passage, showing Mike Johnson’s tenuous hold on majority The US House has rejected a resolution that would have prevented Donald Trump from sending US military forces to Venezuela , after a vote on the legislation fell just short of the majority needed for passage. The tied vote was the latest sign of House speaker Mike Johnson’s tenuous hold on the majority, as well as some of the growing pushback in the Republican-controlled Congress to the US president’s aggressions in the western hemisphere. A Senate vote on a similar resolution was also tied last week until JD Vance broke the deadlock. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/22/house-war-powers-resolution-trump-military-venezuela",
      "published": "Thu, 22 Jan 2026 23:56:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-23T20:21:00.238Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-23T16:06:01.414Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-23T02:55:58.118Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-23T07:11:12.374Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former U.S. ambassador to Ukraine discusses Zelenskyy's Davos speech",
      "description": "NPR's A Martinez asks William Taylor, a former U.S. ambassador to Ukraine, about his thoughts following President Zelenskyy's speech at Davos.",
      "url": "https://www.npr.org/2026/01/23/nx-s1-5685142/former-u-s-ambassador-to-ukraine-discusses-zelenskyys-davos-speech",
      "published": "Fri, 23 Jan 2026 04:47:12 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Merz says Germany won't join Trump's 'Board of Peace'",
      "description": "German Chancellor Merz said the current form of US President Trump's \"Board of Peace\" prevented Germany from joining for \"constitutional reasons.\" But Merz said he was open to \"new formats\" of cooperation with the US.",
      "url": "https://www.dw.com/en/merz-says-germany-won-t-join-trump-s-board-of-peace/a-75633920?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 18:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark’s PM visits Greenland to show ‘support’",
      "description": "Mette Frederiksen said she was visiting to show \"strong support\" to the people of Greenland. Her visit comes amid a turbulent week in which President Trump backed down on his bid to forcibly annex the Arctic island.",
      "url": "https://www.dw.com/en/denmark-s-pm-visits-greenland-to-show-support/a-75633439?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 17:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Sweet Caroline' singer Neil Diamond turns 85",
      "description": "He was a pop icon in the 1970s. Today, one of his songs is experiencing a viral resurgence. From soccer stadiums to TikTok, Neil Diamond's \"Sweet Caroline\" hasn't stopped playing.",
      "url": "https://www.dw.com/en/sweet-caroline-singer-neil-diamond-turns-85/a-75500373?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 16:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany investigates Russian espionage case",
      "description": "After identifying a suspected agent, Germany has expelled a Russian embassy employee and summoned the Russian ambassador.",
      "url": "https://www.dw.com/en/germany-investigates-russian-espionage-case/a-75631642?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 16:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Scorpions bassist, Francis Buchholz, dies aged 71",
      "description": "The musician's family said he died following a battle with cancer. Buchholz played bass for the Scorpions rock band until 1992, during one of their most successful periods.",
      "url": "https://www.dw.com/en/former-scorpions-bassist-francis-buchholz-dies-aged-71/a-75627507?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 15:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's ruling party vulnerable as snap poll looms",
      "description": "Japan's snap election could upend long standing political alignments, with Prime Minister Sanae Takaichi strong personally but her party weakened by scandals, defections and voter frustration over the cost of living.",
      "url": "https://www.dw.com/en/japan-s-ruling-party-vulnerable-as-snap-poll-looms/a-75624573?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 14:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US–EU economic ties show why neither side can decouple",
      "description": "Despite a pause in tariff escalation, US–EU trade remains volatile under Donald Trump. From deficits and energy to services and the dollar, the transatlantic relationship reveals deep ties — and clear vulnerabilities.",
      "url": "https://www.dw.com/en/us-eu-economic-ties-show-why-neither-side-can-decouple/a-75610955?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 23 Jan 2026 13:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Walking centrist line: Far right says budget too socialist, far left says budget as too right-wing'",
      "description": "Catherine Viette is pleased to welcome Dr. Andrew Smith, Historian of Modern France at Queen Mary University of London. In a time of political gridlock and economic uncertainty, the French PM has invoked Article 49.3 to force through its budget. Dr. Smith described this as more of a \"negotiated 49.3\", a tactical manoeuvre involving both compromise and constraint. His insights highlight the structural paralysis of a fractured parliament, the symbolic power of budgetary control, and the broader implications for France's fiscal credibility on the European stage.",
      "url": "https://www.france24.com/en/video/20260123-walking-centrist-line-far-right-says-budget-too-socialist-far-left-says-budget-as-too-right-wing-1",
      "published": "Fri, 23 Jan 2026 16:35:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who is Kirill Dmitriev, the Russian envoy part of Ukraine talks in the UAE?",
      "description": "High-level teams from Russia, Ukraine and the US are in Abu Dhabi for Ukraine peace negotiations. Among them - Kirill Dmitriev, the head of Russia's wealth fund who's played a crucial role in championing Moscow's interests during recent talks with US envoys. But who is this US-educated business mogul turned Kremlin negotiator?",
      "url": "https://www.france24.com/en/who-is-kirill-dmitriev-the-russian-envoy-part-of-ukraine-talks-in-the-uae",
      "published": "Fri, 23 Jan 2026 16:20:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French PM pushes through expenditure and income parts of budget",
      "description": "‍The French government on January 23 survived two no-confidence votes, with more expected after Prime Minister Sebastien Lecornu said he was invoking the constitution to force the expenditure part of the 2026 ‌budget bill through parliament. The key swing group, the socialist MPs, showed their support by not supporting two no-confidence motions, filed by the hard left and far right. FRANCE 24's Olivia Bizot has more from Paris.",
      "url": "https://www.france24.com/en/french-pm-pushes-through-expenditure-and-income-parts-of-budget",
      "published": "Fri, 23 Jan 2026 16:05:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Minnesota: Five-year old boy detained by ICE",
      "description": "US Immigration and Enforcement (ICE) officers this week detained five-year-old Liam Conejo Ramos in Minnesota as he was returning home from preschool, with school officials and witnesses saying agents used the child to lure out and arrest his father. The witnesses also said that the agents refused to leave him in the care of another adult, \"essentially using him as bait”.",
      "url": "https://www.france24.com/en/video/20260123-minnesota-five-year-old-boy-detained-by-ice-1",
      "published": "Fri, 23 Jan 2026 14:48:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Insulting and frankly appalling': PM condemns Trump's remarks on UK troops in Afghanistan",
      "description": "Sir Keir Starmer has said Donald Trump's claims British troops were not on the frontline in Afghanistan were \"insulting and frankly appalling\" - and suggested he should apologise.",
      "url": "https://news.sky.com/story/trump-sparks-fury-by-claiming-us-allies-stayed-off-afghanistan-frontline-13498044",
      "published": "Fri, 23 Jan 2026 14:29:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How close is a peace deal in Ukraine - and have we been here before?",
      "description": "Russian, Ukrainian and US negotiators are taking part in the first trilateral talks since the full-scale invasion of Ukraine in 2022.",
      "url": "https://news.sky.com/story/how-close-is-a-peace-deal-in-ukraine-and-have-we-been-here-before-13497897",
      "published": "Fri, 23 Jan 2026 08:13:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Stars of fashion and film say farewell to Italy's haute couture 'emperor' Valentino",
      "description": "Stars of the runway and the screen have said farewell to fashion designer Valentino at a church service in Rome.",
      "url": "https://news.sky.com/story/stars-of-fashion-and-film-say-farewell-to-italys-haute-couture-emperor-valentino-13498048",
      "published": "Fri, 23 Jan 2026 13:15:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Never before has Davos been so comprehensively hijacked by one man",
      "description": "Switzerland has been neutral ground in the heart of Europe for more than 500 years. This week, Davos provided a safe space for a full-frontal assault on the continent's economic and political model that will be felt long after the canapes are cleared.",
      "url": "https://news.sky.com/story/never-before-has-davos-been-so-comprehensively-hijacked-by-one-man-13498065",
      "published": "Fri, 23 Jan 2026 14:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump-backed investors finalise TikTok deal",
      "description": "The US and China have signed off on a deal for TikTok's Chinese owner to hand over the company's American division to investors backed by Donald Trump.",
      "url": "https://news.sky.com/story/us-and-china-finalise-deal-to-sell-tiktoks-american-business-13497849",
      "published": "Fri, 23 Jan 2026 00:36:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy drops brutal truth bombs upon European allies",
      "description": "Volodymyr Zelenskyy dropped a barrage of truth bombs on his European allies about their collective failure to stand up to Russian President Vladimir Putin and be respected by his US counterpart, Donald Trump.",
      "url": "https://news.sky.com/story/volodymyr-zelenskyy-europe-cant-act-without-us-leadership-and-is-stuck-in-a-groundhog-day-style-doom-loop-ukrainian-president-says-13497797",
      "published": "Thu, 22 Jan 2026 19:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Suicide bomber targets wedding ceremony in northwest Pakistan, killing 7, wounding 25",
      "description": "Police say a suicide bomber has detonated an explosive vest among guests at a wedding ceremony in northwest Pakistan, killing at least seven people and wounding 25 others",
      "url": "https://abcnews.go.com/International/wireStory/suicide-bomber-targets-wedding-ceremony-northwest-pakistan-killing-129496974",
      "published": "Fri, 23 Jan 2026 15:11:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK's Starmer slams Trump for \"insulting and frankly appalling\" comments about non-US NATO troops in Afghanistan",
      "description": "UK's Starmer slams Trump for \"insulting and frankly appalling\" comments about non-US NATO troops in Afghanistan",
      "url": "https://abcnews.go.com/International/wireStory/uks-starmer-slams-trump-insulting-frankly-appalling-comments-129493053",
      "published": "Fri, 23 Jan 2026 11:37:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russia, Ukraine and the US are holding peace talks in Abu Dhabi. They're coming at a key moment",
      "description": "Ukrainian, Russian and U.S. envoys are meeting in the United Arab Emirates, the first known instance that officials from the Trump administration have sat down with both countries as part of Washington’s push to end Moscow’s nearly 4-year-old invasion",
      "url": "https://abcnews.go.com/International/wireStory/russia-ukraine-us-holding-peace-talks-abu-dhabi-129493046",
      "published": "Fri, 23 Jan 2026 13:35:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Second former Malaysian general charged this week in corruption crackdown",
      "description": "A former chief of Malaysia's armed forces has been charged with four corruption offenses",
      "url": "https://abcnews.go.com/International/wireStory/former-malaysian-general-charged-week-corruption-crackdown-129483635",
      "published": "Fri, 23 Jan 2026 05:53:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Turkey celebrates as Syrian government makes gains against Kurdish-led force",
      "description": "Turkey is celebrating the latest developments in Syria, where the new government has effectively defeated a major Kurdish-led force with an abrupt offensive",
      "url": "https://abcnews.go.com/International/wireStory/turkey-celebrates-syrian-government-makes-gains-kurdish-led-129482821",
      "published": "Fri, 23 Jan 2026 04:10:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hong Kong vigil organizer says she was seeking democracy, not end to party rule",
      "description": "A prominent activist who organized Hong Kong’s decades-old vigil commemorating the 1989 Tiananmen Square crackdown has defended their demand for ending \"one-party rule” in court",
      "url": "https://abcnews.go.com/International/wireStory/hong-kong-vigil-organizer-seeking-democracy-end-communist-129482358",
      "published": "Fri, 23 Jan 2026 03:52:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Icebreakers, the key tech to unlock Greenland, are only made by either US allies or adversaries",
      "description": "Icebreakers are essential for navigating Greenland's icy seas, but the U.S. faces a challenge with its limited fleet",
      "url": "https://abcnews.go.com/International/wireStory/icebreakers-key-tech-unlock-greenland-made-us-allies-129482252",
      "published": "Fri, 23 Jan 2026 01:53:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kushner's vision for rebuilding Gaza faces major obstacles",
      "description": "Jared Kushner envisions a rebuilt Gaza with high-rises, a coastline that attracts tourists and a bustling port",
      "url": "https://abcnews.go.com/International/wireStory/kushners-vision-rebuilding-gaza-faces-major-obstacles-129481169",
      "published": "Fri, 23 Jan 2026 00:18:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "An ancient forest in Ecuador is the last stand for a tiny hummingbird facing extinction",
      "description": "The Yanacocha Reserve in the Ecuadorian Andes is the last refuge for a tiny hummingbird facing extinction",
      "url": "https://abcnews.go.com/International/wireStory/ancient-forest-ecuador-stand-tiny-hummingbird-facing-extinction-129480547",
      "published": "Fri, 23 Jan 2026 00:17:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cold kills another infant in Gaza as West Bank displacement intensifies",
      "description": "Another child in the Gaza Strip has died from hypothermia as winter weather continues to whip the enclave, the UN said on Wednesday, citing information from the health authorities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166804",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Surgeon accused of killing ex-wife and dentist husband gets first look at Ohio court with legal eagle defense",
      "description": "Surgeon accused of killing ex-wife and her dentist husband pleads not guilty to murder charges after extradition from Illinois to Ohio court proceedings.",
      "url": "https://www.foxnews.com/us/surgeon-accused-killing-ex-wife-dentist-husband-gets-first-look-ohio-court-legal-eagle-defense",
      "published": "Fri, 23 Jan 2026 15:13:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Video shows moment masked California burglars blitz high-end store, escape in luxury SUVs",
      "description": "Surveillance video captured three masked burglars smashing into a Newport Beach luxury handbag store, stealing over $200,000 in Chanel and Hermès bags.",
      "url": "https://www.foxnews.com/us/video-shows-terrifying-moment-masked-california-burglars-blitz-high-end-store-escape-luxury-suvs",
      "published": "Fri, 23 Jan 2026 14:49:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "California man arrested for allegedly stealing millions in homeless funds",
      "description": "Alexander Soofer was arrested for allegedly using millions in homeless funds for lifestyle, including mansion improvements and Range Rover purchases.",
      "url": "https://www.foxnews.com/us/california-man-arrested-allegedly-stealing-millions-homeless-funds",
      "published": "Fri, 23 Jan 2026 13:03:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "School board member’s explosive lawsuit claims teachers union lied about funneling money to political groups",
      "description": "Freedom Foundation and educator sue Utah Education Association over allegedly false advertising claims about political spending of teacher union dues.",
      "url": "https://www.foxnews.com/us/school-board-members-explosive-lawsuit-claims-teachers-union-lied-about-funneling-money-political-groups",
      "published": "Fri, 23 Jan 2026 08:00:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump revokes Canada’s spot on ‘Board of Peace’ and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/trump-revokes-canadas-spot-board-peace-more-top-headlines",
      "published": "Fri, 23 Jan 2026 06:50:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Judge orders Altoona cop to court as Mangione hopes to have backpack search tossed",
      "description": "Accused assassin Luigi Mangione's lawyers challenge evidence from backpack search as Altoona police officer testifies in UnitedHealthcare CEO murder case.",
      "url": "https://www.foxnews.com/us/judge-orders-altoona-cop-court-mangione-hopes-have-backpack-search-tossed",
      "published": "Fri, 23 Jan 2026 06:00:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nevada judge retires after court grants protective order to attorney she was accused of stalking",
      "description": "A Nevada judge announced her retirement after a court granted a protective order to an attorney she was allegedly stalking.",
      "url": "https://www.foxnews.com/us/nevada-judge-retires-after-court-grants-protective-order-attorney-she-accused-stalking",
      "published": "Fri, 23 Jan 2026 02:26:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian oil tanker, the Grinch, intercepted as US, allies escalate sanctions crackdown",
      "description": "A Russian oil tanker was intercepted between Spain and Morocco as western powers intensify efforts to disrupt Moscow's sanctions-evading shadow fleet operations.",
      "url": "https://www.foxnews.com/world/navy-boards-russian-oil-tanker-grinch-suspected-evading-western-sanctions",
      "published": "Thu, 22 Jan 2026 21:25:07 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "American OnlyFans star with Mexican cartel ties kidnapped at gunpoint outside mall",
      "description": "An Arizona OnlyFans star was allegedly kidnapped at gunpoint in Mexico, according to video. Nicole Pardo Molina's abduction may be linked to a cartel rivalry in Sinaloa.",
      "url": "https://www.foxnews.com/world/american-onlyfans-star-mexican-cartel-ties-kidnapped-gunpoint-mall",
      "published": "Thu, 22 Jan 2026 21:13:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters still at large after Syrian prison break, contributing to volatile security situation",
      "description": "ISIS prisoners escaped from a northeastern Syria prison, and some remain unaccounted for after chaos made tracking impossible, according to Syria analyst Nanar Hawach.",
      "url": "https://www.foxnews.com/world/isis-fighters-still-large-syrian-prison-break-contributing-volatile-security-situation",
      "published": "Thu, 22 Jan 2026 19:12:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark's prime minister insists sovereignty is non-negotiable as Trump announces Greenland deal 'framework'",
      "description": "Denmark's prime minister said she won't negotiate her nation's sovereignty after President Donald Trump said a \"framework\" on a Greenland deal was reached.",
      "url": "https://www.foxnews.com/world/denmarks-prime-minister-insists-sovereignty-non-negotiable-trump-announces-greenland-deal-framework",
      "published": "Thu, 22 Jan 2026 08:19:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US begins transferring ISIS detainees from Syria to Iraq amid security transition",
      "description": "U.S. forces moved 150 ISIS detainees from Syria to Iraq as CENTCOM began a transfer operation involving up to 7,000 radical prisoners.",
      "url": "https://www.foxnews.com/world/us-begins-transferring-isis-detainees-from-syria-iraq-amid-security-transition",
      "published": "Wed, 21 Jan 2026 14:20:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu agrees to join Trump’s Gaza Board of Peace after initial pushback",
      "description": "Israeli Prime Minister Benjamin Netanyahu said he will join President Donald Trump’s newly formed Gaza Board of Peace after initially criticizing its structure.",
      "url": "https://www.foxnews.com/world/netanyahu-agrees-join-trumps-gaza-board-peace-after-initial-pushback",
      "published": "Wed, 21 Jan 2026 03:35:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces apprehend sanctioned vessel in Caribbean maritime operation targeting illicit oil transport",
      "description": "U.S. military forces apprehended Motor Vessel Sagitta in the Caribbean as part of Operation Southern Spear targeting sanctioned tanker vessels.",
      "url": "https://www.foxnews.com/world/us-forces-apprehend-sanctioned-vessel-caribbean-maritime-operation-targeting-illicit-oil-transport",
      "published": "Tue, 20 Jan 2026 16:40:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}