{
  "last_updated": "2026-01-10T23:20:57.726076Z",
  "event_count": 222,
  "events": [
    {
      "title": "Brown University shooting videos show awareness and planning, experts say",
      "description": "Federal authorities released transcripts showing the Brown University shooter allegedly confessed to planning attack that killed two and wounded nine others.",
      "url": "https://www.foxnews.com/us/brown-university-shooting-videos-show-awareness-planning-experts-say",
      "published": "Sat, 10 Jan 2026 10:00:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 41,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: After 1,000 days of war, millions of civilians still bearing brunt",
      "description": "Aid agencies marked 1,000 days of war in Sudan on Friday with a grim reminder that the conflict has created the world’s biggest hunger crisis and largest displacement emergency. Every day, civilians have been “paying the price for a war they did not choose”, said UN aid coordination office, OCHA.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166730",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "West Bank: UN report warns of ‘systematic asphyxiation’ of Palestinian rights",
      "description": "A sweeping UN human rights report released on Wednesday concludes that in the occupied West Bank, Israel is violating international law prohibiting racial segregation and apartheid, warning that the discriminatory practices have accelerated dramatically since late 2022 amid growing violence, repression and impunity.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166716",
      "published": "Wed, 07 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s driver charged with dangerous driving after fatal crash in Nigeria",
      "description": "British boxer was injured in collision that killed his personal trainer Latif Ayodele and strength coach Sina Ghami Nigerian police have charged Anthony Joshua’s driver with causing death by dangerous driving after a fatal crash that killed two people. Adeniyi Mobolaji Kayode, 46, was also charged with driving without a valid driving licence and “driving without due care and attention, causing bodily harm and damage to property”. He is due to appear in court on 20 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/anthony-joshuas-driver-charged-with-dangerous-driving-after-fatal-crash-in-nigeria",
      "published": "Fri, 02 Jan 2026 17:54:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN human rights chief ‘deeply disturbed’ by protest-related violence",
      "description": "The UN human rights chief has called for an independent and transparent investigation into reports of deaths and widespread arrests during ongoing nationwide protests in Iran, amid mounting concerns over the use of force by security forces.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166733",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "New bushfire warnings issued in Victoria and NSW as Townsville braces for cyclone – as it happened",
      "description": "This blog is now closed. More than 100 buildings destroyed and 300,000 hectares burned as Victoria’s bushfires rage Get our breaking news email , free app or daily news podcast NSW working to send more firefighting teams to Victoria New South Wales is moving to send additional firefighting teams to Victoria after a request for assistance, the premier says. There’s over 90 firefighters from NSW in Victoria. At the moment their agencies have asked for more strike teams. My understanding is the RFS is filling those gaps as quickly as possible and sending them across the Murray. It will be an incredibly challenging day for the health system, as well as the RFS and Fire and Rescue. And we’re calling on the community to do their bit, and that means look after one enough, particularly the vulnerable, particularly the old and the young. Make sure that you look after your pets as well. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/10/australia-heatwave-updates-sydney-temperature-victorian-fires-bushfire-latest",
      "published": "Sat, 10 Jan 2026 06:09:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Armed Iran protesters battle police in Tehran streets as Trump warns of forceful US response",
      "description": "Iran protests turn more violent with 65 reportedly killed by Friday and over 2,300 arrested as authorities imposed an internet blackout amid nationwide anti-regime unrest.",
      "url": "https://www.foxnews.com/world/armed-iran-protesters-battle-police-tehran-streets-trump-warns-forceful-us-response",
      "published": "Sat, 10 Jan 2026 17:18:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Global economy shows signs of steady but subdued growth",
      "description": "The global economy has shown resilience amid turbulence during the past year, including shifting trade policies – yet growth remains subdued and far below pre-pandemic levels, the UN said in a landmark report published on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166717",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Noem praises DHS officers on Law Enforcement Appreciation Day as attacks on federal agents spike nationwide",
      "description": "Federal immigration agents face 8,000% spike in death threats as Homeland Security chief Kristi Noem praises officers on Law Enforcement Appreciation Day.",
      "url": "https://www.foxnews.com/us/noem-praises-dhs-officers-law-enforcement-appreciation-day-attacks-federal-agents-spike-nationwide",
      "published": "Fri, 09 Jan 2026 17:27:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Two weeks on, questions linger over targeting and impact of US airstrikes in Nigeria",
      "description": "Very little information has been shared about strikes in Sokoto state Two weeks after the US carried out Christmas Day airstrikes in north-west Nigeria on what it described as Islamic State fighters, questions remain over the specific group that was targeted and the operation’s impact. In the aftermath of the strikes, Donald Trump said in a post on his Truth Social platform that “ISIS Terrorist Scum in Northwest Nigeria , who have been targeting and viciously killing, primarily, innocent Christians” were hit with “numerous perfect strikes”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/questions-targeting-impact-us-airstrikes-in-nigeria",
      "published": "Thu, 08 Jan 2026 05:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Rescuers race to find dozens missing in deadly Philippines landfill collapse",
      "description": "The landslide happened when a mountain of rubbish collapsed at a landfill site in the central Philippines.",
      "url": "https://www.bbc.com/news/articles/cn42jqlqy4xo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 11:32:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Berlin blackouts cast light on infrastructure in Germany",
      "description": "An attack that knocked out power in a Berlin suburb raises concern about German infrastructure and disaster readiness. What can and should the country be doing?",
      "url": "https://www.dw.com/en/berlin-blackouts-cast-light-on-infrastructure-in-germany/a-75455870?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 17:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: US launches retaliatory strikes against Islamic State",
      "description": "Another round of US strikes has reportedly hit targets belonging to the militant Islamist group believed to be behind an attack that killed two US soldiers in Syria in December.",
      "url": "https://www.dw.com/en/syria-us-launches-retaliatory-strikes-against-islamic-state/a-75462852?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 22:41:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Dispute over investigation into Minnesota ICE killing grows",
      "description": "Protests are growing following the death of a woman who was shot by an Immigration and Customs Enforcement officer. State and and federal officials are debating how the investigation into the incident proceeds.",
      "url": "https://www.dw.com/en/dispute-over-investigation-into-minnesota-ice-killing-grows/a-75460661?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 17:10:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Anti-ICE protesters plan rallies across US after killing of Minneapolis woman",
      "description": "Activists are set to attend hundreds of rallies in cities across the US on Saturday and Sunday to protest the fatal shooting of 37-year-old Renee Good by an ICE officer in Minneapolis on Wednesday. The agent who shot Good said he acted in self-defence but local officials say footage of the incident shows Good did not pose a threat to him.",
      "url": "https://www.france24.com/en/americas/20260110-anti-ice-protesters-plan-rallies-across-us-after-killing-of-minneapolis-woman",
      "published": "Sat, 10 Jan 2026 18:15:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Aurora terrorized by Venezuelan gang as dictator Maduro let Tren de Aragua seize power",
      "description": "How government failure in Venezuelan prison system created transnational criminal organization now facing federal charges in multiple U.S. states.",
      "url": "https://www.foxnews.com/us/aurora-terrorized-venezuelan-gang-dictator-maduro-let-tren-de-aragua-seize-power",
      "published": "Sat, 10 Jan 2026 18:00:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "One dead, dozens trapped after giant landfill collapses in Philippines",
      "description": "Rescuers have pulled 12 injured sanitation workers from debris at the private landfill in Cebu City.",
      "url": "https://www.bbc.com/news/articles/c17zqz5pprwo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 09 Jan 2026 08:26:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s territorial ambition: new imperialism or a case of the emperor’s new clothes?",
      "description": "Trump’s attack on Venezuela suggests expansionism is under way but some argue it is simply standard US foreign policy stripped of hypocrisy The attack on Venezuela and the seizure of its president was a shocking enough start to 2026, but it was only the next day, when the smoke had dispersed and Donald Trump was flying from Florida to Washington DC in triumph, that it became clear the world had entered a new era. The US president was leaning on a bulkhead on Air Force One, in a charcoal suit and gold tie, regaling reporters with inside details of the abduction of Nicolás Maduro. He claimed his government was “in charge” of Venezuela and that US companies were poised to extract the country’s oil wealth. Continue reading...",
      "url": "https://www.theguardian.com/news/ng-interactive/2026/jan/10/trump-territorial-ambition-imperialism",
      "published": "Sat, 10 Jan 2026 06:00:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Australia: State of disaster declared amid Victoria fires",
      "description": "Thousands of firefighters are working to douse several bush fires that are still raging in Australia's southeast. The fires erupted as a massive heat wave gripped much of the country.",
      "url": "https://www.dw.com/en/australia-state-of-disaster-declared-amid-victoria-fires/a-75458348?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 07:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "'Nothing to Lose': Nationwide protests challenge Iran’s regime",
      "description": "Major Iranian cities were gripped overnight by new mass rallies denouncing the Islamic republic, as activists on Saturday expressed fear authorities were intensifying their suppression of the demonstrations under cover of an internet blackout. “The determination on the streets of Iran and across the country is unprecedented... this is really essentially people fighting for their lives, feeling they have nothing to lose,” said Azadeh Pourzand, Senior Fellow at the Centre for Middle East and Global Order, noting the extreme fragility of the Iranian regime.",
      "url": "https://www.france24.com/en/nothing-to-lose-nationwide-protests-challenge-iran-s-regime",
      "published": "Sat, 10 Jan 2026 15:26:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Protests roil Iran despite nationwide internet blackout",
      "description": "Protests sweeping across Iran neared the two-week mark Saturday, with the country’s government acknowledging the ongoing demonstrations despite an intensifying crackdown and as the Islamic Republic remains cut off from the rest of the world.",
      "url": "https://www.france24.com/en/protests-roil-iran-despite-nationwide-internet-blackout",
      "published": "Sat, 10 Jan 2026 10:00:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian supreme leader says protesters 'ruining their own streets' to please Trump",
      "description": "Iran reportedly cuts nationwide internet as protests intensified and President Donald Trump threatens intervention if peaceful demonstrators face violence.",
      "url": "https://www.foxnews.com/world/iranian-supreme-leader-says-protesters-ruining-own-streets-please-trump",
      "published": "Fri, 09 Jan 2026 07:37:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Donald Trump's Venezuela attack stuns Europe's far right",
      "description": "Right-wing Trump supporters in Central and Southeastern Europe have operated in a legal gray area for years. After the US's attack on Venezuela, there's a growing awareness that Trump could pose a threat to them, too.",
      "url": "https://www.dw.com/en/donald-trump-s-venezuela-attack-stuns-europe-s-far-right/a-75450701?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 11:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US carries out 'large scale' retaliation strikes against Islamic State group in Syria",
      "description": "The US carried out a fresh wave of attacks against the Islamic State group in Syria in Saturday response to a December attack by a member of the militant group that killed two US soldiers and a US civilian interpreter.",
      "url": "https://www.france24.com/en/middle-east/20260110-us-carries-out-large-scale-retaliation-strikes-against-islamic-state-group-in-syria",
      "published": "Sat, 10 Jan 2026 21:42:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Signs of life detected from rubbish avalanche which killed four",
      "description": "Signs of life have been detected by rescuers searching for more than 30 people missing after an avalanche of rubbish that left four workers dead at a landfill site in the central Philippines.",
      "url": "https://news.sky.com/story/philippines-signs-of-life-detected-from-rubbish-avalanche-which-killed-four-in-cebu-city-13492752",
      "published": "Sat, 10 Jan 2026 15:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Filipino rescuers detect 'signs of life' in deadly garbage avalanche; dozens missing",
      "description": "A Philippine official says rescuers have detected signs of life in an avalanche of garbage that killed at least four workers and left more than 30 others missing",
      "url": "https://abcnews.go.com/International/wireStory/filipino-rescuers-detect-signs-life-garbage-avalanche-killed-129078989",
      "published": "Sat, 10 Jan 2026 02:07:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Repression in Uganda, fighting in Syria’s Aleppo continues, Gaza and West Bank updates",
      "description": "The UN has raised serious concerns ahead of Uganda’s elections scheduled for 15 January, warning they will take place in an environment marked by widespread repression, intimidation and shrinking civic space.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166735",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: Increase in abductions and sexual violence ‘unacceptable’",
      "description": "Despite reductions in the overall number of conflict-related incidents in South Sudan, a rise in abductions and sexual violence is concerning, the UN peacekeeping mission in the country, UNMISS, said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166734",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Human Rights Council elects Indonesian candidate President for 2026",
      "description": "The UN Human Rights Council – the world’s principal defender of vulnerable people worldwide – has elected an Indonesian diplomat to be President for 2026 in a first for the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166720",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Attempt to overturn the Gambia’s ban on FGM heard by supreme court",
      "description": "Case brought by Muslim leaders and MP follows failed 2024 bid and seen as part of global anti-women’s rights backlash A group of religious leaders and an MP in the Gambia have launched efforts to overturn a ban on female genital mutilation at the country’s supreme court. The court case, due to resume this month, comes after two babies bled to death after undergoing FGM in the Gambia last year. Almameh Gibba, an MP and one of the plaintiffs, tabled a bill to decriminalise FGM that was rejected by the country’s parliament in 2024. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/09/the-gambia-female-genital-mutilation-fgm-supreme-court-case-overturn-ban",
      "published": "Fri, 09 Jan 2026 06:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "How does NPR report on Venezuela?",
      "description": "Eyder Peralta, NPR international correspondent, on racing to the Venezuela border after the U.S. captured Nicolás Maduro, and the obstacles keeping journalists from getting into the country.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5670254/how-does-npr-report-on-venezuela",
      "published": "Sat, 10 Jan 2026 17:01:51 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar vote a ‘facade’ to entrench military rule, independent rights expert says",
      "description": "An independent human rights expert has urged the international community to reject the electoral process organised by Myanmar’s military government, after the first round of voting revealed widespread coercion, exclusion and violence.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166729",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Fighting intensifies in Syria’s Aleppo and South Sudan’s Jonglei state, acute hunger in Niger",
      "description": "UN Secretary-General António Guterres continues to be gravely alarmed by escalating hostilities in Aleppo, Syria, and mounting reports of civilian casualties, his Spokesperson said on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166727",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s attack leaves China worried about its interests in Venezuela | Amy Hawkins",
      "description": "Maduro had just affirmed ‘strong bonds of brotherhood’ with Beijing when US made its shocking intervention Venezuela crisis – latest updates Hours before his life and the fate of his country was changed dramatically, Venezuela’s leader, Nicolás Maduro, was exchanging smiles and handshakes with a Chinese delegation in the presidential palace in Caracas. On Friday evening, shortly before he was seized by US forces , Maduro wrote on Telegram of his meeting with China’s special envoy for Latin American affairs, Qiu Xiaoqi: “A fraternal meeting that reaffirms the strong bonds of brotherhood and friendship between China and Venezuela. Through thick and thin!” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/05/venezuela-trump-attack-china-interests-analysis",
      "published": "Mon, 05 Jan 2026 15:51:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "'There wasn't even time for CPR': Iran medics describe hospitals overwhelmed with dead and injured protesters",
      "description": "Hundreds of people are believed to have been killed and injured by the security forces, with more than 70 bodies brought to one hospital.",
      "url": "https://www.bbc.com/news/articles/cj9rengvnp9o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 21:12:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Dozens arrested and one police officer injured in Minneapolis protests",
      "description": "Days after the death of Renee Good, protests continue in Minneapolis and cities across the US.",
      "url": "https://www.bbc.com/news/articles/cvgpnwnqygro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 19:56:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Swiss search souls and question government after ski resort fire",
      "description": "The New Year's Eve fire at a bar in Crans-Montana killed 40 people and injured 116.",
      "url": "https://www.bbc.com/news/articles/cpwnd22lj54o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 06:19:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Russian oil depot fire after Ukrainian drone strike - as UN to meet over hypersonic missile attack",
      "description": "A drone strike by Ukraine has caused a fire at an oil depot in Russia's southern Volgograd region, according to regional authorities.",
      "url": "https://news.sky.com/story/russian-oil-depot-fire-after-ukrainian-drone-strike-as-un-to-meet-over-hypersonic-missile-attack-13492804",
      "published": "Sat, 10 Jan 2026 16:03:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "California driver allegedly kills 2 more people while out on bail for previous fatal crash",
      "description": "A Southern California driver is accused of a fatal hit-and-run and another crash that allegedly killed a bicyclist and two others. Video evidence allegedly linked the suspect to the crashes.",
      "url": "https://www.foxnews.com/us/california-driver-allegedly-kills-2-more-people-bail-previous-fatal-crash",
      "published": "Fri, 09 Jan 2026 21:29:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran protests grow deadlier as regime internet blackout fails to stop uprising",
      "description": "Iran's anti-government protests enter day 13 with reported death toll of 51, including 9 children, as demonstrations spread nationwide against the regime.",
      "url": "https://www.foxnews.com/world/iran-protests-grow-deadlier-regime-internet-blackout-fails-stop-uprising",
      "published": "Fri, 09 Jan 2026 15:37:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "'Limited clashes' still ongoing in Aleppo neighborhood",
      "description": "Syrian security forces began deploying Saturday in a neighborhood in the northern city of Aleppo after days of intense clashes with Kurdish fighters that killed and wounded dozens. Despite the army's claims that it has assumed control of Sheikh Maqsoud, \"limited clashes\" are still ongoing, FRANCE 24's Dana Alboz said, citing local sources.",
      "url": "https://www.france24.com/en/limited-clashes-still-ongoing-in-aleppo-neighborhood",
      "published": "Sat, 10 Jan 2026 16:45:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Protests sweep Iran as authorities intensify crackdown on demonstrators",
      "description": "Protests sweeping across Iran neared the two-week mark Saturday, with the country’s government acknowledging the ongoing demonstrations despite an intensifying crackdown and as the Islamic Republic remains cut off from the rest of the world.",
      "url": "https://www.france24.com/en/protests-sweep-iran-as-authorities-intensify-crackdown-on-demonstrators",
      "published": "Sat, 10 Jan 2026 15:23:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Wildfires sweep across parts of Patagonia",
      "description": "Wildfires have swept across a popular tourist destination in the Argentine Patagonia, destroying a large area of forest, destroying properties, and forcing at least 3,000 people to flee.",
      "url": "https://news.sky.com/story/patagonia-wildfires-sweep-across-parts-of-southern-argentina-forcing-thousands-to-flee-13492731",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Mississippi man charged with murder after 6 killed in overnight shootings, including 7-year-old",
      "description": "Mississippi man facing murder charges after allegedly killing six people, including four family members, in shootings across three locations in Cedarbluff.",
      "url": "https://www.foxnews.com/us/mississippi-man-charged-murder-6-killed-overnight-shootings-including-7-year-old",
      "published": "Sat, 10 Jan 2026 08:32:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis police nowhere to be found as agitators seize control of street after ICE shooting",
      "description": "Agitators erected barricades and took control of a Minneapolis street after Wednesday's fatal ICE shooting, with no police presence observed in the area.",
      "url": "https://www.foxnews.com/us/minneapolis-police-nowhere-found-agitators-seize-control-street-after-ice-shooting",
      "published": "Sat, 10 Jan 2026 08:00:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Russia fires new ballistic missile at Ukraine, killing at least four",
      "description": "Ukrainian authorities reported multiple deaths and infrastructure damage after Russia said it deployed a new missile system in an overnight strike.",
      "url": "https://www.foxnews.com/world/russia-fires-new-ballistic-missile-ukraine-killing-least-four",
      "published": "Fri, 09 Jan 2026 03:34:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Thousands of Irish farmers protest EU’s Mercosur trade deal",
      "description": "Farmers flood the streets of Athlone to raise concerns over the trade deal's impact on Ireland's beef industry.",
      "url": "https://www.aljazeera.com/news/2026/1/10/thousands-of-irish-farmers-protest-eu-mercosur-trade-deal?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 15:54:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "The pope in a major foreign policy address blasts how countries are using force to assert dominion",
      "description": "Pope Leo XIV has denounced how nations are increasingly using force to assert their dominion worldwide",
      "url": "https://abcnews.go.com/International/wireStory/pope-major-foreign-policy-address-blasts-countries-force-129050462",
      "published": "Fri, 09 Jan 2026 07:29:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Switzerland honors victims of deadly Alpine bar fire in national day of mourning",
      "description": "Switzerland will hold a memorial service to honor the 40 people who were killed in an Alpine bar fire earlier this month during a New Year’s celebration",
      "url": "https://abcnews.go.com/International/wireStory/switzerland-honors-victims-deadly-alpine-bar-fire-national-129049512",
      "published": "Fri, 09 Jan 2026 06:55:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Fact-finding mission urges Iran to end protest violence and restore internet",
      "description": "The UN-mandated independent human rights fact-finding mission on Iran has urged authorities to immediately restore internet access and halt the violent crackdown of the ongoing, nationwide protest.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166737",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UN’s ‘responsibility to deliver’ will not waver, after US announces withdrawal from dozens of international organizations",
      "description": "Secretary-General António Guterres has expressed regret over the decision by the United States to withdraw from a number of UN entities, while underscoring that the system will continue to deliver on all its mandates.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166722",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Crowd-for-hire boss rejects Minneapolis unrest as illegal chaos",
      "description": "Crowds on Demand CEO refuses to touch Minneapolis anti-ICE demonstrations, calling roadway blocking and federal obstruction illegal after shooting.",
      "url": "https://www.foxnews.com/us/crowd-for-hire-boss-rejects-minneapolis-unrest-illegal-chaos",
      "published": "Sat, 10 Jan 2026 16:00:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump says US will take Greenland the 'easy way or hard way'",
      "description": "Donald Trump says he'd risk war with Denmark to prevent Russia or China from taking the world's biggest island.",
      "url": "https://www.dw.com/en/trump-says-us-will-take-greenland-the-easy-way-or-hard-way/a-75457869?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 00:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Cuba on edge after US captures Venezuela's Maduro",
      "description": "As US seizures of Venezuela-linked oil tankers surge, concerns grow in Cuba about whether the island’s government and economy will survive. Experts warn that a sudden halt in Venezuelan oil shipments to Cuba could lead to widespread social unrest and mass migration following the stunning US military raid that resulted in the capture of former President Nicolás Maduro. FRANCE 24's Ed Augustin reports.",
      "url": "https://www.france24.com/en/cuba-on-edge-after-us-captures-venezuela-s-maduro",
      "published": "Sat, 10 Jan 2026 13:40:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "At the heart of change: Spotlight Initiative highlights breakthroughs in tackling gender-based violence",
      "description": "When it comes to protecting women and girls from gender-based violence, change happens when they are “at the heart of every decision,” according to Erin Kenny, Global Coordinator of the Spotlight Initiative a United Nations–European Union partnership aimed at tackling all forms of abuse against women and girls.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166721",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "US warns Americans to leave Venezuela immediately as armed militias set up roadblocks",
      "description": "U.S. government issues urgent security alert for Americans in Venezuela to leave immediately due to safety concerns and inability to provide continued assistance.",
      "url": "https://www.foxnews.com/world/us-warns-americans-leave-venezuela-immediately-armed-militias-set-up-roadblocks",
      "published": "Sat, 10 Jan 2026 17:00:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Iranian hospitals overwhelmed with injuries as protests rage across Islamic Republic",
      "description": "Iranian hospitals are reportedly overwhelmed as anti-government protests rage, with doctors treating gunshot wounds to heads and eyes amid nationwide unrest.",
      "url": "https://www.foxnews.com/world/iranian-hospitals-overwhelmed-injuries-protests-rage-across-islamic-republic",
      "published": "Sat, 10 Jan 2026 15:00:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "EU states back controversial Mercosur deal with Latin American countries",
      "description": "Agreement after 25 years of negotiations prompts farmers to block roads in Paris, Brussels and Warsaw European Union member states have backed the biggest ever free trade agreement with a group of Latin American countries, ending 25 years of negotiations but stoking further tensions with farmers and environmentalists around the bloc. The contentious Mercosur deal with Argentina, Brazil, Paraguay and Uruguay prompted immediate protests in Poland, France, Greece and Belgium, with farmers blocking key roads in Paris, Brussels and Warsaw. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/09/eu-states-back-controversial-mercosur-deal-with-latin-american-countries",
      "published": "Fri, 09 Jan 2026 17:27:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US launches new retaliatory strikes against ISIS in Syria after deadly ambush",
      "description": "The U.S. has launched another round of strikes against the Islamic State in Syria. This follows last month's ambush that killed two U.S. soldiers and an American civilian interpreter.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5673346/us-syria-isis-retaliatory-strikes",
      "published": "Sat, 10 Jan 2026 17:03:25 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "A German entrepreneur sees opportunity in Venezuela's crisis",
      "description": "Thilo Schmitz has spent three decades in Caracas, living through Venezuela's volatile recent history. Following the US attack, the entrepreneur is seeking to find a new opportunity in the resulting power shift.",
      "url": "https://www.dw.com/en/a-german-entrepreneur-sees-opportunity-in-venezuela-s-crisis/a-75453304?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 09:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US balks as UK, France pledge troops to postwar Ukraine",
      "description": "Even as France and the UK offer a written commitment to Ukraine to deploy troops in the event of a peace deal, doubts remain whether the US will back those troops in case they come under a Russian attack.",
      "url": "https://www.dw.com/en/us-balks-as-uk-france-pledge-troops-to-postwar-ukraine/a-75450578?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 06:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Musk's Grok under fire for generating sexualized images",
      "description": "European officials and tech campaigners on Friday slammed Elon Musk's AI chatbot Grok after its controversial image creation feature was restricted to paying subscribers, saying the change failed to address concerns about sexualized deepfakes. Grok has faced global backlash after it emerged the feature allowed users to sexualize images of women and children using simple text prompts such as \"put her in a bikini\" or \"remove her clothes.\"",
      "url": "https://www.france24.com/en/musk-s-grok-under-fire-for-generating-sexualized-images",
      "published": "Sat, 10 Jan 2026 10:25:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Who is the exiled crown prince positioning himself as a key figure in Iran's future after decades away?",
      "description": "As Iran's leaders confront a serious challenge to their authority in the form of nationwide anti-government protests, the country's exiled crown prince is trying to position himself as a key figure in his homeland's future.",
      "url": "https://news.sky.com/story/reza-pahlavi-who-is-the-exiled-crown-prince-positioning-himself-as-a-key-figure-in-irans-future-after-decades-away-13492713",
      "published": "Sat, 10 Jan 2026 08:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Massive overnight attack leaves millions in the dark",
      "description": "UN agencies are supporting efforts on Friday to keep energy services up and running in Ukraine, and families warm amid freezing winter temperatures, following a large-scale overnight attack.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166732",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Police arrest surgeon ex-husband of Ohio woman slain alongside dentist husband in double murder, records show",
      "description": "Ex-husband arrested in double murder of Ohio dentist and wife in Columbus home. Michael McKee charged in shooting deaths of Spencer and Monique Tepe.",
      "url": "https://www.foxnews.com/us/police-arrest-ex-husband-ohio-woman-slain-alongside-dentist-husband-double-murder-records-show",
      "published": "Sat, 10 Jan 2026 14:09:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Preliminary autopsy reveals possible cause of death for missing 4-year-old Alabama boy Johnathan Boley",
      "description": "Preliminary autopsy findings reveal possible cause of death for 4-year-old Johnathan Boley who disappeared on New Year's Eve in rural Alabama community.",
      "url": "https://www.foxnews.com/us/preliminary-autopsy-reveals-possible-cause-death-missing-4-year-old-alabama-boy-johnathan-boley",
      "published": "Fri, 09 Jan 2026 21:59:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "A human rights expert explains the status of human rights under the Maduro regime",
      "description": "NPR's Scott Simon speaks with Ofelia Riquezes, human rights lawyer and professor at Florida International University, about the status of human rights under the Maduro regime in Venezuela.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5671166/a-human-rights-expert-explains-the-status-of-human-rights-under-the-maduro-regime",
      "published": "Sat, 10 Jan 2026 07:43:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Germany news: Snowstorm moves south after blanketing north",
      "description": "The snowy weather is heading south after causing severe disruption in the north. Meanwhile, several rallies are to take place in Germany's capital, Berlin, in support of anti-government protests in Iran. DW has more.",
      "url": "https://www.dw.com/en/germany-news-snowstorm-moves-south-after-blanketing-north/live-75458964?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 09:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran: Protests continue amid internet shutdown",
      "description": "Mass protests over the dire economic situation in Iran continue to grow across the country. Iranian authorities have imposed an internet blackout in a bid to quell the unrest. DW has more.",
      "url": "https://www.dw.com/en/iran-protests-continue-amid-internet-shutdown/live-75453936?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 03:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "What the US withdrawal from UN bodies could mean for climate, trade and development",
      "description": "The United States’ intention to withdraw from a host of UN bodies announced this week targets programmes and initiatives focusing on a wide range of crucial areas, including the climate crisis, trade, gender and development.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166736",
      "published": "Fri, 09 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "What does the US raid in Venezuela mean for China’s designs on Taiwan?",
      "description": "Perception that Chinese-made weapons could not stop a ‘decapitation strike’ may give Beijing pause for thought The sight of a hostile regional superpower launching an overnight raid to depose the leader of a smaller neighbouring country could easily have sent pulses in Taiwan racing. The US on Saturday revealed the details of a surprise raid to capture Venezuela’s leader, Nicolás Maduro , who was whisked away to the US, where he was frogmarched into a court in New York on Monday . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/06/what-us-action-in-venezuela-means-for-taiwan",
      "published": "Tue, 06 Jan 2026 01:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump presses top oil executives to invest in Venezuela's reserves",
      "description": "US President Donald Trump pressed top oil executives to invest in Venezuela's reserves at a White House meeting on Friday, but was met with a cautious reception -- with ExxonMobil chief executive Darren Woods dismissing the country as \"uninvestable\" without sweeping reforms.",
      "url": "https://www.france24.com/en/trump-presses-top-oil-executives-to-invest-in-venezuela-s-reserves",
      "published": "Sat, 10 Jan 2026 15:20:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ukrainian drones targeting energy infrastructure spark fire in Russian oil depot",
      "description": "A Ukrainian drone attack sparked a fire in southern Russia, local authorities said on Saturday, as Kyiv continues to target Russian energy sites in a bid to deprive Moscow of oil revenue. The Ukrainian attack came one day after Russia fired a powerful hypersonic missile at Western Ukraine.",
      "url": "https://www.france24.com/en/europe/20260110-ukrainian-drones-targeting-energy-infrastructure-spark-fire-in-russian-oil-depot",
      "published": "Sat, 10 Jan 2026 13:58:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Crime reporter killed in Mexico's Veracruz state",
      "description": "A reporter covering crime in Mexico’s Gulf coast state of Veracruz has been killed in Poza Rica",
      "url": "https://abcnews.go.com/International/wireStory/crime-reporter-killed-mexicos-veracruz-state-129046126",
      "published": "Thu, 08 Jan 2026 23:45:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Iraq ‘unrecognisable and remarkable’ after years of conflict: UN coordinator",
      "description": "Some two decades after a shaky political transition, Iraq today is a country “at peace, with increased security and a clear determination to win the battle of development,” says the UN resident coordinator for Iraq on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166718",
      "published": "Wed, 07 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "DAVID MARCUS: FBI must not let ICE agent become the next Derek Chauvin",
      "description": "Minneapolis leaders allegedly rush to judgment on ICE agent shooting, drawing comparisons to Derek Chauvin case and calls for federal protection.",
      "url": "https://www.foxnews.com/us/david-marcus-fbi-must-not-let-ice-agent-become-next-derek-chauvin",
      "published": "Sat, 10 Jan 2026 06:29:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Iran regime cuts nationwide internet access as protests claim 44 lives across major cities",
      "description": "Iranian protests sparked by a currency collapse evolved into a broader uprising demanding regime overthrow, with demonstrators torching government buildings across provinces.",
      "url": "https://www.foxnews.com/world/iran-regime-cuts-nationwide-internet-access-protests-claim-44-lives-across-major-cities",
      "published": "Thu, 08 Jan 2026 19:34:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Video emerges of Minneapolis shooting filmed by ICE agent who opened fire",
      "description": "The clip shows the moments before gunfire rang out on a Minneapolis street.",
      "url": "https://www.bbc.com/news/articles/cz7yv4524gqo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 14:42:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Night of Swiss ski bar fire 'apocalyptic', woman tells Crans-Montana memorial",
      "description": "A woman named Marie who was in a bar opposite Le Constellation helped the injured as they ran from the flames.",
      "url": "https://www.bbc.com/news/articles/cn7jxm7jkg1o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 03:31:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump claims he has cancelled second wave of attacks on Venezuela",
      "description": "US president does not elaborate on alleged plan for fresh strikes but says large naval presence in region will remain US politics live – latest updates Donald Trump has claimed that he cancelled a second wave of attacks on Venezuela because it was cooperating with the US on oil infrastructure and had released political prisoners. The US president said he had cancelled planned military action in recognition that the authorities in Caracas had released “large numbers” of prisoners and were “seeking peace”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/09/trump-venezuela-leadership-meeting-opposition-machado",
      "published": "Fri, 09 Jan 2026 20:49:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Australia’s Cop31 chief negotiator plans to lobby petrostates on fossil fuel phaseout",
      "description": "Exclusive: Chris Bowen says key to next UN climate summit will be ‘engagement, engagement, engagement’ with countries such as Saudi Arabia Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Chris Bowen wants to use his stint as the world’s chief climate negotiator to lobby Saudi Arabia and others to stop resisting progress at UN summits, heeding calls for a “hard-nosed” approach in dealing with big emitters obstructing the transition. Appointed “president of negotiations” for Cop31 under the deal that handed Turkey hosting rights for the conference, Australia’s climate change and energy minister has told Guardian Australia a focus ahead of the summit would be talking to countries “with whom we don’t traditionally agree”. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/11/australia-cop31-chris-bowen-fossil-fuel-phaseout",
      "published": "Sat, 10 Jan 2026 19:00:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Who is Reza Pahlavi, the exiled Crown Prince encouraging demonstrations across Iran?",
      "description": "In exile for nearly 50 years, Iran's Crown Prince Reza Pahlavi has issued calls urging Iranians to join protests sweeping the country. But support for him may not be clear cut.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5673238/reza-pahlavi-iran-protests",
      "published": "Sat, 10 Jan 2026 17:10:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US: Hundreds of rallies held over ICE shootings",
      "description": "Protests over the killing of Renee Good are taking place across the US. The Trump administration says the gay mom was a dangerous far-left radical, citizens say agents are trigger happy goons. DW has the latest.",
      "url": "https://www.dw.com/en/us-hundreds-of-rallies-held-over-ice-shootings/live-75462489?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 23:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Venezuela, Greenland, Ukraine: Germany's Merz in crisis mode",
      "description": "With foreign policy turbulence, a blackout in Berlin and a high-profile personnel rejig in the Chancellery, 2026 is off to a stormy start for Friedrich Merz.",
      "url": "https://www.dw.com/en/venezuela-greenland-ukraine-germany-s-merz-in-crisis-mode/a-75452671?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 19:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Maduro supporters rally as Trump signs order protecting US-held revenue from Venezuelan oil",
      "description": "Supporters of Venezuela's ousted leader Nicolas Maduro protested in Caracas on Saturday one week after his shock capture by US forces. Meanwhile US President Donald Trump signed an emergency executive order to protect US-held revenues derived from sales of Venezuelan oil, preventing them from being seized by courts or creditors, the White House said.",
      "url": "https://www.france24.com/en/americas/20260110-maduro-supporters-rally-as-trump-signs-order-protecting-us-held-revenue-from-venezuelan-oil",
      "published": "Sat, 10 Jan 2026 21:19:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran’s Revolutionary Guards declare 'red line' on security as protests escalate",
      "description": "Iranian protesters took to the steets once again on Saturday night shouting anti-government chants as Iran's Revolutionary Guards warned that safeguarding security was a \"red line\" and the military vowed to \"vigorously protect\" the nation against those \"seeking to disrupt order and peace\".",
      "url": "https://www.france24.com/en/middle-east/20260110-iran-s-revolutionary-guards-declare-red-line-on-security-as-protests-mount",
      "published": "Sat, 10 Jan 2026 11:18:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukrainian drones set fire to Russian oil depot after Moscow launches new missile",
      "description": "A Ukrainian drone strike has sparked a fire at an oil depot in Russia's Volgograd region, according to regional authorities",
      "url": "https://abcnews.go.com/International/wireStory/ukrainian-drones-set-fire-russian-oil-depot-after-129080295",
      "published": "Sat, 10 Jan 2026 07:21:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Columbus police chief responds to 'disturbing' murder mystery of Ohio dentist, wife found shot in home",
      "description": "Columbus' police chief calls the dentist murder case \"disturbing\" as the investigation continues into the deaths of Spencer and Monique Tepe, who were found shot in their home.",
      "url": "https://www.foxnews.com/us/columbus-police-chief-responds-disturbing-murder-mystery-ohio-dentist-wife-found-shot-home",
      "published": "Sat, 10 Jan 2026 13:08:08 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Border Patrol agent hugs protester in heartwarming moment caught on video during Minnesota operation",
      "description": "A Border Patrol agent and a protester shared a hug that was caught on camera after they discovered shared service during immigration protests.",
      "url": "https://www.foxnews.com/us/border-patrol-agent-hugs-protester-heartwarming-moment-caught-video-during-minnesota-operation",
      "published": "Fri, 09 Jan 2026 18:23:21 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Fox News True Crime Newsletter: Ohio dentist murders, Kohberger sister's warning, 'Torso Killer' confession",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-ohio-dentist-murders-kohberger-sisters-warning-torso-killer-confession",
      "published": "Fri, 09 Jan 2026 16:00:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russia fires new hypersonic missile in massive Ukraine attack, Kremlin says",
      "description": "Russia fired a hypersonic Oreshnik missile at Ukraine in retaliation for an alleged attack on one of Putin's residences that the U.S. and Ukraine have denied.",
      "url": "https://www.foxnews.com/world/russia-fires-new-hypersonic-missile-massive-ukraine-attack-kremlin-says",
      "published": "Fri, 09 Jan 2026 11:23:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Anger in Papua New Guinea after Starlink ordered to shut down internet services",
      "description": "In mid-December PNG said the company did not have a licence to operate in the country and ordered it to halt operations Frustration is growing in Papua New Guinea weeks after the government ordered Starlink to shut down operations in the country as businesses, health providers and communities struggle without access to internet services. Starlink, owned by Elon Musk’s SpaceX, is a satellite internet company that provides internet to remote places. In mid-December, the National Information and Communications Technology Authority (Nicta) ordered the company to halt operations because it was not licensed in PNG. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/06/papua-new-guinea-internet-starlink-shut-down",
      "published": "Tue, 06 Jan 2026 02:50:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "‘We are not free yet’: Venezuelan exiles react a week after Maduro’s capture",
      "description": "Across Europe, the United States and Latin America, Venezuelan exiles contacted by FRANCE 24 expressed a mix of relief, joy and deep uncertainty. While most welcomed Nicolas Maduro’s removal, few believe it marks the end of Venezuela’s crisis.",
      "url": "https://www.france24.com/en/americas/20260110-we-are-not-free-yet-venezuelan-exiles-react-a-week-after-maduro-s-capture",
      "published": "Sat, 10 Jan 2026 11:15:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Chinese, Russian and Iranian warships arrive in South Africa for naval drills as tensions run high",
      "description": "Chinese, Russian and Iranian warships are in South African waters for a week of naval drills as geopolitical tensions run high over the United States’ intervention in Venezuela",
      "url": "https://abcnews.go.com/International/wireStory/chinese-russian-iranian-warships-arrive-south-africa-naval-129052438",
      "published": "Fri, 09 Jan 2026 08:09:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Idaho murder victims’ families file wrongful death lawsuit against Washington State University",
      "description": "Civil lawsuit claims Idaho murders were \"foreseeable and preventable\" as families seek damages from Washington State University over Kohberger case.",
      "url": "https://www.foxnews.com/us/idaho-murder-victims-families-file-wrongful-death-lawsuit-against-washington-state-university",
      "published": "Fri, 09 Jan 2026 16:50:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "How Trump & Co sold the attack on Venezuela",
      "description": "The media reportage of the US attack on Venezuela is telling, from the Trumpian language to predictable narratives.",
      "url": "https://www.aljazeera.com/video/the-listening-post/2026/1/10/how-trump-co-sold-the-attack-on-venezuela?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 14:54:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "‘We do not want to be Americans’: Greenland parties reject Trump’s threats",
      "description": "Statement by five political parties elected to Greenland parliament says island's future must be decided by its people.",
      "url": "https://www.aljazeera.com/news/2026/1/10/we-do-not-want-to-be-americans-greenland-parties-reject-trumps-threats?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 13:49:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Lynne and Peter return to find their house still standing but others left devastated after Harcourt bushfire",
      "description": "Dozens of properties including some owned by firefighters and local councillors destroyed in fire that ripped through Victorian town Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Peter Suelzle holds up the brass house numbers that were once attached to the gate post of his home on Coolstore Road in Harcourt. The post has been incinerated by the fire that ripped through the Victorian town the night before, but miraculously the home he shares with his mother and his wife, Lynne, still stands. All around the house, right up to the brick perimeter, the bushes and trees he planted are still smoking. The sheds are buckled, their contents reduced to toxic rubble. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/10/harcourt-victorian-bushfires-homes-property",
      "published": "Sat, 10 Jan 2026 05:59:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Greenlanders voice concern after Trump reiterates goal to own island",
      "description": "Greenlanders are voicing concern after US President Donald Trump on Friday again suggested the use of force to seize Greenland as he brushed aside Denmark's sovereignty over the autonomous Arctic island. Denmark and other European allies have voiced shock at Trump's threats to take control of Greenland, where the United States already has a military base.",
      "url": "https://www.france24.com/en/greenlanders-voice-concern-after-trump-reiterates-goal-to-own-island",
      "published": "Sat, 10 Jan 2026 10:03:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "US 'ready to help' Iranian protesters, Trump says",
      "description": "The US 'stands ready to help' Iranian protesters, Donald Trump has said, as demonstrations across the country enter their third week.",
      "url": "https://news.sky.com/story/iranian-protesters-to-be-charged-as-enemies-of-god-prosecutor-general-threatens-with-around-100-reportedly-arrested-13492803",
      "published": "Sat, 10 Jan 2026 16:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "ICE officer who shot Minnesota woman was dragged by car of illegal alien sex offender months earlier",
      "description": "The ICE officer who fatally shot Renee Nicole Good was allegedly dragged 50 yards by illegal immigrant's car months earlier, reports indicate.",
      "url": "https://www.foxnews.com/us/ice-officer-who-shot-minnesota-woman-dragged-car-illegal-alien-sex-offender-months-earlier",
      "published": "Sat, 10 Jan 2026 11:58:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Rare first Superman comic once stolen from Nicolas Cage sells for $15m",
      "description": "Fewer than 100 copies of Action Comics No 1, which introduced the world to Superman, are thought to exist.",
      "url": "https://www.bbc.com/news/articles/cly95lpwl1ro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 16:06:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US seizes fifth oil tanker linked to Venezuela, officials say",
      "description": "The tanker, the Olina, is on multiple countries' sanctions list and is \"suspected of carrying embargoed oil\", US officials say.",
      "url": "https://www.bbc.com/news/articles/cdxj28xd542o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 09 Jan 2026 18:09:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cremation pyre in Africa thought to be world’s oldest containing adult remains",
      "description": "9,500-year-old pyre uncovered in Malawi offers rare insight into rituals of ancient African hunter-gatherer groups A cremation pyre built about 9,500 years ago has been discovered in Africa, offering a fresh glimpse into the complexity of ancient hunter-gatherer communities. Researchers say the pyre, discovered in a rock shelter at the foot of Mount Hora in northern Malawi, is thought to be the oldest in the world to contain adult remains, the oldest confirmed intentional cremation in Africa, and the first pyre to be associated with African hunter-gatherers. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/01/cremation-pyre-in-africa-thought-to-be-worlds-oldest-containing-adult-remains",
      "published": "Thu, 01 Jan 2026 19:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Alleged scam kingpin Chen Zhi arrives in China after extradition from Cambodia",
      "description": "Chen founded multinational conglomerate Prince Group that US says is front for multibillion-dollar fraud operation Chinese television has shown footage of the US-indicted tycoon Chen Zhi being escorted by armed police after his extradition to China from Cambodia, where authorities on Thursday ordered the liquidation of a bank he founded linked to a massive “scam centre” network. Chen, who chairs a conglomerate the US says is a front for a multibillion-dollar online fraud operation, was shown in handcuffs and hooded as he was led off a plane at a Beijing airport by black-clad Swat officers, with the state broadcaster CCTV describing him as the “leader of a major transnational gambling and fraud crime syndicate”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/alleged-scam-kingpin-chen-zhi-extradited-china-cambodia-arrest",
      "published": "Thu, 08 Jan 2026 14:28:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian drones set fire to Russian oil depot after Moscow launches new hypersonic missile",
      "description": "The strike comes a day after Russia bombarded Ukraine with hundreds of drones and dozens of missiles, including a powerful new hypersonic missile that hit western Ukraine.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5673211/oil-depot-strike-russia-ukraine",
      "published": "Sat, 10 Jan 2026 11:30:15 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Comic book copy introducing Superman sells for $15 million",
      "description": "A rare copy of the comic book that introduced the world to Superman and also was once stolen from the home of actor Nicolas Cage has been sold for a record $15 million. The private deal for “Action Comics No. 1” was announced Friday. It eclipses the previous record price for a comic book, set last November when a copy of “Superman No. 1″ was at sold at auction for $9.12 million.",
      "url": "https://www.france24.com/en/comic-book-copy-introducing-superman-sells-for-15-million",
      "published": "Sat, 10 Jan 2026 10:48:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Russia's use of hypersonic missile brings fresh threat to Europe and NATO",
      "description": "Russia's inclusion of the Oreshnik intermediate-range ballistic missile (IRBM) in its latest missile and drone strikes on Ukraine has drawn attention well beyond the immediate battlefield - raising urgent questions about the wider security implications for Europe and NATO alike.",
      "url": "https://news.sky.com/story/russias-use-of-hypersonic-missile-brings-fresh-threat-to-europe-and-nato-13492571",
      "published": "Sat, 10 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Protests in Iran near 2-week mark as authorities intensify crackdown on demonstrators",
      "description": "Protests in Iran have continued for nearly two weeks, with the government acknowledging the unrest despite a harsh crackdown",
      "url": "https://abcnews.go.com/International/wireStory/protests-iran-2-week-mark-authorities-intensify-crackdown-129079693",
      "published": "Sat, 10 Jan 2026 10:26:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US military strikes Islamic State group targets in Syria, officials say",
      "description": "US President Donald Trump ordered the \"large-scale strikes\" on Saturday, US Central Command announced.",
      "url": "https://www.bbc.com/news/articles/cly9597r4qpo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 22:21:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie's family accuse hospital of negligence over son's death",
      "description": "A hospital in Lagos denies medical negligence over the death of Chimamanda Ngozi Adichie's 21-month-old.",
      "url": "https://www.bbc.com/news/articles/c0lx09e618yo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 22:25:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Colombia sees 'real threat' of US military action, president tells BBC",
      "description": "Gustavo Petro tells the BBC's Ione Wells that the United States is treating other nations as part of a US \"empire\", after Trump threatened Colombia with military action.",
      "url": "https://www.bbc.com/news/articles/cwygjvkvpgro?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 09 Jan 2026 06:02:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "SA premier denies pressuring Adelaide festival to drop Randa Abdel-Fattah",
      "description": "Letter from 11 South Australian cultural leaders labels cancellation of Palestinian-Australian’s participation a ‘grave mistake’ which brought festival into disrepute Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The South Australian premier has denied exerting pressure on the Adelaide festival board to disinvite Randa Abdel-Fattah as a speaker at Adelaide writers’ week, while reiterating that he agreed with the decision. The board dumped the Palestinian Australian academic as a speaker on Thursday, citing “cultural sensitivity” after the Bondi attack. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/10/sa-premier-denies-pressuring-adelaide-festival-to-drop-randa-abdel-fattah-ntwnfb",
      "published": "Sat, 10 Jan 2026 05:31:45 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Britain executed Ruth Ellis in 1955. Now her granddaughter wants justice",
      "description": "In 1955, Ruth Ellis was hanged for killing her abusive partner. Her case became one of the catalysts for abolishing the death penalty in the UK, and 70 years later her family is seeking a posthumous pardon.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5437767/britain-executed-ruth-ellis-in-1955-now-her-granddaughter-wants-justice",
      "published": "Sat, 10 Jan 2026 17:01:43 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why is Russia reserved in its response to the U.S. attack on Venezuela?",
      "description": "Despite a close relationship with Caracas stretching back for decades, Russia has been reserved in its response to the U.S. attack on Venezuela.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5670296/why-is-russia-reserved-in-its-response-to-the-u-s-attack-on-venezuela",
      "published": "Sat, 10 Jan 2026 07:43:07 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US military carries out large-scale strikes against ISIS targets across Syria",
      "description": "The US military has ​carried out multiple strikes ​in ​Syria targeting the Islamic State militant group.",
      "url": "https://news.sky.com/story/us-military-carries-out-large-scale-strikes-against-isis-across-syria-13491264",
      "published": "Tue, 06 Jan 2026 18:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "EU leaders visit Syria and pledge support for recovery after years of civil war",
      "description": "Top European Union officials have visited Syria for the first time to meet with interim President Ahmad al-Sharaa",
      "url": "https://abcnews.go.com/International/wireStory/eu-leaders-visit-syria-pledge-support-recovery-after-129049816",
      "published": "Fri, 09 Jan 2026 06:41:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria signals renewed cooperation on chemical weapons destruction",
      "description": "Progress continues to be made towards eliminating remnants of the chemical weapons programme in Syria that was developed under the Assad regime, the UN Security Council heard on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166724",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria: Aleppo fighting leaves civilians dead, displaces thousands",
      "description": "At least five civilians have been killed and some 30,000 people displaced following renewed fighting in Aleppo, Syria, prompting calls from the UN for immediate de-escalation and a return to political talks.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166719",
      "published": "Wed, 07 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Drones, fear and exhaustion: The daily reality of providing aid to Ukraine",
      "description": "Almost four years since Russia’s full-scale invasion of Ukraine, aid teams continue to adapt to the lethal reality of working in a modern war zone.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166714",
      "published": "Wed, 07 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US military launches airstrikes against ISIS targets in Syria, officials say",
      "description": "U.S. officials confirmed to Fox News on Saturday that the U.S. military has launched airstrikes against the Islamic State (ISIS) in Syria.",
      "url": "https://www.foxnews.com/us/us-military-launches-airstrikes-against-isis-targets-syria-officials-say",
      "published": "Sat, 10 Jan 2026 15:17:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Times Square Killer' used fake police badge to murder 18-year-old nursing student: deathbed confession",
      "description": "Serial killer Richard Cottingham confessed to the 1965 murder of nursing student Alys Eberhardt in a deathbed admission, solving a 60-year-old cold case.",
      "url": "https://www.foxnews.com/us/times-square-killer-used-fake-police-badge-murder-18-year-old-nursing-student-deathbed-confession",
      "published": "Sat, 10 Jan 2026 14:00:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Portland police chief cries while admitting DHS was right about Tren de Aragua ties in CBP shooting",
      "description": "Portland Police Chief Bob Day tearfully confirms two individuals shot during immigration enforcement have suspected ties to Venezuelan gang Tren de Aragua.",
      "url": "https://www.foxnews.com/us/portland-police-chief-cries-admitting-dhs-right-tren-de-aragua-ties-cbp-shooting",
      "published": "Sat, 10 Jan 2026 10:54:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Middle Eastern country stops sponsoring students studying in Britain over fear of radicalization: report",
      "description": "UAE stops funding students to study in Britain, claiming fears of radicalization by Muslim Brotherhood. The nation will sponsor education elsewhere.",
      "url": "https://www.foxnews.com/us/middle-eastern-country-stops-sponsoring-students-studying-britain-over-fear-radicalization-report",
      "published": "Sat, 10 Jan 2026 09:00:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump discusses whether he'd order a mission to capture Putin",
      "description": "President Donald Trump dismisses the idea of capturing Vladimir Putin, saying he's \"disappointed\" the Russia-Ukraine war remains without a resolution.",
      "url": "https://www.foxnews.com/world/trump-answers-whether-hed-order-mission-capture-putin",
      "published": "Sat, 10 Jan 2026 14:49:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Socialist dictator Maduro gone, but Venezuelans remain wary after years of oppression",
      "description": "Venezuelan citizens express cautious relief after Nicolas Maduro was ousted and taken to New York to face trial, ending years of controversial socialist rule.",
      "url": "https://www.foxnews.com/world/socialist-dictator-maduro-gone-venezuelans-remain-wary-after-years-oppression",
      "published": "Sat, 10 Jan 2026 06:00:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia warns Western forces in Ukraine would be considered 'legitimate combat targets'",
      "description": "Russia warns Western forces deployed to Ukraine under postwar security deal would be \"legitimate combat targets\" as diplomatic tensions escalate.",
      "url": "https://www.foxnews.com/world/russia-warns-western-forces-ukraine-would-considered-legitimate-combat-targets",
      "published": "Thu, 08 Jan 2026 12:55:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yemeni gov’t says southern areas ‘recaptured’ from separatist STC",
      "description": "Rashad al-Alimi says government forces have retaken Hadramout and al-Mahra provinces from Southern Transitional Council.",
      "url": "https://www.aljazeera.com/news/2026/1/10/thousands-of-supporters-of-yemens-separatist-stc-rally-in-aden?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 17:18:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Protester scales Iranian Embassy in London, tears down regime flag, hoists pre-revolution symbol",
      "description": "Dramatic scenes in London as protester reportedly scales Iran's embassy, tears down regime flag and replaces it with pre-1979 one.",
      "url": "https://www.foxnews.com/world/protester-scales-iranian-embassy-in-london-tears-down-regime-flag-hoists-pre-revolution-symbol",
      "published": "Sat, 10 Jan 2026 17:03:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump seeks $100bn for Venezuela oil, but Exxon boss says country 'uninvestable'",
      "description": "Oil executives expressed caution, with one executive saying Venezuela had seized their assets twice.",
      "url": "https://www.bbc.com/news/articles/c205dx61x76o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 20:28:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump promises oil companies ‘total safety’ in Venezuela as he urges them to invest billions",
      "description": "Country is ‘uninvestable’ today, president told, but CEOs signal they are ready to spend with support Donald Trump promised oil giants “total safety, total security” in Venezuela in an effort to persuade them to invest $100bn in the country’s infrastructure after US forces toppled Nicolás Maduro from power. At a roundtable press conference at the White House on Friday afternoon with more than a dozen oil executives, including leaders from Chevron, ExxonMobil and ConocoPhilips, the US president doubled down on claims that Maduro’s arrest presents American oil companies with an unprecedented opportunity for extraction. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/09/trump-oil-company-executives-meeting-venezuela",
      "published": "Fri, 09 Jan 2026 22:07:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Indonesia blocks Musk’s Grok chatbot due to risk of pornographic content",
      "description": "Move comes after governments and regulators from Europe to Asia have condemned the AI tool and some have opened inquiries into sexualised content Indonesia temporarily blocked Elon Musk’s Grok chatbot on Saturday due to the risk of AI-generated pornographic content, becoming the first country to deny access to the AI tool. The move comes after governments, researchers and regulators from Europe to Asia have condemned and some have opened inquiries into sexualised content on the app. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/10/indonesia-blocks-musks-grok-chatbot-due-to-risk-of-pornographic-content",
      "published": "Sat, 10 Jan 2026 07:52:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US attempts to paint Nicolas Maduro as a drug baron",
      "description": "For years, Venezuela's leader ruled with an iron fist. Maduro persecuted opposition figures and rigged elections, sought confrontation with the US and ran his country into the ground. But is he also a drug dealer?",
      "url": "https://www.dw.com/en/us-attempts-to-paint-nicolas-maduro-as-a-drug-baron/a-75412549?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 17:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Filipino Catholics express outrage over corruption scandal during massive religious procession",
      "description": "A massive crowd of mostly barefoot Filipino Catholics is joining an annual procession of a centuries-old statue of Jesus Christ in the Philippine capital, with some using the gathering to express outrage over a corruption scandal involving influential ...",
      "url": "https://abcnews.go.com/International/wireStory/filipino-catholics-express-outrage-corruption-scandal-massive-religious-129045907",
      "published": "Fri, 09 Jan 2026 02:33:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Russia hits Ukraine with rarely used Oreshnik missile in fresh strikes",
      "description": "It is only the second time Moscow has deployed the hypersonic ballistic missile, which was first used to hit Dnipro in November.",
      "url": "https://www.bbc.com/news/articles/cgqe9kv9xxvo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 09 Jan 2026 11:26:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Colombia’s Petro on US threats and whether he fears Maduro’s fate",
      "description": "Colombia’s president responds to US pressure and what it means for sovereignty and stability in Latin America.",
      "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2026/1/10/colombias-petro-on-us-threats-and-whether-he-fears-maduros-fate?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 21:40:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘We have to stand up’: ICE killing in Minneapolis sparks protests across US",
      "description": "Protesters demand justice for Renee Nicole Good, a mother of three shot dead by an ICE agent in Minneapolis this week.",
      "url": "https://www.aljazeera.com/news/2026/1/10/we-have-to-stand-up-ice-killing-in-minneapolis-sparks-protests-across-us?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 19:04:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Milano Cortina Winter Olympics threatened by Cloudflare funding withdrawal",
      "description": "Cloudflare CEO threatens withdrawal of Milano Cortina Olympics funding following fine by Italy communications watchdog.",
      "url": "https://www.aljazeera.com/sports/2026/1/10/milano-cortina-winter-olympics-threatened-by-cloudfare-funding-withdrawal?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 15:49:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Why the once loyal bazaar merchants are now protesting in Iran",
      "description": "Two decades of economic changes have eroded the bazaar's economic power and political sway in Tehran.",
      "url": "https://www.aljazeera.com/opinions/2026/1/10/why-the-once-loyal-bazaar-merchants-are-now-protesting-in-iran?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 14:10:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US ‘adapt, shrink or die’ terms for $2bn aid pot will mean UN bowing down to Washington, say experts",
      "description": "Afghanistan and Yemen excluded from list of 17 priority countries chosen by Trump administration to receive aid laden with demands The $2bn (£1.5bn) of aid the US pledged this week may have been hailed as “bold and ambitious” by the UN but could be the “nail in the coffin” in changing to a shrunken, less flexible aid system dominated by Washington’s political priorities, aid experts fear. After a year of deep cuts in aid budgets by the US and European countries, the announcement of new money for the humanitarian system is a source of some relief, but experts are deeply concerned about demands that the US has imposed on how the money should be managed and where it can go. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/01/us-aid-cuts-conditions-un-humanitarian-pledge-ocha",
      "published": "Thu, 01 Jan 2026 13:00:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "How are Greenlanders responding to Trump's threats to acquire the territory?",
      "description": "NPR's Juana Summers speaks to Naaja Nathanielsen, a government minister in Greenland, about President Trump's latest threats to buy or acquire the territory, and how Greenlanders are responding.",
      "url": "https://www.npr.org/2026/01/09/nx-s1-5671301/how-are-greenlanders-responding-to-trumps-threats-to-acquire-the-territory",
      "published": "Fri, 09 Jan 2026 16:15:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran: Exiled crown prince calls for protests to continue",
      "description": "Reza Pahlavi, the son of the last shah of Iran, has called for more mass action over the weekend after nearly two weeks of street protests against the government and the dire economic situation. Follow DW.",
      "url": "https://www.dw.com/en/iran-exiled-crown-prince-calls-for-protests-to-continue/live-75459222?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 10:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian army renews strikes on Kurdish forces in Aleppo",
      "description": "The military launched strikes after Kurdish forces rejected what they called demands to \"surrender.\" Syria's government has been struggling to unite disparate groups since taking power a year ago.",
      "url": "https://www.dw.com/en/syrian-army-renews-strikes-on-kurdish-forces-in-aleppo/a-75457783?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 08:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Egypt dethrone champions Ivory Coast to reach AFCON semi-finals",
      "description": "Egypt beat defending champions Ivory Coast 3-2 in their Africa Cup of Nations quarter-final match on Thursday, with striker Mohamed Salah scoring a goal that brings him one step closer to adding the Africa Cup of Nations winners medal to his trophy cabinet.",
      "url": "https://www.france24.com/en/sport/20260110-egypt-dethrone-champions-ivory-coast-to-reach-afcon-semi-finals",
      "published": "Sat, 10 Jan 2026 21:57:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Nigeria overturn Algeria to set up AFCON semi-final clash with Morocco",
      "description": "Nigeria secured a 2-0 victory over Algeria in their Africa Cup of Nations quarter-final match on Saturday, with striker Victor Osimhen scoring one goal and setting up the second. Nigeria will next face tournament hosts Morocco in the semi-finals.",
      "url": "https://www.france24.com/en/sport/20260110-nigeria-overturn-algeria-to-set-up-afcon-semi-final-clash-with-morocco",
      "published": "Sat, 10 Jan 2026 18:39:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Storm Goretti kills man in UK and leaves 100,000 French homes without power",
      "description": "Strom Goretti barrelled through northern Europe on Friday killing one man in the UK after a tree fell onto a caravan and leaving 100,000 French homes without power on Saturday.",
      "url": "https://www.france24.com/en/europe/20260110-storm-goretti-kills-man-in-uk-and-leaves-100-000-french-homes-without-power",
      "published": "Sat, 10 Jan 2026 14:46:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran's regime is more vulnerable than ever, but it shows no sign of relenting",
      "description": "Mass protest is a long way from revolution.",
      "url": "https://news.sky.com/story/irans-regime-more-vulnerable-than-it-has-ever-been-but-khamenei-shows-no-sign-of-relenting-13492900",
      "published": "Sat, 10 Jan 2026 18:28:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Winter storm slams UK and France, leaving tens of thousands without power",
      "description": "Thousands of homes and businesses across northern France and southern England were without power Friday morning and residents faced widespread travel delays after a storm swept in off the Atlantic, bringing high winds, rain and snow to the region",
      "url": "https://abcnews.go.com/International/wireStory/winter-storm-slams-uk-france-disrupting-travel-leaving-129049719",
      "published": "Fri, 09 Jan 2026 05:53:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syria announces ceasefire after days of clashes with Kurdish fighters in Aleppo",
      "description": "Syria's Defense Ministry has announced a ceasefire after three days of clashes between government forces and Kurdish fighters in Aleppo",
      "url": "https://abcnews.go.com/International/wireStory/syria-announces-ceasefire-after-days-clashes-kurdish-fighters-129047868",
      "published": "Fri, 09 Jan 2026 02:05:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran judiciary chief vows there will be 'decisive' punishment for protesters",
      "description": "Iran's judiciary chief has vowed decisive punishment for protesters, signaling a coming crackdown against demonstrations",
      "url": "https://abcnews.go.com/International/wireStory/iran-judiciary-chief-vows-decisive-punishment-protesters-129046564",
      "published": "Fri, 09 Jan 2026 07:38:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: New strikes disrupt basic services for millions",
      "description": "Several parts of Ukraine were hit by a new wave of Russian strikes between Wednesday and Thursday morning.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166726",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Exiled Iranian crown prince urges Trump to help as protests against Islamic regime intensify: 'Man of peace'",
      "description": "Exiled Iranian Crown Prince Pahlavi appeals to President Donald Trump for immediate intervention as Iran implements internet blackout amid deadly protests.",
      "url": "https://www.foxnews.com/world/exiled-iranian-crown-prince-urges-trump-help-protests-against-islamic-regime-intensify-man-of-peace",
      "published": "Fri, 09 Jan 2026 13:54:30 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela teeters as guerrilla groups, cartels exploit Maduro power vacuum",
      "description": "Criminal networks including Tren de Aragua cartel and ELN guerrillas exploit power vacuum in Venezuela after former President Nicolás Maduro's arrest, threatening transition efforts.",
      "url": "https://www.foxnews.com/world/venezuela-teeters-guerrilla-groups-cartels-exploit-maduro-power-vacuum",
      "published": "Thu, 08 Jan 2026 21:20:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Nicaraguan authorities arrest dozens for reportedly supporting Maduro capture",
      "description": "Human rights groups say ‘at least 60 arbitrary arrests’ have occurred for celebrating the US military operation Authorities in Nicaragua have arrested at least 60 people for reportedly celebrating or expressing support for the capture of Venezuelan president Nicolás Maduro, a human rights watchdog group and local media outlets said Friday. Nicaraguan president Daniel Ortega and his wife, vice president Rosario Murillo, are staunch allies of Maduro, who was captured by US military personnel in Caracas last Saturday and taken to New York to face trial on drug and weapons charges. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/10/nicaraguan-authorities-arrests-dozens-for-reportedly-supporting-maduro-capture",
      "published": "Sat, 10 Jan 2026 07:25:24 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela launches talks with Trump administration",
      "description": "US officials are visiting Venezuela days after forces captured President Nicolas Maduro. Caracas says it has started talks with the Trump administration to reinstate relations.",
      "url": "https://www.dw.com/en/venezuela-launches-talks-with-trump-administration/a-75458362?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 07:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Supporters of UAE-backed separatist group rally in southern Yemen as regional tensions rise",
      "description": "Thousands of Yemenis have gathered in Aden to support a separatist group backed by the UAE",
      "url": "https://abcnews.go.com/International/wireStory/supporters-uae-backed-separatist-group-rally-southern-yemen-129082460",
      "published": "Sat, 10 Jan 2026 10:09:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "EU reaches South America trade deal after 25 years of talks",
      "description": "Some farmers in Europe opposed the deal, but the EU Commission said it had listened to their concerns.",
      "url": "https://www.bbc.com/news/articles/ceqzj49gny4o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 09 Jan 2026 19:35:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Israel issues demolition order for occupied West Bank football pitch",
      "description": "Israeli authorities have issued a demolition order against a football pitch in a Palestinian refugee camp.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/10/israel-issues-demolition-order-for-occupied-west-bank-football-pitch?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 13:11:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Call centre operator that won major Centrelink contract paid no corporate tax for two years",
      "description": "Telco Services Australia generated more than $185m in revenue in 2024-25 and $130m the year before but paid zero tax Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast An outsource call centre operator for Centrelink paid no corporate tax for several years even after winning a major government agency contract worth tens of millions of dollars, Guardian Australia can reveal. The Perth-headquartered company, Telco Services Australia, generated more than $185m in revenue in 2024-25 but reported no taxable income, new financial documents show. Do you know more? Email jonathan.barrett@theguardian.com Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/11/call-centre-operator-centrelink-paid-no-tax-two-years",
      "published": "Sat, 10 Jan 2026 19:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "G7 rescheduled so Trump can attend White House cage match",
      "description": "The G7 summit was originally scheduled for June 14-16. The meeting, however, was reportedly moved so US President Donald Trump would be at the White House for a UFC fight on June 14, his 80th birthday.",
      "url": "https://www.dw.com/en/g7-rescheduled-so-trump-can-attend-white-house-cage-match/a-75457285?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 9 Jan 2026 20:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Who would rule Iran if the Islamic Republic falls?",
      "description": "From Crown Prince Reza Pahlavi to imprisoned activists, Iran's potential successors remain unclear. Opposition figures debate who could unify after regime change.",
      "url": "https://www.foxnews.com/world/who-would-rule-iran-islamic-republic-falls",
      "published": "Sat, 10 Jan 2026 09:00:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "UAE cuts funding for citizens studying at UK universities over campus radicalization fears: report",
      "description": "The UAE is pulling scholarships from U.K. universities, citing fears Emirati students could be radicalized amid tensions over Britain and the Muslim Brotherhood.",
      "url": "https://www.foxnews.com/world/uae-cuts-funding-citizens-studying-uk-universities-over-campus-radicalization-fears-report",
      "published": "Fri, 09 Jan 2026 19:47:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "European allies working on plan if US acts on acquiring Greenland: report",
      "description": "Countries in Europe reportedly are working on a plan if the Trump administration makes a move on acquiring Greenland, which is a a Danish territory.",
      "url": "https://www.foxnews.com/world/european-allies-working-plan-us-acts-acquiring-greenland-report",
      "published": "Thu, 08 Jan 2026 14:51:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "FA Cup: Holders Crystal Palace suffer one of worst upsets at Macclesfield",
      "description": "FA Cup holders and Premier League club Crystal Palace are beaten 2-1 by team six leagues lower, Macclesfield Town.",
      "url": "https://www.aljazeera.com/sports/2026/1/10/holders-crystal-palace-suffer-greatest-fa-cup-shock-at-macclesfield-town?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 15:19:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump says US needs to 'own' Greenland to prevent Russia and China from taking it",
      "description": "The US will do it \"the easy way\" or \"the hard way\", he says, but Denmark stresses the territory is not for sale.",
      "url": "https://www.bbc.com/news/articles/c78vj5n7jg3o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 01:35:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Musk says X outcry is 'excuse for censorship'",
      "description": "The government is urging Ofcom to use all its powers – up to and including an effective ban – against X.",
      "url": "https://www.bbc.com/news/articles/ce3kqzepp5zo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 11:41:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US film stars Meagan Good and Jonathan Majors become Guinea citizens after DNA tests",
      "description": "The pair join other US celebrities reconnecting with their African heritage and taking up citizenship.",
      "url": "https://www.bbc.com/news/articles/c8d04zp8m26o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 10 Jan 2026 13:28:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "X could face UK ban over deepfakes, minister says",
      "description": "It comes after government urged Ofcom to use all its powers – up to and including an effective ban – against X.",
      "url": "https://www.bbc.com/news/articles/c99kn52nx9do?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 09 Jan 2026 21:41:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan government begins releasing political prisoners",
      "description": "The US, which recently captured its President Nicolás Maduro, has long demanded the detainees be freed.",
      "url": "https://www.bbc.com/news/articles/c0mkwl2g499o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 09 Jan 2026 10:18:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nicaragua frees dozens of prisoners amid pressure from Trump administration",
      "description": "Opposition groups say release triggered by 'political chess moves' following US abduction of Venezuela's Nicolas Maduro.",
      "url": "https://www.aljazeera.com/news/2026/1/10/nicaragua-frees-dozens-of-prisoners-amid-pressure-from-trump-administration?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 22:40:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Barcelona vs Real Madrid: Supercopa final 2026 – El Clasico, teams, start",
      "description": "Barcelona and Real Madrid bring the El Clasico to Spanish Super Cup final for a third year as the latter defend crown.",
      "url": "https://www.aljazeera.com/sports/2026/1/10/barcelona-vs-real-madrid-supercopa-final-2026-el-clasico-teams-start?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 21:46:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Salah seals Egypt win against holders Ivory Coast to reach AFCON 2025 semis",
      "description": "Egypt set up semifinal meeting with Senegal at 2025 Africa Cup of Nations by beating Ivory Coast 3-2 in thriller.",
      "url": "https://www.aljazeera.com/sports/2026/1/10/salah-seals-egypt-win-against-holders-ivory-coast-to-reach-afcon-2025-semis?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 21:34:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What are Saudi Arabia’s plans in southern Yemen?",
      "description": "Saudi Arabia says it will soon host a dialogue between Yemen's main players.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/10/what-are-saudi-arabias-plans-in-southern-yemen?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 19:33:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Impressive Nigeria beat Algeria 2-0 to set up AFCON semifinal with Morocco",
      "description": "Victor Osimhen scores one and sets up another to send Nigeria into the last four of the Africa Cup of Nations.",
      "url": "https://www.aljazeera.com/sports/2026/1/10/impressive-nigeria-beat-algeria-2-0-to-set-up-afcon-semifinal-with-morocco?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 18:27:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Morocco coach angrily rejects AFCON ref bias as Nigeria semifinal looms",
      "description": "Morocco progressed to the semifinals beating Cameroon 2-0 but Indominable Lions felt they had two clear penalties.",
      "url": "https://www.aljazeera.com/sports/2026/1/10/morocco-coach-angrily-rejects-afcon-ref-bias-ahead-of-semifinals?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 15:33:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Africa defends BRICS naval drills as ‘essential’ amid tensions",
      "description": "South African official says drills with Russia, Iran, China and others key to protecting 'maritime economic activities'.",
      "url": "https://www.aljazeera.com/news/2026/1/10/south-africa-defends-brics-naval-drills-as-essential-amid-tensions?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 15:21:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relative calm restored in Syria’s Aleppo as Kurdish fighters disarm",
      "description": "Fighting winds down after earlier escalation, which saw governorate building hit by drone allegedly launched by SDF.",
      "url": "https://www.aljazeera.com/news/2026/1/10/drone-hits-aleppo-governorate-building-after-syrian-army-declares-ceasefire?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 14:50:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Indonesia blocks access to Musk’s AI chatbot Grok over deepfake images",
      "description": "Indonesian minister says deepfakes are a 'serious violation of human rights, dignity, and security of citizens' online.",
      "url": "https://www.aljazeera.com/news/2026/1/10/indonesia-blocks-access-to-musks-ai-chatbot-grok-over-deepfake-images?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 14:00:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sabalenka’s Australian Open prep sets up Brisbane final against Kostyuk",
      "description": "Aryna ‌Sabalenka beats Karolina Muchova to reach Brisbane Open final where she will defend title against Marta Kostyuk.",
      "url": "https://www.aljazeera.com/sports/2026/1/10/sabalenkas-australian-open-prep-sets-up-brisbane-final-against-kostyuk?traffic_source=rss",
      "published": "Sat, 10 Jan 2026 13:09:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-10T22:36:46.697Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 16 km ESE of Baculin, Philippines",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - V Time 2026-01-07 03:02:56 UTC 2026-01-07 03:02:56 UTC at epicenter Location 7.390°N 126.722°E Depth 35.00 km (21.75 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rn2z",
      "published": "2026-01-10T16:27:43.386Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Europe alarmed by Trump's Greenland push",
      "description": "Europe is increasingly alarmed by Trump's talk of annexing Greenland, an autonomous Danish territory in the EU and NATO, especially after the U.S. incursion in Venezuela last weekend.",
      "url": "https://www.npr.org/2026/01/10/nx-s1-5673112/europe-alarmed-by-trumps-greenland-push",
      "published": "Sat, 10 Jan 2026 17:01:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump quiere que petroleras estadounidenses lleguen a Venezuela. Esto es lo que usted debe saber",
      "description": "El Presidente Donald Trump quiere que más compañías petroleras estadounidenses se incorporen a Venezuela. Pero existen razones económicas e históricas que podrían dificultar su acceso.",
      "url": "https://www.npr.org/2026/01/09/g-s1-104620/trump-petroleo-venezuela-maduro",
      "published": "Fri, 09 Jan 2026 21:19:53 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US research shows what ADHD drugs really do and don't do",
      "description": "After evaluating scans of almost 5,800 children with and without attention deficit disorder, US researchers discovered that commonly prescribed ADHD medications don't primarily activate the brain's attention centers.",
      "url": "https://www.dw.com/en/us-research-shows-what-adhd-drugs-really-do-and-don-t-do/a-75460960?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 21:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Morocco boosts military ties with Israel despite tensions",
      "description": "Five years after the Abraham Accords, Morocco and Israel are strengthening ties diplomatically, economically and militarily. The relationship has given Morocco strategic leverage in its Western Sahara dispute.",
      "url": "https://www.dw.com/en/morocco-boosts-military-ties-with-israel-despite-tensions/a-75450725?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 17:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "North Korea claims it shot down South Korean drone over its airspace",
      "description": "North Korea has slammed South Korea for violating its sovereignty with a drone incursion earlier this month. The North's military claims that the drone took surveillance footage. South Korea denies the accusations.",
      "url": "https://www.dw.com/en/north-korea-claims-it-shot-down-south-korean-drone-over-its-airspace/a-75458104?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 10 Jan 2026 04:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Crans-Montana bar owner says service door was locked during deadly New Year blaze",
      "description": "The owner of the bar where 40 people died at a New Years eve party in Crans-Montana, Switzerland, told police a service door had been locked from the inside during the blaze. Jacques and Jessica Moretti, co-owners of the Constellation bar, are suspected of homicide in relation to the incident.",
      "url": "https://www.france24.com/en/europe/20260110-crans-montana-bar-owner-says-service-door-was-locked-during-deadly-new-year-blaze",
      "published": "Sat, 10 Jan 2026 20:10:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hosts Morocco beat Cameroon to advance to AFCON semi-finals",
      "description": "Brahim Diaz kept up his remarkable Africa Cup of Nations (AFCON) scoring record as hosts Morocco beat Cameroon 2-0 in their quarter-final showdown on Friday to keep their title dreams alive. Meanwhile Iliman Ndiaye scored in the first half to give Senegal a 1-0 victory over Mali.",
      "url": "https://www.france24.com/en/sport/20260110-hosts-morocco-beat-cameroon-to-advance-to-afcon-semi-finals",
      "published": "Sat, 10 Jan 2026 09:45:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Lammy says Vance thinks sexualised AI deepfakes 'entirely unacceptable'",
      "description": "David Lammy has said that US vice president JD Vance agrees that sexualised AI-generated deepfakes - such as those made using Elon Musk's Grok - are \"entirely unacceptable\".",
      "url": "https://news.sky.com/story/jd-vance-agrees-sexualised-ai-deepfakes-entirely-unacceptable-lammy-says-13492879",
      "published": "Sat, 10 Jan 2026 17:46:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Video shows masked Israeli settlers beating 67-year-old deaf Palestinian man",
      "description": "Footage has shown dozens of masked Israeli settlers armed with sticks beating an elderly Palestinian man in the occupied West Bank.",
      "url": "https://news.sky.com/story/video-shows-masked-israeli-settlers-beating-palestinian-man-in-west-bank-13492758",
      "published": "Sat, 10 Jan 2026 12:39:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Slow-moving prisoner releases in Venezuela enter 3rd day",
      "description": "Venezuela’s government has pledged to free a significant number of prisoners.",
      "url": "https://abcnews.go.com/International/wireStory/slow-moving-prisoner-releases-venezuela-enter-3rd-day-129092386",
      "published": "Sat, 10 Jan 2026 18:11:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nicaragua’s government says it’s freeing detainees after pressure from the US",
      "description": "Nicaragua’s Interior Ministry has announced the release of dozens of prisoners",
      "url": "https://abcnews.go.com/International/wireStory/nicaraguas-government-freeing-detainees-after-pressure-us-129091177",
      "published": "Sat, 10 Jan 2026 17:21:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "North Korea vows response as it accuses the South of flying drones across border",
      "description": "North Korea has accused South Korea of flying drones across the border between the nations",
      "url": "https://abcnews.go.com/International/wireStory/north-korea-vows-response-accuses-south-flying-drones-129077683",
      "published": "Sat, 10 Jan 2026 00:44:14 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US treasury secretary says Argentina has repaid its US credit line in a win for Milei",
      "description": "U.S. Treasury Secretary Scott Bessent says that Argentina has repaid the funds it drew from a $20 billion credit line with the Trump administration",
      "url": "https://abcnews.go.com/International/wireStory/us-treasury-secretary-argentina-repaid-us-credit-line-129063267",
      "published": "Fri, 09 Jan 2026 13:48:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope to visit Spain this year, with stops in Madrid, Barcelona and Canary Islands, cardinal says",
      "description": "Pope Leo XIV is planning to travel to Spain this year",
      "url": "https://abcnews.go.com/International/wireStory/pope-visit-spain-year-stops-madrid-barcelona-canary-129051002",
      "published": "Fri, 09 Jan 2026 07:29:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Yemen’s Southern Transitional Council to dismantle, a day after its leader fled to the UAE",
      "description": "Yemen's Southern Transitional Council and its institutions are being dismantled, the group's secretary-general has announced",
      "url": "https://abcnews.go.com/International/wireStory/yemens-southern-transitional-council-dismantle-day-after-leader-129049811",
      "published": "Fri, 09 Jan 2026 07:21:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "More diplomatic and economic tensions surface between China, Japan as a bumpy week ends",
      "description": "A week in which longtime tensions between neighbors China and Japan ratcheted up economically and politically is drawing to a close with no sign of improvements",
      "url": "https://abcnews.go.com/International/wireStory/diplomatic-economic-tensions-surface-china-japan-bumpy-week-129048867",
      "published": "Fri, 09 Jan 2026 04:01:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Aid continues despite winter hardship in Gaza and West Bank, UN says",
      "description": "Despite harsh winter conditions and continuing access constraints, the UN and partners are maintaining large-scale humanitarian operations in Gaza and the occupied West Bank, with a focus on shelter, water, health and education.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166728",
      "published": "Thu, 08 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Melodee Buzzard’s grandmother shreds possible insanity defense for accused killer mom: ‘planned everything’",
      "description": "Grandmother speaks out as mother accused of killing 9-year-old Melodee Buzzard appears in court, questioning what changed in the woman she once knew.",
      "url": "https://www.foxnews.com/us/melodee-buzzard-grandmother-shreds-possible-insanity-defense-accused-killer-mom-planned-everything",
      "published": "Sat, 10 Jan 2026 15:00:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland leaders push back on Trump's calls for US control of the island: 'We don’t want to be Americans'",
      "description": "Greenland leaders firmly reject President Donald Trump's proposed U.S. takeover as the American administration vows action regardless of their wishes.",
      "url": "https://www.foxnews.com/world/greenland-leaders-push-back-trumps-calls-us-control-island-we-dont-want-americans",
      "published": "Sat, 10 Jan 2026 12:51:21 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces seize oil tanker in the Caribbean Sea in pre-dawn mission",
      "description": "U.S. forces boarded a tanker known as Olina in ongoing campaign against vessels evading Venezuela sanctions blockade, the U.S. Southern Command said.",
      "url": "https://www.foxnews.com/world/us-forces-seize-oil-tanker-caribbean-sea-pre-dawn-mission",
      "published": "Fri, 09 Jan 2026 09:14:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK keeps billions in Venezuelan gold reserves frozen at Bank of England after Maduro arrest",
      "description": "Bank of England keeps billions in Venezuelan gold frozen since 2020 amid legal battle following Nicolás Maduro's arrest and interim leader appointment.",
      "url": "https://www.foxnews.com/world/uk-keeps-billions-venezuelan-gold-reserves-frozen-bank-england-maduro-arrest",
      "published": "Thu, 08 Jan 2026 17:24:50 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}