{
  "last_updated": "2026-01-22T11:27:43.452678Z",
  "event_count": 224,
  "events": [
    {
      "title": "Catholic cardinals warn US foreign policy under Trump risks global suffering",
      "description": "Church leaders cite Greenland threats, Venezuela action and aid cuts as undermining human dignity and peace Three cardinals in the US Catholic church have criticized the Trump administration ’s foreign policy, saying its push to obtain or otherwise seize Greenland , recent military action in Venezuela , and cuts to humanitarian aid risk “destroying international relations and plunging the world into incalculable suffering”. “Our country’s moral role in confronting evil around the world, sustaining the right to life and human dignity, and supporting religious liberty are all under examination,” said a joint statement from Blase Cupich, Robert McElroy and Joseph Tobin, respectively the archbishops of Chicago, Washington DC and Newark, New Jersey. The Associated Press contributed Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/catholic-cardinals-trump-foreign-policy",
      "published": "Tue, 20 Jan 2026 14:44:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 51,
      "severity_level": "Critical"
    },
    {
      "title": "Iran will retaliate 'with everything we have' if US attacks, senior diplomat warns",
      "description": "More than 4,500 protesters killed in Iran as foreign minister threatens forceful response to potential U.S. military strikes in escalating regional crisis.",
      "url": "https://www.foxnews.com/world/iran-retaliate-with-everything-we-have-us-attacks-senior-diplomat-warns",
      "published": "Wed, 21 Jan 2026 07:44:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "'If we're not at the table, we're on the menu': What global leaders have said",
      "description": "The world order is in the \"midst of a rupture\", leaders have warned - telling how international law is being \"trampled underfoot\" and \"imperial ambitions are resurfacing\".",
      "url": "https://news.sky.com/story/is-a-new-world-without-rules-emerging-what-global-leaders-have-said-13497144",
      "published": "Wed, 21 Jan 2026 13:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Pakistan: Death toll soars in Karachi mall fire",
      "description": "Rescuers have retrieved remains of many more victims from a gutted mall in Pakistan's Karachi, with dozens still missing. The cause of the disaster is still not known.",
      "url": "https://www.dw.com/en/pakistan-death-toll-soars-in-karachi-mall-fire/a-75600651?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 08:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Ukrainian's Zelensky to meet with Trump in Davos",
      "description": "The president of Ukraine heads to Davos as NATO-backed Greenland deal takes center stage at The World Economic Forum. Meanwhile, the leaders of the EU’s 27 member states are set to gather in Brussels later today for an informal emergency meeting on transatlantic relations. France24 International affairs editor Philip Turle and France24 correspondent Gulliver Cragg from Kyiv join for more.",
      "url": "https://www.france24.com/en/ukrainian-s-zelensky-to-meet-with-trump-in-davos",
      "published": "Thu, 22 Jan 2026 09:57:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Rising hunger and displacement pose growing economic risk, UN tells Davos",
      "description": "As global leaders gather at the World Economic Forum in Davos this week, UN agencies are warning that rising hunger and displacement are not only humanitarian emergencies but growing threats to global economic stability.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166791",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Shooting in Australian town leaves 3 dead and 1 wounded",
      "description": "Three people were killed and another was wounded on Thursday in a shooting at an Australian country town, police said",
      "url": "https://abcnews.go.com/International/wireStory/shooting-australian-town-leaves-3-dead-1-wounded-129445257",
      "published": "Thu, 22 Jan 2026 03:06:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "In the ashes of Lirquén: How a small town is rising from Chile's devastating wildfires",
      "description": "Wildfires continue to devastate central and southern Chile, consuming over 170 square miles and causing at least 20 deaths",
      "url": "https://abcnews.go.com/International/wireStory/ashes-lirqun-small-town-rising-chiles-devastating-wildfires-129441749",
      "published": "Thu, 22 Jan 2026 02:01:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "World enters era of ‘global water bankruptcy’",
      "description": "The world has moved beyond a water crisis and into a state of global water bankruptcy, says a new flagship report released on Tuesday by UN researchers.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166800",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: Atrocities ‘repeated town by town’, ICC prosecutor tells UN Security Council",
      "description": "Atrocities in Sudan’s Darfur region are spreading from town to town in an organized campaign of violence that includes mass executions, rape and ethnic targeting, amounting to war crimes and crimes against humanity, the prosecutor of the International Criminal Court told the UN Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166790",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Why the gulf states are wary of a strike on Iran",
      "description": "Geopolitical concerns of the Gulf states have most likely prevented a US attack on Iran despite Donald Trump's promise to help the protesters.",
      "url": "https://www.dw.com/en/why-the-gulf-states-are-wary-of-a-strike-on-iran/a-75593784?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 18:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Illegal immigrant accused in deaths of college soccer player, girlfriend had prior DWI dismissed: records",
      "description": "Illegal immigrant accused in fatal DUI crash that killed college soccer player had prior DWI charge dismissed, fueling immigration enforcement debate.",
      "url": "https://www.foxnews.com/us/illegal-immigrant-accused-deaths-college-soccer-player-girlfriend-had-prior-dwi-dismissed-records",
      "published": "Wed, 21 Jan 2026 16:42:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Armed militias fire heavy machine guns through Tehran streets in deadly night attacks",
      "description": "Iran protests entered day 24 with 4,519 confirmed deaths. Supreme Leader Ayatollah Ali Khamenei backs security forces amid nationwide demonstrations.",
      "url": "https://www.foxnews.com/world/armed-militias-fire-heavy-machine-guns-tehran-streets-deadly-night-attacks",
      "published": "Tue, 20 Jan 2026 21:06:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian soldier sentenced to death for refusing to fire on protesters during nationwide unrest",
      "description": "Iranian soldier Javid Khales was reportedly sentenced to death for refusing orders to shoot protesters during nationwide unrest, a human rights group says.",
      "url": "https://www.foxnews.com/world/iranian-soldier-sentenced-death-refusing-fire-protesters-nationwide-unrest",
      "published": "Tue, 20 Jan 2026 21:56:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Cold and dark: UN rights chief condemns Russian strikes on Ukraine’s power grid",
      "description": "Russian attacks on Ukraine’s energy infrastructure have cut heat, electricity and water to hundreds of thousands of civilians in freezing winter conditions, prompting the UN human rights chief to denounce the strikes as “cruel” and a clear violation of international law.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166798",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli UN ambassador sends stark warning to Iran amid growing unrest",
      "description": "Israel warns Iran not to test its military readiness amid tensions over ballistic missiles and nuclear capabilities following summer 2025 operations.",
      "url": "https://www.foxnews.com/world/israeli-un-ambassador-sends-stark-warning-iran-amid-growing-unrest",
      "published": "Tue, 20 Jan 2026 19:38:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Rescuers search for survivors after landslide at New Zealand campsite",
      "description": "Several people were missing after heavy rains caused flooding and landslides across New Zealand's North Island.",
      "url": "https://www.aljazeera.com/news/2026/1/22/rescuers-search-for-survivors-after-landslide-at-new-zealand-campsite?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 04:59:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli fire kills 11 in Gaza: Three journalists among the dead",
      "description": "In Gaza on Wednesday, Israeli forces killed 11 Palestinians in multiple attacks, including a strike on a vehicle carrying three journalists documenting a new displacement camp. Since the ceasefire took effect on October 10, both sides have frequently accused each other of violating the agreement, Gabrielle Nadler reports.",
      "url": "https://www.france24.com/en/israeli-fire-kills-11-in-gaza-three-journalists-among-the-dead",
      "published": "Thu, 22 Jan 2026 09:59:49 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Gunman at large in Australian town after three people shot dead",
      "description": "A gunman is reported to be at large in an Australian town following shootings that killed three people and wounded one.",
      "url": "https://news.sky.com/story/gunman-at-large-in-lake-cargelligo-australia-after-three-people-shot-dead-13497500",
      "published": "Thu, 22 Jan 2026 09:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Mozambique floods heighten disease, malnutrition risks – UN agencies",
      "description": "Catastrophic flooding across Mozambique is devastating lives and livelihoods, sharply increasing the risk of disease outbreaks and malnutrition, while also forcing dangerous wildlife – including crocodiles – into flooded urban areas, the UN warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166793",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Kurds march in Iraqi Kurdistan against Syrian government takeover of minority",
      "description": "Syria's government said a drone strike by the Kurdish-led Syrian Democratic Forces killed seven of its soldiers on Wednesday, though the ⁠SDF denied this, in an incident that threatens to derail a ceasefire after days of fighting in the northeast. In Erbil, Iraqi Kurds took to the streets to protest as Syrian Kurds see years of Kurdish de facto autonomy in the northeast vanish as Syrian forces take over.",
      "url": "https://www.france24.com/en/kurds-march-in-iraqi-kurdistan-against-syrian-government-takeover-of-minority",
      "published": "Wed, 21 Jan 2026 22:36:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Rising coal demand overshadows Southeast Asia's transition to renewable energy",
      "description": "Southeast Asia’s need for coal is growing faster than anywhere else in the world, undermining progress on cutting carbon emissions that contribute to global warming",
      "url": "https://abcnews.go.com/International/wireStory/rising-coal-demand-overshadows-southeast-asias-transition-renewable-129444203",
      "published": "Thu, 22 Jan 2026 01:29:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Children cook meals for needy and mourners lay wreaths for Bondi attack victims on national day of mourning",
      "description": "Australians urged to do a good deed – or mitzvah – as Anthony Albanese says day is ‘opportunity for us as a nation to wrap our arms around the Jewish community’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Fresh wreaths of flowers have been laid at Bondi beach, children have cooked meals for those in need and Anthony Albanese has welcomed the opportunity to “wrap our arms around” the Jewish community as Australia holds a national day of mourning for the victims of last month’s terror attack. Under the banner of the New South Wales government’s One Mitzvah for Bondi initiative, all Australians were urged to do a good deed – or mitzvah – on Thursday to mark the day of mourning. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/children-cook-meals-for-needy-and-mourners-lay-wreaths-for-bondi-attack-victims-on-national-day-of-mourning-ntwnfb",
      "published": "Thu, 22 Jan 2026 06:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Greetings from Kalk Bay, a South African fishing village where wild seals await scraps",
      "description": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "url": "https://www.npr.org/2026/01/21/g-s1-106277/south-africa-kalk-bay",
      "published": "Wed, 21 Jan 2026 10:10:33 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "The Apprentice, Davos edition? Trump blasts Europe at World Economic Forum",
      "description": "From windmills to NATO, Donald Trump let the world have it from the podium of the World Economic Forum. For more than an hour, the president of the United States took on all-comers in his first return to Davos in six years. We ask about the latest threatening language on tariffs and grabbing Greenland, and how an audience of corporate executives feels about a showdown with Europe that's rekindled the threat of a trade war.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260122-the-apprentice-davos-edition-trump-blasts-europe-at-world-economic-forum",
      "published": "Thu, 22 Jan 2026 09:09:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘Alarming’ increase in use of death penalty last year, despite global trend towards abolition",
      "description": "Despite a downward trend in the use of the death penalty globally, 2025 saw an ‘alarming’ increase in the number of executions in a small number of retentionist countries, the UN human rights office (OHCHR) warned on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166789",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Three people dead and gunman on the run after shooting in NSW town",
      "description": "Two women and a man have have died after a shooting at Lake Cargelligo as police urge locals to stay inside Get our breaking news email , free app or daily news podcast Three people have been fatally shot and a gunman is on the run after a shooting in a country town in central western New South Wales. NSW police said on Thursday that a police operation was under way at Lake Cargelligo, 240km south-west of Dubbo, after shooting, with the suspected gunman believed to be “on the move” in a vehicle. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/three-people-dead-after-shooting-in-nsw-town-lake-cargelligo-as-police-urge-locals-to-stay-inside-ntwnfb",
      "published": "Thu, 22 Jan 2026 10:45:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN Assembly president defends multilateralism, UN Charter in Davos",
      "description": "From Davos, the President of the UN General Assembly on Wednesday warned that the world has entered a “make‑or‑break” moment for multilateralism, saying the rules‑based order can survive only if states speak the truth and act when it’s hard. She called for a cross‑regional alliance to push back against growing lawlessness, disinformation, and power‑based politics.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166803",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Hong Kong national security trial of three pro-democracy activists to open",
      "description": "Chow Hang-tung, Lee Cheuk-yan and Albert Ho, who led Tiananmen Square vigils, accused of inciting subversion The national security trial of three pro-democracy activists who organised an annual memorial in Hong Kong to mark the Tiananmen Square massacre opened on Thursday, in another landmark case brought under the Beijing-imposed law that has practically crushed protests in the semiautonomous Chinese city. Chow Hang-tung , Lee Cheuk-yan and Albert Ho are charged with inciting subversion under Hong Kong’s national security law . Their trial is one of the most high-profile national security cases to be heard in Hong Kong since Beijing imposed the law in 2020 . The defendants face a maximum penalty of 10 years’ imprisonment if convicted. The law has a near-100% conviction rate. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/hong-kong-national-security-trial-pro-democracy-activists-chow-hang-tung-lee-cheuk-yan-albert-ho",
      "published": "Wed, 21 Jan 2026 23:45:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti explained: why the crisis is deepening — and what comes next",
      "description": "Haiti is entering 2026 facing one of the most complex crises in its recent history. On Wednesday, the Caribbean island nation will be high on the international agenda as the UN Security Council holds its first meeting of the year to update ambassadors.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166801",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At the edge of war: the Central African Republic's uneasy border with Sudan",
      "description": "The land flattens on the approach to Birao, a cut-off town ringed by savannah in the far north of the Central African Republic, where roads dissolve into dust and motorcycles vastly outnumber cars. Less than two hours’ drive from the Sudanese border, this is the edge of a fractured country still piecing itself back together, while absorbing the shockwaves of a neighbouring conflict.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166794",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Two dead and several missing in New Zealand landslides",
      "description": "Heavy rains have ravaged the country's North Island, with a minister comparing it to a \"war zone\".",
      "url": "https://www.bbc.com/news/articles/cje11x527n4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 09:14:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Haiti crisis at breaking point as gangs tighten grip ahead of transition deadline",
      "description": "Haiti’s deepening crisis has reached a critical phase, senior UN officials warned the Security Council on Wednesday, as powerful gangs continue to expand their control across the country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166806",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Luigi Mangione case: If stalking and assault aren’t ‘crimes of violence,’ death penalty vanishes",
      "description": "Luigi Mangione's defense team argues a federal court ruling could dismiss his murder charge in the alleged killing of UnitedHealthcare CEO Brian Thompson.",
      "url": "https://www.foxnews.com/us/luigi-mangione-case-stalking-assault-arent-crimes-violence-death-penalty-vanishes",
      "published": "Wed, 21 Jan 2026 15:44:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Japan suspends world's largest nuclear plant hours after restart",
      "description": "The operator says reactor remains \"stable\" and has no \"radioactive impact outside\".",
      "url": "https://www.bbc.com/news/articles/cx2yy8z91n4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 09:00:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Death toll in Pakistan shopping centre fire rises to at least 60",
      "description": "Sharp rise in fatalities at Karachi's Gul Plaza Shopping Centre came after 30 bodies were found in a locked store.",
      "url": "https://www.aljazeera.com/news/2026/1/22/death-toll-in-pakistan-shopping-centre-fire-rises-to-at-least-60?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 07:08:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Trump's provocative rhetoric about Greenland threatens long-standing world order",
      "description": "President Trump says he won't take Greenland by force, but he delivered provocative statements that have threatened to tear down the pillars of the world order constructed by the U.S. 80 years ago.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5684112/trumps-provocative-rhetoric-about-greenland-threatens-long-standing-world-order",
      "published": "Thu, 22 Jan 2026 04:44:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Crew 11 returns to earth and reflects on early mission end",
      "description": "Crew 11- comprising US astronauts Zena Cardman, 38, and Mike Fincke, 58, Japanese astronaut Kimiya Yui, 55, and Russian cosmonaut Oleg Platonov, 39 - safely returned to Earth on January 15 from the International Space Station. After a medical issue forced one crew member to end the mission early, the team spoke publicly about their experience for the first time on Wednesday. Daniel Quinlan reports.",
      "url": "https://www.france24.com/en/crew-11-returns-to-earth-and-reflects-on-early-mission-end",
      "published": "Thu, 22 Jan 2026 10:02:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Rescue efforts underway after landslides hit New Zealand campground, house, 2 dead",
      "description": "Landslides have hit a house and a campground in New Zealand, killing at least two people while emergency crews are trying to rescue people buried in rubble",
      "url": "https://abcnews.go.com/International/wireStory/rescue-efforts-underway-after-landslides-hit-new-zealand-129438465",
      "published": "Thu, 22 Jan 2026 03:29:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "62 Nigerian hostages rescued, 2 militants killed, army says",
      "description": "Nigeria's military rescued 62 hostages and killed two militants in operations across Zamfara, Kebbi and Sokoto states after weekend church kidnappings.",
      "url": "https://www.foxnews.com/world/62-nigerian-hostages-rescued-2-militants-killed-army-says",
      "published": "Wed, 21 Jan 2026 14:08:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Does the World Economic Forum still matter in a fractured global economy?",
      "description": "For decades, the World Economic Forum in Davos was a symbol of global cooperation. Today, its relevance is questioned.",
      "url": "https://www.aljazeera.com/video/counting-the-cost/2026/1/22/does-the-world-economic-forum-still-matter-in-a-fractured-global-economy?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 08:25:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "'Assassination culture' is on the rise, especially among women, study warns",
      "description": "New survey reveals women are 15% more likely to tolerate political violence, with heavy social media use driving concerning \"assassination culture\" trends.",
      "url": "https://www.foxnews.com/us/assassination-culture-rise-especially-among-women-study-warns",
      "published": "Thu, 22 Jan 2026 06:00:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of sex assaults on teenage prisoners, while families charged to recover remains of loved ones",
      "description": "Iran's prosecutor general Mohammad Movahedi claims government crushed nationwide protests as death toll reaches 544 with over 10,681 arrested.",
      "url": "https://www.foxnews.com/world/iran-accused-sex-assaults-teenage-prisoners-families-charged-recover-remains-loved-ones",
      "published": "Wed, 21 Jan 2026 21:38:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "American flags torched, riot police clash with protesters ahead of Trump Davos arrival",
      "description": "Swiss riots erupt in multiple cities as anti-Trump protesters march against President Trump's World Economic Forum appearance, with police deploying water cannons.",
      "url": "https://www.foxnews.com/world/american-flags-torched-riot-police-clash-protesters-trump-davos-arrival",
      "published": "Tue, 20 Jan 2026 20:11:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Israeli strike in Gaza kills three journalists, first responders say",
      "description": "Another eight Palestinians were killed by Israeli artillery and gunfire across Gaza on Wednesday, according to medics.",
      "url": "https://www.bbc.com/news/articles/c98pnzp50nqo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 20:44:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Trump launches ‘Board of Peace’ with signing ceremony in Davos",
      "description": "Board was initially aimed at rebuilding Gaza due to Israeli genocide, but was later pitched as global conflict body.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/22/live-trump-to-lead-signing-of-charter-for-gaza-board-of-peace-in-davos?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 06:19:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump says Canada should be grateful for ‘freebies’ it gets from the US",
      "description": "US president singles out Mark Carney day after prime minister warned world is undergoing geopolitical ‘rupture’ Trump news at a glance: at Davos, president rambles, backs down and touts ‘future deal’ on Greenland Donald Trump has said Canada should be “grateful” for the “freebies” it gets from the US, a day after its prime minister, Mark Carney , warned the world was undergoing a geopolitical “rupture”. Speaking those attending the World Economic Forum annual meeting in Switzerland, the US president singled out Carney’s speech that was sharply critical of US foreign policy. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/21/trump-canada-mark-carney",
      "published": "Wed, 21 Jan 2026 20:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Chile’s president-elect names staunch abortion opponent as gender equality minister",
      "description": "Far-right incoming president picked Judith Marín, who has publicly decried bills to decriminalise abortion, for the role Chile’s incoming far-right president José Antonio Kast has named a vehement opponent of abortion who has repeatedly stated her support for life “from conception to natural death” as the country’s new women and gender equality minister. Judith Marín, 30, was once ejected from Chile’s senate by police for screaming “return to the Lord” during a vote to decriminalise abortion under restricted circumstances. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/chile-abortion-opponent-gender-equality-minister",
      "published": "Wed, 21 Jan 2026 16:56:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Colombian ex-paramilitary leader jailed for crimes against Indigenous groups",
      "description": "Salvatore Mancuso given 40-year sentence, which could be reduced after truth and reparation activities A Colombian court has sentenced a former paramilitary leader to 40 years in prison for crimes committed against Indigenous communities in the province of La Guajira, including homicides, forced disappearances and the displacement of people from 2002 to 2006. The special tribunal that hears cases from the country’s armed conflict said in its ruling that Salvatore Mancuso was responsible for 117 crimes committed by fighters under his command in La Guajira. However, it added that Mancuso’s time in prison could be reduced to eight years, if he collaborated with truth and reparation activities that benefited victims of his former paramilitary group. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/colombia-ex-paramilitary-leader-salvatore-mancuso-jailed-crimes-against-indigenous-groups",
      "published": "Tue, 20 Jan 2026 12:12:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Filipino journalist Frenchie Cumpio found guilty of terror financing in verdict rights groups call ‘absurd’",
      "description": "Reporters Without Borders said the ruling against the 26-year-old journalist showed a ‘blatant disregard for press freedom’ in the Southeast Asian nation A young Filipino journalist who spent nearly six years in a crowded provincial prison was found guilty of terror financing on Thursday, in a case rights groups and a UN rapporteur labelled a “travesty of justice”. Community journalist and radio broadcaster Frenchie Cumpio, 26, and former roommate Marielle Domequil broke down in tears and hugged each other as the guilty verdict was read and they were sentenced to 12-18 years in prison by judge Georgina Uy Perez of the Tacloban regional court. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/22/frenchie-mae-cumpio-philippine-journalist-found-guilty",
      "published": "Thu, 22 Jan 2026 03:28:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Israeli fire strikes journalists and children in Gaza",
      "description": "Israeli forces on Wednesday killed at least 11 Palestinians in Gaza, including two boys, three journalists and a woman, hospitals said, on one of the enclave 's deadliest days since the ceasefire took effect.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106775/israel-strikes-gaza",
      "published": "Thu, 22 Jan 2026 01:56:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Davos 2026: German chancellor says new era 'already begun'",
      "description": "Speaking to world leaders in Davos, German Chancellor Friedrich Merz warned that \"the old world order is unraveling at breathtaking pace\" and set out key priorities for the future. DW has more.",
      "url": "https://www.dw.com/en/davos-2026-german-chancellor-says-new-era-already-begun/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 09:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Canada's Carney says world order 'in the midst of a rupture'",
      "description": "Canada PM Mark Carney warned world leaders gathered at the WEF in Davos that we are entering a new era. Carney garnered much praise for his speech, though one person was unimpressed, US President Donald Trump.",
      "url": "https://www.dw.com/en/canada-s-carney-says-world-order-in-the-midst-of-a-rupture/a-75596732?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 16:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Donald Trump backs down on Greenland",
      "description": "Donald Trump says he is moving toward a deal on Greenland following discussions with NATO chief Mark Rutte. The US president had earlier declined to rule out the use of military force to acquire the territory from Denmark, a NATO member—a stance many experts warned could threaten the alliance’s cohesion. Ellen Gainsford reports.",
      "url": "https://www.france24.com/en/donald-trump-backs-down-on-greenland",
      "published": "Thu, 22 Jan 2026 09:58:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Will Trump's 'board of peace' in Gaza really rival the UN?",
      "description": "While in Davos, Donald Trump is expected to elaborate on his newly proposed \"board of peace,\" reportedly established to oversee the US-brokered ceasefire in Israel's conflict with Hamas. The initiative has invited participation from around 60 countries, including Russia and China, and some, like Israel, have already signed on. However, many questions linger, with critics expressing concern that the board could be intended to supplant the United Nations. Emerald Maxwell examines the plan and its implications.",
      "url": "https://www.france24.com/en/will-trump-s-board-of-peace-in-gaza-really-rival-the-un",
      "published": "Thu, 22 Jan 2026 09:55:34 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Guterres in London: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ISIS takes credit for Kabul suicide bombing at Chinese restaurant",
      "description": "ISIS-K claims responsibility for deadly suicide blast at Chinese restaurant in Kabul, killing seven people, including one Chinese national.",
      "url": "https://www.foxnews.com/world/isis-takes-credit-kabul-suicide-bombing-chinese-restaurant",
      "published": "Tue, 20 Jan 2026 08:24:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Israel postpones demolition of Palestinian children's football pitch",
      "description": "An international campaign to save the pitch in the occupied West Bank city of Bethlehem appears to have forced the authorities to reconsider.",
      "url": "https://www.bbc.com/news/articles/cly3dm37m7no?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 15:34:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "New Zealand: Campers missing after Mount Maunganui landslide",
      "description": "A landslide has hit a busy campsite at New Zealand's Mount Maunganui, leaving several campers missing. Elsewhere, two people were killed when a house was hit by a separate landslide after two days of heavy rains.",
      "url": "https://www.dw.com/en/new-zealand-campers-missing-after-mount-maunganui-landslide/a-75599259?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 03:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "French dairy giant Lactalis recalls baby formula in 18 countries due to toxin",
      "description": "French dairy maker Lactalis has recalled baby formula in 18 countries after it was discovered that some batches may contain a dangerous toxin. Since the start of this year, three of the world’s biggest dairy companies, including also Nestlé and Danone, have issued recalls on baby milk due to contamination scares.",
      "url": "https://www.france24.com/en/france/20260122-french-dairy-giant-lactalis-recalls-baby-formula-in-18-countries-due-to-toxin",
      "published": "Thu, 22 Jan 2026 07:39:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Several missing after New Zealand landslide hits campsite at beauty spot",
      "description": "Rescue efforts are under way to free people buried under rubble after landslides hit a campsite and house in New Zealand.",
      "url": "https://news.sky.com/story/several-missing-after-new-zealand-campsite-landslide-with-no-sign-of-life-detected-for-hours-official-says-13497417",
      "published": "Thu, 22 Jan 2026 06:33:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Rescuers spot wreckage possibly from a helicopter that went missing near a volcano in Japan",
      "description": "Rescuers have spotted wreckage believed to be from a sightseeing helicopter carrying three people that went missing near Japan’s Mount Aso",
      "url": "https://abcnews.go.com/International/wireStory/rescuers-spot-wreckage-possibly-helicopter-missing-volcano-japan-129423993",
      "published": "Wed, 21 Jan 2026 12:25:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Teen mass killer pleads guilty to NC rampage that left five dead, including brother, police officer",
      "description": "Eighteen-year-old Austin Thompson pleaded guilty to the 2022 Raleigh mass shooting that killed five, including his brother and a police officer. Sentencing is in February.",
      "url": "https://www.foxnews.com/us/teen-mass-killer-pleads-guilty-nc-rampage-left-five-dead-including-brother-police-officer",
      "published": "Wed, 21 Jan 2026 21:55:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Supreme Court sceptical of Trump firing of central bank governor Lisa Cook",
      "description": "One conservative justice warned that the White House interpretation of the law could \"shatter\" Federal Reserve independence.",
      "url": "https://www.bbc.com/news/articles/ckgjm50r14go?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 20:45:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "PM tells memorial ‘I am deeply and profoundly sorry’ government could not protect victims – as it happened",
      "description": "This blog is now closed Children cook meals for needy and mourners lay wreaths for Bondi attack victims on national day of mourning Get our breaking news email , free app or daily news podcast Nationals senator Bridget McKenzie said she hopes the Coalition is not broken, but said that is “up to Sussan Ley ” now. McKenzie spoke to ABC News this morning, just before party leader David Littleproud is set to speak amid the fallout. She said: Obviously, Sussan Ley has chosen to accept our resignations and the consequence of that is the National party broader shadow ministry has also tended their resignation to the opposition leader. And now, obviously, that’s a matter for her and David to discuss the fallout. … We took this as a very serious and principled decision as a party room. … But ultimately, we did not have the comfort we needed around the hate laws … and our room, with a heavy heart, made the decision. As my dad used to say, for every action, there’s an equal and opposite reaction. And I would call for calmer heads to prevail, because we are Coalitionists. We need to do everything we can to confront hate preachers and those that spread vile antisemitism and racism in our community and this law helps us do that. So I’m glad it’s in place, I think it’s important that it was supported. They’re really important in terms of keeping the public safe. We think we’ll get thousands and thousands of guns off the street, and I’m very grateful that most gun owners have said that they can participate in the buy back program, give their guns back and make Sydney safer. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/22/bondi-terror-attack-national-day-of-mourning-coalition-crisis-nationals-liberals-david-littleproud-sussan-ley-ntwnfb",
      "published": "Thu, 22 Jan 2026 10:46:49 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump vs. U.S. allies: How will this end?",
      "description": "The president has backed off his threat to take Greenland by force. But his highly inflammatory remarks in Switzerland rattled U.S. allies and threatened to tear down the pillars of the world order.",
      "url": "https://www.npr.org/2026/01/22/g-s1-106678/trump-allies-nato",
      "published": "Thu, 22 Jan 2026 05:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "US government warns it will take action if Haitian politicians destabilize country",
      "description": "The U.S. has warned the transitional council in charge of Haiti against making changes to the troubled country’s government, as pressure mounts for the unelected body to move toward elections for the first time in a decade",
      "url": "https://abcnews.go.com/International/wireStory/us-government-warns-action-haitian-politicians-destabilize-country-129441923",
      "published": "Thu, 22 Jan 2026 00:10:14 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "National security trial for Hong Kong's Tiananmen vigil organizers opens",
      "description": "A trial against two pro-democracy activists behind a group that for decades organized a vigil that commemorated people killed in Beijing’s Tiananmen Square crackdown in 1989 opened on Thursday",
      "url": "https://abcnews.go.com/International/wireStory/national-security-trial-hong-kongs-tiananmen-vigil-organizers-129436487",
      "published": "Wed, 21 Jan 2026 23:37:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "2 hikers in Olympic National Forest killed after tree falls on popular trail",
      "description": "Two hikers tragically killed when dead tree fell on popular Lena Lake trail in Olympic National Forest. Third hiker survived the deadly incident.",
      "url": "https://www.foxnews.com/us/2-hikers-olympic-national-forest-killed-after-tree-falls-popular-trail",
      "published": "Wed, 21 Jan 2026 14:34:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown",
      "description": "The images from one mortuary in Tehran were shown to families who went to identify their loved ones.",
      "url": "https://www.bbc.com/news/articles/c0r4957rq8ro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 05:56:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Greenland government unveils new \"crisis\" handbook amid US threats",
      "description": "Greenlanders are expressing relief after Donald Trump said in Davos that he would not use force to take the semi-autonomous territory. But at the same time, they’re not letting down their guard. In fact, Greenland's government unveiled a new handbook on Wednesday offering advice to the population in the event of a \"crisis\" in the territory. FRANCE 24's Monte Francis has the details.",
      "url": "https://www.france24.com/en/greenland-government-unveils-new-crisis-handbook-amid-us-threats",
      "published": "Wed, 21 Jan 2026 22:45:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Food insecurity in Lebanon, Libya migrants freed, UNHCR tackles multiple emergencies – despite cuts",
      "description": "Since 2026, nearly 17 percent of Lebanon’s population has been living in a state of major food insecurity – a situation that is likely to worsen in the coming year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166787",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen: Children are dying and it’s going to get worse, warns aid veteran",
      "description": "In Yemen, renewed political instability and economic woes linked to the war threaten to complicate the already difficult task of helping vulnerable people suffering from deepening hunger, illness and displacement, the UN’s top aid official there said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166786",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yale hosts controversial speaker Trita Parsi accused of promoting Iranian regime interests",
      "description": "Controversial Iranian American Trita Parsi to speak at Yale, sparking outrage amid deadly Iran protests that allegedly killed over 16,000 people.",
      "url": "https://www.foxnews.com/us/yale-hosts-controversial-speaker-trita-parsi-accused-promoting-iranian-regime-interests",
      "published": "Thu, 22 Jan 2026 06:00:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump slams UK island handoff deal that could put key US military base at risk",
      "description": "President Donald Trump calls the United Kingdom's Chagos Islands transfer plan \"an act of great stupidity,\" warning China could exploit the deal.",
      "url": "https://www.foxnews.com/world/trump-slams-uk-island-handoff-deal-put-key-us-military-base-risk",
      "published": "Wed, 21 Jan 2026 18:25:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Top EU official warns Trump's tariff threat over Greenland pushback is 'a mistake'",
      "description": "EU chief calls President Donald Trump's Greenland tariff threats \"a mistake\" as European leaders warn of downward spiral in transatlantic trade relations.",
      "url": "https://www.foxnews.com/world/top-eu-official-warns-trumps-tariff-threat-over-greenland-pushback-a-mistake",
      "published": "Tue, 20 Jan 2026 13:23:56 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Three dead in shooting in Australia's New South Wales",
      "description": "Residents have been told to stay indoors and avoid the area of the shooting.",
      "url": "https://www.bbc.com/news/articles/c4g00mv29j5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 07:57:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The business of saving nature",
      "description": "Global financing is heavily skewed to industries that harm rather than preserve nature, according to a new report that calls for an urgent scale-up of nature-positive spending.",
      "url": "https://www.dw.com/en/the-business-of-saving-nature/a-75594438?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 09:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "It's complicated: Macron's turbulent relationship with Trump",
      "description": "More than any other head of state, French President Macron seems set on a collision course with Donald Trump. The Greenland crisis is a litmus test for his high-stakes mix of diplomacy and defiance.",
      "url": "https://www.dw.com/en/it-s-complicated-macron-s-turbulent-relationship-with-trump/a-75592010?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 16:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Philippine court convicts journalist of terror financing charge in ruling condemned by media groups",
      "description": "A Philippine court has found a Filipina journalist guilty of financing terrorism in a verdict that was condemned by press freedom watchdogs but welcomed by anti-communist insurgency officials",
      "url": "https://abcnews.go.com/International/wireStory/philippine-court-convicts-journalist-terror-financing-charge-ruling-129445362",
      "published": "Thu, 22 Jan 2026 04:01:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UN strongly condemns demolition of UNRWA headquarters in East Jerusalem",
      "description": "The reported demolition underway early Tuesday of the headquarters of UN agency UNRWA by Israeli forces in occupied East Jerusalem - reportedly “under the watch of lawmakers and a member of the Government” - has prompted swift condemnation from the global body.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166792",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Jury reaches verdict in trial of ex-Uvalde school police officer accused of failing to confront gunman",
      "description": "Former Uvalde school district officer Adrian Gonzales was acquitted by a jury on Wednesday evening on charges in connection with the 2022 Robb Elementary School shooting.",
      "url": "https://www.foxnews.com/us/jury-reaches-verdict-trial-ex-uvalde-school-police-officer-accused-failing-confront-gunman",
      "published": "Wed, 21 Jan 2026 20:46:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Zelensky and Trump to meet as US envoy says ending war with Russia down to one issue",
      "description": "US envoy Steve Witkoff said he was optimistic about a deal ahead of talks with Russia's Vladimir Putin.",
      "url": "https://www.bbc.com/news/articles/c4g44r22j5jo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 10:11:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Renewables muscle fossil fuels out of EU electricity market, says research",
      "description": "Solar and wind power provided more electricity than coal and gas last year, leading a global trend, says Ember.",
      "url": "https://www.aljazeera.com/news/2026/1/22/renewables-muscle-fossil-fuels-out-of-eu-electricity-market-says-research?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 07:46:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Iran blocked the internet amid deadly protests. Some voices are still getting through",
      "description": "Weeks into an internet blackout in Iran, NPR speaks to a protester who is still online and a U.S.-based activist who is trying to get more Starlink terminals into the country to get more people online.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5680784/iran-blocked-the-internet-amid-deadly-protests-some-voices-are-still-getting-through",
      "published": "Thu, 22 Jan 2026 04:44:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Germany's rail service dealt major blow by government",
      "description": "The government is reportedly walking back promises to fund major projects for national train operator Deutsche Bahn. DB is beset by chronic punctuality problems, decrepit infrastructure and a lack of investment.",
      "url": "https://www.dw.com/en/germany-s-rail-service-dealt-major-blow-by-government/a-75590884?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 19:56:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Oklahoma man charged with threatening to kill ICE agents, MAGA Republicans online",
      "description": "An Oklahoma man federally charged with threatening to kill ICE agents and politicians in YouTube comments faces up to five years in prison.",
      "url": "https://www.foxnews.com/us/oklahoma-man-charged-threatening-kill-ice-agents-maga-republicans-online",
      "published": "Wed, 21 Jan 2026 15:17:18 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "DHS alleges criminal illegal alien 'rammed law enforcement' in California operation, agent fired weapon",
      "description": "A federal agent opened fire in southern California after a criminal illegal immigrant \"rammed law enforcement\" during an operation, DHS told Fox News Digital.",
      "url": "https://www.foxnews.com/us/dhs-alleges-criminal-illegal-alien-rammed-law-enforcement-california-operation-agent-fired-weapon",
      "published": "Wed, 21 Jan 2026 13:24:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Oldest cave painting of red claw hand could rewrite human creativity timeline",
      "description": "A stencilled outline of a hand found on the Indonesian island of Sulawesi is the world's oldest known cave painting, researchers say.",
      "url": "https://www.bbc.com/news/articles/czx1pnlzer5o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 16:00:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Pro-Palestine activist on hunger strike says he will begin refusing water",
      "description": "Palestine Action-linked remand prisoner Umer Khalid calls on the UK to engage with his protest demands.",
      "url": "https://www.aljazeera.com/news/2026/1/22/pro-palestine-activist-on-hunger-strike-says-he-will-begin-refusing-water?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 09:47:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Hong Kong begins national security trial for organisers of Tiananmen vigils",
      "description": "Rights groups condemn trial of three activists accused of 'inciting subversion of state power'.",
      "url": "https://www.aljazeera.com/news/2026/1/22/hong-kong-begins-national-security-trial-for-organisers-of-tiananmen-vigils?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 05:16:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Hand shape in Indonesian cave may be world’s oldest known rock art",
      "description": "Archaeologists say stencil painted with ochre in limestone cave on Muna Island was created at least 67,800 years ago The faded outline of a hand on a cave wall in Indonesia may be the world’s oldest known rock art, according to archaeologists who say it was created at least 67,800 years ago. The ancient hand stencil was discovered in a limestone cave popular with tourists on Muna Island, part of south-eastern Sulawesi, where it had gone unnoticed between more recent paintings of animals and other figures. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/21/hand-shape-indonesia-cave-rock-art-67800-years-old",
      "published": "Wed, 21 Jan 2026 16:00:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The U.S. is leaving the WHO. But like most breakups, the details are complicated",
      "description": "The U.S.'s break from the World Health Organization is almost finalized. But the details of the breakup are complicated - as are the post-divorce dynamics.",
      "url": "https://www.npr.org/2026/01/22/nx-s1-5679546/the-u-s-is-leaving-the-who-but-like-most-breakups-the-details-are-complicated",
      "published": "Thu, 22 Jan 2026 04:44:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "In Davos speech, Trump ruled out using military force to acquire Greenland",
      "description": "During a speech in Davos, Switzerland, President Trump ruled out using military force to acquire Greenland. But he left many questions about the U.S. role in the world.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5684015/in-davos-speech-trump-ruled-out-using-military-force-to-acquire-greenland",
      "published": "Wed, 21 Jan 2026 17:36:58 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Veteran diplomat on Trump's objectives with his World Economic Forum speech",
      "description": "NPR's Leila Fadel asks veteran diplomat Richard Haass about President Trump's objectives with his address to the World Economic Forum in Switzerland.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5683098/veteran-diplomat-on-trumps-objectives-with-his-world-economic-forum-speech",
      "published": "Wed, 21 Jan 2026 06:46:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Cup 2026: Could Europe drive a boycott?",
      "description": "Just as it did in Russia 2018 and Qatar 2022, politics is dominating the build up to World Cup 2026. Could discontent with Donald Trump in Europe see football heavyweights united behind such a cause?",
      "url": "https://www.dw.com/en/world-cup-2026-could-europe-drive-a-boycott/a-75598538?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 10:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US to transfer Islamic State prisoners from Syria to Iraq",
      "description": "The US military has started transferring up to 7,000 Islamic State (IS) detainees from prisons in northeastern Syria to Iraq, as Syria’s new government asserts control over territories long governed autonomously by Kurdish-led forces. US Central Command (Centcom) reported that 150 IS fighters have already been moved from Hassakeh province to a “secure location” in Iraq. Charlotte Lam reports.",
      "url": "https://www.france24.com/en/us-to-transfer-islamic-state-prisoners-from-syria-to-iraq",
      "published": "Thu, 22 Jan 2026 10:01:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "What is Trump's Board of Peace - and is it going to replace the UN?",
      "description": "Donald Trump says \"a lot of great people\" want to join his Board of Peace - but some world leaders are clearly worried the controversial initiative could undermine the United Nations.",
      "url": "https://news.sky.com/story/what-is-trumps-board-of-peace-and-is-it-going-to-replace-the-un-13497460",
      "published": "Thu, 22 Jan 2026 08:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump is rolling out his Board of Peace at Davos at a time when US leadership is being questioned",
      "description": "President Donald Trump is set to unveil his proposed Board of Peace at the World Economic Forum",
      "url": "https://abcnews.go.com/International/wireStory/trump-rolling-board-peace-davos-time-us-leadership-129443374",
      "published": "Thu, 22 Jan 2026 02:17:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump floats ‘Board of Peace’ to replace UN, signals major global power shift",
      "description": "President Donald Trump invited dozens of countries including Russia, China, and Ukraine to join his Board of Peace initiative, with a signing ceremony planned for Davos, Switzerland.",
      "url": "https://www.foxnews.com/world/trump-floats-board-peace-replace-un-signals-major-global-power-shift",
      "published": "Tue, 20 Jan 2026 17:36:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli minister approves gun licences for 18 illegal West Bank settlements",
      "description": "UN says more than 1,800 settler attacks against Palestinians - about five per day - were documented in 2025.",
      "url": "https://www.aljazeera.com/news/2026/1/22/israeli-minister-approves-gun-licences-for-18-illegal-west-bank-settlements?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 08:06:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Sheinbaum defends transfer of Mexican cartel members amid efforts to appease Trump",
      "description": "Analysts warn that Trump will probably demand more action from Mexico to counter drug-trafficking groups Mexico’s President Claudia Sheinbaum has defended the latest transfer of 37 Mexican cartel operatives to the US as a “sovereign decision”, as her government strives to alleviate pressure from the Trump administration to do more against drug-trafficking groups. It was the third such flight in the year since Donald Trump returned to the White House, but analysts warn that while it remains an effective pressure valve, the returns may be diminishing. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/sheinbaum-mexican-cartel-trump",
      "published": "Wed, 21 Jan 2026 20:05:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Blinken and British counterpart signal trans-Atlantic unity with visit to Ukraine",
      "description": "Secretary of State Antony Blinken and his British counterpart, David Lammy, are raising alarms about Iranian ballistic missiles in Russia that threaten Ukraine.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5106395/blinken-and-british-counterpart-signal-transatlantic-unity-with-visit-to-ukraine",
      "published": "Wed, 21 Jan 2026 07:05:29 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "House panel advances contempt charges against Clintons over Epstein probe",
      "description": "A Republican-led House committee voted on Wednesday to advance contempt of Congress charges against former president Bill Clinton and former secretary of state Hillary Clinton for denying a congressional subpoena over the Jeffrey Epstein investigation. In a rare break from party lines, several progressive lawmakers supported the move, citing the need for full transparency in the Epstein probe.",
      "url": "https://www.france24.com/en/americas/20260121-house-panel-advances-contempt-charges-against-clintons-over-epstein-probe",
      "published": "Wed, 21 Jan 2026 22:51:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US allies need to learn key lesson from Trump's Greenland obsession",
      "description": "Donald Trump's grandstanding on Greenland betrays a disdain for NATO that means this crisis for the alliance is far from over despite his sudden climbdown.",
      "url": "https://news.sky.com/story/trumps-greenland-climbdown-dont-let-it-fool-you-this-crisis-is-far-from-over-for-nato-13497397",
      "published": "Thu, 22 Jan 2026 00:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Texas jury clears police officer accused of failing to stop school shooting gunman",
      "description": "A former police officer has been acquitted of criminal child-endangerment charges related to his role in the flawed law enforcement response to the 2022 Uvalde school shooting that left 19 children and two teachers dead.",
      "url": "https://news.sky.com/story/texas-jury-clears-police-officer-accused-of-failing-to-stop-uvalde-school-shooting-gunman-13497447",
      "published": "Thu, 22 Jan 2026 07:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Border Patrol chief targeted in alleged murder-for-hire plot focused on Snapchat messages",
      "description": "A jury weighs a murder-for-hire case against a Chicago man accused of targeting a Border Patrol official through Snapchat messages offering cash rewards.",
      "url": "https://www.foxnews.com/us/border-patrol-chief-targeted-alleged-murder-hire-plot-focused-snapchat-messages",
      "published": "Wed, 21 Jan 2026 20:04:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Federal officials say anti-ICE agitators 'going after the dogs' after Minneapolis kennel incident",
      "description": "An anti-ICE message was reportedly scrawled on a CBP K-9's feed chart at a Minneapolis kennel, prompting outrage from homeland security officials.",
      "url": "https://www.foxnews.com/us/federal-officials-say-anti-ice-agitators-going-after-dogs-following-minneapolis-kennel-incident",
      "published": "Wed, 21 Jan 2026 19:34:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nanny affair case turns emotional as alleged killer husband watches bodycam video",
      "description": "Brendan Banfield broke down in tears as jurors watched police body camera video from the night his wife Christine was allegedly killed in their home.",
      "url": "https://www.foxnews.com/us/nanny-affair-case-turns-emotional-alleged-killer-husband-watches-bodycam-video",
      "published": "Wed, 21 Jan 2026 18:52:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Good Samaritan stops Florida maniac attacking child with knife at school bus stop after jail release: police",
      "description": "A Florida man released from jail days earlier allegedly attacked a child at a school bus stop with a knife before being restrained by brave bystanders.",
      "url": "https://www.foxnews.com/us/florida-maniac-attacks-child-knife-school-bus-stop-days-after-jail-release-police-say",
      "published": "Wed, 21 Jan 2026 15:11:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fourth shark attack in three days rocks Australia as authorities close beaches and deploy drumlines",
      "description": "A string of shark attacks near Sydney prompted beach closures across New South Wales. The latest victim attacked at Point Plomer suffered only minor cuts.",
      "url": "https://www.foxnews.com/world/fourth-shark-attack-three-days-rocks-australia-authorities-close-beaches-deploy-drumlines",
      "published": "Tue, 20 Jan 2026 07:24:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US to transfer Islamic State prisoners from Syria to Iraq",
      "description": "The move comes as Syrian government forces take control of north-eastern areas where Kurdish-led forces have long controlled.",
      "url": "https://www.bbc.com/news/articles/cx20pwqkgp9o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 20:09:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump backs down on tariffs, but 'the damage has been done and it's very persistent', expert says",
      "description": "Speaking with FRANCE 24's Sharon Gaffney, Steven Durlauf, Director of the Stone Center for Research on Wealth Inequality and Mobility at the University of Chicago's Harris School of Public Policy, says \"the damage has been done and it's very persistent\", following the announcement by US President Donald Trump that he was scrapping the planned tariffs on European nations over his Greenland takeover threat.",
      "url": "https://www.france24.com/en/tv-shows/a-propos/20260121-trump-backs-down-on-tariffs-but-the-damage-has-been-done-and-it-s-very-persistent-expert-says",
      "published": "Wed, 21 Jan 2026 22:01:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea-Bissau sets election date following last year’s coup",
      "description": "The West African country is set to hold legislative and presidential elections on December 6.",
      "url": "https://www.aljazeera.com/news/2026/1/22/guinea-bissau-sets-election-date-following-last-years-coup?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 09:00:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "A bid to clean up shipping industry intensified a coral bleaching event on Great Barrier Reef, study says",
      "description": "The removal of sulphur from shipping fuels caused ‘a lot of extra sunlight’ to get through atmosphere and hit reef in 2022 Steps to clean up the shipping industry by removing sulphur from fuels intensified a major coral bleaching event on the Great Barrier Reef by allowing more of the sun’s energy to hit the oceanic wonder, according to a new study. Sulphur pollution can cause respiratory problems for humans and cause acid rain, but it also has a shading effect and can make clouds brighter, providing more shade to areas underneath. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/22/great-barrier-reef-coral-bleaching-shipping-industry-sulphur",
      "published": "Thu, 22 Jan 2026 11:00:53 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Theranos founder Elizabeth Holmes asks Trump for early release from prison",
      "description": "Elizabeth Holmes, the former Theranos founder, has asked US President Donald Trump to release her from prison, with nearly six years still remaining on her sentence. Holmes’ request for commutation follows her 2022 conviction on wire fraud and conspiracy charges, and comes after a federal appeals court upheld her 11-year sentence earlier this year.",
      "url": "https://www.france24.com/en/americas/20260122-theranos-founder-elizabeth-holmes-asks-trump-for-pardon",
      "published": "Thu, 22 Jan 2026 01:36:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Danish leader says her country can't negotiate on sovereignty",
      "description": "Denmark’s prime minister is saying after U_S_ President Donald Trump announced he agreed a “framework of a future deal” on Arctic security with the head of NATO that her country can’t negotiate on its sovereignty and she has been “informed that this ha...",
      "url": "https://abcnews.go.com/International/wireStory/danish-leader-country-negotiate-sovereignty-shes-told-case-129445256",
      "published": "Thu, 22 Jan 2026 03:08:03 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Campaigning starts for Bangladesh's first national election after Hasina's ouster",
      "description": "Campaigning has begun for Bangladesh’s elections next month",
      "url": "https://abcnews.go.com/International/wireStory/campaigning-starts-bangladeshs-national-election-after-hasinas-ouster-129444573",
      "published": "Thu, 22 Jan 2026 02:09:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "A US shift marked Kurdish-led forces' fall from power in Syria",
      "description": "The Kurdish-led Syrian Democratic Forces have fallen from power in Syria as the U.S. shifts its backing to the country's new leaders in Damascus",
      "url": "https://abcnews.go.com/International/wireStory/us-shift-marked-kurdish-led-forces-fall-power-129423182",
      "published": "Wed, 21 Jan 2026 11:37:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Centuries of love letters go on display at the National Archives in London",
      "description": "Love letters spanning five centuries are on display at Britain’s National Archives",
      "url": "https://abcnews.go.com/International/wireStory/centuries-love-letters-display-national-archives-london-129421067",
      "published": "Wed, 21 Jan 2026 11:26:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Human trafficking depends on corruption at every step",
      "description": "In 2011, a trafficker in Chile was convicted for recruiting economically vulnerable Peruvian citizens and arranging for them to be brought into the country – destined to become victims of sexual exploitation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166797",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US immigration authorities allow suspect in $100M jewelry heist to self-deport before trial",
      "description": "A suspect in a $100 million jewelry heist was allowed by U.S. immigration officials to self-deport to Ecuador, avoiding a federal trial and potential prison time.",
      "url": "https://www.foxnews.com/us/us-immigration-authorities-allow-suspect-100-million-jewelry-heist-self-deport-before-trial",
      "published": "Thu, 22 Jan 2026 02:08:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Ghislaine Maxwell to testify before House committee investigating handling of Epstein case",
      "description": "Ghislaine Maxwell testimony scheduled for Feb. 9 as convicted Jeffrey Epstein associate agrees to appear before congressional committee investigating federal handling of case.",
      "url": "https://www.foxnews.com/us/ghislaine-maxwell-testify-before-house-committee-investigating-handling-epstein-case",
      "published": "Wed, 21 Jan 2026 16:53:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump praises ‘infinite’ Greenland framework deal",
      "description": "US President Donald Trump dropped his threat to impose tariffs on European countries over his bid to takeover Greenland.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/trump-praises-infinite-greenland-framework-deal?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 07:45:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "French firm Lactalis latest to recall baby formula amid contamination scare",
      "description": "Swiss food giants Nestle has also recalled infant formula batches in recent weeks over toxin fears.",
      "url": "https://www.aljazeera.com/news/2026/1/22/french-firm-lactalis-latest-to-recall-baby-formula-amid-contamination-scare?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 06:34:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump's latest visa ban hits African countries hardest",
      "description": "A decision by the US to suspend visa procedures for numerous countries, including African, has come into effect. Experts say it is part of President Trump's plan to portray immigrants as a threat to Americans.",
      "url": "https://www.dw.com/en/trump-s-latest-visa-ban-hits-african-countries-hardest/a-75590864?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 11:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland: Trump signals deal, rolls back tariff threats",
      "description": "US President Donald Trump calls announced framework for a deal on Greenland \"complex\" as details remain unclear. DW has the latest.",
      "url": "https://www.dw.com/en/greenland-trump-signals-deal-rolls-back-tariff-threats/live-75599036?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 01:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel's Somaliland recognition: Strategic ripples in Africa",
      "description": "Protests and defiance occurred in Somalia after Israel's recognition of the breakaway region of Somaliland. Analysts say it could inspire secessionist movements in other parts of the continent.",
      "url": "https://www.dw.com/en/israel-s-somaliland-recognition-strategic-ripples-in-africa/a-75590942?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 14:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Live: NATO chief cannot negotiate Greenland on behalf of Denmark, govt says",
      "description": "NATO chief Mark Rutte cannot negotiate on behalf of Denmark over Greenland, the Danish defence minister said Thursday, a day after the head of the transatlantic alliance discussed a “framework” for the future of the autonomous Danish territory with US President Donald Trump. The talks, of which few details have been made public, resulted in Trump backing down on his threats to impose tariffs on allies who opposed US acquisition of the territory. Follow our liveblog for the latest developments.",
      "url": "https://www.france24.com/en/europe/20260122-trump-pushes-to-expand-board-of-peace-challenging-un-security-council",
      "published": "Thu, 22 Jan 2026 03:41:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump cancels threatened tariffs after reaching 'framework of deal' on Greenland",
      "description": "Just hours after doubling down on his claim that the US should \"get Greenland\", Donald Trump made an abrupt U-turn on the tariffs he had threatened to slap on European nations that opposed his bid. Announcing the news on his Truth Social platform, the US president said he and NATO chief Mark Rutte had reached a \"framework of a future deal\" on Greenland and that in light of that, he would not be imposing the 10 percent import duties that were slated to go into effect on February 1.",
      "url": "https://www.france24.com/en/tv-shows/business/20260121-trump-cancels-threatened-tariffs-over-greenland",
      "published": "Wed, 21 Jan 2026 22:05:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump cancels tariff threat, says NATO's Rutte agreed to Greenland deal 'framework'",
      "description": "President Donald Trump on Wednesday withdrew ⁠a threat to impose tariffs on eight European nations for ‍their opposition to his ambitions for US ownership of Greenland, saying he had reached the outlines of a deal with NATO General Secretary Mark Rutte on the Danish autonomous territory’s future. He did not give any details of what he described as “the framework of a future deal”.",
      "url": "https://www.france24.com/en/americas/20260121-trump-cancels-tariff-threat-says-nato-rutte-agreed-greenland-deal-framework",
      "published": "Wed, 21 Jan 2026 21:55:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Cambodia will send 73 online scam suspects to South Korea",
      "description": "73 South Koreans detained in Cambodia for alleged involvement in online scams will be brought back home this week to face criminal investigation",
      "url": "https://abcnews.go.com/International/wireStory/cambodia-send-73-online-scam-suspects-south-korea-129443648",
      "published": "Thu, 22 Jan 2026 01:37:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Dozens of body parts are found after Pakistan's shopping plaza fire",
      "description": "Officials in Pakistan have discovered body parts thought to belong to over a dozen people in a Karachi shopping plaza after a devastating weekend fire",
      "url": "https://abcnews.go.com/International/wireStory/dozens-body-parts-found-after-pakistans-shopping-plaza-129422169",
      "published": "Wed, 21 Jan 2026 11:47:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US begins transfer of up to 7,000 IS group detainees from Syria to Iraq",
      "description": "The US army has begun transferring up to 7,000 detained Islamic State (IS) group fighters from Syria to prison facilities in Iraq as the Kurdish-led, US-backed Syrian Democratic Forces start handing back Syrian prisons to the government. An initial group of around 150 detainees was moved on Wednesday.",
      "url": "https://www.france24.com/en/middle-east/20260122-us-begins-transfer-of-up-to-7-000-is-group-detainees-from-syria-to-iraq",
      "published": "Thu, 22 Jan 2026 09:38:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s interim president to visit US amid deepening oil ties",
      "description": "Venezuela’s interim president Delcy Rodriguez is expected to visit the United States soon, a senior US official said Wednesday, marking a shift in relations between Washington and Caracas. The move signals President Donald Trump’s willingness to engage directly with Rodriguez’s government as the US seeks access to Venezuela’s oil reserves.",
      "url": "https://www.france24.com/en/americas/20260122-venezuela-interim-president-to-visit-usa",
      "published": "Thu, 22 Jan 2026 00:36:32 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US moves 150 Islamic State prisoners out of Syria with thousands more to follow",
      "description": "US troops have transferred 150 Islamic State (IS) prisoners from Syria to Iraq under plans that could see 7,000 detainees moved across the border.",
      "url": "https://news.sky.com/story/us-moves-150-islamic-state-prisoners-out-of-syria-with-thousands-more-to-follow-13497338",
      "published": "Wed, 21 Jan 2026 21:20:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters break free from Syrian jail amid chaotic government handover",
      "description": "U.S. military boosts regional presence with F-15 fighter jets and USS Abraham Lincoln deployment as ISIS prison break highlights security risks amid Syria's political realignment.",
      "url": "https://www.foxnews.com/world/isis-fighters-break-free-from-syrian-jail-amid-chaotic-government-handover",
      "published": "Mon, 19 Jan 2026 22:10:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Gunmen abduct dozens of worshippers from multiple Nigerian churches using sophisticated weapons",
      "description": "Gunmen allegedly abducted dozens of worshippers from two churches in Nigeria's Kaduna state, with security forces deployed to track the captors.",
      "url": "https://www.foxnews.com/world/gunmen-abduct-dozens-worshippers-multiple-nigerian-churches-using-sophisticated-weapons",
      "published": "Mon, 19 Jan 2026 21:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "UK holds off joining Trump's Board of Peace over Putin concerns",
      "description": "Foreign Secretary Yvette Cooper says the Russian president has shown no commitment to peace in Ukraine.",
      "url": "https://www.bbc.com/news/articles/cp9jj1j74ggo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 10:58:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump seeking ‘regime change’ in Cuba by end of the year: US media report",
      "description": "The Wall Street Journal reports the White House is seeking Cuban officials willing to cut a deal on regime change.",
      "url": "https://www.aljazeera.com/news/2026/1/22/trump-seeking-regime-change-in-cuba-by-end-of-the-year-us-media-report?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 07:55:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Keir Starmer to visit China with British business leaders next week, say reports",
      "description": "Prime minister’s reported trip follows approval by UK government for Beijing to build new embassy in London UK politics live – latest updates Davos live – latest updates Keir Starmer will reportedly visit China next week after controversial plans for Beijing to build a vast embassy in London were approved by his government. The UK prime minster will lead a delegation of blue-chip British companies, according to Reuters. The same firms, which include BP, HSBC, Intercontinental Hotels Group, Jaguar Land Rover and Rolls-Royce were also said to be among those who will join a revamped “UK-China CEO council”. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/21/keir-starmer-visit-china-british-business-leaders",
      "published": "Wed, 21 Jan 2026 10:09:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Europol busts massive synthetic drug production network",
      "description": "Europol has reported the break-up of a major synthetic drug supply network. Authorities called it is the biggest such operation they have ever undertaken, and a \"major blow\" to organized crime.",
      "url": "https://www.dw.com/en/europol-busts-massive-synthetic-drug-production-network/a-75595738?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 15:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Japan records a 5th straight yearly trade deficit",
      "description": "Japan has reported it posted a trade deficit for the fifth straight year in 2025 as exports were hit by President Donald Trump’s tariffs and a diplomatic rift with neighboring China",
      "url": "https://abcnews.go.com/International/wireStory/japan-records-5th-straight-yearly-trade-deficit-129441650",
      "published": "Thu, 22 Jan 2026 00:12:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Prison breaks and renewed clashes raise alarm in northeast Syria",
      "description": "The United Nations continues to monitor developments in northeast Syria following clashes between government troops and the Kurdish-led SDF militia during which scores of detained ISIL militants reportedly escaped from prison.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166799",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Trump told to 'f--- off' by Danish lawmaker during European Parliament debate about Greenland",
      "description": "European Parliament member Anders Vistisen confronts President Donald Trump's Greenland interest with profanity-laced rebuke, drawing a reprimand from parliament leadership.",
      "url": "https://www.foxnews.com/world/trump-told-f-k-off-danish-lawmaker-european-parliament-greenland-debate",
      "published": "Tue, 20 Jan 2026 16:27:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘If you sleep, settlers will burn your house’: fear in the West Bank",
      "description": "The Palestinian village of Ras Ein al-Auja has held out against violent Israeli settlers - until now.",
      "url": "https://www.aljazeera.com/features/2026/1/22/if-you-sleep-settlers-will-burn-your-house-fear-in-the-west-bank?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 05:48:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump ratcheted up the Greenland rhetoric - but has he been talked down?",
      "description": "Despite talk of a deal over Greenland, it will be hard for US allies to return to business as usual, writes the BBC’s diplomatic correspondent.",
      "url": "https://www.bbc.com/news/articles/cj3vv1kv1rdo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 01:52:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU suspends approval of US trade deal",
      "description": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland.",
      "url": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 23:41:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South African police not yet able to defeat gangs, minister says",
      "description": "Police Minister Firoz Cachalia says organised crime is growing more complex, requiring new strategies.",
      "url": "https://www.bbc.com/news/articles/cx2ll9wr562o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 08:23:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-intelligence officer in Austria's biggest spy trial for years",
      "description": "Egisto Ott, 63, denies charges of handing over information to Russian agents.",
      "url": "https://www.bbc.com/news/articles/cz0pnjv1zy5o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 10:29:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Slashed incomes and gamers go cold turkey: the fallout from Uganda's internet shutdown",
      "description": "The internet was shut during the general election, leaving many people without any income - or entertainment.",
      "url": "https://www.bbc.com/news/articles/cx2p54rm4k4o?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 04:14:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ghislaine Maxwell to testify before US Congress in Epstein probe",
      "description": "The convicted sex trafficker has previously said she would decline to answer questions unless she is granted immunity.",
      "url": "https://www.bbc.com/news/articles/cr7jlylp5keo?at_medium=RSS&at_campaign=rss",
      "published": "Thu, 22 Jan 2026 05:14:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Taylor Swift makes history as she joins Songwriters Hall of Fame",
      "description": "The US pop superstar is among nine songwriters who have been inducted into the 2026 class.",
      "url": "https://www.bbc.com/news/articles/c0mkp3yk933o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 17:42:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Faisal Islam: What it was like inside the room with Donald Trump at Davos",
      "description": "Our economics editor says there was mixed reaction in the room during Trump's Davos speech.",
      "url": "https://www.bbc.com/news/articles/cm24vjvy3n1o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 19:22:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fact-checking Trump's Davos speech",
      "description": "The US president made a series of contested claims, ranging from the status of Greenland to Nato spending.",
      "url": "https://www.bbc.com/news/articles/c301jgd1qj6o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 21 Jan 2026 19:19:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump launches ‘Board of Peace’ at ceremony in Davos",
      "description": "This is a breaking news story.",
      "url": "https://www.aljazeera.com/news/2026/1/22/trump-launches-board-of-peace-at-ceremony-in-davos?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 10:41:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Campaigning begins in Bangladesh for first election after Hasina’s ouster",
      "description": "The vote scheduled for February 12 is seen as a major test for democracy in the South Asian nation.",
      "url": "https://www.aljazeera.com/news/2026/1/22/campaigning-begins-in-bangladesh-for-first-election-after-hasinas-ouster?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 10:16:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelans share their opinions on US interference",
      "description": "Venezuelans share their opinions on US interference",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/22/venezuelans-share-their-opinions-on-us-interference?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 09:57:43 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Europe cannot condemn colonialism à la carte",
      "description": "Europe is quick to denounce Trump’s imperial fantasies while defending its own colonial past and present.",
      "url": "https://www.aljazeera.com/opinions/2026/1/22/europe-cannot-condemn-colonialism-a-la-carte?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 08:14:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Djokovic eases past qualifier Maestrelli at Australian Open",
      "description": "The 24-time Grand Slam singles winner lost just eight games and cruised into the third round at Melbourne Park.",
      "url": "https://www.aljazeera.com/sports/2026/1/22/djokovic-eases-past-qualifier-maestrelli-at-australian-open?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 07:48:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The Crimean Tatar movement trying to ruin Russia’s army from within",
      "description": "Atesh, an underground resistance group, says it has trained thousands - including Russian soldiers - in sabotage.",
      "url": "https://www.aljazeera.com/news/2026/1/22/the-crimean-tatar-group-seeking-systemic-collapse-of-russian-army?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 07:38:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bangladesh’s latest election battlegrounds: TikTok, Facebook, YouTube",
      "description": "On-the-ground campaigning kicks off on Thursday, but parties have been locked in online battles for month.",
      "url": "https://www.aljazeera.com/features/2026/1/22/tiktok-facebook-youtube-bangladeshs-latest-election-battlegrounds?traffic_source=rss",
      "published": "Thu, 22 Jan 2026 05:14:34 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former South Korean PM jailed for 23 years for role in martial law insurrection",
      "description": "Han Duck-soo verdict marks first judicial ruling stemming from ex-president Yoon Suk Yeol’s 2024 martial law decree South Korea’s former prime minister Han Duck-soo has been sentenced to 23 years in prison for his role in an insurrection stemming from the former president Yoon Suk Yeol’s failed martial law declaration . The judge, Lee Jin-kwan, ordered Han’s immediate detention. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/21/former-south-korea-pm-han-duck-soo-jailed-martial-law-insurrection",
      "published": "Wed, 21 Jan 2026 11:13:31 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sussan Ley just outlasted the Liberal party’s shortest serving leader. But will she survive another milestone?",
      "description": "A leadership challenge could be likely if Ley’s conservative rivals, Angus Taylor and Andrew Hastie, agree on who should be the candidate Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Sussan Ley passed a milestone this week. While locked in a string of party room meetings and tense negotiations with Anthony Albanese over Labor’s hate speech bill, she surpassed eight months and eight days as her party’s leader. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/22/sussan-ley-liberal-party-leadership-challenge-analysis",
      "published": "Thu, 22 Jan 2026 08:39:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-22T11:25:01.757Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-22T11:05:43.092Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-22T08:21:14.683Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-22T03:36:02.156Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Some Britons wonder if the U.S. and U.K.'s 'special relationship' may end in divorce",
      "description": "Some people in Britain are asking what it would look like for their government to sever security and intelligence ties with its closest ally, the U.S.",
      "url": "https://www.npr.org/2026/01/21/nx-s1-5682016/some-britons-wonder-if-the-u-s-and-u-k-s-special-relationship-may-end-in-divorce",
      "published": "Wed, 21 Jan 2026 18:01:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Elizabeth Holmes asks Trump to commute her prison sentence",
      "description": "Elizabeth Holmes led people to believe that her now-defunct company, Theranos, had developed a medical device that could revolutionize blood tests. She is serving an 11-year sentence for fraud and conspiracy.",
      "url": "https://www.dw.com/en/elizabeth-holmes-asks-trump-to-commute-her-prison-sentence/a-75599260?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Thu, 22 Jan 2026 04:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US begins transfer of IS fighters from Syria to Iraq",
      "description": "The US thanked Iraq for its cooperation to transfer up to 7,000 prisoners out of Syria, after the Kurdish-led SDF lost control over the territory where the prisoner camps were held.",
      "url": "https://www.dw.com/en/us-begins-transfer-of-is-fighters-from-syria-to-iraq/a-75598783?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 22:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Davos WEF: Trump touts policies, renews Greenland ambitions",
      "description": "Donald Trump used his WEF speech to praise himself and lash out at Europe while offering little on the economy. Business and political leaders were expecting the worst, but much of it was for a domestic audience.",
      "url": "https://www.dw.com/en/davos-wef-trump-touts-policies-renews-greenland-ambitions/a-75598520?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 20:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Lumumba killing case back in Belgian courts, 65 years later",
      "description": "Belgian ex-diplomat Etienne Davignon is defending himself in Brussels over his alleged role in the 1961 killing of Congolese leader Patrice Lumumba — a landmark case in Belgium's reckoning with its colonial past.",
      "url": "https://www.dw.com/en/lumumba-killing-case-back-in-belgian-courts-65-years-later/a-75594050?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 18:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump: Greenland agreement 'a deal everyone is happy with'",
      "description": "US President Donald Trump called off looming tariffs on European countries over Greenland after he said he reached a \"framework of a future deal\" over the island during a meeting with NATO Secretary General Mark Rutte.",
      "url": "https://www.dw.com/en/trump-greenland-agreement-a-deal-everyone-is-happy-with/live-75588065?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 16:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New EU anti-racism strategy misses the point, say NGOs",
      "description": "Diversity groups say the EU has weakened its newly-released policy to tackle discrimination. But was it due to fears of negative reactions from the Trump administration?",
      "url": "https://www.dw.com/en/new-eu-anti-racism-strategy-misses-the-point-say-ngos/a-75588965?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 15:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "European Parliament votes to delay Mercosur deal in court",
      "description": "Lawmakers voted narrowly to challenge the EU trade deal with Latin America in the bloc's top court, a move that could derail the deal. Chancellor Friedrich Merz said the deal should be provisionally enacted anyway.",
      "url": "https://www.dw.com/en/european-parliament-votes-to-delay-mercosur-deal-in-court/a-75593480?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 21 Jan 2026 15:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Liverpool close in on Champions League round of 16 with win over Marseille",
      "description": "Liverpool cruised past Marseille 3-0 to put themselves in a strong position to finish in the Champions League top eight. The French side will have to beat Club Brugge in their final match to clinch a playoff spot.",
      "url": "https://www.france24.com/en/tv-shows/sports/20260122-liverpool-close-in-on-round-of-16-with-3-0-win-over-marseille",
      "published": "Thu, 22 Jan 2026 06:14:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marseille’s hopes dented as Liverpool wins 3–0 in Champions League clash",
      "description": "Marseille’s push for a place in the Champions League knockout stages suffered a significant setback on Wednesday as Liverpool delivered a dominant 3–0 victory at the Stade Vélodrome. The home side struggled to convert promising moments into goals, leaving them reliant on a final league match against Club Brugge to reach the play-off round.",
      "url": "https://www.france24.com/en/sport/20260121-marseille-hopes-dented-liverpool-win-champions-league",
      "published": "Wed, 21 Jan 2026 23:23:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The penny dropped over Trump's Greenland plans - self-defeating, undeliverable and frankly mad",
      "description": "European governments and their diplomats here in Washington are as relieved as they are exasperated by this extraordinary Greenland show and latest act which played out in the Swiss Alps over the past 24 hours.",
      "url": "https://news.sky.com/story/the-truth-behind-trumps-greenland-deal-13497401",
      "published": "Thu, 22 Jan 2026 02:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Quick take: Major tariff U-turn for Trump",
      "description": "👉 Follow Trump100 on your podcast app 👈",
      "url": "https://news.sky.com/story/quick-take-major-tariff-u-turn-for-trump-13497318",
      "published": "Wed, 21 Jan 2026 20:53:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why is Ryanair fighting with Elon Musk?",
      "description": "Elon Musk has said he could buy Ryanair amid an ongoing public spat with the budget airline's boss Michael O'Leary.",
      "url": "https://news.sky.com/story/elon-musk-vs-ryanair-could-tech-billionaire-actually-buy-budget-airline-and-what-started-online-spat-13497018",
      "published": "Wed, 21 Jan 2026 08:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazilians affected by US visa suspension evoke frustration but try to remain hopeful",
      "description": "Brazilians hoping to move to the U.S. are frustrated by the suspension of immigrant visas",
      "url": "https://abcnews.go.com/International/wireStory/brazilians-affected-us-visa-suspension-evoke-frustration-remain-129436310",
      "published": "Wed, 21 Jan 2026 18:49:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Peru's interim president faces calls for removal over unregistered meetings with Chinese businessmen",
      "description": "Peru's interim President José Jerí is facing scrutiny for unregistered meetings with two Chinese business owners",
      "url": "https://abcnews.go.com/International/wireStory/perus-interim-president-faces-calls-removal-unregistered-meetings-129433570",
      "published": "Wed, 21 Jan 2026 16:25:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Dior is back:' Menswear turns a corner in Paris as Jonathan Anderson hones his vision",
      "description": "Dior’s menswear show arrived with a stripped-back set and a loud signal of intent: spiky neon-yellow wigs that read like a flag planted in the Paris runway",
      "url": "https://abcnews.go.com/International/wireStory/dior-back-menswear-turns-corner-paris-jonathan-anderson-129426914",
      "published": "Wed, 21 Jan 2026 13:37:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guinea-Bissau junta sets election date following last year's coup",
      "description": "Guinea-Bissau's military junta has set a date for democratic elections following its takeover late last year",
      "url": "https://abcnews.go.com/International/wireStory/guinea-bissau-junta-sets-election-date-years-coup-129425067",
      "published": "Wed, 21 Jan 2026 13:13:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cold kills another infant in Gaza as West Bank displacement intensifies",
      "description": "Another child in the Gaza Strip has died from hypothermia as winter weather continues to whip the enclave, the UN said on Wednesday, citing information from the health authorities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166804",
      "published": "Wed, 21 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jealous Texas woman allegedly launches 25-pound gym weight at romantic rival in fitness center",
      "description": "A jealous woman allegedly hurled a 25-pound weight at her romantic rival's head during a gym confrontation in Houston. The victim narrowly escaped serious injury.",
      "url": "https://www.foxnews.com/us/jealous-texas-woman-allegedly-launches-25-pound-gym-weight-romantic-rival-fitness-center",
      "published": "Wed, 21 Jan 2026 19:42:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "NYPD detectives mistaken for ICE, treated rudely by hospital staff after scuffle with suspect",
      "description": "NYPD detectives were allegedly mistaken for ICE agents at a NYC hospital and treated rudely while seeking care after an arrest. The hospital apologized to the police commissioner.",
      "url": "https://www.foxnews.com/us/nypd-detectives-mistaken-ice-treated-rudely-hospital-staff-scuffle-suspect",
      "published": "Wed, 21 Jan 2026 19:10:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "PETA suggests replacing Punxsutawney Phil with hologram for Groundhog Day: 'Let Phil and his family retire'",
      "description": "PETA proposes a high-tech hologram replace Punxsutawney Phil at the annual Groundhog Day celebration, offering a 3D projection with weather predictions.",
      "url": "https://www.foxnews.com/us/peta-suggests-replacing-punxsutawney-phil-hologram-groundhog-day-let-phil-his-family-retire",
      "published": "Wed, 21 Jan 2026 18:54:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ICE reels in the worst of the worst with Operation Catch of the Day in Maine",
      "description": "ICE launched Operation Catch of the Day in Maine, arresting over 50 people with 1,400 targets identified under Trump's immigration enforcement crackdown.",
      "url": "https://www.foxnews.com/us/ice-reels-worst-worst-operation-catch-day-maine",
      "published": "Wed, 21 Jan 2026 17:35:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "FBI solves Colonial Parkway murders thanks to new technology, bureau says",
      "description": "A DNA breakthrough helped solve the 38-year-old Colonial Parkway murders cold case, linking a deceased fisherman to killings of at least six young people in Virginia.",
      "url": "https://www.foxnews.com/us/fbi-solves-colonial-parkway-murders-thanks-new-technology-bureau-says",
      "published": "Wed, 21 Jan 2026 14:18:41 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US begins transferring ISIS detainees from Syria to Iraq amid security transition",
      "description": "U.S. forces moved 150 ISIS detainees from Syria to Iraq as CENTCOM began a transfer operation involving up to 7,000 radical prisoners.",
      "url": "https://www.foxnews.com/world/us-begins-transferring-isis-detainees-from-syria-iraq-amid-security-transition",
      "published": "Wed, 21 Jan 2026 14:20:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Netanyahu agrees to join Trump’s Gaza Board of Peace after initial pushback",
      "description": "Israeli Prime Minister Benjamin Netanyahu said he will join President Donald Trump’s newly formed Gaza Board of Peace after initially criticizing its structure.",
      "url": "https://www.foxnews.com/world/netanyahu-agrees-join-trumps-gaza-board-peace-after-initial-pushback",
      "published": "Wed, 21 Jan 2026 03:35:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US forces apprehend sanctioned vessel in Caribbean maritime operation targeting illicit oil transport",
      "description": "U.S. military forces apprehended Motor Vessel Sagitta in the Caribbean as part of Operation Southern Spear targeting sanctioned tanker vessels.",
      "url": "https://www.foxnews.com/world/us-forces-apprehend-sanctioned-vessel-caribbean-maritime-operation-targeting-illicit-oil-transport",
      "published": "Tue, 20 Jan 2026 16:40:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump confirms he invited Putin to join his Board of Peace: 'He's been invited'",
      "description": "U.S. President Donald Trump on Monday confirmed Russian President Vladimir Putin was invited to the Board of Peace for supervision of the Gaza plan.",
      "url": "https://www.foxnews.com/world/trump-confirms-he-invited-putin-join-his-board-peace-hes-been-invited",
      "published": "Tue, 20 Jan 2026 02:40:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark ramps up defenses in Greenland as Trump zeros in on control of territory",
      "description": "Denmark deploys additional troops to Greenland after President Donald Trump claims the island is not secure from Russia or China.",
      "url": "https://www.foxnews.com/world/denmark-ramps-up-defenses-greenland-trump-zeros-control-territory",
      "published": "Mon, 19 Jan 2026 20:09:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}