{
  "last_updated": "2026-01-31T23:24:37.800419Z",
  "event_count": 222,
  "events": [
    {
      "title": "Islamic State claims attack on international airport and airbase in Niger",
      "description": "Motorcycle-riding militants launch strikes using heavy weaponry and drones, damaging planes belonging to Ivorian carrier and Togolese airline Islamic State in the Sahel has claimed responsibility for an audacious assault at the international airport and adjacent air force base in Niamey, the capital of Niger, according to the SITE Intelligence Group, which tracks jihadist activity and communications worldwide. The attack, which began shortly after midnight on Thursday, reportedly involved motorcycle-riding militants who launched a “surprise and coordinated” strike using heavy weaponry and drones, according to statements released via IS in the Sahel’s propaganda arm, Amaq news agency. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/niger-airport-airbase-attack-islamic-state",
      "published": "Fri, 30 Jan 2026 15:57:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 53,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: IOM warning for Sudan returnees, Nipah virus alert for India, food security in Afghanistan",
      "description": "In Sudan, where the devastating conflict between the Sudanese army and rival paramilitary Rapid Support Forces is nearing the end of its third year, more than three million people have returned to their areas of origin, the International Organization for Migration (IOM) announced on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166855",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "IDF says Gaza strikes hit terrorists, weapons facilities after ceasefire breach; hospitals report 30 killed",
      "description": "At least 30 Palestinians were reportedly killed in Israeli strikes across Gaza as ceasefire tensions escalate ahead of Rafah border crossing reopening.",
      "url": "https://www.foxnews.com/world/idf-says-gaza-strikes-hit-terrorists-weapons-facilities-after-ceasefire-breach-hospitals-report-30-killed",
      "published": "Sat, 31 Jan 2026 09:22:48 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 43,
      "severity_level": "Critical"
    },
    {
      "title": "Niger’s military ruler vows retaliation after gunfire and explosions heard in capital",
      "description": "General Tchiani accuses France, Benin and the Ivory Coast of links to attack near Niamey’s airport and thanks Russian troops for defence efforts Heavy security has been deployed around the main airport in Niger’s capital, Niamey, after overnight gunfire and explosions that the country’s military ruler blamed without evidence on France, Benin and Côte d’Ivoire. The shooting and detonations began shortly after midnight on Wednesday, according to residents of a neighbourhood near the airport, which is next to Base Aérienne 101, a military base previously used by US and then Russian troops . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/29/gunfire-blasts-heard-airport-niamey-niger-planes-hit-reports",
      "published": "Fri, 30 Jan 2026 00:34:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Iran explosions: What we know so far",
      "description": "An explosion rocked the southern Iranian port of Bandar Abbas on Saturday, Iranian news agencies said, but the cause of the blast was not known. The semi-official Tasnim news agency said that social media reports alleging that a Revolutionary Guard navy commander had been targeted were \"completely false\". Separately, four people were killed after a gas explosion in the city of Ahvaz near the Iraqi border, according to state-run Tehran Times. France 24’s international affairs editor Kethevane Gorjestani takes a look at what we know so far.",
      "url": "https://www.france24.com/en/video/20260131-iran-explosions-what-we-know-so-far",
      "published": "Sat, 31 Jan 2026 14:27:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s policies ‘erodes the fabric of global cooperation’, ex-Swedish PM Bildt says",
      "description": "As the UN stands on the brink of financial collapse, Iran stands on the brink of possible US strikes and many world leaders navigate how to handle US President Donald Trump, FRANCE 24 spoke to Carl Bildt, Sweden’s former prime minister, about the impact of the US leader’s foreign policies on the international community and rules-based order.",
      "url": "https://www.france24.com/en/europe/20260131-trump-s-policies-erodes-the-fabric-of-global-cooperation-ex-swedish-pm-bildt-says",
      "published": "Sat, 31 Jan 2026 18:28:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Mexico president says Trump tariffs on Cuba’s oil suppliers could trigger humanitarian crisis",
      "description": "Island country only has oil enough to last 15-20 days, and 12-hour blackouts have become commonplace Mexico ’s president, Claudia Sheinbaum , has warned that Donald Trump ’s move to slap new tariffs on countries sending oil to Cuba could trigger a humanitarian crisis on the island, which is already suffering from chronic fuel shortages and regular blackouts. The US president signed an executive order on Thursday declaring a national emergency and laying the groundwork for such tariffs, ratcheting up the pressure to topple the communist government in Havana. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/mexico-sheinbaum-trump-tariffs-cuba-oil-crisis",
      "published": "Fri, 30 Jan 2026 18:08:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "EU to list Iran's Revolutionary Guard as terrorists; Germany warns of rapid action",
      "description": "The European Union approved new sanctions targeting Iranian officials and designated the Islamic Revolutionary Guard Corps a terrorist group over protest suppression and Russia support.",
      "url": "https://www.foxnews.com/world/eu-list-irans-revolutionary-guard-terrorists-germany-warns-rapid-action",
      "published": "Thu, 29 Jan 2026 17:41:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "South Africa expels top Israeli diplomat over ‘insulting attacks’ on president",
      "description": "Ariel Seidman declared persona non grata and given 72 hours to leave country after remarks on social media South Africa and Israel have engaged in a tit-for-tat expulsion of senior diplomats, after South Africa ordered Israel’s chargé d’affaires to leave within 72 hours, citing “insulting attacks” on South Africa’s president, Cyril Ramaphosa, on social media. Ariel Seidman, the chargé d’affaires at Israel’s embassy in Pretoria, was declared persona non grata by South Africa’s department for international relations and cooperation (DIRCO) in a statement on its website on Friday afternoon. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/south-africa-expels-israel-diplomat-insults-president",
      "published": "Fri, 30 Jan 2026 14:11:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Weather tracker: Winter storms cause death and outages across eastern north America",
      "description": "Millions told to stay home in US and more than a million are left without power, while Australia faces record heatwave Cold weather across a vast swathe of the eastern US has been the likely cause of at least 49 deaths in the past week. At one point, about 213 million people were under some sort of winter weather warnings, affecting areas from New Mexico to New England – a spread of about 2,000 miles (3,200km). Millions were told to stay at home, and at one point there were more than a million people without power. As of Wednesday night, there were still 312,000 outages, mostly across Tennessee, Mississippi, Louisiana and Texas. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/30/weather-tracker-winter-storms-cause-death-and-outages-across-eastern-north-america",
      "published": "Fri, 30 Jan 2026 10:45:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "More than 200 killed in coltan mine collapse in eastern DRC, officials say",
      "description": "Rubaya mine produces about 15% of the world’s coltan, which is processed into tantalum, used in mobile phones More than 200 people were killed this week in a collapse at the Rubaya coltan mine in eastern Democratic Republic of Congo, Lumumba Kambere Muyisa, a spokesperson for the rebel-appointed governor of the province where the mine is located, told Reuters on Friday. Rubaya produces about 15% of the world’s coltan, which is processed into tantalum – a heat-resistant metal that is in high demand by makers of mobile phones, computers, aerospace components and gas turbines. The site, where local people dig manually for a few dollars a day, has been under the control of the M23 rebel group since 2024. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/more-than-200-killed-in-coltan-mine-collapse-in-eastern-drc-officials-say",
      "published": "Fri, 30 Jan 2026 22:11:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Explosions at two Iranian cities amid rising tensions with US",
      "description": "At least one person was killed and 14 injured in an explosion in the ⁠southern Iranian port of Bandar Abbas on Saturday, a local official told Iranian news agencies, but the cause of the blast was not known. Separately, four people were killed after a gas explosion in the city of Ahvaz near the Iraqi border, according to state-run Tehran Times. The blasts come at a tense time after a major US military deployment to the region.",
      "url": "https://www.france24.com/en/video/20260131-explosions-at-two-iranian-cities-amid-rising-tensions-with-us",
      "published": "Sat, 31 Jan 2026 15:51:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "'There's no ceasefire': Israeli strikes kill 30 Palestinians, including children, in Gaza",
      "description": "Israeli air strikes killed at east 30 people in Gaza Saturday, including children, according to hospitals, as the military said it attacked in response to a Hamas ceasefire violation. Despite a US-brokered ceasefire entering its second phase earlier this month, violence in the Palestinian territory has continued, with both Israel and Hamas accusing each other of violating the truce agreement.",
      "url": "https://www.france24.com/en/video/20260131-no-ceasefire-israeli-strikes-kill-30-palestinians-including-children-gaza",
      "published": "Sat, 31 Jan 2026 15:50:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "UN watchdog warns Ukraine war remains world’s biggest threat to nuclear safety",
      "description": "The war in Ukraine remains the world’s biggest threat to nuclear safety as a fifth year of combat looms, the head of the UN nuclear watchdog warned on Friday, citing continued risks to power supplies at nuclear sites vulnerable to fighting nearby.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166863",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly blast rips Iranian port city as Tehran plans naval drills in Strait of Hormuz",
      "description": "An explosion at a building in the southern Iranian port city of Bandar Abbas on Saturday killed one person and wounded 14, according to authorities. The blast came a day before a planned Iranian naval drill in the strategic Strait of Hormuz. Amid frantic regional diplomatic efforts to de-escalate tensions, President Donald Trump on Saturday said Iran was \"taking to us\".",
      "url": "https://www.france24.com/en/middle-east/20260131-deadly-blast-rips-iranian-port-city-as-tehran-plans-naval-drills-in-strait-of-hormuz",
      "published": "Sat, 31 Jan 2026 20:08:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "DRC: Many killed in coltan mine disaster in east — rebels",
      "description": "At least 200 were killed when mines collapsed at a coltan mining site in eastern Congo this week, rebel authorities say. The Rubaya mines, where the disaster occurred, supply a key metal for smartphones and computers.",
      "url": "https://www.dw.com/en/drc-many-killed-in-coltan-mine-disaster-in-east-rebels/a-75737682?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 09:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Thousands take to streets in Minnesota and across US to protest ICE",
      "description": "Thousands of protesters took to the streets in Minneapolis and ⁠students across the United States staged walkouts on Friday to demand the withdrawal of federal immigration agents from Minnesota following the fatal shootings of two US citizens. Meanwhile, rock star Bruce Springsteen lent his voice to the protest, taking the stage at a fundraiser for Good and Pretti in downtown Minneapolis and playing his new song \"Streets of Minneapolis\".",
      "url": "https://www.france24.com/en/video/20260131-thousands-take-to-streets-in-minnesota-and-across-us-to-protest-ice",
      "published": "Sat, 31 Jan 2026 09:58:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘deeply concerned’ by escalation of violence in South Sudan",
      "description": "The world's youngest country, South Sudan, is facing continued instability and violence as military escalation looms, following reports earlier this week that a senior army commander had called on troops to inflict indiscriminate violence against civilians in Jonglei state.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166859",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Remembering the Holocaust: ‘You are here because you choose hope over hate’",
      "description": "The Holocaust is a warning, that hatred “can consume everything” – a message that feels more urgent than ever, the UN chief said on Tuesday, as antisemitism rages worldwide.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166840",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Five killed in gas explosions in Iran, officials say",
      "description": "Fourteen people are reportedly injured after separate blasts were reported on Saturday.",
      "url": "https://www.bbc.com/news/articles/cd9ew5p3zvko?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 22:03:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar crisis deepens five years after coup, as military ballot entrenches repression",
      "description": "Five years after Myanmar’s military seized power and jailed the country’s elected leaders, the United Nations says the country’s crisis has only deepened, marked by escalating violence, mass displacement and a military-controlled election that UN officials warn has further entrenched repression rather than restored civilian rule.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166866",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Violence roiling Nigeria extends beyond religious lines, amid a deepening humanitarian crisis",
      "description": "When the United States ordered airstrikes on Christmas Day against Islamist militants in northern Nigeria, officials in Washington said the action was aimed at protecting Christians facing threats of violence.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166857",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: 1 killed after explosion hit Bandar Abbas Port",
      "description": "The blast in the Iranian city of Bandar Abbas comes amid heightened US-Iran tensions. State media has attributed the incident to a gas leak.",
      "url": "https://www.dw.com/en/iran-1-killed-after-explosion-hit-bandar-abbas-port/a-75740142?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 13:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Separatists launch 'coordinated' attacks in southwest Pakistan",
      "description": "Ethnic Baloch separatists launched \"coordinated\" attacks across Pakistan's Balochistan province on Saturday, killing at least ten policemen, officials said, the latest violence in insurgency-hit southwest region. FRANCE 24's correspondent Shahzaib Wahlah reports that the situation in the provincial capital of Quetta remains tense.",
      "url": "https://www.france24.com/en/video/20260131-separatists-launch-coordinated-attacks-in-southwest-pakistan",
      "published": "Sat, 31 Jan 2026 11:39:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Salman Rushdie refuses to be 'diverted' by terrorism after surviving near-fatal stabbing attack",
      "description": "Salman Rushdie premieres documentary about his 2022 stabbing attack at Sundance Film Festival, sharing his powerful story of survival and resilience.",
      "url": "https://www.foxnews.com/us/salman-rushdie-refuses-diverted-terrorism-after-surviving-near-fatal-stabbing-attack",
      "published": "Sat, 31 Jan 2026 08:00:39 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "UN faces severe cash crisis as Trump admin ramps up pressure on world body",
      "description": "U.N. faces potential cash crisis by July as unpaid dues hit record $1.568 billion. Secretary-General António Guterres warns of liquidity problems amid funding cuts.",
      "url": "https://www.foxnews.com/world/un-faces-severe-cash-crisis-trump-admin-ramps-up-pressure-world-body",
      "published": "Fri, 30 Jan 2026 12:53:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli strikes on Gaza kill dozens as violence continues despite ceasefire",
      "description": "Hospitals in Gaza said Israeli strikes killed at least 29 Palestinians Saturday, one of the highest tolls since the October ceasefire aimed at stopping the fighting. A day after Israel accused Hamas of new ceasefire violations, strikes hit locations throughout Gaza, including lethal ones on an apartment building in Gaza City and a tent camp in Khan Younis, officials at hospitals that received the bodies said.",
      "url": "https://www.france24.com/en/video/20260131-israeli-strikes-on-gaza-kill-dozens-as-violence-continues-despite-ceasefire",
      "published": "Sat, 31 Jan 2026 14:09:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "'Technical malfunction' causes mass power outages in Ukraine",
      "description": "Ukraine reported mass power outages across its power grid on Saturday due to a \"technical malfunction\" affecting international power lines. The power cuts come as Ukraine faces a particularly harsh winter and increased Russian attacks on energy infrastructure that have caused major disruption to heat, electricity and water provision in recent weeks.",
      "url": "https://www.france24.com/en/europe/20260131-technical-malfunction-causes-mass-power-outages-in-ukraine",
      "published": "Sat, 31 Jan 2026 11:18:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Israeli strikes kill 23 Palestinians as Gaza ceasefire inches forward",
      "description": "Hospitals in Gaza said Israeli strikes killed at least 23 Palestinians Saturday, one of the highest tolls since the October ceasefire aimed at stopping the fighting.",
      "url": "https://www.npr.org/2026/01/31/g-s1-108142/israeli-strikes-kill-23-palestinians-gaza",
      "published": "Sat, 31 Jan 2026 06:13:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gas leaks blamed for explosions in two Iranian cities",
      "description": "An explosion reported on Saturday at a residential building in the southern Iranian city of Bandar Abbas on the Gulf coast was the result of a gas leak, according to the local fire chief. Another explosions in the city of Ahvaz near the Iraqi border had also earlier been blamed on a gas leak, according to state media.",
      "url": "https://www.france24.com/en/video/20260131-gas-leaks-blamed-for-explosions-in-two-iranian-cities",
      "published": "Sat, 31 Jan 2026 16:30:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Blockade, strikes: What are the US military's options in Iran?",
      "description": "As more warships arrive near Iran to reinforce what US President Donald Trump calls the \"Armada\", what are the US's military options if it goes ahead with an intervention? Several scenarios are emerging, including a naval blockade that would prevent Iran from exporting its oil. Or surgical strikes against what remains of the Iranian regime's nuclear and ballistic programs.",
      "url": "https://www.france24.com/en/video/20260131-blockade-strikes-what-are-the-us-military-s-options-in-iran",
      "published": "Sat, 31 Jan 2026 10:06:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘We must stand up for our shared humanity - each and every day’: UN human rights chief",
      "description": "On the eve of International Holocaust Remembrance Day, UN High Commissioner for Human Rights Volker Türk called on the global community to “not only to look at our past, but to reflect on our present, and to safeguard our future.”",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166836",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN risks 'imminent financial collapse', secretary general warns",
      "description": "António Guterres says the international body could run out of money by July due to members' unpaid fees.",
      "url": "https://www.bbc.com/news/articles/cr579mdv4m7o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 16:24:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump threatens tariffs on goods from countries that sell oil to Cuba",
      "description": "White House cites Cuba’s ties to hostile powers as order ratchets up Trump’s pressure to topple its government Donald Trump signed an executive order on Thursday laying the groundwork to slap tariffs on goods from countries that provide oil to Cuba, the White House said. The order, which ratchets up Trump’s pressure to topple the communist government, declares a national emergency and establishes a process for the US secretaries of state and commerce to assess tariffs against countries that sell or otherwise provide oil to the island nation. The White House has yet to specify tariff rates for violating its new policy of blocking Cuba from buying oil. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/29/trump-tariffs-cuba-oil",
      "published": "Fri, 30 Jan 2026 01:06:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "More than 200 killed after landslide collapses smartphone mineral mines",
      "description": "More than 200 people have been reported dead after a landslide hit coltan mines in the Democratic Republic of Congo.",
      "url": "https://news.sky.com/story/more-than-200-killed-after-landslide-hits-miners-extracting-key-smartphone-mineral-13501303",
      "published": "Sat, 31 Jan 2026 09:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "More than 200 killed in mine collapse in DR Congo",
      "description": "The mine gave way after heavy rains on Wednesday, a local rebel spokesman says.",
      "url": "https://www.bbc.com/news/articles/cly381dvnvzo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 13:18:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Appropriating the death count: Manufacturing consent for an attack on Iran",
      "description": "Protest death toll speculations are used to rally support for an attack on Iran and downplay the genocide in Gaza.",
      "url": "https://www.aljazeera.com/opinions/2026/1/31/appropriating-the-death-count-manufacturing-consent-for-an-attack-on-iran?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 18:01:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Drone strikes in Ethiopia’s Tigray kill one amid fears of renewed conflict",
      "description": "The attack comes amid fears of a return to conflict following clashes between government troops and Tigrayan forces.",
      "url": "https://www.aljazeera.com/news/2026/1/31/drone-strikes-in-ethiopias-tigray-kill-one-amid-fears-of-renewed-conflict?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 13:49:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Pakistan: Dozens killed in 'coordinated' Balochistan attacks",
      "description": "Officials have said at least 15 security personnel and 92 militants were killed in southwestern Balochistan province. Pakistan has been battling a separatist insurgency in the region for decades.",
      "url": "https://www.dw.com/en/pakistan-dozens-killed-in-coordinated-balochistan-attacks/a-75737955?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 09:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Who are the Baloch Liberation Army, the group behind Pakistan attacks?",
      "description": "Some 10 police and security personnel and 11 civilians were killed during orchestrated militant attacks across the southwestern province of Balochistan Saturday, Pakistan officials said. The banned separatist group Baloch Liberation Army (BLA) claimed responsibility for the attacks in a region that has faced a decades-long insurgency by ethnic Baloch militant groups. France 24’s correspondent Shahzaib Wahlah takes a closer look.",
      "url": "https://www.france24.com/en/video/20260131-who-are-the-baloch-liberation-army-the-group-behind-pakistan-attacks",
      "published": "Sat, 31 Jan 2026 14:13:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "At least 200 killed in coltan mine collapse in eastern Congo, rebel authorities say",
      "description": "Rebel authorities say at least 200 people were killed in a landslide at coltan mines in eastern Congo",
      "url": "https://abcnews.go.com/International/wireStory/200-killed-coltan-mine-collapse-eastern-congo-rebel-129728737",
      "published": "Sat, 31 Jan 2026 02:14:14 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Syria ceasefire welcomed, ‘Olympic truce’, Ukraine’s freezing children",
      "description": "The UN Commission of Inquiry on Syria has welcomed a ceasefire agreement between the Syrian Government and the mainly-Kurdish Syrian Democratic Forces (SDF), urging all parties to seize the moment to protect civilians and prevent further violations in the country’s northeast.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166864",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Explosion in Iran’s Bandar Abbas caused by gas leak, official says",
      "description": "Local fire official says gas leak likely caused blast that ripped through residential building in Iranian port city.",
      "url": "https://www.aljazeera.com/news/2026/1/31/explosion-in-irans-bandar-abbas-caused-by-gas-leak-official-says?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 17:26:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Starmer hopes his China trip will begin the thaw after recent ice age",
      "description": "PM flies out after courting world’s second biggest economy aware of difficult balance of risks and potential rewards The last British prime minister to visit China was Theresa May in 2018 . Before the visit, she and her team were advised to get dressed under the covers because of the risk of hidden cameras having been placed in their hotel rooms to record compromising material. Keir Starmer, in Beijing this week, was more sanguine about his privacy, even though the security risks have, if anything, increased since the former Tory prime minister was in town. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/31/starmer-hopes-his-china-trip-will-begin-the-thaw-after-recent-ice-age",
      "published": "Sat, 31 Jan 2026 06:00:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Two men in their 20s found dead at Sydney property",
      "description": "Men – both aged 28 – found at a home in Glenorie on Saturday, New South Wales police say Get our breaking news email , free app or daily news podcast Two 28-year-old men have been found dead at a property in Sydney’s north-west in an incident police are treating as not suspicious. In a statement, New South Wales police said emergency services were called at about 8.40am on Saturday to a home on Harrisons Lane, Glenorie, 40km north-west of the Sydney CBD, following reports of a concern for welfare. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/31/two-men-in-their-20s-found-dead-at-sydney-property",
      "published": "Sat, 31 Jan 2026 03:45:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "On a trip to Denmark, a reporter sees lawmakers take on the role of diplomats",
      "description": "NPR congressional correspondent Barbara Sprunt watched U.S. lawmakers attempt a diplomatic rescue mission in Denmark amid the Greenland crisis.",
      "url": "https://www.npr.org/2026/01/31/nx-s1-5690097/on-a-trip-to-denmark-a-reporter-sees-lawmakers-take-on-the-role-of-diplomats",
      "published": "Sat, 31 Jan 2026 16:50:20 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Israeli strikes kill at least 30 across Gaza in one of highest tolls since October ceasefire",
      "description": "New Israeli air strikes slammed targets across Gaza on Saturday, including a Gaza City residential building and a tent camp Khan Younis, killing at least 30 people, hospital officials said. The strikes come just a day before the announced reopening of the enclave's Rafah crossing with Egypt and mark a continually rising death toll as Israel and Hamas trade accusations of violating the ceasefire.",
      "url": "https://www.france24.com/en/middle-east/20260131-israeli-strikes-kill-30-palestinians-including-children-gaza-ceasefire-inches-forward",
      "published": "Sat, 31 Jan 2026 13:08:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "‘We children saw things that no one should ever have to see’ Holocaust survivor tells the UN",
      "description": "Holocaust survivor Marion Blumenthal Lazan, gave a harrowing and heart-rendering account of her childhood under Nazi persecution during Tuesday’s Holocaust Memorial event in New York, urging citizens worldwide to push back against ‘negativity’ by choosing “love, respect and compassion” in how they treat one another.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166851",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "From lunch tray to lifelong health: WHO sets global standards for school meals",
      "description": "For the first time ever, the World Health Organization (WHO) is providing recommendations for healthy and nutritious food in schools around the world.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166843",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Shooting at Louisiana Mardi Gras parade leaves multiple people injured: reports",
      "description": "Multiple people were reportedly injured in a shooting during a Mardi Gras parade in Clinton, Louisiana, and authorities are investigating the incident.",
      "url": "https://www.foxnews.com/us/shooting-louisiana-mardi-gras-parade-leaves-multiple-people-injured-local",
      "published": "Sat, 31 Jan 2026 15:32:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump declares national emergency over Cuba, threatens tariffs on nations that supply oil to communist regime",
      "description": "Trump declared a national emergency over Cuba, accusing the communist regime of aligning with hostile powers and ordering new tariffs on oil suppliers to the island nation.",
      "url": "https://www.foxnews.com/world/trump-declares-national-emergency-cuba-threatens-tariffs-nations-supply-oil-communist-regime",
      "published": "Thu, 29 Jan 2026 22:04:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Israeli air strikes kill at least 32 Palestinians in Gaza, rescue officials say",
      "description": "Israel's military confirmed the strikes, which come during a ceasefire that Israel and Hamas accuse each other of breaking.",
      "url": "https://www.bbc.com/news/articles/c701g1g00gdo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 18:06:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Luigi Mangione will not face death penalty if convicted, judge rules",
      "description": "A judge dismisses two federal counts against the 27-year-old, but he still faces state murder charges.",
      "url": "https://www.bbc.com/news/articles/c78egdg3r0po?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 23:30:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Pakistan beat Australia to seal cricket series in T20 World Cup warm-up",
      "description": "Pakistan thump Australia by 90 runs in Lahore in second T20 of tour to seal three-match T20 series 2-0.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/pakistan-beat-australia-to-seal-cricket-series-in-t20-world-cup-warm-up?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 15:25:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Israel split over plans to bring back death penalty for deadly attacks",
      "description": "In a highly controversial move, some Israeli MPs are trying to introduce the death penalty for Palestinian attackers.",
      "url": "https://www.bbc.com/news/articles/clymp8v7ye2o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 06:09:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Heatwave across Australia’s south-east continues for eighth day ahead of a welcome cool change",
      "description": "The BoM forecasts parts of inland NSW will exceed 45C on Saturday, with Thargomindah in Queensland to reach 46C, Mildura 45C and Canberra 41C Get our breaking news email , free app or daily news podcast A cool change this weekend is expected to bring an end to eight consecutive days of blistering temperatures above 40C in Australia’s south-east. But before it does, the heat continued on Saturday. Heatwave warnings remained in place for parts of every state and territory excluding Tasmania, with Canberra forecast to reach a top of 41C and parts of inland New South Wales, including Broken Hill, expected to climb higher than 45C. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/31/australia-heatwave-bom-weather-forecast-hot-temperature-eighth-day-cool-change",
      "published": "Sat, 31 Jan 2026 01:17:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump's military interventions concern China despite there being no direct risk",
      "description": "China is troubled by President Trump's military interventions and threats of regime change around the world, even if they don't necessarily pose a direct threat to China.",
      "url": "https://www.npr.org/2026/01/30/nx-s1-5668231/trumps-military-interventions-concern-china-despite-there-being-no-direct-risk",
      "published": "Fri, 30 Jan 2026 04:51:06 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Madison Square Garden warns brawlers of life bans before Lopez vs Stevenson",
      "description": "New York venue Madison Square Gardens issues warning before Teofimo Lopez vs Shakur Stevenson and Knicks vs Lakers bill.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/madison-square-garden-to-life-ban-brawlers-ahead-of-lopez-vs-stevenson?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 13:01:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Sudan: ‘All the conditions for a human catastrophe are present’",
      "description": "Military tensions in South Sudan are “rapidly expanding” between Government forces and opposition militia as fighting continues in restive Jonglei state.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166865",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump picks Kevin Warsh to lead the US Federal Reserve",
      "description": "The 55-year-old economist had been considered for Fed chair during Trump's first term.",
      "url": "https://www.bbc.com/news/articles/c2d7yddrl2xo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 16:22:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Palau lawmakers vote to block controversial Trump deal to resettle migrants from US",
      "description": "A plan to resettle third-country nationals from the US to the Pacific nation faces an uncertain future amid unease over the deal A controversial Trump administration deal to relocate deportees from the US to the small Pacific nation of Palau faces an uncertain future, after the senate voted to block the deal as concern about the agreement grows. The deal, which allows up to 75 third-country migrants facing removal from the US to live and work in Palau, was signed by president Surangel Whipps Jr in December . Palau’s lower house now has to consider the deal, and the final decision rests with Whipps Jr. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/palau-pacific-country-blocks-trump-migrant-deal",
      "published": "Fri, 30 Jan 2026 04:27:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Venezuelan interim president proposes mass amnesty law, closure of notorious prison",
      "description": "Venezuela's acting president Delcy Rodriguez announced on Friday a push for mass amnesty in the country, saying she will propose a \"general amnesty law covering the entire period of political violence from 1999 to the present.\" She also announced plans to close the notorious El Helicoide prison in Caracas, where rights groups say political prisoners were tortured by Nicolas Maduro's intelligence services.",
      "url": "https://www.france24.com/en/video/20260131-venezuelan-interim-president-proposes-mass-amnesty-law-closure-of-notorious-prison",
      "published": "Sat, 31 Jan 2026 10:03:41 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Two explosions reported in Iran",
      "description": "Two explosions have been reported in Iran as the regime denied a ‌military leader was targeted, amid heightened tension in the region.",
      "url": "https://news.sky.com/story/explosion-reported-in-iran-as-it-denies-military-leader-targeted-13501162",
      "published": "Sat, 31 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Israel eyes regime change in Iran - and is counting on Trump to make it happen",
      "description": "Analysts believe PM Netanyahu is urging the US towards maximalist strikes.",
      "url": "https://www.bbc.com/news/articles/c78egvpkm77o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 12:52:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukraine sees quieter night as Trump says Putin will not attack its cities",
      "description": "Russia said the US president requested a pause in strikes on Kyiv until 1 February, a move Trump said was prompted by the cold weather.",
      "url": "https://www.bbc.com/news/articles/c4g4yj92kwro?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 13:46:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Denmark: Thousands take part in veteran anti-Trump protest",
      "description": "The silent march to the US embassy in Copenhagen came after Donald Trump belittled NATO's role in the Afghanistan war. Tensions remain high between the two NATO allies amid Trump's push to acquire Greenland.",
      "url": "https://www.dw.com/en/denmark-thousands-take-part-in-veteran-anti-trump-protest/a-75742882?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 15:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Search operation for missing girl hindered by storm, MP says",
      "description": "The search operation for a seven-year-old girl who was swept out to sea in Morocco has been \"hindered\" by a storm, an MP has said.",
      "url": "https://news.sky.com/story/search-operation-for-seven-year-old-girl-missing-in-morocco-hindered-by-storm-mp-says-13501440",
      "published": "Sat, 31 Jan 2026 15:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Israeli strikes kill at least 30 Palestinians in Gaza, hospital officials say",
      "description": "At least 30 Palestinians have been killed in Israeli strikes on Saturday, according to hospitals in Gaza.",
      "url": "https://news.sky.com/story/israeli-strikes-kill-at-least-12-palestinians-in-gaza-hospital-officials-say-13501292",
      "published": "Sat, 31 Jan 2026 08:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "US military warns Iran it will not tolerate any 'unsafe' actions ahead of live-fire drills in Strait of Hormuz",
      "description": "U.S. Central Command warned Iran it will not tolerate \"any unsafe and unprofessional behavior\" near American forces ahead of live-fire naval drills.",
      "url": "https://www.foxnews.com/us/us-military-warns-iran-not-tolerate-any-unsafe-actions-ahead-live-fire-drills-strait-hormuz",
      "published": "Sat, 31 Jan 2026 12:45:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ukraine races to bolster air defenses as Putin’s strike pause nears end",
      "description": "Ukraine is rushing to boost air defenses as a brief Russian airstrike pause on Kyiv nears an end. Experts warn the temporary halt may strengthen Moscow's position.",
      "url": "https://www.foxnews.com/world/ukraine-races-bolster-air-defenses-putins-strike-pause-nears-end",
      "published": "Fri, 30 Jan 2026 14:20:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Rubio revokes Iranian officials' US travel privileges over deadly protest crackdown killing thousands",
      "description": "Rubio revoked travel privileges for Iranian officials after organizations accused the regime of killing more than 6,200 protesters. President Trump also warned of a \"massive armada.\"",
      "url": "https://www.foxnews.com/world/rubio-revokes-iranian-officials-us-travel-privileges-over-deadly-protest-crackdown-killing-thousands",
      "published": "Thu, 29 Jan 2026 20:22:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "News live: Australia declines to join statement condemning Israel for Unrwa HQ demolition; Liberal party can win elections without Nationals, Ruston says",
      "description": "Foreign ministers of 11 nations including UK, Canada and France strongly condemned demolition of the site in East Jerusalem in January. Follow live updates Get our breaking news email , free app or daily news podcast Matt Canavan rules out Nationals leadership tilt Nationals Senator Matt Canavan says he is not harbouring any plans to run against party leader David Littleproud, with a vote on his leadership expected to take place on Monday, saying “I don’t care about all this stuff”. Maybe I’m a different kind of species, Andrew?” I go to Canberra to take action. I’ve got five beautiful kids; I’ve got a beautiful wife. I’d prefer to be staying home this week, but I’m going down to try and improve things for the Australian people. And I really don’t care what position in the zoo I am. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/feb/01/news-live-australia-statement-israel-unrwa-ruston-liberal-party-nationals-sussan-ley-anthony-albanese-heatwave-weather-ntwnfb",
      "published": "Sat, 31 Jan 2026 23:13:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Satellite images reveal activity at Iran nuclear sites bombed by US, Israel",
      "description": "Satellite images reveal Iran building roofs over damaged buildings at the Isfahan and Natanz nuclear sites that were struck by the U.S. and Israel last year.",
      "url": "https://www.foxnews.com/world/satellite-images-reveal-activity-iran-nuclear-sites-bombed-us-israel",
      "published": "Sat, 31 Jan 2026 07:42:04 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Hikers stiff hotel on unpaid bill after treacherous 7-hour mountain rescue operation, nonprofit says",
      "description": "Rescued hikers allegedly stiffed a hotel after a Scafell Pike rescue operation in England's Lake District, leaving volunteers to pay the $178 bill.",
      "url": "https://www.foxnews.com/world/hikers-stiff-hotel-unpaid-bill-treacherous-7-hour-mountain-rescue-operation-nonprofit-says",
      "published": "Fri, 30 Jan 2026 19:11:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Hamas emerges as ‘ultimate spoiler’ in Gaza plan as Trump insists terror group will disarm",
      "description": "Hamas leader Mousa Abu Marzouk says the group \"never agreed to disarm\" after President Donald Trump claimed the militant organization would throw down weapons.",
      "url": "https://www.foxnews.com/world/hamas-emerges-ultimate-spoiler-gaza-plan-trump-insists-terror-group-disarm",
      "published": "Thu, 29 Jan 2026 21:35:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Security Council LIVE: Ambassadors debate as Middle East crises mount",
      "description": "The UN Security Council held a high-level open debate on the Middle East on Wednesday focusing on the Gaza peace plan – including the role of President Donald Trump’s Board of Peace – the continuing humanitarian crisis in the enclave and turmoil in the West Bank and East Jerusalem, following the demolition of UNRWA’s headquarters there. Follow live coverage below, and UN News app users can click here. For full and comprehensive UN meetings coverage, go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166845",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "LAPD arrests violent agitators after protests erupt outside federal detention center in Los Angeles",
      "description": "Los Angeles police arrested multiple protesters after violent clashes erupted outside a federal detention center during Friday demonstrations.",
      "url": "https://www.foxnews.com/us/lapd-arrests-violent-agitators-protests-erupt-outside-federal-detention-center-los-angeles",
      "published": "Sat, 31 Jan 2026 01:37:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Witkoff says talks with Russian envoy were 'productive and constructive' amid Trump admin's peace push",
      "description": "Trump envoy reports \"productive\" meetings with Russian envoy on Ukraine peace deal, days after touting progress made toward peace after years of war.",
      "url": "https://www.foxnews.com/world/witkoff-says-talks-russian-envoy-were-productive-constructive-amid-trump-admins-peace-push",
      "published": "Sat, 31 Jan 2026 15:46:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Federal judge denies request to block ICE surge in Minnesota",
      "description": "A judge said ICE activity could have \"heartbreaking\" effects but said the state hadn't proven its case.",
      "url": "https://www.bbc.com/news/articles/c78vgnz3z6eo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 18:21:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "German football federation rules out World Cup boycott to oppose Trump",
      "description": "German football federation confirms it met to discuss a boycott of the FIFA 2026 World Cup, which is co-hosted by US.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/german-football-federation-rules-out-world-cup-boycott-to-oppose-trump?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 15:13:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Rybakina shocks Sabalenka to win Australian Open tennis final",
      "description": "Fifth seed Elena Rybakina wins the Australian Open tennis final, beating world number one Aryna Sabalenka in Melbourne.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/rybakina-shocks-sabalenka-to-win-australian-open-tennis-final?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 11:08:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela approves bill to open oil sector to foreign investment after US pressure",
      "description": "Law will give private companies more control but experts unsure whether changes go far enough for US Venezuela’s acting president has signed into law a bill making significant changes to the country’s oil sector after pressure from the US to open it up to foreign private investment. The new hydrocarbons law promises to give private companies control over oil production and sales, ease taxes and allow for independent arbitration of disputes, while largely maintaining state control over oil production. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/venezuela-approves-bill-to-open-oil-sector-to-foreign-investment-after-us-pressure",
      "published": "Fri, 30 Jan 2026 11:54:20 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UK politics: Starmer shrugs off Trump’s criticism of ‘very dangerous’ deal with China – as it happened",
      "description": "Prime minister suggests US president was ‘talking more about Canada’ when asked for reaction to Beijing visit Prominent Hong Kong and Uyghur activists living in exile in the UK have accused Starmer of seeking China’s desperate approval, after the prime minister visited Beijing for the first time in eight years this week. Pro-democracy campaigner and prominent critic of the Communist Party, Finn Lau said the Hong Kong community is disappointed by Starmer’s visit, but unsurprised by the government’s “short sightedness”. “While British citizen Jimmy Lai remains imprisoned and Uyghurs continue to suffer atrocity crimes, we take no comfort in this decision and will not be silenced. We look forward to receiving urgent assurances from the government regarding those who were placed under sanction together with us, and take this opportunity to express our ongoing solidarity with the Uyghur people, whose cause we will not drop. Continue reading...",
      "url": "https://www.theguardian.com/politics/live/2026/jan/30/donald-trump-keir-starmer-china-uk-us-trade-deals-tariffs-latest-news",
      "published": "Fri, 30 Jan 2026 17:10:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "NSW to remove ‘good character’ from being considered at sentencing hearings in nationwide first",
      "description": "Survivors of sexual abuse welcome the ‘monumental shift’ in how courts approach sentencing, while others say it could limit defendants’ rights Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Offenders convicted of any crime will no longer be able to rely on glowing character references during sentencing under changes being introduced in New South Wales, in a move supported by survivors of sexual abuse but which others say could limit defendants’ rights. On Wednesday, the state government will become the first nationwide to introduce legislation to remove “good character” from being considered at sentencing hearings, when judges hear about someone’s prior record, general reputation and any positive contributions to society as mitigating factors. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/31/nsw-to-remove-good-character-from-being-considered-at-sentencing-hearings-in-nationwide-first",
      "published": "Sat, 31 Jan 2026 19:00:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Unmentioned but present, Trump is a common denominator in Asia-Europe ties",
      "description": "Trump was not the only factor behind the agreements, but his shaking up of the global order is worrying friends and foes and driving them closer.",
      "url": "https://www.npr.org/2026/01/30/g-s1-108011/unmentioned-but-present-trump-is-a-common-denominator-in-asia-europe-ties",
      "published": "Fri, 30 Jan 2026 14:55:36 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Kari Lake promotes Trump on Voice of America. Does that break the law?",
      "description": "Critics say U.S. Agency for Global Media's Kari Lake risks making Voice of America sound like a propaganda outlet in her remarks on the air praising President Trump.",
      "url": "https://www.npr.org/2026/01/30/nx-s1-5683246/kari-lake-trump-voa-pnn-iran-firewall-propaganda",
      "published": "Fri, 30 Jan 2026 05:01:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Goma under rebel control: Life in the shadow of violence",
      "description": "One year after M23 rebels captured Goma, residents of the city in the Democratic Republic of Congo are looking for ways to cope with the trauma.",
      "url": "https://www.dw.com/en/goma-under-rebel-control-life-in-the-shadow-of-violence/a-75743471?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 17:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "In an increasingly hostile world, migrants are hopeful as Spain moves to integrate them",
      "description": "More than half a million foreigners are believed to live in Spain without legal permission",
      "url": "https://abcnews.go.com/International/wireStory/increasingly-hostile-world-migrants-hopeful-spain-moves-integrate-129730354",
      "published": "Sat, 31 Jan 2026 07:29:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about the Strait of Hormuz as Iran plans military drill while tensions are high with US",
      "description": "Iran plans a military drill in the Strait of Hormuz, a crucial global shipping lane",
      "url": "https://abcnews.go.com/International/wireStory/strait-hormuz-iran-plans-military-drill-tensions-high-129729064",
      "published": "Sat, 31 Jan 2026 03:21:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "A Sudanese doctor recounts his harrowing escape from a Darfur city under rebel bombardment",
      "description": "Three months after paramilitary fighters overran the Sudanese city of el-Fasher, a doctor is providing a rare first-person account of the attack",
      "url": "https://abcnews.go.com/International/wireStory/sudanese-doctor-recounts-harrowing-escape-darfur-city-rebel-129728158",
      "published": "Sat, 31 Jan 2026 00:18:05 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Choose peace over chaos, Guterres urges as he sets out final-year priorities",
      "description": "With global tensions rising and “reckless actions” triggering dangerous consequences, UN Secretary-General António Guterres on Thursday called for renewed efforts on peace, justice and sustainable development as he outlined his priorities for 2026 – the final year of his tenure.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166853",
      "published": "Thu, 29 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World News in Brief: UN Support Office in Haiti, Goodwill Ambassador Theo James in Syria, urgent appeal for millions in DR Congo",
      "description": "The Security Council-endorsed UN Support Office in Haiti is on track to deliver on behalf of the Haitian people, UN Spokesperson Stéphane Dujarric said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166850",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Louisiana authorities, federal agents nab all 8 inmates who escaped in jailbreak after massive manhunt",
      "description": "All eight violent offenders who escaped Louisiana's Riverbend Detention Center have been captured after massive manhunt involving state police and federal agencies.",
      "url": "https://www.foxnews.com/us/louisiana-authorities-federal-agents-nab-all-8-inmates-escaped-jailbreak-massive-manhunt",
      "published": "Sat, 31 Jan 2026 18:08:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Federal judge rejects Minnesota request to block ICE-led Operation Metro Surge",
      "description": "Federal judge denies Minnesota's bid to halt ICE's Operation Metro Surge, ruling state failed to meet legal standard to block immigration enforcement.",
      "url": "https://www.foxnews.com/us/federal-judge-rejects-minnesota-request-block-ice-led-operation-metro-surge",
      "published": "Sat, 31 Jan 2026 12:04:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Milan protests decry ‘creeping fascism’ of ICE role at Winter Olympics",
      "description": "Demonstrators in Milan protest United State's ICE unit role at Milano-Cortina 2026 Winter Olympics.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/milan-demonstrators-decry-creeping-fascism-of-ice-role-at-winter-olympics?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 17:15:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Bill Gates, Elon Musk, Howard Lutnick face new scrutiny over Epstein ties",
      "description": "New files suggest the men had more extensive contact with Epstein than previously known.",
      "url": "https://www.aljazeera.com/news/2026/1/31/bill-gates-elon-musk-howard-lutnick-face-new-scrutiny-over-epstein-ties?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 16:23:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds feared dead in attempt to cross Mediterranean during cyclone",
      "description": "Fifty killed in one incident as Italian authorities estimate 380 people may have drowned last week Up to 380 people may have drowned attempting to cross the Mediterranean last week as Cyclone Harry battered southern Italy and Malta, the Italian coastguard has said, as a shipwreck with the loss of 50 lives was confirmed by Maltese authorities. Just one person, who was hospitalised in Malta, survived the shipwreck, which happened on Friday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/hundreds-feared-dead-after-attempting-to-cross-mediterranean-amid-cyclone-harry",
      "published": "Mon, 26 Jan 2026 14:54:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "China has lifted sanctions from six serving British MPs and peers, Starmer says",
      "description": "Starmer confirms immediate removal, but it is unclear if sanctions remain on former MP, academic and barrister China has lifted the sanctions it imposed on serving British MPs and peers in a significant sign of warming relations after Keir Starmer travelled to Beijing for landmark talks with Xi Jinping. Nine UK citizens were banned from China in 2021 , including five Conservative MPs and two members of the House of Lords, targeted for highlighting human rights violations against the Muslim Uyghur community. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/china-lifts-sanctions-british-mps-peers",
      "published": "Fri, 30 Jan 2026 14:37:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says ‘very dangerous’ for UK to do business with China, after Starmer hails progress in Beijing",
      "description": "US president warns against closer ties with China during British PM’s trip to secure lower tariffs and better market access Donald Trump has warned the UK against doing business with China, just hours after Keir Starmer lauded the economic relationship during a landmark visit to Beijing . The US president said it was “very dangerous” for the UK to pursue closer ties with the rival superpower as the prime minister’s three-hour talks with Xi Jinping underlined a thaw in previously strained relations. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/trump-dangerous-uk-china-starmer-xi-jinping-beijing",
      "published": "Fri, 30 Jan 2026 12:39:17 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US envoy Witkoff holds ‘constructive’ Ukraine talks with Russia",
      "description": "US envoy Steve Witkoff on Saturday said he had \"productive and constructive meetings\" with Kirill Dmitriev, Russian President Vladimir Putin's top economic adviser and special envoy, in Florida. The talks came a day before a scheduled meeting in Abu Dhabi between Ukrainian and Russian negotiators amid the Trump administration's drive to end the Ukraine war.",
      "url": "https://www.france24.com/en/americas/20260131-us-envoy-witkoff-holds-constructive-ukraine-talks-with-russia",
      "published": "Sat, 31 Jan 2026 20:43:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nigeria's Fela Kuti is first African musician honoured with Grammys Lifetime Achievement award",
      "description": "Nigeria’s Afrobeat legend Fela Kuti will be posthumously honored this weekend with a Grammys Lifetime Achievement Award, becoming the first African artist to receive the prestigious distinction.",
      "url": "https://www.france24.com/en/culture/20260131-fela-kuti-first-african-honored-grammys-lifetime-achievement-award-afrobeat",
      "published": "Sat, 31 Jan 2026 11:33:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pok&#233;mon apologises after Chinese anger over plan for game at Japanese shrine",
      "description": "Pokémon has apologised after plans for a card game event at a controversial shrine for Japanese war dead saw it accused of hurting \"the feelings of the Chinese people\".",
      "url": "https://news.sky.com/story/pok233mon-apologises-after-chinese-anger-over-plan-for-game-at-japanese-shrine-13501325",
      "published": "Sat, 31 Jan 2026 10:49:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Power outages hit Ukraine and Moldova as Kyiv struggles against the winter cold",
      "description": "Emergency power cuts have hit several Ukrainian cities and neighboring Moldova",
      "url": "https://abcnews.go.com/International/wireStory/power-outages-hit-ukraine-moldova-kyiv-struggles-winter-129731967",
      "published": "Sat, 31 Jan 2026 13:13:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Supplies running out at Syria's al-Hol camp as clashes block aid deliveries",
      "description": "Save the Children warns that supplies are running out at al-Hol camp in northeast Syria",
      "url": "https://abcnews.go.com/International/wireStory/supplies-running-syrias-al-hol-camp-clashes-block-129730576",
      "published": "Sat, 31 Jan 2026 07:30:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Armed extremists kill dozens in northeastern Nigeria",
      "description": "Armed extremists in northeastern Nigeria have killed dozens in recent raids on a construction site and a military installation",
      "url": "https://abcnews.go.com/International/wireStory/armed-extremists-kill-dozens-northeastern-nigeria-129730100",
      "published": "Sat, 31 Jan 2026 05:41:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Coordinated attacks in Pakistan kill 10 security personnel and dozens of insurgents",
      "description": "Assailants armed with guns and grenades have carried out nearly a dozen coordinated attacks across southern Pakistan",
      "url": "https://abcnews.go.com/International/wireStory/coordinated-attacks-pakistan-kill-10-security-personnel-dozens-129729961",
      "published": "Sat, 31 Jan 2026 04:58:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Pokemon card event at controversial shrine to Japanese war dead canceled",
      "description": "A Pokemon card event for Saturday at Tokyo’s controversial Yasukuni Shrine was canceled and the Pokemon Company, an affiliate of Japanese game maker Nintendo, apologized following a backlash from China, as tensions between the two sides escalated",
      "url": "https://abcnews.go.com/International/wireStory/pokemon-card-event-controversial-shrine-japanese-war-dead-129728926",
      "published": "Sat, 31 Jan 2026 03:47:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Canadian company says Virginia warehouse sale to ICE won't proceed",
      "description": "A Canadian company has decided not to sell a Virginia warehouse to the U.S. Department of Homeland Security",
      "url": "https://abcnews.go.com/International/wireStory/canadian-company-virginia-warehouse-sale-ice-proceed-129721245",
      "published": "Fri, 30 Jan 2026 18:09:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Reaching a child in Darfur is ‘hard-won and fragile’, says UNICEF",
      "description": "Reaching a single child in Sudan’s Darfur region can take days of negotiations, security clearances and travel across sandy roads that cut through shifting frontlines, UNICEF warned Friday – as children live “on the brink” of survival.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166861",
      "published": "Fri, 30 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Potential turning point for Gaza as peace plan enters second phase: UN envoy",
      "description": "The start of a second phase of a stabilisation plan for Gaza offers a potential turning point for the war-ravaged enclave, a senior UN official told the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166852",
      "published": "Wed, 28 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN says Gaza crisis remains dire, children hardest hit",
      "description": "Despite a modest increase in humanitarian assistance, the situation in Gaza remains “dire”, with children among the hardest hit by shortages of shelter, basic services and education, the United Nations said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166842",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Martha Moxley case: Kennedy cousin points to ‘bold-faced lies,’ missing evidence in murder probe",
      "description": "Kennedy cousin Michael Skakel, cleared in Martha Moxley's 1975 murder after 11 years in prison, discusses the decades-old Connecticut case that remains unsolved.",
      "url": "https://www.foxnews.com/us/martha-moxley-case-kennedy-cousin-points-bold-faced-lies-missing-evidence-murder-probe",
      "published": "Sat, 31 Jan 2026 14:00:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Detroit judge, 3 others charged in alleged scheme to steal thousands from vulnerable and incapacitated people",
      "description": "Judge Andrea Bradley-Baskin and three other Detroit residents were charged with conspiring to \"systematically embezzle funds from wards.\"",
      "url": "https://www.foxnews.com/us/detroit-judge-3-others-charged-alleged-scheme-steal-thousands-from-vulnerable-incapacitated-people",
      "published": "Sat, 31 Jan 2026 09:55:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "LAPD chief defies Newsom's mask ban for federal immigration agents citing safety concerns",
      "description": "The LAPD won't enforce California's ban on masked federal immigration agents, citing public safety concerns during ongoing ICE operations in Los Angeles.",
      "url": "https://www.foxnews.com/us/lapd-chief-defies-newsoms-mask-ban-federal-immigration-agents-citing-safety-concerns",
      "published": "Fri, 30 Jan 2026 17:50:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump admin labels Israel 'model US ally' ahead of major military aid talks",
      "description": "Trump's new National Defense strategy positions Israel as a \"model ally\" in Middle East doctrine, fundamentally reshaping U.S. military aid discussions.",
      "url": "https://www.foxnews.com/world/trump-admin-labels-israel-model-us-ally-ahead-major-military-aid-talks",
      "published": "Fri, 30 Jan 2026 06:30:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Former CNN host Don Lemon charged in anti-ICE protest at Minnesota church",
      "description": "Lemon says he was just doing his job as a journalist reporting on the protests at the church.",
      "url": "https://www.bbc.com/news/articles/c24gm3dz36po?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 15:16:54 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "New campaign calls on Mexicans to rediscover the capital’s heart through revered churches",
      "description": "A new campaign by Mexico City’s Historic Center Trust aims to encourage Mexicans to rediscover the religious and architectural heritage at the heart of the nation's capital",
      "url": "https://abcnews.go.com/International/wireStory/new-campaign-calls-mexicans-rediscover-capitals-heart-revered-129728829",
      "published": "Sat, 31 Jan 2026 01:53:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Campus Radicals: Dems target military school, Chicago teachers wreak havoc, college nurse's viral scandal",
      "description": "Melinda Cook was fired as a nurse from VCU Health while Democrats targeted a Virginia military college over DEI concerns and Chicago teachers continued their anti-ICE campaign.",
      "url": "https://www.foxnews.com/us/campus-radicals-dems-target-military-school-chicago-teachers-wreak-havoc-college-nurses-viral-scandal",
      "published": "Sat, 31 Jan 2026 11:17:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Panama supreme court cancels Hong Kong company’s canal contracts",
      "description": "Panama’s president says strategic waterway will operate as normal after ruling that advances US policy aims Panama’s president said ports at each end of the Panama canal would operate as usual after the country’s supreme court ruled the concession held by a subsidiary of a Chinese company was unconstitutional. The court’s decision on Thursday, which helps US attempts to block any Chinese influence over the strategic waterway, immediately drew a sharp rebuke from Beijing. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/30/court-ends-hong-kong-china-panama-canal-contracts",
      "published": "Fri, 30 Jan 2026 13:47:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US government enters partial shutdown",
      "description": "Funding for around three-quarters of federal operations has been affected after Congress failed to approve a 2026 budget. But the disruption is expected to be of short duration.",
      "url": "https://www.dw.com/en/us-government-enters-partial-shutdown/a-75737528?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 07:27:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "'Creeping fascism': Milan protesters slam ICE deployment at Winter Olympics",
      "description": "Protesters on Saturday gathered at Milan's Piazza XXV Aprile, a square named for the date of Italy’s liberation from Nazi fascism in 1945, to protest the deployment of US Immigration and Customs Enforcement (ICE) agents during the upcoming Winter Olympics there. Demonstrators in the Italian city denounced what they called \"creeping fascism\" in the US.",
      "url": "https://www.france24.com/en/europe/20260131-creeping-fascism-milan-protesters-slam-ice-deployment-at-winter-olympics",
      "published": "Sat, 31 Jan 2026 16:35:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Myanmar coup 5 years on: 'It has gone horrifically wrong for the military'",
      "description": "This Sunday will mark five years since the military re-took control in Myanmar in a coup that ousted elected leader Aung San Suu Kyi. The military celebrated the anniversary by declaring a sweeping win for their political party in a general election, widely denounced as a sham. But, according to Mark Farmaner, director of the NGO \"Burma Campaign UK\", the five years since the coup have gone “horrifically wrong\" for the military junta, which has lost control of vast swathes of the country to armed rebel groups.",
      "url": "https://www.france24.com/en/video/20260131-myanmar-coup-5-years-on-it-has-gone-horrifically-wrong-for-the-military",
      "published": "Sat, 31 Jan 2026 10:45:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Northern Ireland should hold unity referendum by 2030, first minister says",
      "description": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said.",
      "url": "https://news.sky.com/story/northern-ireland-should-hold-unity-referendum-by-2030-first-minister-says-13501305",
      "published": "Sat, 31 Jan 2026 09:26:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Independent experts alarmed by child rights violations in US immigration procedures",
      "description": "UN-appointed independent human rights experts have raised alarm over violations of children’s rights during US immigration procedures, nearly a year after federal funding for legal representation for unaccompanied minors was terminated.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166837",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Alleged MS-13 gang member accused of 5 murders in home country nabbed in Virginia",
      "description": "Edwin Antonio Hernandez Hernandez of El Salvador was taken into custody by ICE in Virginia, Department of Homeland Security sources told Fox News Digital.",
      "url": "https://www.foxnews.com/us/alleged-ms-13-gang-member-accused-5-murders-home-country-nabbed-virginia",
      "published": "Sat, 31 Jan 2026 14:46:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "ICE lodges detainer for illegal immigrant accused of sexually assaulting teen",
      "description": "ICE lodged an arrest detainer against an illegal immigrant from Egypt accused of sexually assaulting a 16-year-old girl while she slept in her bed, according to federal authorities.",
      "url": "https://www.foxnews.com/us/ice-lodges-detainer-illegal-immigrant-accused-sexually-assaulting-teen",
      "published": "Fri, 30 Jan 2026 21:49:45 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela releases all known American detainees after Maduro's capture and government takeover",
      "description": "All known American citizens detained in Venezuela have been released by interim authorities after the recent political upheaval in the country.",
      "url": "https://www.foxnews.com/world/venezuela-releases-all-known-american-detainees-following-maduro-capture-government-takeover",
      "published": "Fri, 30 Jan 2026 19:48:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump scores strategic win as Panama court ousts Hong Kong firm from canal ports",
      "description": "Panama's Supreme Court struck down a Hong Kong company's port operations near Panama Canal amid constitutional concerns. U.S. Secretary of State Rubio calls the decision encouraging.",
      "url": "https://www.foxnews.com/world/trump-scores-strategic-win-panama-court-ousts-hong-kong-firm-canal-ports",
      "published": "Fri, 30 Jan 2026 19:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "This army chief threatened to castrate opposition leader and claimed descent from Jesus",
      "description": "The Ugandan president’s son, notorious for explosive remarks on X, has ambitions to succeed his father.",
      "url": "https://www.bbc.com/news/articles/cdjnp9m8wvgo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 00:05:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iraq Shia bloc reiterates support for al-Maliki despite Trump’s threats",
      "description": "The Coordination Framework said that selecting a PM is an internal constitutional matter.",
      "url": "https://www.aljazeera.com/news/2026/1/31/iraq-shia-bloc-reiterates-support-for-al-maliki-despite-trumps-threats?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 20:57:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US judge declines to halt immigration surge in Minnesota amid protests",
      "description": "Minneapolis mayor criticises judge's ruling, calling the Trump administration's immigration crackdown 'an invasion'.",
      "url": "https://www.aljazeera.com/news/2026/1/31/us-judge-declines-to-halt-immigration-surge-in-minnesota-amid-protests?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 20:18:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US journalists arrested for covering anti-ICE protest at church",
      "description": "Two journalists were arrested and taken to court in the US for covering an anti-ICE protest inside a Minnesota church.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/31/us-journalists-arrested-for-covering-anti-ice-protest-at-church?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 13:49:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "NSW Greens to move bill to let councils better regulate berry industry as it continues rapid expansion",
      "description": "Residents and local authorities are worried about environmental hazards and land devaluation as minister says excess regulations may hinder modern farming practices Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Cate Faehrmann, a Greens member of the New South Wales legislative council, will move a private member’s bill next week to give councils more power to regulate blueberry and other berry farms which are expanding throughout the mid-north coast, leading to serious frictions with other landholders. Separately, the state Labor government is considering an inquiry into alleged worker abuse in the region. Most states regulate labour hire companies, which serve as intermediaries between farmers and seasonal workers, but NSW does not. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/31/australia-berry-industry-bill-nsw-greens",
      "published": "Sat, 31 Jan 2026 19:00:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli strikes kill more than 30 Palestinians in Gaza",
      "description": "A wave of strikes hit different locations across Gaza, including apartments and tents, a day before the Rafah border is set to reopen.",
      "url": "https://www.dw.com/en/israeli-strikes-kill-more-than-30-palestinians-in-gaza/a-75742841?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 17:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds protest against ICE role in Winter Olympics in Milan",
      "description": "Hundreds of protesters have gathered in Milan, Italy, to protest against the deployment of US Immigration and Customs Enforcement (ICE) staff at the upcoming Winter Olympics.",
      "url": "https://news.sky.com/story/hundreds-protest-against-ice-role-in-winter-olympics-in-milan-13501426",
      "published": "Sat, 31 Jan 2026 15:38:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Blackouts in Ukraine and Moldova as power lines fail in sub-zero temperatures after Russian airstrikes",
      "description": "Parts of Ukraine and Moldova suffered power cuts on Saturday after high-voltage power lines failed while both countries were affected by sub-zero temperatures.",
      "url": "https://news.sky.com/story/blackouts-in-ukraine-and-moldova-as-power-lines-fail-amid-sub-zero-temperatures-13501424",
      "published": "Sat, 31 Jan 2026 15:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Hungarian Roma protest inflammatory comments by Orbán government minister",
      "description": "Over a thousand protesters, including many from Hungary's Roma community, have held a demonstration in Budapest where they demanded the resignation of a prominent government minister over comments seen as racist",
      "url": "https://abcnews.go.com/International/wireStory/hungarian-roma-protest-inflammatory-comments-orbn-government-minister-129738459",
      "published": "Sat, 31 Jan 2026 14:09:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Danish veterans stage protest outside US Embassy",
      "description": "Hundreds of Danish veterans have staged a silent protest outside the U.S. Embassy in Copenhagen",
      "url": "https://abcnews.go.com/International/wireStory/danish-veterans-stage-protest-us-embassy-129730395",
      "published": "Sat, 31 Jan 2026 13:13:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Can workers compete with machines and stay relevant in the AI era?",
      "description": "AI looks set to be transformative for us all, but it also brings a real risk of job losses and widening social and economic divides. UN experts are focusing on how to manage that transition, to ensure the benefits of the technology outweigh the threats.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166847",
      "published": "Sat, 31 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran's president accuses Trump, Netanyahu, Europe of provoking unrest: 'They brought them into the streets'",
      "description": "Iran's president accused President Donald Trump, Israeli Prime Minister Benjamin Netanyahu and European leaders of trying to \"fragment society.\"",
      "url": "https://www.foxnews.com/world/irans-president-accuses-trump-netanyahu-europe-provoking-unrest-they-brought-them-streets",
      "published": "Sat, 31 Jan 2026 13:35:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Iran to hold live-fire drills in Strait of Hormuz with US armada in Middle East",
      "description": "Iran announces live-fire military drills in Strait of Hormuz as Trump sends USS Abraham Lincoln carrier group to region amid escalating tensions.",
      "url": "https://www.foxnews.com/world/iran-hold-live-fire-drills-strait-hormuz-us-armada-middle-east",
      "published": "Thu, 29 Jan 2026 14:44:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US eyes Red Sea as state envoy visits Africa",
      "description": "Washington has said a visit by Deputy Secretary of State Christopher Landau to Africa aims to strengthen bilateral ties, but the timing raises questions about the US's interests in the Red Sea corridor.",
      "url": "https://www.dw.com/en/us-eyes-red-sea-as-state-envoy-visits-africa/a-75731780?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 11:19:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "French tech giant Capgemini assists US Dept. of Homeland Security",
      "description": "French technology company Capgemini has been assisting ICE immigration agents with expelling illegal immigrants from the United States. This discovery has led some to question whether this is work the company should be doing.",
      "url": "https://www.france24.com/en/tv-shows/a-week-in-france/20260131-2026-01-31-13-15-a-week-in-france-3101",
      "published": "Sat, 31 Jan 2026 16:39:45 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Murder suspects among 8 inmates who escaped Louisiana jail; manhunt launched",
      "description": "A manhunt is underway for five of eight inmates who escaped a Louisiana prison Friday. Louisiana State Police has taken the lead in the search.",
      "url": "https://www.foxnews.com/us/murder-suspects-among-8-inmates-escaped-louisiana-jail-manhunt-launched",
      "published": "Fri, 30 Jan 2026 19:10:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Married real estate mogul allegedly offered contractor millions to leave husband, lawsuit claims",
      "description": "Real Brokerage CEO accused of offering contractor $500K cash and $3M home to leave husband in shocking lawsuit that allegedly destroyed her marriage.",
      "url": "https://www.foxnews.com/us/married-real-estate-mogul-allegedly-offered-aide-millions-leave-husband-lawsuit-claims",
      "published": "Fri, 30 Jan 2026 17:52:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela's acting president overhauls oil industry amid pressure from Trump administration",
      "description": "Venezuela's acting president signs law ending state oil monopoly, reversing decades of socialist policy to allow private companies control of the industry.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-president-overhauls-oil-industry-amid-pressure-from-trump-administration",
      "published": "Fri, 30 Jan 2026 13:43:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Iranian official says progress made on talks as US-Iran tensions persist",
      "description": "Ali Larijani says efforts to get framework for negotiations advancing, as US naval deployment in Gulf fuels concerns.",
      "url": "https://www.aljazeera.com/news/2026/1/31/iranian-official-says-progress-made-on-talks-as-us-iran-tensions-persist?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 22:13:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "NBA issues 76ers’ Paul George with 25-game ban for drug violation",
      "description": "NBA suspends Philadelphia 76ers' nine-time All Star Paul George for 25 games for undisclosed anti-drug policy violation.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/nba-issues-76ers-paul-george-with-25-game-ban-for-drug-violation?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 17:22:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Senegal and Morocco fined and players banned after African Cup final chaos",
      "description": "Africa's soccer body issued fines worth more than $1 million and banned Senegal's coach and Senegalese and Morocco players Wednesday following a shambolic African Cup soccer final this month.",
      "url": "https://www.npr.org/2026/01/29/g-s1-107750/senegal-morocco-fined-african-cup-final-chaos",
      "published": "Thu, 29 Jan 2026 05:27:40 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Minneapolis: Thousands rally against Trump immigration blitz",
      "description": "Rallies against the Trump administration's hardline immigration tactics were also reported in other cities, such as Los Angeles. It comes as the US Justice Department opened a probe into the killing of Alex Pretti.",
      "url": "https://www.dw.com/en/minneapolis-thousands-rally-against-trump-immigration-blitz/a-75736782?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 03:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Coast Guard suspends search for survivors after fishing boat sinks off Massachusetts; 1 body recovered",
      "description": "The Coast Guard suspended its search Saturday after the fishing vessel Lily Jean reportedly sank off Cape Ann with seven aboard, including an NOAA observer.",
      "url": "https://www.foxnews.com/us/coast-guard-searching-survivors-after-commercial-fishing-boat-sinks-off-massachusetts-1-body-recovered",
      "published": "Fri, 30 Jan 2026 20:09:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Canadian actress Catherine O'Hara dies at 71",
      "description": "Catherine O'Hara was famous for starring roles in the series \"Schitt's Creek\" and the \"Home Alone\" movies. She got her start with the Second City Toronto comedy troupe in the 1970s before her career in Hollywood.",
      "url": "https://www.dw.com/en/canadian-actress-catherine-o-hara-dies-at-71/a-75736335?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 21:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Yemen: Security Council votes on final extension of Hudaydah Mission",
      "description": "The Security Council adopted a resolution on Tuesday that renews the mandate of the UN Mission in the Yemeni port city of Hudaydah for a final two-month period through 31 March of this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166844",
      "published": "Tue, 27 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Takeaways from the millions of newly released Epstein files",
      "description": "Three million new documents include hundreds of mentions of Trump and emails between Epstein and a person called \"The Duke\".",
      "url": "https://www.bbc.com/news/articles/cevnmxyy4wjo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 23:14:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pedro Pascal and Meryl Streep lead tributes to Catherine O'Hara",
      "description": "The Canadian comedic actress died in Los Angeles on Friday at the age of 71 following a brief illness.",
      "url": "https://www.bbc.com/news/articles/czejk8pnk82o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 17:41:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Musk's SpaceX applies to launch 1m satellites into orbit",
      "description": "The firm wants to create a network of \"orbital data centres\" to power artificial intelligence.",
      "url": "https://www.bbc.com/news/articles/cyv5l24mrjmo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 16:19:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pokémon cancels event at controversial Japan shrine following backlash",
      "description": "The event, advertised through official channels, was criticised in China for being held at a military memorial.",
      "url": "https://www.bbc.com/news/articles/cdjn0nmnjmwo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 12:08:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US government partially shuts down despite last minute funding deal",
      "description": "The soonest the US House of Representatives can vote on the funding deal and end the shutdown is Monday.",
      "url": "https://www.bbc.com/news/articles/ce8rk33dpvmo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 05:10:27 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran wants to make deal rather than face military action, Trump says",
      "description": "Tehran has said it will never negotiate on its missile and defence systems, but that it is open to talks.",
      "url": "https://www.bbc.com/news/articles/cd9ew2kwj0lo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 21:43:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada's Poilievre sweeps Conservative party leadership test with 87.4%",
      "description": "The opposition leader received a strong show of support from party delegates, despite the recent electoral loss against the Liberals.",
      "url": "https://www.bbc.com/news/articles/c14r1023yy6o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 31 Jan 2026 14:45:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mali lawmaker jailed in Ivory Coast for insulting president",
      "description": "Prosecutors say Mamadou Hawa Gassama described Alassane Ouattara as a \"tyrant\" and \"an enemy of Mali\".",
      "url": "https://www.bbc.com/news/articles/c74vgxp0zr4o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 30 Jan 2026 18:09:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How much control will the US have over Venezuela’s oil?",
      "description": "Caracas says it is opening up the sector to private players.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/31/how-much-control-will-the-us-have-over-venezuelas-oil?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 22:43:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Peter Kornbluh: Is Trump pushing a new imperialism in Latin America?",
      "description": "Peter Kornbluh speaks to Marc Lamont Hill on Trump’s abduction of Venezuela’s president and fallout for Latin America.",
      "url": "https://www.aljazeera.com/video/upfront/2026/1/31/peter-kornbluh-is-trump-pushing-a-new-imperialism-in-latin-america?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 19:30:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tributes pour in for beloved actress Catherine O’Hara",
      "description": "Actors and politicians honour O'Hara, who died this week at age 71, for her comedic 'brilliance' and generosity.",
      "url": "https://www.aljazeera.com/news/2026/1/31/tributes-pour-in-for-beloved-actress-catherine-ohara?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 18:50:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US envoy Witkoff says Ukraine talks with Russia ‘productive’",
      "description": "The talks come just a day before a second round of US-mediated talks between Russia and Ukraine in Abu Dhabi.",
      "url": "https://www.aljazeera.com/news/2026/1/31/us-envoy-witkoff-says-ukraine-talks-with-russia-productive?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 18:25:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Real Madrid vs Rayo Vallecano: La Liga – teams, start, lineups",
      "description": "Real Madrid's turbulent season continued with UCL defeat at Benfica in midweek but now focus returns to La Liga title.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/real-madrid-vs-rayo-vallecano-la-liga-teams-start-lineups?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 16:30:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sabalenka ‘really upset’ at blowing Australian Open final chances",
      "description": "Following back-to-back Australian Open wins, Aryna Sabalenka has now lost consecutive finals with Elena Rybakina defeat.",
      "url": "https://www.aljazeera.com/sports/2026/1/31/sabalenka-really-upset-at-blowing-australian-open-final-chances?traffic_source=rss",
      "published": "Sat, 31 Jan 2026 13:27:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.2 - 8 km NE of Black Eagle, Montana",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - V Time 2026-01-29 19:41:09 UTC 2026-01-29 19:41:09 UTC at epicenter Location 47.585°N 111.202°W Depth 22.47 km (13.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000s5ba",
      "published": "2026-01-31T19:51:12.523Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 5.5 - 9 km ESE of Dianga, China",
      "description": "PAGER - YELLOW ShakeMap - VII DYFI? - IV Time 2026-01-26 06:56:02 UTC 2026-01-26 06:56:02 UTC at epicenter Location 34.028°N 103.305°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rs2q",
      "published": "2026-01-27T07:23:20.332Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "After backsliding, democracy often comes back weaker and more fragile",
      "description": "Losing democracy once can make it harder to restore it, even after a democratic government returns to power. University of Birmingham professor Nic Cheeseman analyzed three decades of data.",
      "url": "https://www.npr.org/2026/01/31/nx-s1-5684187/after-backsliding-democracy-often-comes-back-weaker-and-more-fragile",
      "published": "Sat, 31 Jan 2026 16:50:18 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "With decades-long restrictions lifted, a Pakistani brewery has started exporting beer",
      "description": "Drinking is illegal for Pakistan's Muslim majority, but Murree Brewery's beer has long been available to non-Muslims and foreigners there. Now it's being exported to the U.K., Japan and Portugal. Is the U.S. next?",
      "url": "https://www.npr.org/2026/01/31/g-s1-105888/pakistan-beer-exports-murree-brewery-alcohol",
      "published": "Sat, 31 Jan 2026 05:03:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela announces amnesty bill that could lead to release of political prisoners",
      "description": "Venezuela's acting President Delcy Rodríguez on Friday announced an amnesty bill that could lead to the release of hundreds of prisoners detained for political reasons.",
      "url": "https://www.npr.org/2026/01/31/g-s1-108127/venezuela-amnesty-bill",
      "published": "Sat, 31 Jan 2026 01:55:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Voices from Iran: women defy fear in the face of brutal crackdown",
      "description": "Amid Iran's deadly crackdown, three women share their stories of resistance, fear and an unyielding hope for freedom.",
      "url": "https://www.npr.org/2026/01/30/nx-s1-5688912/iran-women-crackdown",
      "published": "Fri, 30 Jan 2026 13:28:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Liam Ramos: Judge orders release of 5-year-old ICE detainee",
      "description": "The boy and his father had been detained by US immigration agents during a Minneapolis raid earlier this month. An image of the boy during the raid sparked outrage and brought a defense from US Vice President JD Vance.",
      "url": "https://www.dw.com/en/liam-ramos-judge-orders-release-of-5-year-old-ice-detainee/a-75745175?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 22:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Defense minister says US needs Europe",
      "description": "Pistorius has stressed that the US needs Europe just as much as Europe needs the US. Meanwhile, recent research figures show that about one in two Germans will develop cancer in their lifetime. DW has more.",
      "url": "https://www.dw.com/en/germany-news-defense-minister-says-us-needs-europe/live-75738990?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 20:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Belarus: Snow and cold used to torture political prisoners",
      "description": "Former political prisoners tell DW that winter in Belarus prisons is brutal during cold, snowy winters like this one — because snow and freezing temperatures are used by guards to torment them.",
      "url": "https://www.dw.com/en/belarus-snow-and-cold-used-to-torture-political-prisoners/a-75717969?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 19:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "An undying trend: How vampires like those in 'Sinners' hold a mirror to society",
      "description": "As the horror movie \"Sinners\" stands poised to sweep the Oscars, we take a look at how and why the vampire genre has long captivated audiences — from folklore to film. Is this trend truly immortal?",
      "url": "https://www.dw.com/en/an-undying-trend-how-vampires-like-those-in-sinners-hold-a-mirror-to-society/a-75681267?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 17:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Italy church restoration probed after Meloni angel lookalike",
      "description": "Many have noted a striking resemblance between the face of an angel in a restored church in Rome and that of Italy's prime minister. \"No, decidedly I do not resemble an angel,\" Giorgia Meloni has said.",
      "url": "https://www.dw.com/en/italy-church-restoration-probed-after-meloni-angel-lookalike/a-75744123?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 17:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Massive outage knocks out power across Ukraine, Moldova",
      "description": "Disruptions to Ukraine's power grid have led to outages there and in neighboring Moldova. Kyiv's metro and water supply have both been affected.",
      "url": "https://www.dw.com/en/massive-outage-knocks-out-power-across-ukraine-moldova/a-75738787?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 10:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany's AfD bonds with Austrian far-right extremists",
      "description": "Officials from the far-right Alternative for Germany (AfD) party have been openly rubbing shoulders with Austrian right-wing extremist Martin Sellner. This, despite reservations over his Identitarian Movement.",
      "url": "https://www.dw.com/en/germany-s-afd-bonds-with-austrian-far-right-extremists/a-75725834?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 10:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'No end in sight' as Myanmar marks 5-year anniversary of 2021 coup",
      "description": "After half a decade of bloody fighting, a resurgent military faces a determined but splintered armed resistance.",
      "url": "https://www.dw.com/en/no-end-in-sight-as-myanmar-marks-5-year-anniversary-of-2021-coup/a-75730711?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 08:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: Interim president proposes amnesty bill",
      "description": "Venezuelan acting President Delcy Rodriguez announced a general amnesty bill that could see the release of hundreds of political prisoners, including opposition leaders, journalists and human rights activists.",
      "url": "https://www.dw.com/en/venezuela-interim-president-proposes-amnesty-bill/a-75737147?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 31 Jan 2026 02:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US Justice Department releases more Epstein files",
      "description": "The US Department of Justice has said it released 3 million more pages of documents from the Epstein files. Some Democratic politicians have questioned whether all the files have been made public as legally required.",
      "url": "https://www.dw.com/en/us-justice-department-releases-more-epstein-files/a-75736606?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 30 Jan 2026 22:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Catherine O'Hara, star of 'Schitt's Creek' and 'Home Alone,' dead at 71",
      "description": "Catherine O’Hara, the shape-shifting Canadian comic actor whose characters ranged from the ⁠deliriously theatrical Moira Rose in \"Schitt's Creek\" to the frantic mother in “Home Alone,” has died at 71 — prompting an outpouring of tributes led by her co-star Macaulay Culkin and Canadian Prime Minister Mark Carney.",
      "url": "https://www.france24.com/en/video/20260131-catherine-o-hara-star-of-schitt-s-creek-and-home-alone-dead-at-71",
      "published": "Sat, 31 Jan 2026 14:11:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Macaulay Culkin pays tribute to Home Alone star Catherine O'Hara",
      "description": "Catherine O'Hara, the Emmy-winning actress who starred as Kevin's mother in Home Alone and the eccentric Moira Rose in Schitt's Creek, has died.",
      "url": "https://news.sky.com/story/catherine-ohara-who-starred-in-home-alone-and-schitts-creek-has-died-13500698",
      "published": "Thu, 29 Jan 2026 16:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Astronauts are about to go back to the moon - here's what you need to know",
      "description": "NASA is poised to send astronauts around the moon and back for the first time in more than 50 years.",
      "url": "https://news.sky.com/story/everything-to-know-about-artemis-ii-the-nasa-mission-to-send-astronauts-around-the-moon-13497536",
      "published": "Sat, 31 Jan 2026 00:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US ambassador arrives in Venezuela to reopen diplomatic mission after 7 years",
      "description": "U.S. Ambassador Laura Dogu has arrived in Caracas.",
      "url": "https://abcnews.go.com/International/wireStory/us-ambassador-arrives-venezuela-reopen-diplomatic-mission-after-129741505",
      "published": "Sat, 31 Jan 2026 18:03:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope gets invitation to visit Peru during a Vatican garden party, then stays for lunch",
      "description": "Peru’s ambassador to the Holy See has publicly invited Pope Leo XIV to visit",
      "url": "https://abcnews.go.com/International/wireStory/pope-gets-invitation-visit-peru-vatican-garden-party-129736421",
      "published": "Sat, 31 Jan 2026 12:01:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan, Britain to boost cybersecurity and critical minerals cooperation as China’s influence grows",
      "description": "Japan and Britain have agreed to boost cooperation on cybersecurity and the supply of critical minerals",
      "url": "https://abcnews.go.com/International/wireStory/japan-britain-boost-cybersecurity-critical-minerals-cooperation-chinas-129733320",
      "published": "Sat, 31 Jan 2026 10:02:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada's Conservatives keep Poilievre as leader despite election loss",
      "description": "Members of Canada’s Conservative opposition party voted to keep Perre Poilievre as the party’s leader despite his election loss last year and recent defections",
      "url": "https://abcnews.go.com/International/wireStory/canadas-conservatives-poilievre-leader-despite-election-loss-129730769",
      "published": "Sat, 31 Jan 2026 08:25:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "After Mexico bans vapes, cartels tighten their grip on a booming market",
      "description": "Organized crime in Mexico is tightening its grip on the vape market, a $1.5 billion industry",
      "url": "https://abcnews.go.com/International/wireStory/after-mexico-bans-vapes-cartels-tighten-grip-booming-129728214",
      "published": "Sat, 31 Jan 2026 01:10:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iraqi calligrapher's handwritten Quran ends 6 years of artistry and craft",
      "description": "Iraqi calligrapher Ali Zaman has completed a colossal handwritten Quran manuscript after six years of work",
      "url": "https://abcnews.go.com/International/wireStory/iraqi-calligraphers-handwritten-quran-ends-6-years-artistry-129727158",
      "published": "Sat, 31 Jan 2026 00:09:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Chile's far-right president-elect visits El Salvador mega-prison, plans to talk security with Bukele",
      "description": "Chile’s far-right President-elect José Antonio Kast visited El Salvador’s mega-prison for accused gang members ahead of a meeting with President Nayib Bukele to discuss organized crime",
      "url": "https://abcnews.go.com/International/wireStory/chiles-president-elect-visits-el-salvador-mega-prison-129720506",
      "published": "Fri, 30 Jan 2026 17:45:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Texas A&M moves to end Women’s and Gender Studies degree program",
      "description": "Texas A&M eliminates Women's and Gender Studies degree program, citing \"limited student interest\" and policy compliance after comprehensive course review.",
      "url": "https://www.foxnews.com/us/texas-am-moves-end-womens-gender-studies-degree-program",
      "published": "Sat, 31 Jan 2026 14:17:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Serial Killer Whisperer’ reveals how he cracked America’s most prolific murderer and unlocked 93 confessions",
      "description": "Retired Texas Ranger James Holland reveals how he got Samuel Little to confess to 93 murders, making him \"the most prolific serial killer in U.S. history.\"",
      "url": "https://www.foxnews.com/us/serial-killer-whisperer-reveals-how-he-cracked-americas-most-prolific-murderer-unlocked-93-confessions",
      "published": "Sat, 31 Jan 2026 10:00:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Utah doomsday mom arrested abroad after allegedly abducting four kids, dumping them in European orphanage",
      "description": "Utah mother accused of kidnapping four children and abandoning them in Croatian orphanage after allegedly believing \"end times\" were coming to America.",
      "url": "https://www.foxnews.com/us/utah-doomsday-mom-arrested-abroad-after-allegedly-abducting-four-kids-dumping-them-european-orphanage",
      "published": "Sat, 31 Jan 2026 06:00:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Father claims daughter accused of sex crimes with Florida middle schoolers is the 'real victim'",
      "description": "A Florida woman back in jail after being arrested again has faced multiple charges of sexual abuse of minors, but her father argues she is the victim.",
      "url": "https://www.foxnews.com/us/father-claims-daughter-accused-sex-crimes-florida-middle-schoolers-real-victim",
      "published": "Fri, 30 Jan 2026 18:38:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida couple sues fertility clinic after allegedly giving birth to someone else's baby",
      "description": "White couple sues Florida fertility clinic after giving birth to baby who appeared \"racially non-Caucasian,\" genetic testing allegedly confirms embryo mix-up.",
      "url": "https://www.foxnews.com/us/florida-couple-sues-fertility-clinic-allegedly-giving-birth-someone-elses-baby",
      "published": "Fri, 30 Jan 2026 17:35:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hundreds of political prisoners in Venezuela could be released under new amnesty bill",
      "description": "Venezuela's acting president announces amnesty bill that could free hundreds of political prisoners, including opposition leaders and journalists.",
      "url": "https://www.foxnews.com/world/hundreds-political-prisoners-venezuela-could-released-under-new-amnesty-bill",
      "published": "Sat, 31 Jan 2026 08:43:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel set to reopen Gaza’s Rafah border crossing with Egypt for first time since May 2024",
      "description": "Israel announced that the Rafah border crossing between Egypt and the Gaza Strip will reopen \"for limited movement of people only\" on Sunday, Feb. 1.",
      "url": "https://www.foxnews.com/world/israel-set-reopen-gazas-rafah-border-crossing-egypt-first-time-since-may-2024",
      "published": "Fri, 30 Jan 2026 13:34:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "80-year-old lottery winner sentenced for bankrolling $400M drug empire from cottage with son",
      "description": "Lottery winner John Eric Spiby, 80, was sentenced to 16 years in prison for running a $400 million counterfeit pill empire from his cottage after a 2010 windfall.",
      "url": "https://www.foxnews.com/world/80-year-old-lottery-winner-sentenced-bankrolling-400m-drug-empire-cottage-son",
      "published": "Thu, 29 Jan 2026 20:58:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK's Starmer meets Xi in Beijing as Trump pressures allies on China trade",
      "description": "U.K. Prime Minister Keir Starmer meets Chinese President Xi Jinping, while President Donald Trump attempts to dissuade allies from Beijing.",
      "url": "https://www.foxnews.com/world/uks-starmer-meets-xi-beijing-trump-pressures-allies-china-trade",
      "published": "Thu, 29 Jan 2026 14:20:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}