{
  "last_updated": "2026-01-03T21:40:36.020322Z",
  "event_count": 223,
  "events": [
    {
      "title": "Venezuela: US ready ‘to run’ the country, ‘Maduro captured’",
      "description": "The overnight attacks on January 2 follow recent US military operations that, according to Washington, targeted 35 alleged drug-smuggling boats in the Caribbean. Those strikes brought the total number of people killed to at least 115, according to figures released by the Trump administration. After the overnight strikes, Venezuela declared a state of emergency, reporting a significant escalation in the US administration’s pressure campaign against President Nicolas Maduro. On Saturday, the country’s interior minister urged citizens to “remain calm” and to trust the political and military high command. Several international leaders condemned the US attack, including officials from Colombia, Cuba, Russia, and Iran, denouncing the strikes as violations of international law and acts of state terrorism. They called for emergency action by the United Nations and regional bodies to prevent further escalation. Meanwhile, crowds of Venezuelans gathered in the streets of major cities to celebrate the US operation, waving flags and voicing support for a possible change in leadership, as Nicolás Maduro is considered by many to be a dictator.",
      "url": "https://www.france24.com/en/video/20260103-venezuela-us-ready-to-run-the-country-maduro-captured",
      "published": "Sat, 03 Jan 2026 17:44:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 62,
      "severity_level": "Critical"
    },
    {
      "title": "Coast Guard searches for survivors after US strikes suspected narco-terrorist vessels in Eastern Pacific",
      "description": "The U.S. Coast Guard is searching for survivors after strikes on suspected drug vessels in the Eastern Pacific. Three alleged narco-terrorists were killed, and others are missing.",
      "url": "https://www.foxnews.com/us/coast-guard-searches-survivors-us-strikes-suspected-narco-terrorist-vessels-eastern-pacific",
      "published": "Fri, 02 Jan 2026 17:08:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "Young man killed in apparent targeted drive-by shooting near police station in Melbourne’s inner north",
      "description": "Police investigation continues after fatal shooting in Fitzroy in early hours of Saturday morning Get our breaking news email , free app or daily news podcast A young man has been killed in what police believe was a targeted drive-by shooting outside a police station in Melbourne’s inner north in the early hours of Saturday morning. The attack took place just after midnight when a passing car opened fire on two young men walking across the road from a police station in Fitzroy. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/03/man-dies-after-shooting-in-melbournes-inner-north-ntwnfb",
      "published": "Sat, 03 Jan 2026 01:45:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Venezuela: A sign of relief, but country's future remains uncertain",
      "description": "US President Donald Trump said on Saturday he was looking at whether Venezuela's opposition leader Maria Corina Machado might lead the country after President Nicolas Maduro was captured and flown out of the country. Maduro has been slammed with terrorism and drug charges by the US after a \"large-scale strike\" rocked Caracas with explosions and aircraft-like sounds. Venezuelan writer, Author of \"I killed Simon Bolivar\", Vicente Ulive, shares his insights.",
      "url": "https://www.france24.com/en/video/20260103-venezuela-a-sign-of-relief-but-country-s-future-remains-uncertain",
      "published": "Sat, 03 Jan 2026 15:53:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Donald Trump says US will ‘run’ Venezuela after military strikes – live",
      "description": "United Nations to hold emergency security council meeting after the US attacked Venezuela and forced Nicolás Maduro out of the country Full report – Trump says US will ‘run’ Venezuela Is there legal justification for the US attack on Venezuela? Global outcry after US strikes Venezuela The Reuters news agency says it has been told by a US official, speaking on the condition of anonymity, that the US carried out strikes inside Venezuela on Saturday . The unnamed official did not provide details. As mentioned earlier, the White House and Pentagon did not immediately respond to request for comment on Saturday morning. Continue reading...",
      "url": "https://www.theguardian.com/world/live/2026/jan/03/caracas-explosions-venezuela-maduro-latest-news-updates-live",
      "published": "Sat, 03 Jan 2026 21:34:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Iran threatens Trump after 'locked and loaded' warning",
      "description": "Donald Trump has been threatened with a \"swift, decisive and comprehensive\" response by Iran if the US intervenes following growing unrest in the country, with at least 10 people killed and dozens of arrests, according to reports.",
      "url": "https://news.sky.com/story/iran-threatens-trump-after-locked-and-loaded-warning-13489824",
      "published": "Sat, 03 Jan 2026 00:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua’s driver charged with dangerous driving after fatal crash in Nigeria",
      "description": "British boxer was injured in collision that killed his personal trainer Latif Ayodele and strength coach Sina Ghami Nigerian police have charged Anthony Joshua’s driver with causing death by dangerous driving after a fatal crash that killed two people. Adeniyi Mobolaji Kayode, 46, was also charged with driving without a valid driving licence and “driving without due care and attention, causing bodily harm and damage to property”. He is due to appear in court on 20 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/anthony-joshuas-driver-charged-with-dangerous-driving-after-fatal-crash-in-nigeria",
      "published": "Fri, 02 Jan 2026 17:54:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "The ‘Putinization’ of US foreign policy has arrived in Venezuela",
      "description": "Trump is no longer bending the rules – he is demolishing them, with consequences far beyond Caracas US strikes on Venezuela – live updates Hardly anyone expected 2026 to be a year of peace, and it was barely two days old when the worst fears were confirmed. The overnight strikes on Venezuela, the abduction of its leader, Nicolás Maduro, and his wife , and Donald Trump’s declaration that the US would “run” the country and sell its oil, have driven another truck through international law and global norms. But that is not even the most concerning thing about it. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/03/putin-russia-us-foreign-policy-venezuela",
      "published": "Sat, 03 Jan 2026 19:22:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "US announces terrorism, drug charges against Venezuela's Maduro",
      "description": "The United States on Saturday announced terrorism and drugs charges against Venezulean President Nicolas Maduro, just hours after saying he had been captured and flown out of the country. The Venezuelan government demanded \"immediate proof of life\" of Maduro and his wife after a US \"large-scale strike\" rocked Caracas with explosions and aircraft-like sounds. For more analysis, Washington Bureau Chief for The Guardian and journalist Noris Argotte Soto, explain.",
      "url": "https://www.france24.com/en/video/20260103-us-announces-terrorism-drug-charges-against-venezuela-s-maduro",
      "published": "Sat, 03 Jan 2026 15:07:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Venezuelan leader Maduro and wife indicted in New York on drug, terrorism charges",
      "description": "The United States on Saturday announced terrorism and drugs charges against Venezulean President Nicolas Maduro, just hours after saying he had been captured and flown out of the country. The Venezuelan government demanded \"immediate proof of life\" of Maduro and his wife after a US \"large-scale strike\" rocked Caracas with explosions and aircraft-like sounds. Washington Bureau Chief at The Guardian, David Smith, together with France24 journalist Shirli Sitbon, share their insights.",
      "url": "https://www.france24.com/en/video/20260103-venezuelan-leader-maduro-and-wife-indicted-in-new-york-on-drug-terrorism-charges",
      "published": "Sat, 03 Jan 2026 13:19:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Donald Trump says Maduro and his wife aboard a US warship",
      "description": "ttorney General Pam Bondi said Saturday that Venezuela’s leader Nicolás Maduro has been charged with drug trafficking and “will soon face the full wrath of American justice on American soil in American courts.” The announcement came after President Donald Trump said the U.S. carried out “a large-scale strike” in Venezuela and had captured and flown the pair out of the country. France24 International Affairs Editor Kethevane Gorjestani tells us more.",
      "url": "https://www.france24.com/en/video/20260103-donald-trump-says-maduro-and-his-wife-aboard-a-us-warship",
      "published": "Sat, 03 Jan 2026 15:42:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Drop draft proposals on death penalty for Palestinians, UN rights chief urges Israel",
      "description": "The UN’s top human rights official on Friday called on Israeli authorities to abandon plans for new legislation that would impose mandatory death sentences exclusively on Palestinians, warning the proposals violate international law and fundamental human rights standards.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166693",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "‘It sends a horrible signal’: US politicians react to capture of Nicolás Maduro",
      "description": "Republicans cheer capture of Venezuelan leader, but Democrats say it ‘risks pulling our nation into another war’ US attacks Venezuela – live updates Reaction to the capture of Nicolás Maduro in Caracas, Venezuela , by US forces on Saturday has been starkly polarized along political lines, with administration officials and Republicans celebrating the enforcement of a 2020 US narco-trafficking indictment against Maduro and Democrats decrying what they see as a violation of Venezuela’s right to self-determination. The US attorney general, Pam Bondi, said on X that Maduro and his wife, Cilia Flores, had been indicted in the southern district of New York on charges including narco-terrorism conspiracy, cocaine importation conspiracy, possession of machine guns and destructive devices, and conspiracy to possess machine guns and destructive devices against the United States. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/03/us-politicians-reaction-capture-venezuelan-president-maduro",
      "published": "Sat, 03 Jan 2026 18:15:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "FBI disrupts alleged ISIS-inspired New Year’s Eve attack plot targeting NC grocery store, fast food restaurant",
      "description": "Prosecutors say Christian Sturdivant, 18, of Mint Hill, N.C., allegedly plotted an attack on New Year's Eve in support of the Islamic State terrorist group.",
      "url": "https://www.foxnews.com/us/fbi-disrupts-alleged-isis-inspired-new-years-eve-attack-plot-targeting-nc-grocery-store",
      "published": "Fri, 02 Jan 2026 11:11:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Trump warning over Iran protests 'reckless' says foreign minister",
      "description": "The US president earlier said if peaceful protesters are killed, Washington \"will come to their rescue\".",
      "url": "https://www.bbc.com/news/articles/c2057md3gvro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 11:22:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Mexico: Powerful earthquake kills at least 2 people",
      "description": "The magnitude 6.5 earthquake shook the center and south of the country, which is one of the most seismically active in the world. The capital Mexico City and tourist hotspot Acapulco were affected.",
      "url": "https://www.dw.com/en/mexico-powerful-earthquake-kills-at-least-2-people/a-75373261?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 02:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Woman suspected to have been killed in Colorado's first fatal mountain lion attack in over two decades",
      "description": "A woman's death on a trail is being investigated as a suspected deadly mountain lion attack, according to Colorado Parks and Wildlife.",
      "url": "https://www.foxnews.com/us/woman-suspected-have-been-killed-colorados-first-fatal-mountain-lion-attack-over-two-decades",
      "published": "Fri, 02 Jan 2026 11:46:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Trump says US will ‘run’ Venezuela after ousting Maduro in military attack",
      "description": "US president made comments after US special forces captured Venezuelan president and his wife US attacks Venezuela – live updates Donald Trump has vowed that the US is “going to run” Venezuela until there is an orderly transition of power but provided few details after ousting the country’s leader, Nicolás Maduro , in an audacious military attack. Speaking at a press conference at his Mar-a-Lago residence in Palm Beach, Florida, on Saturday, the president hailed an overnight operation that captured Maduro and his wife, Cilia Flores, as “an assault like people have not seen since world war two”. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/03/trump-venezuela-oil-industry",
      "published": "Sat, 03 Jan 2026 20:19:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "WHO research shows COVID vaccines still crucial in preventing severe illness",
      "description": "Up-to-date vaccination remains the most effective way to prevent severe COVID-19 illness, new research from the World Health Organization (WHO) shows, even as the pandemic has officially ended.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166689",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Police to carry long-arm rifles at final Ashes Test in Sydney amid heightened security after Bondi attack",
      "description": "Decision to carry the weapons at SCG not due to active or imminent threat but ‘to help the public feel safe’, NSW police chief says Get our breaking news email , free app or daily news podcast Police will carry long-arm rifles at the final Ashes Test in Sydney as police presence continues to be heightened after the Bondi terror attack. New South Wales police said public order and riot squad officers would carry the weapons at the fifth and final Ashes Test, which starts on Sunday at the Sydney Cricket Ground (SCG), after similar measures were implemented at the Boxing Day Test in Melbourne and New Year’s Eve events in Sydney. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/03/police-to-carry-long-arm-rifles-final-ashes-test-sydney-heightened-security-after-bondi-attack-ntwnfb",
      "published": "Sat, 03 Jan 2026 00:57:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Six people injured in the fatal fire at a Swiss bar remain unidentified. It's an unbearable wait",
      "description": "A fire at a bar in Crans-Montana, Switzerland, has left families desperate for news about missing loved ones",
      "url": "https://abcnews.go.com/International/wireStory/people-injured-fatal-fire-swiss-bar-remain-unidentified-128860095",
      "published": "Sat, 03 Jan 2026 00:17:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "WATCH: Ohio police smash sunroof, drag injured driver from burning car after rollover crash",
      "description": "Ohio police officers smashed through a sunroof to rescue a trapped driver from a burning car after a crash. Dramatic body camera video shows the rescue.",
      "url": "https://www.foxnews.com/us/watch-ohio-police-smash-sunroof-drag-injured-driver-from-burning-car-after-rollover-crash",
      "published": "Sat, 03 Jan 2026 16:00:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Two people killed in magnitude 6.5 earthquake in Mexico",
      "description": "The powerful earthquake shook southern and central Mexico on Friday, also leaving several people injured.",
      "url": "https://www.bbc.com/news/articles/c1ev8el75gyo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 07:06:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "NSW Labor accused of rushing inquiry into banning phrases such as ‘globalise the intifada’ over the holidays",
      "description": "State opposition leader says inquiry established ‘with no notice, no public hearings and an impossibly short deadline’ Get our breaking news email , free app or daily news podcast A New South Wales parliamentary inquiry into banning phrases including “globalise the intifada” will not hold any public hearings and has a matter of days to receive submissions before it produces its final report. The NSW opposition has expressed concern that the Labor-controlled inquiry, established to investigate the banning of “hateful statements” after the deadly Bondi attack, was being rushed through, limiting the ability of communities to consult on legislative changes. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/03/nsw-labor-accused-of-rushing-inquiry-into-banning-phrases-such-as-globalise-the-intifada-over-the-holidays-ntwnfb",
      "published": "Sat, 03 Jan 2026 05:57:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Missile attack on Kharkiv kills two including child, authorities say",
      "description": "Russian officials say reports of the missile strike are untrue, suggesting the explosion was caused by Ukrainian ammunition.",
      "url": "https://www.bbc.com/news/articles/cx2lnk3486xo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 05:13:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Health advances marked 2025 as wars and funding cuts strained systems",
      "description": "From eliminating deadly infections to expanding access to lifesaving vaccines, 2025 delivered meaningful progress for global health, according to the UN World Health Organization (WHO), offering cautious optimism at the close of a year marked by both breakthroughs and strain.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166690",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Afghanistan to remain major crisis in 2026, UN, partners warn",
      "description": "Afghanistan is expected to remain one of the world’s largest humanitarian crises in 2026, UN agencies and humanitarian partners warned on Tuesday, launching a $1.7 billion appeal to assist nearly 18 million people in urgent need.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166684",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Political violence has 'just started,’ former FBI agent warns in 2026 outlook",
      "description": "Former FBI agent warns political violence has \"just started\" as 2026 begins, citing Charlie Kirk's alleged assassination and ICE attacks.",
      "url": "https://www.foxnews.com/us/political-violence-has-just-started-former-fbi-agent-warns-2026-outlook",
      "published": "Fri, 02 Jan 2026 08:00:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US: FBI arrests man over alleged NYE attack plot",
      "description": "The man had pledged loyalty to the Islamic State group and was allegedly planning a knife-and-hammer attack in North Carolina. Undercover agents foiled the terror plot, the FBI said.",
      "url": "https://www.dw.com/en/us-fbi-arrests-man-over-alleged-nye-attack-plot/a-75373274?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 04:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran blasts Trump's intervention threat",
      "description": "Iran’s UN ambassador, Amir Saeed Iravani, has urged the UN secretary-general and the president of the Security Council to condemn what he calls “unlawful threats” from U.S. President Donald Trump, following his statement that the U.S. was “locked and loaded and ready to go” if more protesters were killed amid ongoing demonstrations in Iran over the rising cost of living. Assistant Professor of Middle East Politics in Washington DC, Sina Azodi, explains further.",
      "url": "https://www.france24.com/en/video/20260103-iran-blasts-trump-s-intervention-threat",
      "published": "Sat, 03 Jan 2026 13:36:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Transport Canada warns Air India on drinking rules after pilot's Vancouver arrest",
      "description": "An Air India pilot was arrested at Vancouver International Airport last week while preparing for a flight",
      "url": "https://abcnews.go.com/International/wireStory/transport-canada-warns-air-india-drinking-rules-after-128857541",
      "published": "Fri, 02 Jan 2026 21:05:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "SECURITY COUNCIL LIVE: Briefing on threats to international peace and security",
      "description": "The UN Security Council meets today to hear a briefing on threats to international peace and security following Israel’s recent recognition of the northern region of Somalia as an independent and sovereign state. Follow live below and UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166679",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "US launch strikes on Venezuela, captures President Maduro",
      "description": "The United States hit Venezuela with a “large-scale strike” early Saturday and said its president, Nicolas Maduro, had been captured and flown out of the country after months of stepped-up pressure by Washington – an extraordinary nighttime operation announced by President Donald Trump on social media hours after the attack.",
      "url": "https://www.france24.com/en/video/20260103-us-launch-strikes-on-venezuela-captures-president-maduro",
      "published": "Sat, 03 Jan 2026 20:47:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Protests spread across Iran as regime threatens US forces as 'legitimate targets' after Trump warning",
      "description": "Iran's parliament speaker threatens U.S. military bases as 'legitimate targets' after Trump vows action over protest crackdowns. Tensions escalate.",
      "url": "https://www.foxnews.com/world/protests-spread-across-iran-regime-threatens-us-forces-legitimate-targets-after-trump-warning",
      "published": "Fri, 02 Jan 2026 16:39:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump vows to 'rescue' Iran's protesters. Iran warns the U.S. to stay out of it",
      "description": "President Trump warned Iran not to kill protesters. Iranian officials alleged the U.S. and Israel were stoking the sweeping protests, and said U.S. military bases in the region are legitimate targets.",
      "url": "https://www.npr.org/2026/01/02/g-s1-104265/trump-iran-protests",
      "published": "Fri, 02 Jan 2026 08:43:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Explosions heard in Venezuelan capital of Caracas",
      "description": "Explosions reported in Venezuelan capital city amid tensions with the US.",
      "url": "https://www.dw.com/en/explosions-heard-in-venezuelan-capital-of-caracas/a-75373526?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 06:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Venezuela denounces 'extremely serious military aggression' by US",
      "description": "The United ​States' military operation ⁠which resulted in the capture of Venezuelan President Nicolas ​Maduro went ‍against the principles of ​international law, said French Foreign ​Minister Jean-Noel Barrot on Saturday. \"The military operation that led to the capture of Nicolas Maduro violates ‍the principle of ​not resorting to force, that underpins international law. France ‌reiterates that no lasting political solution ‍can be imposed from the outside and that only sovereign people themselves can decide their ‍future,\" Barrot wrote on X. France24 Reporter Claire Paccalin shares her insights.",
      "url": "https://www.france24.com/en/video/20260103-venezuela-denounces-extremely-serious-military-aggression-by-us",
      "published": "Sat, 03 Jan 2026 15:14:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "In their words: Survivors and others talk about fatal Swiss Alpine bar fire",
      "description": "In the aftermath of a fire inside a Swiss Alpine bar that killed 40 people celebrating the new year, survivors, friends and family members, the region’s top authorities and even Pope Leo have spoken to the public in remarks in French, Italian, German a...",
      "url": "https://abcnews.go.com/International/wireStory/words-survivors-talk-fatal-swiss-alpine-bar-fire-128862205",
      "published": "Sat, 03 Jan 2026 04:41:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "How the region is reacting to U.S. strikes on Venezuela",
      "description": "NPR international correspondent Eyder Peralta joins NPR's Daniel Estrin to discuss reaction from Venezuela and other countries in the region.",
      "url": "https://www.npr.org/2026/01/03/nx-s1-5665576/how-the-region-is-reacting-to-u-s-strikes-on-venezuela",
      "published": "Sat, 03 Jan 2026 08:02:18 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Trump says U.S. carried out 'large-scale strike' against Venezuela",
      "description": "NPR's Daniel Estrin discusses the latest with NPR international correspondent Carrie Kahn.",
      "url": "https://www.npr.org/2026/01/03/nx-s1-5665570/trump-says-u-s-carried-out-large-scale-strike-against-venezuela",
      "published": "Sat, 03 Jan 2026 08:02:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "What we know about the alleged ISIS-inspired New Year’s Eve terror suspect",
      "description": "Details are emerging Friday about Christian Sturdivant, the 18-year-old who allegedly plotted an ISIS-inspired New Year's Eve attack in North Carolina.",
      "url": "https://www.foxnews.com/us/what-we-know-about-isis-inspired-new-years-eve-terror-suspect",
      "published": "Fri, 02 Jan 2026 14:57:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "How K-beauty went from a viral trend to an economic powerhouse",
      "description": "Inside the K-beauty industry that has made South Korea a major player in worldwide beauty market.",
      "url": "https://www.bbc.com/news/articles/cj9y43mv332o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 02 Jan 2026 22:20:53 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Russia says 27 dead in Ukrainian strike; Zelenskyy names intell chief to new role",
      "description": "Russian authorities say a Ukrainian drone strike on a café in the Kherson region has killed 27 people",
      "url": "https://abcnews.go.com/International/wireStory/russia-puts-death-toll-ukrainian-strike-27-zelenskyy-128841458",
      "published": "Fri, 02 Jan 2026 08:40:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Revelers at Swiss Alpine bar describe horror and panic when a fire broke out, leaving about 40 dead",
      "description": "A New Year’s party at a Swiss Alpine bar turned into a tragedy after about 40 people died in a fire and another roughly 115 were injured, many in their teens to mid-20s",
      "url": "https://abcnews.go.com/International/wireStory/fire-swiss-ski-resort-bar-left-40-people-128840811",
      "published": "Fri, 02 Jan 2026 09:31:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Attacks disrupt heating as temperatures plunge",
      "description": "Recent attacks across Ukraine have killed civilians, damaged critical infrastructure and cut heating and power supplies for millions, UN humanitarians report, as temperatures drop below freezing.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166687",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "SEE PICS: Venezuelans worldwide celebrate as exiles react to Maduro’s capture",
      "description": "Venezuelans erupt in celebration after President Donald Trump announces Nicolás Maduro's capture, with celebrations in Miami, Chile and Spain.",
      "url": "https://www.foxnews.com/world/see-pics-venezuelans-worldwide-celebrate-as-exiles-react-to-maduros-capture",
      "published": "Sat, 03 Jan 2026 15:07:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Maduro gave state TV address as US strikes in Venezuela began: report",
      "description": "Venezuelan President Nicolás Maduro called U.S. strikes an \"attack against Venezuela's sovereignty\" before President Donald Trump announced his capture.",
      "url": "https://www.foxnews.com/world/maduro-gave-state-tv-address-us-strikes-venezuela-began-report",
      "published": "Sat, 03 Jan 2026 10:30:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "U.S. strikes on Venezuela spark alarm across Latin America and beyond",
      "description": "The U.S. military action in Venezuela has drawn condemnation from many regional governments and global powers alike, raising fresh questions about legality, sovereignty and the risk of escalation.",
      "url": "https://www.npr.org/2026/01/03/nx-s1-5665659/venezuela-us-strikes-maduro",
      "published": "Sat, 03 Jan 2026 11:40:06 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Criminal investigation launched after deadly blaze at Swiss bar over New Year",
      "description": "The two managers of a Swiss bar where at least 40 people were killed in a devastating fire have been put under criminal investigation.",
      "url": "https://news.sky.com/story/managers-of-swiss-bar-where-fire-killed-40-during-new-years-event-face-criminal-investigation-13490061",
      "published": "Sat, 03 Jan 2026 17:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Security Council: New faces, old tensions as five nations take their seats",
      "description": "From deploying peacekeepers to conducting quiet – but at times heated – diplomacy, the UN Security Council sits at the heart of global decision-making on war and peace. As of January, five new countries will have a seat around the iconic horseshoe table.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166697",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Tensions between Saudis and Emiratis over future of Yemen reach boiling point",
      "description": "Dispute has potential to create civil war in south of Yemen and spill over into neighbouring countries Tensions between the United Arab Emirates and Saudi Arabia over the future of Yemen and the imminent possibility of the declaration of an independent southern state have reached boiling point with Saudi Arabia in effect accusing the UAE of threatening its future security. The dispute has the potential to create a civil war within the south of Yemen and also spill over into other disputes including in Sudan and the Horn of Africa where the two countries often find themselves backing opposite sides. Yemen could yet become only one theatre in which the two vastly wealthy Gulf states vie for political influence, control of shipping lanes and commercial access. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/30/saudi-arabia-uae-tension-future-yemen-boiling-point",
      "published": "Tue, 30 Dec 2025 17:19:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sexual violence against children ‘entrenched, systemic and widespread’ across DR Congo, UNICEF warns",
      "description": "Sexual violence against children has become entrenched, systemic and increasingly widespread across the Democratic Republic of the Congo (DRC), with new data showing a sharp rise in cases since 2022, according to the UN Children’s Fund (UNICEF).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166683",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Runner fought off mountain lion with stick just weeks before fatal attack on same Colorado trail",
      "description": "A Colorado hiker fought off a mountain lion with a stick after being rushed on a trail where a woman was found dead weeks later in a suspected wildlife attack.",
      "url": "https://www.foxnews.com/us/runner-fought-mountain-lion-stick-just-weeks-fatal-attack-same-colorado-trail",
      "published": "Fri, 02 Jan 2026 21:33:31 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Off-duty ICE agent takes down armed man firing rifle at LA apartment complex",
      "description": "Off-duty ICE agent confronted armed neighbor firing rifle shots into the air at Los Angeles apartment complex on New Year's Eve, fatally shooting the gunman.",
      "url": "https://www.foxnews.com/us/off-duty-ice-agent-takes-armed-man-firing-rifle-la-apartment-complex",
      "published": "Fri, 02 Jan 2026 17:08:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US capture of Maduro championed, condemned across world stage after surgical Venezuela strikes",
      "description": "World leaders react with condemnation, concern and praise after President Donald Trump announces strikes on Venezuela and capture of Nicolás Maduro.",
      "url": "https://www.foxnews.com/world/us-capture-maduro-championed-condemned-across-world-stage-after-surgical-venezuela-strikes",
      "published": "Sat, 03 Jan 2026 08:22:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "George Clooney gets French citizenship — and another dust-up with Trump",
      "description": "The French government says it granted George and Amal Clooney citizenship because of their contributions to its international influence. Their family has primarily lived in France since 2021.",
      "url": "https://www.npr.org/2026/01/02/nx-s1-5664809/george-clooney-french-citizenship-trump",
      "published": "Fri, 02 Jan 2026 10:50:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "US strikes Venezuela and captures Maduro and his wife",
      "description": "President Donald Trump said that US forces had captured Venezuelan leader Nicolas Maduro after launching a \"large-scale strike\" on the South American country. \"The United States of America has successfully carried out a large scale strike against Venezuela and its leader, President Nicolas Maduro, who has been, along with his wife, captured and flown out of the Country,\" Trump said on Truth Social. Trump said he would give a news conference at 11am local time at his Mar-a-Lago residence in Florida. France24 correspondent Fraser Jackson tells us the latest from Washington.",
      "url": "https://www.france24.com/en/video/20260103-us-strikes-venezuela-and-captures-maduro-and-his-wife",
      "published": "Sat, 03 Jan 2026 15:15:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "What images and videos tell us about why Swiss bar fire spread so quickly",
      "description": "How the blaze took hold with such ferocity, killing at least 40 people and leaving many more critically injured, is now a key focus for officials.",
      "url": "https://www.bbc.com/news/articles/c20gjlpw9l3o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 02 Jan 2026 20:28:25 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Union calls for end to tax breaks that make Australian housing ‘a vehicle for hoarding wealth’",
      "description": "Manufacturing workers union wants capital gains tax discount to be reduced and then phased out and an effective end to negative gearing Get our breaking news email , free app or daily news podcast A trade union has called for sweeping changes to housing tax breaks that it warns have “commodified” property and worsened inequality. The Australian Manufacturing Workers’ Union (AMWU) wants the capital gains discount phased out for investment properties and negative gearing effectively abolished. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/04/amfu-union-end-capital-gains-tax-negative-gearing-australia-house-prices",
      "published": "Sat, 03 Jan 2026 19:00:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Photos: Aftermath of strikes in Venezuela",
      "description": "Pictures show the aftermath of the U.S. strikes in Venezuela and the reaction from around the world.",
      "url": "https://www.npr.org/sections/the-picture-show/2026/01/03/g-s1-104359/photos-aftermath-of-strikes-in-venezuela",
      "published": "Sat, 03 Jan 2026 13:28:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "'We are going to run the country,' Trump says after strike on Venezuela",
      "description": "President Trump claimed overnight that the United States carried out airstrikes in Venezuela and captured President Nicolás Maduro.",
      "url": "https://www.npr.org/2026/01/03/g-s1-104329/explosions-caracas-venezuela",
      "published": "Sat, 03 Jan 2026 03:11:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "More Saudi airstrikes hit separatist positions in Yemeni port city",
      "description": "Yemen has been engulfed in civil war for more than a decade.",
      "url": "https://abcnews.go.com/International/wireStory/saudi-airstrikes-hit-separatist-positions-yemeni-port-city-128872012",
      "published": "Sat, 03 Jan 2026 13:27:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Pakistan sentences journalists, YouTubers and ex-military officers to life over inciting violence",
      "description": "A court in Pakistan’s capital has sentenced seven people to life imprisonment after convicting them of inciting violence",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-sentences-journalists-youtubers-military-officers-life-inciting-128843498",
      "published": "Fri, 02 Jan 2026 09:05:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "European security advisors discuss peace proposals in Kyiv ahead of leaders' summit",
      "description": "European national security advisors have arrived in Kyiv to discuss peace proposals as a U.S.-led diplomatic push to end the war in Ukraine intensifies",
      "url": "https://abcnews.go.com/International/wireStory/european-security-advisors-discuss-peace-proposals-kyiv-ahead-128864384",
      "published": "Sat, 03 Jan 2026 09:01:16 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "‘Do not give up on children’: Displaced by violence, a Haitian girl finds hope at school",
      "description": "A teenage Haitian girl who was forced to flee her home in Haiti’s capital, Port-au-Prince, due to gang violence has urged adults not to “give up on children.”",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166695",
      "published": "Sat, 03 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump confirms US strike in Venezuela, says President Nicolás Maduro has been 'captured'",
      "description": "The U.S. military carried out air strikes in various areas of Venezuela, including the capital of Caracas, early Saturday morning, officials confirmed to Fox News.",
      "url": "https://www.foxnews.com/world/explosions-venezuelan-capital-caracas-reports",
      "published": "Sat, 03 Jan 2026 02:22:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "'Living a nightmare': Families of teens missing after ski resort fire desperate for news",
      "description": "Families are appealing for information about children as young as 15 who are thought to have been at the bar.",
      "url": "https://www.bbc.com/news/articles/c07xn220gdeo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 09:02:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "'You're invisible, you don't exist' - life without a birth certificate",
      "description": "Millions around the world are living in the shadows as stateless people as they lack official papers.",
      "url": "https://www.bbc.com/news/articles/cx2drqwp2eyo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 02 Jan 2026 02:15:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Footage shows Saudi-backed forces advancing in southern Yemen",
      "description": "Video shows Saudi-backed forces advancing towards the Yemeni city of Mukalla, seizing new areas in Hadramout.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/3/footage-shows-saudi-backed-forces-advancing-in-southern-yemen?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 12:07:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The US has followed through on its Venezuela threats - how did we get here?",
      "description": "After months of rising tensions, a build-up of US warships in the Caribbean and escalating threats of military action, America has struck Venezuela.",
      "url": "https://news.sky.com/story/us-strikes-on-venezuela-how-did-we-get-here-13489872",
      "published": "Sat, 03 Jan 2026 09:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "What are the charges against Venezuela's Nicolás Maduro?",
      "description": "The U.S. Justice Department has unsealed a new indictment alleging \"drug trafficking and narco-terrorism conspiracies\" against Maduro, his wife and other defendants.",
      "url": "https://www.npr.org/2026/01/03/nx-s1-5665617/venezuela-nicolas-maduro-charges",
      "published": "Sat, 03 Jan 2026 11:23:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "'Narcoterrorism', 'safe' transition and oil: Trump speaks after Maduro’s capture",
      "description": "​US President Donald ⁠Trump said Venezuelan President Nicolas Maduro and his wife were ​seized in ‍an overnight operation ​on Saturday and would face American ​justice, calling it one of the most successful military operations in US history.",
      "url": "https://www.france24.com/en/live-news/20260103-%F0%9F%94%B4-live-maduro-has-been-indicted-for-his-narcoterrorism-campaign-says-trump",
      "published": "Sat, 03 Jan 2026 16:46:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Venezuela: Maduro and his wife 'captured' will face terrorism charges",
      "description": "US Attorney General Pam Bondi says deposed Venezuelan leader Nicolas Maduro and his wife, Cilia Flores, will face criminal charges after an indictment in New York. Bondi vowed in a social media post that the couple will “soon face the full wrath of American justice on American soil in American courts\". Maduro was indicted in 2020 in New York, but it was not previously known that his wife had been. For more, Senior Fellow at the Center for Economic and Policy Research, Guillaume Lang, shares his insights.",
      "url": "https://www.france24.com/en/video/20260103-venezuela-maduro-and-his-wife-captured-will-face-terrorism-charges",
      "published": "Sat, 03 Jan 2026 15:40:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Earthquake with a preliminary magnitude of 6.5 rattles southern and central Mexico",
      "description": "A strong earthquake rattled southern and central Mexico, interrupting President Claudia Sheinbaum’s first press briefing of the new year as seismic alarms sounded",
      "url": "https://abcnews.go.com/International/wireStory/earthquake-preliminary-magnitude-65-rattles-southern-central-mexico-128845093",
      "published": "Fri, 02 Jan 2026 15:14:35 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "A woman dies from cervical cancer every two minutes, UN says",
      "description": "A flood of questions drowned Jeanette in thought after she was diagnosed with cervical cancer. Would she be unable to conceive a child? Would she have to enter menopause at the early age of 31?",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166696",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Another child dies in extreme conditions in Gaza: UNICEF",
      "description": "A sixth child has died in Gaza this month as the enclave’s people continue to endure dire living conditions linked to freezing rains and the Israel-Hamas war, the UN Children’s Fund (UNICEF) has announced. The development comes as aid agencies urged Israeli authorities to reconsider revoking the licences of dozens of humanitarian partners that provide assistance across the devastated enclave from 1 January.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166686",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Zelenskyy names new chief of staff",
      "description": "Ukraine's popular military intelligence head, Kyrylo Budanov, has been appointed chief of staff. Meanwhile, Ukraine has reported two missile strikes in residential areas of Kharkiv.",
      "url": "https://www.dw.com/en/ukraine-zelenskyy-names-new-chief-of-staff/live-75371089?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 17:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Swiss fire safety under scrutiny after Crans-Montana blaze",
      "description": "After the deadly fire at the Constellation bar in the Swiss ski resort of Crans-Montana, questions are growing about the country's safety regulations.",
      "url": "https://www.dw.com/en/swiss-fire-safety-under-scrutiny-after-crans-montana-blaze/a-75369716?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 16:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "'Dragged from their bedroom': How the US struck Venezuela - and removed Maduro and wife",
      "description": "The US has carried out a \"large-scale strike\" against Venezuela, and its leader, Nicolas Maduro, has been flown out of the country with his wife.",
      "url": "https://news.sky.com/story/everything-we-know-about-us-strikes-on-venezuela-13489955",
      "published": "Sat, 03 Jan 2026 14:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Sudan: UN warns of unprecedented child hunger in Darfur as fighting fuels refugee exodus",
      "description": "Sudan’s deepening war is driving unprecedented levels of hunger, child malnutrition and displacement, UN agencies report, as new data from Darfur and a renewed refugee influx into Chad underscore the rapidly deteriorating situation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166682",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Gaza battered by heavy rains as humanitarian response continues",
      "description": "Severe weather conditions have led to further casualties and heightened health risks in Gaza over the past 24 hours, the UN aid coordination office (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166680",
      "published": "Mon, 29 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "California defies deadline on immigrant trucker licenses as feds threaten funding cuts",
      "description": "California delays crackdown on immigrant commercial driver's licenses until March, defying federal deadline and risking $160 million in funding cuts.",
      "url": "https://www.foxnews.com/us/california-defies-deadline-immigrant-trucker-licenses-feds-threaten-funding-cuts",
      "published": "Fri, 02 Jan 2026 11:25:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Ukraine tricks Russia into paying $500K bounty for fake hit on Putin opponent: report",
      "description": "Ukraine faked the assassination of Russian opposition leader Denis Kapustin to trick Moscow into paying a $500,000 bounty that funded the war effort.",
      "url": "https://www.foxnews.com/world/ukraine-tricks-russia-paying-500k-bounty-fake-hit-putin-opponent-report",
      "published": "Fri, 02 Jan 2026 15:38:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Swiss open criminal case against managers of ski resort bar after deadly fire",
      "description": "It comes after a preliminary investigation found the likely cause was sparklers on champagne bottles being carried too close to the ceiling.",
      "url": "https://www.bbc.com/news/articles/cjdjl303zxlo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 21:20:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Indonesia hire former Canada coach Herdman to replace Kluivert",
      "description": "Former Canada coach John Herdman replaces Patrick Kluivert as Indonesia coach after failure to reach 2026 World Cup.",
      "url": "https://www.aljazeera.com/sports/2026/1/3/indonesia-hire-former-canada-coach-herdman-to-replace-kluivert?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 16:02:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran’s Khamenei says rioters ‘must be put in their place’ amid protests",
      "description": "Supreme leader says authorities should only 'talk to protesters', not rioters, as antigovernment demonstrations grow.",
      "url": "https://www.aljazeera.com/news/2026/1/3/irans-khamenei-says-rioters-must-be-put-in-their-place-amid-protests?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 12:54:26 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Cremation pyre in Africa thought to be world’s oldest containing adult remains",
      "description": "9,500-year-old pyre uncovered in Malawi offers rare insight into rituals of ancient African hunter-gatherer groups A cremation pyre built about 9,500 years ago has been discovered in Africa, offering a fresh glimpse into the complexity of ancient hunter-gatherer communities. Researchers say the pyre, discovered in a rock shelter at the foot of Mount Hora in northern Malawi, is thought to be the oldest in the world to contain adult remains, the oldest confirmed intentional cremation in Africa, and the first pyre to be associated with African hunter-gatherers. Continue reading...",
      "url": "https://www.theguardian.com/science/2026/jan/01/cremation-pyre-in-africa-thought-to-be-worlds-oldest-containing-adult-remains",
      "published": "Thu, 01 Jan 2026 19:00:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Swiss NYE fire: Bar managers face criminal investigation",
      "description": "Authorities have launched an investigation into the managers of a bar in Crans-Montana after 40 people died at a New Year's Eve party.",
      "url": "https://www.dw.com/en/swiss-nye-fire-bar-managers-face-criminal-investigation/a-75378122?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 16:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "China's BYD overtakes Tesla as world's top EV seller",
      "description": "Elon Musk's Tesla has had a tough year and faced intensifying competition from Chinese and European rivals.",
      "url": "https://www.dw.com/en/china-s-byd-overtakes-tesla-as-world-s-top-ev-seller/a-75370504?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 16:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Mexico condemns US strikes on Venezuela",
      "description": "President Claudia Sheinbaum made reference to Article 2 of the Charter of the United Nations by sharing Mexico's position on social media, rejecting the United States' aggression against Venezuela. France24 correspondent, author and journalist Ioan Grillo tells us the latest from Mexico City.",
      "url": "https://www.france24.com/en/video/20260103-mexico-condemns-us-strikes-on-venezuela",
      "published": "Sat, 03 Jan 2026 15:44:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Inside Venezuela’s oil industry: World’s largest oil reserves, failing infrastructure",
      "description": "US President Donald Trump told Fox News ‍on Saturday that the ‍US was ⁠going to be \"very strongly involved\" in Venezuela's ​oil ‍industry in the ​wake of the operation to ​capture Venezuelan President Nicolas Maduro. Here are some key facts ‍about Venezuela's oil industry.",
      "url": "https://www.france24.com/en/americas/20260103-world-largest-oil-reserves-failing-infrastructure-inside-venezuela-oil-industry",
      "published": "Sat, 03 Jan 2026 14:50:31 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Why Trump's removal of Maduro is unprecedented - and what it means for the world",
      "description": "Donald Trump's removal of Nicolas Maduro as leader of Venezuela is completely unprecedented.",
      "url": "https://news.sky.com/story/why-trumps-removal-of-maduro-is-unprecedented-13489912",
      "published": "Sat, 03 Jan 2026 12:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump, top Iranian security official exchange threats over protests now roiling Iran",
      "description": "U.S. President Donald Trump and a top Iranian security official have exchanged dueling threats as widening economic protests swept across parts of the Islamic Republic",
      "url": "https://abcnews.go.com/International/wireStory/trump-top-iranian-security-official-exchange-threats-protests-128841175",
      "published": "Fri, 02 Jan 2026 04:52:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Officials race to identify mostly young victims of deadly Swiss Alps bar fire",
      "description": "Deadly New Year's Eve bar fire at Swiss ski resort kills around 40 people, mostly young victims as the investigation and identification process continues.",
      "url": "https://www.foxnews.com/world/officials-race-identify-mostly-young-victims-deadly-swiss-alps-bar-fire",
      "published": "Fri, 02 Jan 2026 08:50:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "BBC reaches agreement with Israeli family for filming in home after 7 October without consent",
      "description": "The family who survived the Hamas attack in 2023 call the incident an “intrusion”.",
      "url": "https://www.bbc.com/news/articles/c1ev7ly35neo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 15:37:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why has Trump attacked Venezuela and taken Maduro?",
      "description": "The US has been ramping up pressure on the Venezuelan leader since Trump took office last January.",
      "url": "https://www.bbc.com/news/articles/c93n4nx5yqro?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 18:06:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US lawmakers react to attack on Venezuela, ‘capture’ of Nicolas Maduro",
      "description": "Donald Trump's allies defend actions against Venezuela as Democrats condemn lack of oversight from US Congress.",
      "url": "https://www.aljazeera.com/news/2026/1/3/us-lawmakers-react-to-attack-on-venezuela-capture-of-maduro?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 16:36:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Colombia braces with alarm after Maduro’s removal in Venezuela by US",
      "description": "Colombia could face its own turmoil from the stunning turn of events both in violence and a mass influx of refugees.",
      "url": "https://www.aljazeera.com/news/2026/1/3/colombia-braces-with-alarm-after-maduros-removal-in-venezuela-by-us?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 14:27:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump bombs Venezuela, US ‘captures’ Maduro: All that we know",
      "description": "Venezuelan vice president says Maduro's whereabouts unknown after dramatic attacks capping months of tension.",
      "url": "https://www.aljazeera.com/news/2026/1/3/trump-bombs-venezuela-us-captures-maduro-all-that-we-know?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 13:32:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine updates: Trump says Putin 'killing too many people'",
      "description": "US President Trump has said he is \"not thrilled with Putin\" during a press conference. Meanwhile, European security advisers discussed a 20-point peace plan put forward by Zelenskyy. DW has more.",
      "url": "https://www.dw.com/en/ukraine-updates-trump-says-putin-killing-too-many-people/live-75373512?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 18:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Kenya mourns death of iconic elephant Craig",
      "description": "Craig was one of the last remaining elephants identified as super tuskers in Africa, but also became a symbol for conservation.",
      "url": "https://www.dw.com/en/kenya-mourns-death-of-iconic-elephant-craig/a-75378118?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 15:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "What is behind Trump's ouster of Venezuela's Maduro?",
      "description": "The latest attacks on Caracas suggest regime change is top of the White House agenda when it comes to Venezuela. But the ultimate purpose may not be purely to restore democracy.",
      "url": "https://www.dw.com/en/what-is-behind-trump-s-ouster-of-venezuela-s-maduro/a-75232235?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 08:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yemen separatists plan transition to independence by 2028",
      "description": "The Southern Transitional Council said independence would be \"immediate\" if attacks against them continue.",
      "url": "https://www.dw.com/en/yemen-separatists-plan-transition-to-independence-by-2028/a-75372634?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 19:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "REPLAY: US President Donald Trump Press conference on Venezuela's attack and capture of Maduro",
      "description": "This is the replay of US President Donald Trump Press conference on Venezuela's attack and capture of Maduro.",
      "url": "https://www.france24.com/en/video/20260103-replay-us-president-donald-trump-press-conference-on-venezuela-s-attack-and-capture-of-maduro",
      "published": "Sat, 03 Jan 2026 18:17:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "How sanctions are boosting Russian wine",
      "description": "You've probably never had a glass of Russian sparkling wine before. Perhaps you never even knew such a thing existed. If that's the case, Mikhail Nikolaev believes you're missing out.",
      "url": "https://news.sky.com/story/russian-winemakers-think-theyre-ready-to-join-the-elite-our-taste-test-says-otherwise-13489675",
      "published": "Fri, 02 Jan 2026 13:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Dozens missing after boat carrying more than 200 migrants capsized off the coast of Gambia",
      "description": "Gambia's president says dozens are missing after a boat carrying over 200 migrants capsized off the coast",
      "url": "https://abcnews.go.com/International/wireStory/dozens-missing-after-boat-carrying-200-migrants-capsized-128862733",
      "published": "Sat, 03 Jan 2026 05:21:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "The Latest: US strikes Venezuela, captures Maduro and his wife",
      "description": "The United States has launched a large-scale strike on Venezuela, capturing President Nicolás Maduro and his wife",
      "url": "https://abcnews.go.com/International/wireStory/latest-us-strikes-venezuela-captures-maduro-wife-128863070",
      "published": "Sat, 03 Jan 2026 06:25:56 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "New year dawns amid rubble and resolve in Gaza",
      "description": "As 2026 begins, residents of the Gaza Strip are confronting life in displacement camps and among the ruins of destroyed neighbourhoods – facing deep uncertainty after months of war and devastation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166692",
      "published": "Thu, 01 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "The Bail Project spent $91M freeing criminal suspects, including some who later committed murder",
      "description": "The Bail Project spent $90+ million bailing out suspects, including those who allegedly killed people after release. Multiple murders linked to the program.",
      "url": "https://www.foxnews.com/us/bail-project-spent-91m-freeing-criminal-suspects-including-some-who-later-committed-murder",
      "published": "Sat, 03 Jan 2026 08:00:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Teens' viral prank targeting homeowners could have deadly consequences, police warn",
      "description": "Kansas police warn about dangerous \"door kick challenge\" TikTok trend where teens kick doors to mimic home invasions, risking criminal charges and safety.",
      "url": "https://www.foxnews.com/us/teens-viral-prank-targeting-homeowners-could-have-deadly-consequences-police-warn",
      "published": "Fri, 02 Jan 2026 14:00:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "From bus driver to dictator: Nicolás Maduro’s rise and fall in Venezuela",
      "description": "The U.S. had announced a $50 million reward for information leading to Maduro’s arrest before news emerged Saturday of his capture in Venezuela.",
      "url": "https://www.foxnews.com/world/from-bus-driver-dictator-nicolas-maduros-rise-fall-venezuela",
      "published": "Sat, 03 Jan 2026 07:54:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "‘It’s impossible not to feel relief’: UK Venezuelans on Maduro’s capture",
      "description": "Hope, fear and unease ripple through Britain’s Venezuelan community after US forces seized Nicolás Maduro US strikes on Venezuela – live updates When Cinzia de Santis woke up to the news that Nicolás Maduro had been captured by US troops in a pre-dawn assault on Caracas, she had mixed emotions. “My first reaction was he’s gone, which is kind of good news,” she said. But the manner in which the Venezuelan president and his wife, Cilia Flores, were taken to New York to face criminal charges – in a military operation that, at this point, appears to have little to no legal or constitutional authority – has sparked concern. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/03/its-impossible-not-to-feel-relief-uk-venezuelans-on-maduros-capture",
      "published": "Sat, 03 Jan 2026 18:43:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Middle Eastern governments are watching Iran's protests",
      "description": "As anti-government protests continue in Iran, countries in the region are watching. Some are concerned; others sense potential opportunity.",
      "url": "https://www.dw.com/en/middle-eastern-governments-are-watching-iran-s-protests/a-75372258?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 20:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says US will ‘run’ Venezuela after Nicolas Maduro seized",
      "description": "Trump says the US will 'run the country until such time as we can do a safe, proper and judicious transition'.",
      "url": "https://www.aljazeera.com/news/2026/1/3/trump-says-us-will-run-venezuela-after-nicolas-maduro-seized?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 16:57:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea’s junta chief elected president after opposition boycott",
      "description": "Mamady Doumbouya reneged on promise not to stand and hand west African country back to civilian rule The head of Guinea’s junta, Mamady Doumbouya, who had pledged not to run for office after seizing power four years ago, has been elected president after the country’s electoral commission said he had secured a sweeping majority of the vote. Doumbouya, 41, faced eight rivals for the presidency but the main opposition leaders were barred from running and had urged a boycott of the vote held over the weekend. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/guinea-junta-chief-mamady-doumbouya-elected-president-after-opposition-boycott",
      "published": "Wed, 31 Dec 2025 07:54:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Who is Zelenskyy's new chief of staff, Kyrylo Budanov?",
      "description": "Lieutenant General Kyrylo Budanov is the first military officer to head Volodymyr Zelenskyy's presidential office. The head of the military secret service HUR is one of the country's most popular civil servants.",
      "url": "https://www.dw.com/en/who-is-zelenskyy-s-new-chief-of-staff-kyrylo-budanov/a-75375476?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 18:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Maduro's 'tiger' with designer fashion tastes: Who is Venezuela's VP Delcy Rodriguez?",
      "description": "Hours after Venezuelan President Nicolas Maduro was captured in an audacious US raid, Vice President Delcy Rodriguez insisted he remains the Latin American country’s only leader. In a televised speech, Rodriguez, who is also finance and oil minister, called for calm. Rodriguez denounced Maduro's kidnapping and vowed to defend Venezuela's resources.",
      "url": "https://www.france24.com/en/live-news/20260103-live-we-are-ready-to-defend-venezuela-vp-delcy-rodriguez-says-on-state-tv",
      "published": "Sat, 03 Jan 2026 19:34:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "What to know about the Ukrainian general picked by Zelenskyy to be his new chief of staff",
      "description": "Ukrainian President Volodymyr Zelenskyy has announced Gen. Kyrylo Budanov, the head of the country’s military intelligence service, as his new chief of staff",
      "url": "https://abcnews.go.com/International/wireStory/ukrainian-general-picked-zelenskyy-new-chief-staff-128860283",
      "published": "Sat, 03 Jan 2026 00:33:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Indonesia’s new penal code takes effect, marking historic break with colonial law",
      "description": "Indonesia has begun enforcing its newly ratified penal code, replacing a Dutch-era criminal law that had governed the country for more than 80 years and marking a major shift in its legal landscape",
      "url": "https://abcnews.go.com/International/wireStory/indonesias-new-penal-code-takes-effect-marking-historic-128841111",
      "published": "Fri, 02 Jan 2026 04:41:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Maduro met Chinese envoy hours before US capture from Caracas as Beijing slams operation",
      "description": "Venezuela's dictator Nicolás Maduro was captured by U.S. forces and flown out of the country hours after meeting Chinese envoy to Latin America, Qiu Xiaoqi.",
      "url": "https://www.foxnews.com/world/maduro-met-chinese-envoy-hours-before-us-capture-from-caracas-beijing-slams-operation",
      "published": "Sat, 03 Jan 2026 11:00:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Zelensky names spy chief to head presidential office after corruption row",
      "description": "Kyrylo Budanov has led the Hur military intelligence, which has claimed a number of highly-effective strikes against Russia.",
      "url": "https://www.bbc.com/news/articles/cx2k0101enyo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 02 Jan 2026 21:18:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "'Somewhere to put worker bees': Why Canada's micro-condos are losing their appeal",
      "description": "The condo market in Canada's biggest cities is undergoing a historic crash, with smaller units losing their value faster than any others.",
      "url": "https://www.bbc.com/news/articles/cqxq32zzq8eo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 00:05:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Young Italian golfer feared dead: What we know about Swiss resort fire",
      "description": "Authorities say 40 people died in the blaze in the resort of Crans-Montana.",
      "url": "https://www.bbc.com/news/articles/c9dvyyjyj18o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 02 Jan 2026 22:38:12 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Photos: Aftermath of US air strikes in Venezuela",
      "description": "Trump confirms Maduro has been captured and flown out of Venezuela during joint US operation lasting under 30 minutes.",
      "url": "https://www.aljazeera.com/gallery/2026/1/3/photos-aftermath-of-us-air-strikes-in-venezuela?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 14:49:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US ‘adapt, shrink or die’ terms for $2bn aid pot will mean UN bowing down to Washington, say experts",
      "description": "Afghanistan and Yemen excluded from list of 17 priority countries chosen by Trump administration to receive aid laden with demands The $2bn (£1.5bn) of aid the US pledged this week may have been hailed as “bold and ambitious” by the UN but could be the “nail in the coffin” in changing to a shrunken, less flexible aid system dominated by Washington’s political priorities, aid experts fear. After a year of deep cuts in aid budgets by the US and European countries, the announcement of new money for the humanitarian system is a source of some relief, but experts are deeply concerned about demands that the US has imposed on how the money should be managed and where it can go. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/01/us-aid-cuts-conditions-un-humanitarian-pledge-ocha",
      "published": "Thu, 01 Jan 2026 13:00:40 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Yemen's Houthis would benefit if fighting begins again",
      "description": "Recent Saudi airstrikes against UAE-aligned separatists escalated tensions in southern Yemen. With Saudi Arabia and the UAE backing opposing factions, a return to fighting would most benefit the Houthis.",
      "url": "https://www.dw.com/en/yemen-s-houthis-would-benefit-if-fighting-begins-again/a-75370222?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 17:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Grok under fire for sexualizing women and children's images",
      "description": "Grok's new feature allowing modification of pictures was used on a mass scale to create images of undressed women and children.",
      "url": "https://www.dw.com/en/grok-under-fire-for-sexualizing-women-and-children-s-images/a-75373792?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 12:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Swiss resort fire: Sparklers likely cause, authorities say",
      "description": "The fire that tore through a bar in Crans-Montana was likely started by sparklers in Champagne bottles coming too close to the ceiling, authorities have said. Follow DW for more.",
      "url": "https://www.dw.com/en/swiss-resort-fire-sparklers-likely-cause-authorities-say/live-75363055?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 15:53:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anthony Joshua's driver charged over deadly Nigeria crash",
      "description": "The man behind the wheel of a car that crashed into a lorry in Nigeria, killing two passengers and injuring Anthony Joshua has been charged.",
      "url": "https://news.sky.com/story/anthony-joshuas-driver-charged-over-nigeria-crash-that-killed-two-13489745",
      "published": "Fri, 02 Jan 2026 16:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza aid lifelines under strain as winter worsens",
      "description": "Humanitarian partners in the Gaza Strip are struggling to reach hundreds of thousands of vulnerable people as winter storms batter damaged homes and temporary shelters.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166694",
      "published": "Fri, 02 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Mind chess,’ not threats, convinced real-life Sopranos mobster to cooperate: retired FBI agent",
      "description": "How the FBI cracked the real-life crime family behind HBO's \"The Sopranos\" using one shocking arrest to bring down the entire DeCavalcante organization.",
      "url": "https://www.foxnews.com/us/mind-chess-not-threats-convinced-real-life-sopranos-mobster-cooperate-retired-fbi-agent",
      "published": "Sat, 03 Jan 2026 10:00:02 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "EXCLUSIVE: Mom speaks out after illegal alien DUI suspect allegedly kills 8-year-old, maims Marine dad",
      "description": "Grieving mom demands justice after allegedly intoxicated illegal immigrant kills 8-year-old daughter in crash, leaves Marine father fighting for his life.",
      "url": "https://www.foxnews.com/us/exclusive-mom-speaks-illegal-alien-dui-suspect-allegedly-kills-8-year-old-maims-marine-dad",
      "published": "Fri, 02 Jan 2026 14:58:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "University of Oklahoma teaching assistant fired after flunking Christian student files appeal with school",
      "description": "Fired University of Oklahoma teaching assistant appeals decision, denies wrongdoing in grading Christian student's paper on gender roles and biblical beliefs.",
      "url": "https://www.foxnews.com/us/university-oklahoma-teaching-assistant-fired-after-flunking-christian-student-files-appeal-school",
      "published": "Fri, 02 Jan 2026 11:59:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Swiss nightclub promoted flaming bottle stunts before deadly inferno in packed New Year's Eve venue",
      "description": "New Year's Eve nightclub fire in Swiss resort Crans-Montana kills 40, injures 119. Witnesses say bartender carried lit sparkler near wooden ceiling before flames erupted.",
      "url": "https://www.foxnews.com/world/swiss-nightclub-promoted-flaming-bottle-stunts-deadly-inferno-packed-new-years-eve-venue",
      "published": "Fri, 02 Jan 2026 18:02:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Witnesses give harrowing accounts of New Year's horror that erupted due to Swiss ski resort bar fire",
      "description": "Eyewitnesses described the grim and horrific scene that ensued due to the fiery blaze that erupted at a bar in Switzerland earlier this week.",
      "url": "https://www.foxnews.com/world/witnesses-give-harrowing-accounts-new-years-horror-erupted-due-swiss-ski-resort-bar-fire",
      "published": "Fri, 02 Jan 2026 13:09:48 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Maduro says Venezuela is 'ready' to make deal with US on drugs and oil after military strikes",
      "description": "Venezuelan President Nicolás Maduro says his government is ready to negotiate a drug trafficking agreement with the U.S. after months of military pressure.",
      "url": "https://www.foxnews.com/world/maduro-says-venezuela-ready-make-deal-us-drugs-oil-after-military-strikes",
      "published": "Fri, 02 Jan 2026 03:08:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Kim Jong-un’s daughter visits state mausoleum, fuelling speculation she will be next North Korean ruler",
      "description": "Kim Ju-ae has been making increasingly prominent appearances in state media over the past three years The daughter of the North Korean ruler, Kim Jong-un, who is likely being prepared as his successor has accompanied her parents on her first public visit to the Kumsusan mausoleum to pay respects to former leaders, ahead of an event that could see her succession formalised. Photos from state news agency KCNA showed Kim Jong-un accompanied by his wife, Ri Sol-ju, and senior officials on the visit on 1 January, with Ju-ae between her parents in the main hall of the Kumsusan Palace of the Sun. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/02/kim-jong-un-daughter-ju-ae-north-korean-ruler-speculation",
      "published": "Fri, 02 Jan 2026 03:31:45 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "NewJeans member Danielle sued for millions after bitter feud with K-pop record label",
      "description": "Ador terminated the Australian-born singer’s contract on Monday and is now suing her, a family member and the band’s former producer The K-pop record label Ador is suing a former member of megaband NewJeans for millions in damages, it has announced, a day after removing her from the group following a year-long dispute that saw the band allege mistreatment and attempt to leave their contract. The compensation suit against Danielle Marsh, a 20-year-old Australian-born singer, comes months after a Seoul district court ruled that NewJeans’ five members must honour their contracts with Ador, whose parent company Hybe is also behind the K-pop sensation BTS. The band’s contract runs until 2029. Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/01/newjeans-member-danielle-sued-for-millions-after-bitter-feud-with-k-pop-record-label",
      "published": "Thu, 01 Jan 2026 06:19:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "'The State of South Arabia': Yemen separatists announce plan for independence",
      "description": "Yemen's southern separatist movement has announced a constitution and aims to hold a referendum on independence from the north.",
      "url": "https://news.sky.com/story/the-state-of-south-arabia-yemen-separatists-announce-plan-for-independence-13489815",
      "published": "Fri, 02 Jan 2026 22:54:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US actions in Venezuela ‘constitute a dangerous precedent’: Guterres",
      "description": "The UN Secretary-General Antonio Guterres has said he is “deeply alarmed” over the standoff between the United States and Venezuela in recent months, which culminated on Saturday morning in the capture of President Nicolás Maduro by US special forces.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166698",
      "published": "Sat, 03 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Results expected 5 January after landmark elections in Central African Republic",
      "description": "Voting proceeded largely as planned in the Central African Republic’s first-ever combined presidential, legislative, regional and municipal elections, and ballot counting is now complete, the UN peacekeeping mission (MINUSCA) said on Wednesday, with results expected to be announced on 5 January.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166688",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Georgia teen charged with murdering Uber driver in suburban carjacking, leaving him to die",
      "description": "Teen charged as adult with murder after Uber driver found shot dead following alleged carjacking incident in suburban Atlanta area on New Year's Day.",
      "url": "https://www.foxnews.com/us/georgia-teen-charged-murdering-uber-driver-suburban-carjacking-leaving-him-die",
      "published": "Fri, 02 Jan 2026 15:38:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Maduro joins Iraq’s Saddam, Panama’s Noriega as latest leader taken by US",
      "description": "The reported capture of Venezuelan president evokes previous eras when other leaders were seized by US.",
      "url": "https://www.aljazeera.com/news/2026/1/3/maduro-joins-iraqs-saddam-panamas-noriega-as-latest-leader-taken-by-us?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 12:10:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Germany: Third bank robbery reported in NRW in days",
      "description": "Another day, another report of a robbery at a Sparkasse bank in western Germany. This time, four safe-deposit boxes were emptied in broad daylight.",
      "url": "https://www.dw.com/en/germany-third-bank-robbery-reported-in-nrw-in-days/a-75372907?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 22:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan VP Rodriguez’s speech contradicts Trump’s claims",
      "description": "Venezuelan Vice President Delcy Rodriguez on Saturday claimed that Nicolas Maduro is Venezuela's \"only president\", denouncing the US operation that resulted in his capture as a flagrant violation of the United Nations charter. Rodriguez's speech contradicted remarks made by US President Donald Trump who claimed that Rodriguez was willing to cooperate with Washington, FRANCE 24's correspondent Noris Argotte Soto said, reporting from Caracas.",
      "url": "https://www.france24.com/en/video/20260103-venezuelan-vp-rodriguez-s-speech-contradicts-trump-s-claims",
      "published": "Sat, 03 Jan 2026 21:22:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Maduro's presumed successor, Venezuelan Vice President Delcy Rodriguez, is possibly in Russia: report",
      "description": "Venezuelan Vice President Delcy Rodriguez, the presumed successor to captured Venezuelan President Nicolás Maduro, is in Russia, according to a report.",
      "url": "https://www.foxnews.com/world/maduros-presumed-successor-venezuelan-vice-president-delcy-rodriguez-possibly-in-russia-report",
      "published": "Sat, 03 Jan 2026 12:43:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Four challenges facing New York City Mayor Mamdani",
      "description": "Can the Democratic socialist deliver on the big cost-of-living promises that propelled him to victory?",
      "url": "https://www.bbc.com/news/articles/ce8edj7y5z9o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 00:46:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "What we know about Maduro's capture and US plan to 'run' Venezuela",
      "description": "Donald Trump said the US would \"run\" Venezuela until a \"safe\" transition after his forces captured President Nicolás Maduro and his wife.",
      "url": "https://www.bbc.com/news/articles/crmlz7r0zrxo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 21:34:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's toppling of Maduro is fraught with risk - what happens next is unclear",
      "description": "Will the US push for elections or will it try to depose more members of the government, asks the BBC's Ione Wells.",
      "url": "https://www.bbc.com/news/articles/c0q4dg1kn8vo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 20:23:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Saudi Arabia calls for Yemeni factions to attend 'dialogue' in Riyadh",
      "description": "It comes after clashes and an independence bid in southern Yemen bring Saudi and UAE-backed forces into confrontation.",
      "url": "https://www.bbc.com/news/articles/cjrz34qdr9no?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 04:16:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "More than 100 shelter overnight in Japan shrine due to heavy snow",
      "description": "Visitors of the Mitsumine Shrine spent the night there after roads around it were shut off.",
      "url": "https://www.bbc.com/news/articles/cj3vmekg7ddo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 10:18:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Craig the beer-ambassador elephant dies aged 54",
      "description": "The peace-loving pachyderm and lager promoter was an icon of successful conservation, say officials.",
      "url": "https://www.bbc.com/news/articles/c8e5k7p5222o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 11:48:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The year angry men dominated Bollywood - and what it means for India",
      "description": "Violent, male-driven films dominated the Indian box-office and cultural conversations in 2025.",
      "url": "https://www.bbc.com/news/articles/ce8n8eye1vjo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 03 Jan 2026 00:12:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Arsenal survive Bournemouth scare, as Aston Villa bounce back in title race",
      "description": "Arsenal come from behind at Bournemouth to extend their Premier League lead, while Villa beat Forest to stay in race.",
      "url": "https://www.aljazeera.com/sports/2026/1/3/arsenal-survive-bournemouth-scare-as-aston-villa-bounce-back-in-title-race?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 20:15:52 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal beat Sudan to reach AFCON quarterfinals as Pape Gueye grabs brace",
      "description": "Senegal come from behind to ease past Sudan 3-1 ⁠and book their ‍place in the Africa Cup of Nations quarterfinals.",
      "url": "https://www.aljazeera.com/sports/2026/1/3/senegal-beat-sudan-to-reach-afcon-quarterfinals-as-pape-gueye-grabs-brace?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 18:33:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Team’ from US to run Venezuela after ‘capture’ of Maduro",
      "description": "US President Donald Trump says a ‘team’ from the US will be running Venezuela.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/3/team-from-us-to-run-venezuela-after-capture-of-maduro?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 18:08:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Africa manager to show ‘no mercy’ to Cameroon at AFCON 2025",
      "description": "Hugo Broos lead Cameroon to the 2017 AFCON title but will have be no room for sentimentality with his South Africa side.",
      "url": "https://www.aljazeera.com/sports/2026/1/3/south-africa-manager-to-show-no-mercy-to-cameroon-at-afcon-2025?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 18:00:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump: US ‘captures’ Maduro in ‘dead of night’",
      "description": "US President Donald Trump said the US will run Venezuela until there is a “safe and judicious” transition of power.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/3/trump-us-captures-maduro-in-dead-of?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 17:17:54 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Real Madrid to ‘push deadline’ for Mbappe to make Atletico Super Cup return",
      "description": "Real Madrid's Kylian Mbappe out of Sunday's Real Betis clash in La Liga, and now in race for Atletico Super Cup derby.",
      "url": "https://www.aljazeera.com/sports/2026/1/3/real-madrid-to-push-deadline-for-mbappe-to-make-atletico-super-cup-return?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 17:14:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Jake Paul loses WBA cruiserweight ranking after loss to Anthony Joshua",
      "description": "Jake Paul's defeat by Anthony Joshua in their heavyweight bout in December has seen American boxer lose his WBA ranking.",
      "url": "https://www.aljazeera.com/sports/2026/1/3/jake-paul-loses-wba-cruiserweight-rankings-after-loss-to-anthony-joshua?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 15:36:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fear, joy, hope: Venezuelans react to Maduro capture",
      "description": "Venezuelans reacted with everything from fear to joy as the US claims to have captured Nicolas Maduro.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/3/fear-joy-hope-venezuelans-react-to-maduro-capture?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 14:58:19 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: American regime change with a Trumpian twist",
      "description": "Trump has added a particular layer of dementedness to the latest unprovoked US aggression.",
      "url": "https://www.aljazeera.com/opinions/2026/1/3/venezuela-american-regime-change-with-a-trumpian?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 14:01:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal vs Sudan 3-1: AFCON 2025 – as it happened",
      "description": "All the updates as Senegal fight back from a goal down to knock out Sudan in the last 16 of the Africa Cup of Nations.",
      "url": "https://www.aljazeera.com/sports/liveblog/2026/1/3/live-senegal-vs-sudan-afcon-2025?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 13:33:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who is Venezuelan President Nicolas Maduro?",
      "description": "The US has announced it has captured Nicolas Maduro. Al Jazeera takes a look at his political career",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/3/who-is-venezuelan-president-nicolas-maduro?traffic_source=rss",
      "published": "Sat, 03 Jan 2026 13:05:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Xi Jinping vows to reunify China and Taiwan in New Year’s Eve speech",
      "description": "Reunification ‘is unstoppable’, says Chinese president, a day after the conclusion of intense military drills China’s president, Xi Jinping, has vowed to reunify China and Taiwan in his annual New Year’s Eve speech in Beijing. Speaking the day after the conclusion of intense Chinese military drills around Taiwan, Xi said: “The reunification of our motherland, a trend of the times, is unstoppable.” Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/xi-jinping-vows-reunification-china-taiwan-new-years-eve-speech",
      "published": "Wed, 31 Dec 2025 13:47:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China forecast to have sold one in every 10 new cars in UK in 2025",
      "description": "Carmakers such as MG, BYD and Chery are set to pass 200,000 mark in sales, analysis suggests, double 2024’s total Chinese brands are on course to account for one in every 10 new cars sold in Britain during 2025, a marked increase on last year as sales increase across Europe. Manufacturers led by MG, BYD, and Chery are on track to break the 200,000 mark in UK new car sales in 2025, meaning they are very likely to account for 10% of the market, according to Matthias Schmidt, an analyst tracking electric cars across Europe. Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/31/china-forecast-to-have-sold-one-in-every-10-new-cars-in-uk-in-2025",
      "published": "Wed, 31 Dec 2025 09:42:26 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "​Two cubicles, 73 women, one long queue: Japan’s female MPs fight for more loos",
      "description": "PM Sanae Takaichi joins petition asking for better facilities for women to match improved representation Nearly 60 female lawmakers in Japan, including the prime minister, Sanae Takaichi, have submitted a petition calling for more toilets in the parliament building for women to match their improved representation. Japanese politics remains hugely male-dominated, although the number of women in the parliament rose at the last election – and Takaichi became the first female prime minister in October. This is reflected by there being only one lavatory containing two cubicles for the lower house’s 73 women to use near the Diet’s main plenary session hall in central Tokyo. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/31/female-lawmakers-in-japan-lobby-for-more-toilets-in-parliament",
      "published": "Wed, 31 Dec 2025 08:29:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Ten more years’: Helen Wilding, the artist sketching the whole of Melbourne’s Brunswick Street",
      "description": "Wilding has been drawing the same street for seven years, taking in cafes, pubs, homes, churches, markets, shops and a branch of the legendary A1 Lebanese bakery • More summer essentials Once a week you can find Helen Wilding and friends sitting on the side of the road, pens in hand. This time she’s perched on a tiny folding stool between a couple of pot plants, focusing intently on a plant nursery. It appears to be shut. Wilding has been sketching this same street in inner Melbourne for seven years. Stretching for a couple of kilometres through Fitzroy, one of Melbourne’s oldest suburbs, Brunswick Street has everything – cafes, pubs, homes, churches, markets, shops and a branch of the legendary A1 Lebanese bakery. Continue reading...",
      "url": "https://www.theguardian.com/artanddesign/2026/jan/04/helen-wilding-artist-sketching-whole-melbourne-brunswick-street",
      "published": "Sat, 03 Jan 2026 19:00:45 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 4 km NNW of Rancho Viejo, Mexico",
      "description": "PAGER - YELLOW ShakeMap - VI DYFI? - VII Time 2026-01-02 13:58:18 UTC 2026-01-02 13:58:18 UTC at epicenter Location 16.902°N 99.303°W Depth 35.00 km (21.75 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rm3k",
      "published": "2026-01-03T14:27:33.593Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 15 km NNW of Susanville, CA",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VII Time 2025-12-31 05:49:32 UTC 2025-12-31 05:49:32 UTC at epicenter Location 40.544°N 120.692°W Depth 5.32 km (3.31 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75288851",
      "published": "2026-01-03T05:59:37.568Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.2 - 36 km W of Puerto Santa, Peru",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-28 02:51:50 UTC 2025-12-28 02:51:50 UTC at epicenter Location 8.960°S 78.974°W Depth 66.41 km (41.27 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl57",
      "published": "2025-12-31T01:12:43.205Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro's ouster on drug charges comes as Trump lets others free",
      "description": "The military removal of Venezuelan President Nicolás Maduro on US drug charges comes after Trump has freed other figures connected to narcotics trafficking.",
      "url": "https://www.npr.org/2026/01/03/nx-s1-5665695/maduro-trump-drug-dealer-pardons",
      "published": "Sat, 03 Jan 2026 15:38:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Yemen's separatists announce a constitution for an independent south",
      "description": "The move comes as an escalation of a confrontation that has pitted Gulf powerhouses Saudi Arabia and the United Arab Emirates against each other.",
      "url": "https://www.npr.org/2026/01/02/g-s1-104314/yemen-separatists-constitution",
      "published": "Fri, 02 Jan 2026 17:08:06 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says US will 'run' Venezuela after Maduro ouster",
      "description": "President Donald Trump said the US will control Venezuela until a political transition following the capture of President Nicolas Maduro in an overnight operation. DW has more.",
      "url": "https://www.dw.com/en/trump-says-us-will-run-venezuela-after-maduro-ouster/live-75373644?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 17:45:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "K-Pop band BTS set to make comeback in March",
      "description": "The reunion marks the end of a nearly four-year hiatus. All seven members of the South Korean pop boy band BTS have now completed their mandatory military service.",
      "url": "https://www.dw.com/en/k-pop-band-bts-set-to-make-comeback-in-march/a-75372972?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 3 Jan 2026 01:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why plastic bans aren't working and what needs to change",
      "description": "Four years after Germany phased out light plastic bags, how has the EU addressed plastic waste? And why do single-use items still pile up in takeaway restaurants, shops and the environment?",
      "url": "https://www.dw.com/en/why-plastic-bans-aren-t-working-and-what-needs-to-change/a-74980708?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Fri, 2 Jan 2026 17:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: What's next for Nicolas Maduro?",
      "description": "US President Donald Trump on Saturday posted a photo of Venezuelan leader Nicolas Maduro handcuffed and blindfolded on Truth Social, hours after he was captured, along with his wife, by US forces in Caracas. What's next for Venezuelan leader? Caroline Baum takes a closer look.",
      "url": "https://www.france24.com/en/video/20260103-venezuela-what-s-next-for-nicolas-maduro",
      "published": "Sat, 03 Jan 2026 17:55:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025 : Senegal and Sudan open knockout stage at Tangier",
      "description": "Senegal face Sundan, who only just made it through as one of the best thrid-placed teams in their group. Despite being strong title favourites, Senegal coach Pape Thiaw expect a tough challenge and see this match as the start \"of a different competition\".",
      "url": "https://www.france24.com/en/tv-shows/sports/20260103-afcon-2025-senegal-and-sudan-open-knockout-stage-at-tangier",
      "published": "Sat, 03 Jan 2026 15:58:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "🔴 Watch live: Trump holds press conference on operation to capture Venezuela's Maduro",
      "description": "No description available.",
      "url": "https://www.france24.com/en/americas/20260103-live-venezuela-declares-state-of-emergency-after-reported-us-military-aggression",
      "published": "Sat, 03 Jan 2026 15:57:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How Nicolas Maduro took the presidency in Venezuela",
      "description": "Now 62 years old, Nicolás Maduro has led Venezuela since he was propelled to power after being designated by his predecessor, Hugo Chávez. Backed by his revolutionary mentor, he narrowly won the 2013 presidential election. Antonia Kerrigan takes a closer look to Venezuelan leader.",
      "url": "https://www.france24.com/en/video/20260103-how-nicol%C3%A1s-maduro-took-the-presidency-in-venezuela",
      "published": "Sat, 03 Jan 2026 15:55:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US general reveals how America captured Venezuela's president",
      "description": "Months of spying, ground forces and more than 150 aircraft were involved in the daring US operation against Venezuela's President Nicolas Maduro.",
      "url": "https://news.sky.com/story/us-general-reveals-how-america-captured-venezuelas-president-13490105",
      "published": "Sat, 03 Jan 2026 19:35:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro combined swaggering incompetence with ruthless repression",
      "description": "Few leaders this century have done so much damage to the lives of so many as Nicolas Maduro.",
      "url": "https://news.sky.com/story/venezuelan-president-maduro-combined-swaggering-incompetence-with-ruthless-repression-13489875",
      "published": "Sat, 03 Jan 2026 09:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australia's Northern Territory considers passing assisted dying laws for second time in 31 years",
      "description": "The Northern Territory government in Australia plans to legislate for doctor-assisted dying for a second time",
      "url": "https://abcnews.go.com/International/wireStory/australias-northern-territory-considers-passing-assisted-dying-laws-128841021",
      "published": "Fri, 02 Jan 2026 02:18:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Police in Finland arrest 2 in connection with damage to undersea telecom cable",
      "description": "Finnish authorities have arrested two people in connection with damage to an undersea telecommunications cable in the Gulf of Finland",
      "url": "https://abcnews.go.com/International/wireStory/police-finland-arrest-2-connection-damage-undersea-telecom-128841367",
      "published": "Fri, 02 Jan 2026 05:14:07 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The United Arab Emirates says it has withdrawn all its troops from Yemen",
      "description": "The United Arab Emirates says it has withdrawn all its troops from Yemen",
      "url": "https://abcnews.go.com/International/wireStory/united-arab-emirates-withdrawn-troops-yemen-128857450",
      "published": "Fri, 02 Jan 2026 20:41:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Military-backed party leads in early election results in Myanmar",
      "description": "Myanmar's military-appointed election body has announced the winners of the first phase of its three-part general election",
      "url": "https://abcnews.go.com/International/wireStory/military-backed-party-leads-early-election-results-myanmar-128862024",
      "published": "Sat, 03 Jan 2026 11:08:56 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kim’s daughter visits family mausoleum, promoting her potential status as heir",
      "description": "The teenage daughter of North Korean leader Kim Jong Un has made her first known visit to a sacred family mausoleum where the embalmed bodies of her late grandfather and great-grandfather are on display",
      "url": "https://abcnews.go.com/International/wireStory/kims-daughter-visits-family-mausoleum-promoting-potential-status-128840435",
      "published": "Fri, 02 Jan 2026 03:20:11 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ireland's Micheál Martin will visit China in the first trip by an Irish leader in 14 years",
      "description": "Ireland's Prime Minister Micheál Martin visits China starting Sunday, marking the first visit by an Irish leader in 14 years",
      "url": "https://abcnews.go.com/International/wireStory/irelands-michel-martin-visit-china-trip-irish-leader-128862646",
      "published": "Sat, 03 Jan 2026 04:42:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN chief condemns Israeli amendments targeting UNRWA operations",
      "description": "The UN Secretary-General has condemned amendments adopted by Israel’s Knesset to a law aimed at ceasing the operations of the UN agency assisting Palestine refugees (UNRWA), saying the measures must be immediately repealed.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166691",
      "published": "Wed, 31 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "General Assembly approves $3.45 billion UN regular budget for 2026",
      "description": "The General Assembly has approved a $3.45 billion regular budget for the United Nations for 2026, following weeks of intensive negotiations and one of the Organization’s most important reform initiatives, UN80.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166685",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: General Assembly decides on 2026 UN budget",
      "description": "Follow our live coverage as the General Assembly and its Fifth Committee meet today to finalize negotiations and vote on the United Nations’ regular budget for 2026. The Fifth Committee is responsible for administrative and budgetary matters, including the Organization’s finances and staffing. UN News app users can click here and go here for all our in-depth meeting coverage.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166681",
      "published": "Tue, 30 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US military details timeline of operation to capture Maduro, revealing more than 150 aircraft involved",
      "description": "Joint Chiefs Gen. Dan Caine provides details about high-stakes military operation to capture Venezuelan President Nicolás Maduro that was planned for months.",
      "url": "https://www.foxnews.com/us/us-military-details-timeline-operation-capture-maduro-revealing-more-than-150-aircraft-involved",
      "published": "Sat, 03 Jan 2026 15:27:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Police seek suspect after dentist and wife found shot dead at home while 2 young children are unharmed",
      "description": "Columbus dentist Spencer Tepe and wife Monique found shot dead in their home just weeks before their fifth wedding anniversary. Two children unharmed.",
      "url": "https://www.foxnews.com/us/dentist-wife-found-shot-dead-home-2-young-children-unharmed",
      "published": "Fri, 02 Jan 2026 18:43:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fox News True Crime Newsletter: Bryan Kohberger video, Slender Man stabber's fate, Luigi Mangione trial",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-bryan-kohberger-video-slender-man-stabbers-fate-luigi-mangione-trial",
      "published": "Fri, 02 Jan 2026 16:11:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Judge orders accused Jan 6 pipe bomber to remain in custody pending trial",
      "description": "Brian Cole, accused of planting pipe bombs outside RNC and DNC headquarters in Washington, will be held in custody pending trial after Friday's decision.",
      "url": "https://www.foxnews.com/us/judge-orders-accused-jan-6-pipe-bomber-remain-custody-pending-trial",
      "published": "Fri, 02 Jan 2026 14:44:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Coast Guard suspends search for 77-year-old woman who went overboard from Holland America Line cruise ship",
      "description": "Coast Guard suspends search for 77-year-old woman who went overboard from Holland America cruise ship near Cuba on New Year's Day after 8-hour effort.",
      "url": "https://www.foxnews.com/us/coast-guard-suspends-search-77-year-old-woman-who-went-overboard-holland-america-line-cruise-ship",
      "published": "Fri, 02 Jan 2026 09:58:21 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran and Maduro ties suffer major blow following US operation and capture of Venezuelan dictator",
      "description": "Venezuela President Nicolas Maduro's capture deals devastating blow to Iran's Western Hemisphere interests, experts say, weakening Tehran's anti-American alliance in South America.",
      "url": "https://www.foxnews.com/world/iran-maduro-ties-suffer-major-blow-following-us-operation-capture-venezuelan-dictator",
      "published": "Sat, 03 Jan 2026 14:56:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What is Delta Force and what does it do? Inside the elite US Army unit that captured Maduro",
      "description": "What is Delta Force? President Donald Trump confirms the elite U.S. Army unit led the operation that captured Venezuela’s Nicolás Maduro.",
      "url": "https://www.foxnews.com/world/what-is-delta-force-what-do-they-do-inside-elite-us-army-unit-captured-maduro",
      "published": "Sat, 03 Jan 2026 14:38:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro’s fall sparks suspicion of betrayal inside Venezuela’s ruling elite",
      "description": "Maduro’s sudden removal raises questions of betrayal, military loyalty and what comes next as Venezuela braces for a dangerous fight over power.",
      "url": "https://www.foxnews.com/world/maduros-fall-sparks-suspicion-betrayal-inside-venezuelas-ruling-elite",
      "published": "Sat, 03 Jan 2026 13:09:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Maduro gave car interview about possible Trump olive branch days before he was captured by US",
      "description": "Venezuelan leader Nicolás Maduro was captured by U.S. forces days after he discussed possible drug trafficking deal negotiations with President Donald Trump.",
      "url": "https://www.foxnews.com/world/maduro-gave-car-interview-about-possible-trump-olive-branch-days-before-he-captured-us",
      "published": "Sat, 03 Jan 2026 12:27:52 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "María Corina Machado, Venezuelan opposition urge military to back power transfer after Maduro capture",
      "description": "Venezuelan opposition leader María Corina Machado calls for military to abandon Maduro after President Donald Trump announced the president's capture by U.S. forces.",
      "url": "https://www.foxnews.com/world/maria-corina-machado-venezuelan-opposition-urge-military-back-power-transfer-after-maduro-capture",
      "published": "Sat, 03 Jan 2026 12:10:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "María Corina Machado emerges as top potential successor after Máduro’s fall",
      "description": "With Nicolás Maduro out, experts say Nobel laureate María Corina Machado and Edmundo González could lead Venezuela’s transition, though major hurdles remain.",
      "url": "https://www.foxnews.com/world/maria-corina-machado-emerges-top-potential-successor-after-maduros-fall",
      "published": "Sat, 03 Jan 2026 07:37:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "McDonald's customer caught on camera launching flying kick at employee during heated brawl",
      "description": "Shocking footage shows customer launching flying kick at McDonald's employee during heated fight at Brazil location. Viral video captures chaotic scene.",
      "url": "https://www.foxnews.com/world/mcdonalds-customer-launches-flying-kick-employee-heated-restaurant-brawl",
      "published": "Fri, 02 Jan 2026 18:38:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}