{
  "last_updated": "2026-01-20T20:13:13.976820Z",
  "event_count": 223,
  "events": [
    {
      "title": "Catholic cardinals warn US foreign policy under Trump risks global suffering",
      "description": "Church leaders cite Greenland threats, Venezuela action and aid cuts as undermining human dignity and peace Three cardinals in the US Catholic church have criticized the Trump administration ’s foreign policy, saying its push to obtain or otherwise seize Greenland , recent military action in Venezuela , and cuts to humanitarian aid risk “destroying international relations and plunging the world into incalculable suffering”. “Our country’s moral role in confronting evil around the world, sustaining the right to life and human dignity, and supporting religious liberty are all under examination,” said a joint statement from Blase Cupich, Robert McElroy and Joseph Tobin, respectively the archbishops of Chicago, Washington DC and Newark, New Jersey. The Associated Press contributed Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/catholic-cardinals-trump-foreign-policy",
      "published": "Tue, 20 Jan 2026 14:44:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 51,
      "severity_level": "Critical"
    },
    {
      "title": "Chilean president declares state of catastrophe as wildfires kill at least 18",
      "description": "Fires blaze through 8,500 hectares, forcing 50,000 people to evacuate as firefighters struggle to extinguish flames Wildfires raging across central and southern Chile have killed at least 18 people, scorched thousands of hectares of forest and destroyed scores of homes, authorities said, as the South American country swelters under a heatwave. Chile’s president, Gabriel Boric, declared a state of catastrophe in the country’s central Biobío region and the neighbouring Ñuble region, about 500km (300 miles) south of Santiago, the capital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chile-president-declares-state-of-catastrophe-as-wildfires-kill",
      "published": "Sun, 18 Jan 2026 20:16:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of emergency after eight police officers killed in prison gang violence",
      "description": "President announces 30-day order after inmates also took 46 people hostage at three prisons Guatemala’s president has declared a 30-day nationwide state of emergency to combat criminal gangs after authorities accused them of killing eight police officers and holding hostages at three prisons. The killings occurred in the capital, Guatemal City, and surrounding areas a day after gang-affiliated inmates took 46 people hostage in the three prisons across the country to demand incarcerated gang leaders be moved to lower-security facilities. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/guatemala-state-of-emergency-police-officers-killed-prison-gang-violence",
      "published": "Mon, 19 Jan 2026 12:53:59 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Labor’s hate speech laws pass Senate in late-night vote as Nationals split from Liberals to oppose bill",
      "description": "Coalition divided over reforms in response to Bondi beach terror attack, with Bridget McKenzie accusing government of ‘trashing normal process of parliamentary scrutiny’ Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Laws to ban hate groups and establish a national gun buyback scheme have passed the Senate after the Albanese government struck separate deals with the Liberals and Greens to legislate its response to the Bondi beach massacre. The two bills were rushed through on Tuesday night at the end of a special two-day sitting to deal with the political fallout to the 14 December shooting. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/labor-albanese-hate-speech-laws-expected-pass-parliament",
      "published": "Tue, 20 Jan 2026 12:17:53 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Men charged with contract killing of Indigenous leader to go on trial in Peru",
      "description": "Prosecution over death of Quinto Inuma Alvarado seen as test of ability to curb attacks on environmental defenders Five men are due to go on trial on Tuesday over the killing of an Amazonian Indigenous leader, in a legal case that could test whether Peru can hold perpetrators accountable for violence linked to illegal logging and drug trafficking in one of the world’s most dangerous regions for environmental defenders. The Kichwa tribal leader Quinto Inuma Alvarado was killed on 29 November 2023, after repeatedly denouncing illegal activity within his community’s territory. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/trial-peru-amazon-quinto-inuma-alvarado-indigenous-leader",
      "published": "Tue, 20 Jan 2026 10:00:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Rising hunger and displacement pose growing economic risk, UN tells Davos",
      "description": "As global leaders gather at the World Economic Forum in Davos this week, UN agencies are warning that rising hunger and displacement are not only humanitarian emergencies but growing threats to global economic stability.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166791",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Surfer injured in fourth shark attack in Australian state in 48 hours",
      "description": "Authorities are warning people to stay out of the Australian state's waterways after recent rainfall.",
      "url": "https://www.bbc.com/news/articles/cqxy3523nq2o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 07:05:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan: Atrocities ‘repeated town by town’, ICC prosecutor tells UN Security Council",
      "description": "Atrocities in Sudan’s Darfur region are spreading from town to town in an organized campaign of violence that includes mass executions, rape and ethnic targeting, amounting to war crimes and crimes against humanity, the prosecutor of the International Criminal Court told the UN Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166790",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Viral protest video against Iran’s supreme leader sparks copycat demonstrations worldwide",
      "description": "Viral video shows Iranian refugee lighting cigarette with burning photo of supreme leader, sparking global defiance movement amid Iran protests.",
      "url": "https://www.foxnews.com/world/viral-protest-video-against-irans-supreme-leader-sparks-copycat-demonstrations-worldwide",
      "published": "Sun, 18 Jan 2026 21:52:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Anthony Joshua's driver appears in court over fatal crash in Nigeria",
      "description": "A driver charged in connection with a fatal crash in Nigeria, which killed two passengers and injured boxer Anthony Joshua, has appeared in court.",
      "url": "https://news.sky.com/story/anthony-joshuas-driver-appears-in-court-over-fatal-crash-in-nigeria-13496615",
      "published": "Tue, 20 Jan 2026 12:44:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Spain train crash: What we know about the fatal derailment so far",
      "description": "At least 40 people have been killed and 170 others injured after two high-speed trains derailed in southern Spain on Sunday.",
      "url": "https://news.sky.com/story/what-we-know-so-far-about-the-fatal-train-crash-in-spain-13496110",
      "published": "Mon, 19 Jan 2026 08:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russia plots major strike on Europe's largest nuclear plant power lines: source",
      "description": "Ukraine nuclear facilities face Russian attack threats as Moscow weighs strikes on power substations to force capitulation, officials say. Zaporizhzhia is a primary target.",
      "url": "https://www.foxnews.com/world/russia-threaten-ukraine-europe-nuclear-plant-winter-energy-war-escalates",
      "published": "Sun, 18 Jan 2026 19:21:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Mozambique floods heighten disease, malnutrition risks – UN agencies",
      "description": "Catastrophic flooding across Mozambique is devastating lives and livelihoods, sharply increasing the risk of disease outbreaks and malnutrition, while also forcing dangerous wildlife – including crocodiles – into flooded urban areas, the UN warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166793",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "World Economic Forum boots Iranian foreign minister from Davos summit amid deadly crackdown on protesters",
      "description": "World Economic Forum withdraws Iranian foreign minister's Davos invitation amid deadly nationwide protests that have killed thousands of civilians.",
      "url": "https://www.foxnews.com/world/world-economic-forum-boots-iranian-foreign-minister-from-davos-summit-amid-deadly-crackdown-protesters",
      "published": "Mon, 19 Jan 2026 09:49:29 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Students return to Brown University amid questions over security policies that enabled mass shooting",
      "description": "Brown University students return to campus after deadly shooting that killed two students, injured nine. New security measures implemented amid concerns.",
      "url": "https://www.foxnews.com/us/students-return-brown-university-amid-questions-over-security-policies-enabled-mass-shooting",
      "published": "Tue, 20 Jan 2026 11:04:12 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘Alarming’ increase in use of death penalty last year, despite global trend towards abolition",
      "description": "Despite a downward trend in the use of the death penalty globally, 2025 saw an ‘alarming’ increase in the number of executions in a small number of retentionist countries, the UN human rights office (OHCHR) warned on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166789",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Amid Sudan’s humanitarian crisis, Chad shows ‘act of solidarity’",
      "description": "In war-torn Sudan, local communities say they don’t have enough settlements for the internally displaced, few solutions for women who have suffered sexual violence – and there’s a lack of aid available for people with disabilities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166777",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Almost half of Kyiv without heat, power, after Russian attack",
      "description": "An overnight Russian bombardment on Kyiv left thousands of residential buildings and parliament without heating and water in -14C temperatures on Tuesday, just as the Ukrainian capital was scrambling to restore vital utilities destroyed in earlier attacks. The barrage of hundreds of drones and missiles, which targeted energy facilities across Ukraine, killed at least one 50-year-old man near Kyiv. FRANCE 24's Emerald Maxwell reports.",
      "url": "https://www.france24.com/en/almost-half-of-kyiv-without-heat-power-after-russian-attack",
      "published": "Tue, 20 Jan 2026 19:49:32 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "One year of Trump's war on American culture",
      "description": "One year after Donald Trump's return to power, FRANCE 24's Eve Jackson revisits the paradoxical and conflictual relationship between the US president and culture and the arts. From controversial appointments in Hollywood, to attacks on diversity policies, to the symbolic takeover of the Kennedy Center, the US president intends to regain control of the American cultural narrative. Faced with this pressure, artists and institutions are getting organised, taking a stand and mobilising for freedom of speech.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260120-united-states-donald-trump-s-war-on-american-culture",
      "published": "Tue, 20 Jan 2026 17:11:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Episcopal bishop warns clergy to prepare for 'new era of martyrdom' after ICE shooting",
      "description": "An Episcopal bishop warned New Hampshire clergy to prepare wills for \"new era of martyrdom\" after woman killed in ICE shooting, urging readiness.",
      "url": "https://www.foxnews.com/us/episcopal-bishop-warns-clergy-prepare-new-era-martyrdom-ice-shooting",
      "published": "Mon, 19 Jan 2026 17:43:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Rights groups warn on Israeli abuse of Palestinian prisoners",
      "description": "A new report has published harrowing testimonies by Palestinians who were released as part of the Israel-Hamas ceasefire deal. Meanwhile, rights activists are worried that Israel is now considering the death penalty.",
      "url": "https://www.dw.com/en/rights-groups-warn-on-israeli-abuse-of-palestinian-prisoners/a-75568097?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 11:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Game-changing international ocean treaty comes into force",
      "description": "Almost two decades in the making, an international agreement to protect and sustainably use marine life in international waters and the international seabed is due to come into force on Saturday, marking a major step forward in efforts to ensure the health of ocean ecosystems for decades to come.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166762",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN urges ‘maximum restraint’ to avert more death, wider escalation",
      "description": "As nationwide protests in Iran appear to ease after nearly three weeks of unrest and bloodshed, a senior UN official called on Thursday for action to prevent further escalation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166773",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "After four shark attacks in 48 hours, NSW authorities urge beachgoers ‘just go to a pool’",
      "description": "Surfer taken to hospital with minor injuries after latest shark attack at Point Plomer beach on mid-north coast Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A surfer has been taken to hospital after being bitten by a shark off the coast of New South Wales’ Limeburners Creek national park, the state’s fourth incident in 48 hours. The local health district said the man, 39, was in hospital in a stable condition with minor injuries. The attack took place near the Point Plomer campground, less than 20km north of Port Macquarie, on Tuesday morning. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/shark-attack-nsw-coast-fourth-incident-man-surfer",
      "published": "Tue, 20 Jan 2026 07:42:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Unrecognized pain: Most Halabja Massacre survivors have PTSD",
      "description": "A new report finds ongoing trauma affects survivors of a 1988 chemical weapons attack on Kurdish Iraqis in Halabja and nearby communities, highlighting the need for better health and support services.",
      "url": "https://www.dw.com/en/unrecognized-pain-most-halabja-massacre-survivors-have-ptsd/a-75580145?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 18:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Macron answers Trump's tariff threats at Davos World Economic Forum",
      "description": "French President Emmanuel Macron warned against \"useless aggressivity\" and said France preferred \"respect to bullies\" following US President Donald Trump's threat of tariffs over Greenland and the Board of Peace. He spoke at the World Economic Forum in Davos. #davos #macron #trump",
      "url": "https://www.france24.com/en/video/20260120-macron-answers-trump-s-tariff-threats-at-davos-world-economic-forum",
      "published": "Tue, 20 Jan 2026 17:20:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Australia's Parliament passes gun laws, and debates anti-hate speech bill after Sydney attack",
      "description": "Australia’s Parliament has passed new gun restrictions and begun debating proposed anti-hate speech laws after two shooters killed 15 people at a Jewish festival in Sydney last month in an attack that authorities say was inspired by the Islamic State g...",
      "url": "https://abcnews.go.com/International/wireStory/australias-parliament-passes-gun-laws-debates-anti-hate-129372828",
      "published": "Tue, 20 Jan 2026 06:01:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Four killed by floods after Tunisia’s worst rainfall in 70 years",
      "description": "Tunisia grapples with record rainfall, causing deadly flooding and disruptions in Monastir, Nabeul, and other regions.",
      "url": "https://www.aljazeera.com/news/2026/1/20/four-killed-by-floods-after-tunisias-worst-rainfall-in-70-years?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 16:08:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "As Trump dismantles the existing world order, his version is still taking shape",
      "description": "In his second term, the president is embracing a foreign policy that breaks sharply from U.S. tradition. Both supporters and critics say he's upending a global system in place for 80 years.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5678927/trump-world-order-foreign-policy",
      "published": "Tue, 20 Jan 2026 05:02:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "European leaders call for emergency summit as tensions with the U.S. rise",
      "description": "European leaders will meet for an emergency summit Thursday to form an official response to President Trump's pursuit of Greenland and his threat of tariffs for any country that tries to stop him.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5682235/european-leaders-call-for-emergency-summit-as-tensions-with-the-u-s-rise",
      "published": "Tue, 20 Jan 2026 04:49:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Trump’s first year back in office: A hard-line immigration crackdown",
      "description": "As Tuesday marks one year since Donald Trump’s return to the White House, FRANCE 24 International Affairs Editor Kethevane Gorjestani examines his immigration crackdown. With crossings at the US – Mexico border at a historic low, Trump has shifted focus to deportations within the United States. “The strategy was to make life so miserable for people who do not actually have legal status that they would either not come or leave by themselves,” Gorjestani said. Citing figures from the US Department of Homeland Security, Gorjestani said more than 600,000 people were deported and 1.9 million self-deported. She added that the figures remain controversial, as no details have been provided on how they were calculated.",
      "url": "https://www.france24.com/en/video/20260120-trump-s-first-year-back-in-office-a-hard-line-immigration-crackdown-1",
      "published": "Tue, 20 Jan 2026 16:37:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Ivory Coast will buy unsold cocoa stocks as prices plunge",
      "description": "Ivory Coast, the world's top cocoa producer, plans to buy unsold cocoa stocks to support farmers as global prices have plunged",
      "url": "https://abcnews.go.com/International/wireStory/ivory-coast-buy-unsold-cocoa-stocks-prices-plunge-129383835",
      "published": "Tue, 20 Jan 2026 10:41:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Spain begins 3 days of mourning for deadly train wreck while death toll ticks up to 41",
      "description": "Spain has woken to flags at half staff on Tuesday as the nation began three days of mourning for the victims of the deadly train accident in the country’s south",
      "url": "https://abcnews.go.com/International/wireStory/spain-begins-3-days-mourning-deadly-train-wreck-129372449",
      "published": "Tue, 20 Jan 2026 06:41:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran state TV hacked to show exiled Crown Prince Pahlavi",
      "description": "Iranian state TV hacked to show exiled Crown Prince Reza Pahlavi urging military to join protesters as death toll reportedly reaches nearly 4,000.",
      "url": "https://www.foxnews.com/world/iran-state-tv-hacked-show-exiled-crown-prince-pahlavi",
      "published": "Mon, 19 Jan 2026 07:46:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "How winter is making Gaza’s humanitarian crisis worse",
      "description": "Winter hits Gaza hard, while activists and aid workers push to keep the world’s attention from slipping away.",
      "url": "https://www.aljazeera.com/video/the-stream/2026/1/20/how-winter-is-making-gazas-humanitarian-crisis-worse?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 19:30:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Al Jazeera sees devastation from southern Chile wildfires",
      "description": "Wildfires in Chile have wiped out entire towns, killing at least 20 people.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/al-jazeera-sees-devastation-from-southern-chile-wildfires?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 15:49:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Colombian ex-paramilitary leader jailed for crimes against Indigenous groups",
      "description": "Salvatore Mancuso given 40-year sentence, which could be reduced after truth and reparation activities A Colombian court has sentenced a former paramilitary leader to 40 years in prison for crimes committed against Indigenous communities in the province of La Guajira, including homicides, forced disappearances and the displacement of people from 2002 to 2006. The special tribunal that hears cases from the country’s armed conflict said in its ruling that Salvatore Mancuso was responsible for 117 crimes committed by fighters under his command in La Guajira. However, it added that Mancuso’s time in prison could be reduced to eight years, if he collaborated with truth and reparation activities that benefited victims of his former paramilitary group. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/colombia-ex-paramilitary-leader-salvatore-mancuso-jailed-crimes-against-indigenous-groups",
      "published": "Tue, 20 Jan 2026 12:12:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "NATO leaders escalate warnings that Trump's aggression toward Greenland threatens alliance with the US",
      "description": "NATO leaders escalate warnings that Trump's aggression toward Greenland threatens alliance with the US",
      "url": "https://abcnews.go.com/International/wireStory/nato-leaders-escalate-warnings-trumps-aggression-greenland-threatens-129388818",
      "published": "Tue, 20 Jan 2026 12:57:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Guterres in London: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ISIS takes credit for Kabul suicide bombing at Chinese restaurant",
      "description": "ISIS-K claims responsibility for deadly suicide blast at Chinese restaurant in Kabul, killing seven people, including one Chinese national.",
      "url": "https://www.foxnews.com/world/isis-takes-credit-kabul-suicide-bombing-chinese-restaurant",
      "published": "Tue, 20 Jan 2026 08:24:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Twelve schoolchildren killed after bus collides with lorry in South Africa",
      "description": "The fatal collision is just the latest in South Africa, where the road safety record is poor.",
      "url": "https://www.bbc.com/news/articles/cvgdmkxl1mko?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 11:23:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "How can Europe respond to Trump’s Greenland tariffs threat?",
      "description": "The United States's claim to the Danish territory has sparked fears of a trade war.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/20/how-can-europe-respond-to-trumps-greenland-tariffs?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 18:49:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Age of 'fascism' in America: Reed Brody warns that the US is 'living in a very dangerous moment'",
      "description": "In a wide-ranging interview, Reed Brody, former NY Asst Attorney General and renowned int'l human rights lawyer, sounds the alarm at home. Drawing on decades of experience, Brody delivers a scathing assessment of a second Trump term, raising urgent concerns about the erosion of institutions, the rule of law, and checks and balances. Unlike Trump's first term, when political norms and guardrails curbed some of his extreme impulses, Brody warns an emboldened Trump prioritises fealty and capitulation over country.",
      "url": "https://www.france24.com/en/video/20260120-trump-pits-americans-against-americans-we-are-living-in-a-very-dangerous-moment-in-the-us",
      "published": "Tue, 20 Jan 2026 16:06:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Philippine coast guard rescues 1 and searches for 12 missing after motorboat vanishes",
      "description": "Philippine authorities have rescued a crew member from a missing motorboat and are searching for 12 others, including business people",
      "url": "https://abcnews.go.com/International/wireStory/philippine-coast-guard-rescues-1-searches-12-missing-129374761",
      "published": "Tue, 20 Jan 2026 07:03:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Canadian woman found dead on Australian beach in suspected dingo attack",
      "description": "Authorities are investigating whether a Canadian woman found dead on an Australian beach was killed by dingoes",
      "url": "https://abcnews.go.com/International/wireStory/canadian-woman-found-dead-australian-beach-suspected-dingo-129367199",
      "published": "Mon, 19 Jan 2026 21:37:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Aid cuts push millions in West and Central Africa deeper into hunger",
      "description": "A staggering 55 million people across West and Central Africa are expected to suffer crisis levels of hunger, or worse, during the lean season from June to August as funding cuts to humanitarian operations continue amid rising violence and displacement.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166776",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Florida repeat offender allegedly killed 3 tourists minutes from Magic Kingdom after run of violence: records",
      "description": "Florida man accused of killing three tourists near Magic Kingdom had lengthy criminal history including prior insanity acquittal for attempted murder.",
      "url": "https://www.foxnews.com/us/florida-repeat-offender-allegedly-killed-3-tourists-minutes-from-magic-kingdom-after-run-violence-records",
      "published": "Mon, 19 Jan 2026 18:52:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Australian boy fighting for life after shark attack, rescued by friends in Sydney Harbor waters",
      "description": "A 12-year-old boy is fighting for his life after a catastrophic shark attack in Sydney Harbor. He was rescued by heroic friends who leaped from a cliff to save him.",
      "url": "https://www.foxnews.com/world/australian-boy-fighting-life-after-shark-attack-rescued-friends-sydney-harbor-waters",
      "published": "Mon, 19 Jan 2026 09:23:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump leaks world leaders' messages. And, Indiana wins its first national title",
      "description": "President Trump explains why he wants to acquire Greenland in private messages with world leaders. And, Indiana caps off a perfect football season with a national championship win over Miami.",
      "url": "https://www.npr.org/2026/01/20/g-s1-106532/up-first-newsletter-trump-world-leaders-immigration-detention-college-football-champion",
      "published": "Tue, 20 Jan 2026 07:19:41 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "African fans fume at 'disgraceful' World Cup travel ban",
      "description": "Senegal's football team are champions of Africa, but fans from the country are banned from going to the US for the World Cup. They aren't the only ones, with Donald Trump's hostility and FIFA ticket prices hitting hard.",
      "url": "https://www.dw.com/en/african-fans-fume-at-disgraceful-world-cup-travel-ban/a-75572110?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 09:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "After Trump salvo, Macron says: we don't give in to bullies",
      "description": "The President of France warned against US attempts to \"subordinate Europe\". Speaking in Davos, Switzerland, Emmanuel Macron blasted as \"unacceptable\" Trump's threats to impose tariffs of up to 25% on countries opposed to his Greenland takeover plans. FRANCE 24's Emerald Maxwell reports.",
      "url": "https://www.france24.com/en/after-trump-salvo-macron-says-we-don-t-give-in-to-bullies",
      "published": "Tue, 20 Jan 2026 19:37:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran locks nation into ‘darker’ digital blackout, viewing internet as an ‘existential threat’",
      "description": "Iran enters 22nd day of internet shutdown with limited connectivity restored as NetBlocks reports shift toward \"filternet plus\" censorship scheme whitelisting only business services.",
      "url": "https://www.foxnews.com/world/iran-locks-nation-darker-digital-blackout-viewing-internet-existential-threat",
      "published": "Mon, 19 Jan 2026 16:33:46 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Top GOP senator says Syria ceasefire welcome but actions must match words",
      "description": "Syria reaches fragile ceasefire with Kurdish forces as U.S. senator warns about reported crimes by government troops during military operation against SDF.",
      "url": "https://www.foxnews.com/world/top-gop-senator-says-syria-ceasefire-welcome-actions-must-match-words",
      "published": "Mon, 19 Jan 2026 11:42:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of killing 16,500 in sweeping ‘genocide’ crackdown: report",
      "description": "Supreme Leader Ayatollah Ali Khamenei acknowledges thousands killed in Iran protests as regime allegedly accelerates executions to more than eight per day.",
      "url": "https://www.foxnews.com/world/iran-accused-killing-16500-sweeping-genocide-crackdown-report",
      "published": "Sun, 18 Jan 2026 22:07:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Nigeria police deny reports of mass church abductions in north",
      "description": "A state police commissioner said the information was \"mere falsehood... peddled by conflict entrepreneurs\".",
      "url": "https://www.bbc.com/news/articles/c4grw9vg7y4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 08:39:41 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Gul Plaza fire: How a deadly inferno exposed Karachi’s safety failures",
      "description": "Karachi’s deadliest fire in years raises urgent questions about building safety, rescue capacity and urban governance.",
      "url": "https://www.aljazeera.com/news/2026/1/20/gul-plaza-fire-how-a-deadly-inferno-exposed-karachis-safety-failures?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 15:07:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "NDIS tool to determine support not tested on variety of disability types – including diverse autism, experts warn",
      "description": "Exclusive: Experts also alarmed I-CAN tool – a three-hour interview – may be conducted by people with no allied health background Get our breaking news email , free app or daily news podcast The head of Australia’s peak body of psychologists and disability experts have warned the NDIS’s new assessment tool hasn’t been tested on a variety of disability types – including diverse autistic needs – which may lead to “tragedies” occurring, if more research is not conducted. The National Disability Insurance Agency (NDIA) announced in September it had procured the Instrument for the Classification and Assessment of Support Needs (I-CAN) to be used as the basis for determining support plans for NDIS participants. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/ndis-tool-to-determine-support-not-tested-on-variety-of-disability-types-including-diverse-autism-experts-warn",
      "published": "Tue, 20 Jan 2026 14:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Dame Marie Bashir, former NSW governor and distinguished psychiatrist, dies age 95",
      "description": "The first female governor of New South Wales, Dame Marie was widely respected and will be honoured with a state funeral Dame Marie Bashir, the first female governor of New South Wales, has died. She was 95. The NSW premier, Chris Minns, confirmed her death on Tuesday on behalf of her family, writing in a statement that he was saddened to share the news of her passing. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/20/dame-marie-bashir-former-nsw-governor-and-distinguished-psychiatrist-dies-age-95",
      "published": "Tue, 20 Jan 2026 11:48:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ukraine: Overnight Russian attack cuts off power in Kyiv",
      "description": "Russia pounded Ukraine's Kyiv region with combined drone and missile strikes overnight. Thousands of homes have been left without electricity and heating in freezing weather.",
      "url": "https://www.dw.com/en/ukraine-overnight-russian-attack-cuts-off-power-in-kyiv/a-75574053?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 09:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Nigeria police deny attacks as residents insist 168 people are held by armed groups",
      "description": "The Nigerian police deny reports of church attacks in Kaduna state over the weekend",
      "url": "https://abcnews.go.com/International/wireStory/nigeria-police-deny-church-attacks-residents-insist-168-129378474",
      "published": "Tue, 20 Jan 2026 09:18:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Alexander brothers trade trophy listings for jury trial as accuser’s recent death shadows case",
      "description": "Jury selection begins for the Alexander brothers' federal sex trafficking trial, with defense attorneys facing a challenging jury selection environment.",
      "url": "https://www.foxnews.com/us/alexander-brothers-trade-trophy-listings-jury-trial-accusers-recent-death-shadows-case",
      "published": "Tue, 20 Jan 2026 07:00:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Ukraine's parliament and half of Kyiv with no heating after Russian strikes",
      "description": "President Zelensky says Russia has started using \"far more\" ballistic missiles in its attacks on Ukraine.",
      "url": "https://www.bbc.com/news/articles/cwy1lpgqenxo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 18:40:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Anthony Joshua's driver appears in court after crash that killed two",
      "description": "The former heavyweight champion was a passenger in the crash, which killed two of his team members.",
      "url": "https://www.bbc.com/news/articles/cew8jxze027o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 11:16:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Australia news live: Labor’s hate speech laws pass the Senate; experts warn research gap on NDIS tool could lead to ‘tragedies’",
      "description": "Attorney general says Labor does not plan to again try to pass laws targeting racial vilification. Follow updates live Get our breaking news email , free app or daily news podcast Former prime minister, Scott Morrison , has fired back over comments Anthony Albanese , made in question time on Tuesday after the opposition leader, Sussan Ley , asked Albanese if he would apologise for not acting on antisemitism sooner. Albanese told the parliament that antisemitism didn’t start when the Labor government was elected in 2022, pointing to comments from Liberal senator Andrew Bragg that antisemitism began rising in 2019, when Morrison was prime minister. Hamas never praised the actions of my Government @AlboMP, but they did praise yours. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/21/hate-speech-laws-pass-senate-gun-reforms-anthony-albanese-labor-sussan-ley-coalition-ntwnfb",
      "published": "Tue, 20 Jan 2026 19:56:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump's 'Board of Peace' could pose threat to UN",
      "description": "The UN gave the US president a mandate to lead a \"Board of Peace\" to stabilize the Middle East. However, Donald Trump seems to be increasingly competing with the UN, while sidelining the Middle East conflict entirely.",
      "url": "https://www.dw.com/en/trump-s-board-of-peace-could-pose-threat-to-un/a-75580180?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 17:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Greenland: Europe vows 'unflinching' response to Trump",
      "description": "The EU's Ursula von der Leyen has warned Donald Trump that his tariff threat against European countries would be a \"mistake.\" Follow DW.",
      "url": "https://www.dw.com/en/greenland-europe-vows-unflinching-response-to-trump/live-75575266?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 10:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "EU vows 'unflinching' response to Trump's Greenland gambit",
      "description": "European leaders drew a clear line over Greenland Tuesday, vowing an \"unflinching\" response to Washington's threats even as US President Donald Trump said he was ready to hold a meeting in Davos about his plans to take the autonomous Danish territory. EU chief Ursula von der Leyen warned of relations \"plunging into a downward spiral\" while Greenland's PM said the island's population must be prepared for military force.",
      "url": "https://www.france24.com/en/eu-vows-unflinching-response-to-trump-s-greenland-gambit",
      "published": "Tue, 20 Jan 2026 19:51:20 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Spain begins three days of mourning as number killed in train crash could rise",
      "description": "The number of people killed in a high-speed train crash in Spain could rise in the coming hours as cranes begin moving the wreckage.",
      "url": "https://news.sky.com/story/number-killed-in-spain-train-crash-expected-to-rise-as-carriages-moved-13496557",
      "published": "Tue, 20 Jan 2026 10:37:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Hopes fade in fourth day of search for dozens missing in Karachi shopping plaza fire",
      "description": "Hopes of finding survivors of a Karachi shopping plaza fire have faded",
      "url": "https://abcnews.go.com/International/wireStory/hopes-fade-fourth-day-search-dozens-missing-karachi-129377362",
      "published": "Tue, 20 Jan 2026 08:19:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Food insecurity in Lebanon, Libya migrants freed, UNHCR tackles multiple emergencies – despite cuts",
      "description": "Since 2026, nearly 17 percent of Lebanon’s population has been living in a state of major food insecurity – a situation that is likely to worsen in the coming year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166787",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Yemen: Children are dying and it’s going to get worse, warns aid veteran",
      "description": "In Yemen, renewed political instability and economic woes linked to the war threaten to complicate the already difficult task of helping vulnerable people suffering from deepening hunger, illness and displacement, the UN’s top aid official there said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166786",
      "published": "Mon, 19 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Judge and wife shot in broad daylight in Indiana, sparking massive multi-agency investigation",
      "description": "A manhunt is underway after Indiana judge Steven Meyer and his wife, Kimberly Meyer, were shot in their home on Sunday. Both victims survived the shooting.",
      "url": "https://www.foxnews.com/us/judge-wife-shot-broad-daylight-indiana-sparking-massive-multi-agency-investigation",
      "published": "Mon, 19 Jan 2026 21:45:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Top EU official warns Trump's tariff threat over Greenland pushback is 'a mistake'",
      "description": "EU chief calls President Donald Trump's Greenland tariff threats \"a mistake\" as European leaders warn of downward spiral in transatlantic trade relations.",
      "url": "https://www.foxnews.com/world/top-eu-official-warns-trumps-tariff-threat-over-greenland-pushback-a-mistake",
      "published": "Tue, 20 Jan 2026 13:23:56 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Japan’s prime minister calls snap election as approval ratings ride high",
      "description": "Sanae Takaichi tells senior figures in ruling Liberal Democratic party she plans to dissolve lower house on 23 January Japan’s prime minister, Sanae Takaichi , has called a snap election as she attempts to capitalise on high approval ratings since becoming the country’s first female prime minister three months ago. Takaichi, a conservative who is embroiled in a deepening dispute with China over the security of Taiwan, said on Monday she would dissolve the lower house of the Diet – Japan’s parliament – on 23 January, with an election to follow on 8 February. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/japan-snap-election-sanae-takaichi-ldp",
      "published": "Mon, 19 Jan 2026 09:39:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "How to survive on the streets of Paris? Two homeless people tell their stories",
      "description": "January 22 marks the ninth edition of La Nuit de la Solidarité à Paris (A Night of Solidarity in Paris), an initiative from Paris's City Hall to raise awareness about the needs of homeless people and an attempt to change perceptions of those living on the margins of society. FRANCE 24’s reporters Florence Gaillard and Jonathan Walsh followed two homeless people to learn more. Romain is 45 years old and is following a rehabilitation program, while Valérie, 62, is still struggling to survive on the streets.",
      "url": "https://www.france24.com/en/tv-shows/france-in-focus/20260120-how-to-survive-on-the-streets-of-paris-two-homeless-people-tell-their-stories",
      "published": "Tue, 20 Jan 2026 14:34:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "UN strongly condemns demolition of UNRWA headquarters in East Jerusalem",
      "description": "The reported demolition underway early Tuesday of the headquarters of UN agency UNRWA by Israeli forces in occupied East Jerusalem - apparently “under the watch of lawmakers and a member of the Government” - has prompted swift condemnation from the global body.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166792",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Shock and confusion as Spain struggles for answers after deadly train crash",
      "description": "Investigators remain baffled by the cause of Sunday's deadly crash in the south of the country.",
      "url": "https://www.bbc.com/news/articles/crle9k2gw6jo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 18:00:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Lawyers for Swiss bar owners condemn 'vindictiveness' after deadly fire",
      "description": "Lawyers for the Moretti couple say \"lies\" have been circulating about their clients, in their first public statement since the fire.",
      "url": "https://www.bbc.com/news/articles/c5yvl4x3nqeo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 14:53:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Researchers find Antarctic penguin breeding is heating up sooner",
      "description": "Warming temperatures are forcing Antarctic penguins to breed earlier and that's a big problem for two of the cute tuxedoed species that face extinction by the end of the century, a study said.",
      "url": "https://www.npr.org/2026/01/20/g-s1-106516/antarctic-penguin-breeding-heating-up-sooner",
      "published": "Tue, 20 Jan 2026 05:19:20 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators occupy Minnesota Target store, demand retailer stop helping federal agents",
      "description": "Anti-ICE protesters staged a sit-in at Minneapolis Target store, claiming retailer allows federal immigration agents to use parking lot as staging ground.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-occupy-minnesota-target-store-demand-retailer-stop-helping-federal-agents",
      "published": "Mon, 19 Jan 2026 16:22:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Doha hosts maritime defence exhibition amid rising regional tensions",
      "description": "DIMDEX 2026 opens in Qatari capital, bringing together industry leaders and military officials.",
      "url": "https://www.aljazeera.com/gallery/2026/1/20/doha-hosts-maritime-defence-exhibition-amid-rising-regional-tensions?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 17:01:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UK approves Chinese ‘mega embassy’ in London after reassurances from spy chiefs",
      "description": "Critics expected to mount legal challenge to plans for vast complex at Royal Mint Court amid security concerns UK politics live – latest updates The communities secretary, Steve Reed, has given permission for China to build a vast new embassy near the Tower of London after spy chiefs told him that the risks to UK national security could be controlled and dealt with. The decision paves the way for Keir Starmer to visit Beijing in the coming weeks – though local residents plan to legally challenge the decision, potentially delaying the development by months or years. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/20/china-mega-embassy-approved-london",
      "published": "Tue, 20 Jan 2026 15:57:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "French President Emmanuel Macron delivers speech at Davos Forum",
      "description": "Watch French President Emmanuel Macron's speech at the World Economic Forum in Davos, Switzerland.",
      "url": "https://www.france24.com/en/video/20260120-french-president-emmanuel-macron-delivers-speech-at-davos-forum-1",
      "published": "Tue, 20 Jan 2026 13:52:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump's first year has been 'faster and more shocking than expected', expert says",
      "description": "US President Donald Trump's actions during his first year back in office have been \"faster and more shocking than we even expected\". That's the view of US domestic and foreign policy specialist Laurie Dundon. She told us that Trump's mind is set on the historical legacy he will leave and that he aims to upend how the US functions internally and how it is seen in the world. She spoke to us in Perspective.",
      "url": "https://www.france24.com/en/tv-shows/perspective/20260120-trump-s-first-year-has-been-faster-and-more-shocking-than-expected-expert-says",
      "published": "Tue, 20 Jan 2026 13:50:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Sir David Beckham refuses to answer Sky News questions in Davos",
      "description": "Sir David Beckham has refused to answer questions on his relationship with his son at the World Economic Forum in Davos.",
      "url": "https://news.sky.com/story/sir-david-beckham-refuses-to-answer-sky-news-questions-in-davos-13496537",
      "published": "Tue, 20 Jan 2026 09:53:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Mexico sends 37 cartel members to US in latest offer to Trump administration",
      "description": "Mexico's security minister says the country has sent 37 more cartel members to the United States",
      "url": "https://abcnews.go.com/International/wireStory/mexico-sends-37-cartel-members-us-latest-offer-129390809",
      "published": "Tue, 20 Jan 2026 13:53:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "South Sudan president fires interior minister in a move threatening peace agreement",
      "description": "President Salva Kiir of South Sudan has dismissed his interior minister, Angelina Teny, who is the wife of detained opposition leader Riek Machar",
      "url": "https://abcnews.go.com/International/wireStory/south-sudan-president-fires-interior-minister-move-threatening-129375041",
      "published": "Tue, 20 Jan 2026 06:56:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Six countries confirm US invitations to Gaza peace board",
      "description": "Trump invites multiple countries, including Jordan, Greece and India, to join his \"Board of Peace\" for Gaza reconstruction and governance oversight.",
      "url": "https://www.foxnews.com/world/six-countries-confirm-us-invitations-gaza-peace-board",
      "published": "Sun, 18 Jan 2026 14:21:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Economic Forum invites Iranian foreign minister to Davos after regime slaughter of Iranian civilians",
      "description": "World Economic Forum is facing calls to exclude Iranian officials from Davos after the regime slaughtered thousands of its civilians, rights groups say.",
      "url": "https://www.foxnews.com/world/world-economic-forum-invites-iranian-foreign-minister-davos-after-regime-slaughter-iranian-civilians",
      "published": "Sun, 18 Jan 2026 12:04:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Australia parliament passes gun reform and anti-hate bills after Bondi shooting",
      "description": "The reforms are in response to Australia's worst mass shooting in decades at a Jewish festival in December.",
      "url": "https://www.bbc.com/news/articles/c20ge5qwdl2o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 15:11:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Netflix switches its Warner Bros offer to all-cash deal to quell Paramount",
      "description": "The switch in its offer comes as Paramount Skydance has campaigned that its bid is superior to Netflix's.",
      "url": "https://www.aljazeera.com/economy/2026/1/20/netflix-switches-its-warner-bros-offer-to-all-cash-deal-to-quell-paramount?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 18:52:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "There is another war Israel is waging – one that is not making headlines",
      "description": "In the occupied West Bank, Israel has mobilised all military and colonial means to make Palestinian life impossible.",
      "url": "https://www.aljazeera.com/opinions/2026/1/20/there-is-another-war-israel-is-waging-one-that-is-not-making?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 16:03:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'The miracle': A 6-year-old walked away from the train wreck that killed her family",
      "description": "Her parents, brother and cousin were killed in the collision, but the girl was found walking barefoot on the tracks. She's being cared for by grandparents after receiving three stitches in her head.",
      "url": "https://www.npr.org/2026/01/20/g-s1-106563/spain-train-crash-miracle-survivor-zamorano-alvarez",
      "published": "Tue, 20 Jan 2026 13:31:04 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "WEF: Is Greenland the wake-up call Europe needed?",
      "description": "Europe faces waning influence amid wars, trade tensions, climate inaction and a US administration quick to hurl insults at its oldest allies. In Davos, leaders discuss how Europe can regain its mojo.",
      "url": "https://www.dw.com/en/wef-is-greenland-the-wake-up-call-europe-needed/a-75584471?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 18:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "China stays resilient in first year of Trump 2.0",
      "description": "Donald Trump's second term in the White House has tested China's tit-for-tat approach in response to the the US president's trade war. While stiff competition remains moving forward, there are signs of more stable ties.",
      "url": "https://www.dw.com/en/china-stays-resilient-in-first-year-of-trump-2-0/a-75577333?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 13:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump floats 200% tariff on French wine over perceived snub",
      "description": "Donald Trump has warned of steep tariffs on French wine and champagne as he presses France's president Emmanuel Macron to join a US-led \"Board of Peace.\" Paris has signalled that it does not plan to join the initiative.",
      "url": "https://www.dw.com/en/trump-floats-200-tariff-on-french-wine-over-perceived-snub/a-75574134?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 08:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK approves new Chinese ‘mega embassy’ in London despite security concerns",
      "description": "The UK goverenment on Tuesday approved a 20,000-square-metre plot of land, known as Royal Mint Court, for China's new embassy in London. The decision has stoked heated controversy, mostly over national security concerns and the signal it could send, that Britain bows to economic pressure from Beijing.",
      "url": "https://www.france24.com/en/europe/20260120-uk-approves-new-chinese-mega-embassy-in-london-despite-security-concerns",
      "published": "Tue, 20 Jan 2026 17:17:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Crypto investments and conflicts of interest: Trump's very profitable year in office",
      "description": "Twelve months into Donald Trump’s second presidency, his personal fortune has shot up by at least $3 billion, according to estimates by US media. This is largely due to his family’s crypto ventures, which have attracted wealthy investors and sparked conflict of interest accusations from critics.",
      "url": "https://www.france24.com/en/americas/20260120-crypto-investments-and-conflicts-of-interest-trump-s-very-profitable-year-in-office",
      "published": "Tue, 20 Jan 2026 15:42:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "French opposition parties expected to file votes of no-confidence",
      "description": "French Prime Minister Sebastien Lecornu is set to ram his budget bill through parliament without a vote after conceding it was a \"partial failure\" Monday after weeks of stalled negotiations. French hard-left France Unbowed and far-right National Rally party are both expected to file votes of no-confidence, said FRANCE 24 Senior Reporter James André, adding that the first such vote would take place on Friday if it was indeed filed.",
      "url": "https://www.france24.com/en/french-opposition-parties-expected-to-file-votes-of-no-confidence",
      "published": "Tue, 20 Jan 2026 14:57:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Surfer 'lucky to survive' Sydney's fourth shark attack in three days",
      "description": "A surfer has become the latest victim of a shark attack in Australia - the fourth off Sydney in just three days.",
      "url": "https://news.sky.com/story/surfer-lucky-to-survive-sydneys-fourth-shark-attack-in-three-days-13496507",
      "published": "Tue, 20 Jan 2026 08:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting",
      "description": "Australia's politicians have fast-tracked reforms to toughen gun control and hate crime laws in response to December's Bondi Beach shooting.",
      "url": "https://news.sky.com/story/australia-fast-tracks-tougher-gun-and-hate-laws-after-bondi-beach-shooting-13496476",
      "published": "Tue, 20 Jan 2026 07:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN accuses Israel of 'unprecedented attack' as diggers start demolishing refugee agency site",
      "description": "The United Nations has accused Israel of \"an unprecedented attack\" after diggers started demolition work at a compound used for decades by UNRWA, the UN agency that provides support to Palestinian refugees.",
      "url": "https://news.sky.com/story/un-accuses-israel-of-unprecedented-attack-as-diggers-start-demolishing-unrwa-site-13496573",
      "published": "Tue, 20 Jan 2026 11:36:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota police chiefs allege some ICE agents racially profiled US citizens, including off-duty officers",
      "description": "Minnesota police chiefs report federal immigration officers allegedly racially profiled American citizens and off-duty cops during enforcement operations.",
      "url": "https://www.foxnews.com/us/minnesota-police-chiefs-allege-some-ice-agents-racially-profiled-us-citizens-including-off-duty-officers",
      "published": "Tue, 20 Jan 2026 14:34:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Suspected gunman uttered 4 words before shooting Indiana judge and wife: dispatch audio",
      "description": "A gunman shot a Lafayette judge and his wife at their home before fleeing the scene. Steven and Kimberly Meyer are stable as the manhunt continues in Indiana.",
      "url": "https://www.foxnews.com/us/suspected-uttered-4-words-before-shooting-indiana-judge-wife-dispatch-audio",
      "published": "Tue, 20 Jan 2026 12:31:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US drug overdose deaths plummet 20% as Trump administration cracks down on southern border",
      "description": "Drug overdose deaths plummeted over 20% as border enforcement tightened, new CDC data shows. Experts suggest stronger policies may curb fentanyl flow.",
      "url": "https://www.foxnews.com/us/us-drug-overdose-deaths-plummet-20-trump-administration-cracks-down-southern-border",
      "published": "Tue, 20 Jan 2026 11:19:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Portland police release photos of suspect accused of shooting 2 officers",
      "description": "The Portland Police Bureau released photos of a suspect who allegedly shot two officers on Monday night, describing him as \"armed and dangerous.\"",
      "url": "https://www.foxnews.com/us/portland-police-release-photos-suspect-accused-shooting-2-officers",
      "published": "Tue, 20 Jan 2026 10:06:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Nanny love triangle murders trial pits dueling stories of mastermind behind case ‘out of a TV movie’: expert",
      "description": "First week of testimony in Virginia murder trial exposes alleged affair between Brendan Banfield and family nanny, leading to wife's death and cover-up.",
      "url": "https://www.foxnews.com/us/nanny-love-triangle-murders-trial-pits-dueling-stories-mastermind-behind-case-tv-movie-expert",
      "published": "Tue, 20 Jan 2026 09:00:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "ICE says immigrant who died in Texas detention center committed suicide",
      "description": "ICE said that an immigrant who was found dead at an immigration detention center in El Paso, Texas, last week had killed himself, as authorities continue to investigate.",
      "url": "https://www.foxnews.com/us/ice-says-immigrant-who-died-texas-detention-center-committed-suicide",
      "published": "Tue, 20 Jan 2026 01:09:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Minneapolis software engineers mistaken for ICE agents while eating lunch harassed by anti-ICE crowd",
      "description": "Software engineers mistakenly accused of being ICE agents face harassment and shocking allegations while eating lunch at Minneapolis restaurant during incident.",
      "url": "https://www.foxnews.com/us/minneapolis-software-engineers-mistaken-ice-agents-eating-lunch-harassed-anti-ice-crowd",
      "published": "Mon, 19 Jan 2026 18:18:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Fourth shark attack in three days rocks Australia as authorities close beaches and deploy drumlines",
      "description": "A string of shark attacks near Sydney prompted beach closures across New South Wales. The latest victim attacked at Point Plomer suffered only minor cuts.",
      "url": "https://www.foxnews.com/world/fourth-shark-attack-three-days-rocks-australia-authorities-close-beaches-deploy-drumlines",
      "published": "Tue, 20 Jan 2026 07:24:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian regime elites allegedly move millions of dollars out of country amid sanctions",
      "description": "Treasury sanctions target Iran's shadow banking as Mojtaba Khamenei allegedly transferred $328 million overseas according to Treasury Department reports.",
      "url": "https://www.foxnews.com/world/iranian-regime-elites-allegedly-move-tens-millions-dollars-out-country-amid-sanctions",
      "published": "Sun, 18 Jan 2026 20:29:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian drone strikes leave hundreds of thousands without power across Russian-controlled area",
      "description": "Ukrainian drone strikes against Russian energy infrastructure left over 200,000 without power as both sides continue targeting electrical grids.",
      "url": "https://www.foxnews.com/world/ukrainian-drone-strikes-leave-hundreds-thousands-without-power-across-russian-controlled-area",
      "published": "Sun, 18 Jan 2026 14:07:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Kim Jong-un fires vice-premier and likens him to ‘a goat yoked to an ox cart’",
      "description": "North Korean leader reportedly blames Yang Sung-ho for ‘confusion’ at factory project as major congress looms The North Korean leader, Kim Jong-un , has dismissed a vice-premier over troubles in a factory modernisation project, in an apparent move to tighten discipline among officials and push them to deliver greater results before a major political conference. The upcoming ruling Workers’ party congress, the first of its kind in five years , is one of North Korea’s biggest propaganda spectacles and is intended to review past projects, establish new political and economic priorities and reshuffle officials. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/kim-jong-un-fires-vice-premier-yang-sung-ho-goat-ox-cart",
      "published": "Tue, 20 Jan 2026 11:46:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea's Kim fires vice premier over factory failures ahead of major party congress",
      "description": "North Korean leader Kim Jong Un has dismissed a vice premier over issues in a factory modernization project",
      "url": "https://abcnews.go.com/International/wireStory/north-koreas-kim-dismisses-vice-premier-factory-project-129369235",
      "published": "Tue, 20 Jan 2026 06:33:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota AG dismisses FACE Act concerns after anti-ICE agitators storm church and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/minnesota-ag-dismisses-face-act-concerns-anti-ice-agitators-storm-church-more-top-headlines",
      "published": "Tue, 20 Jan 2026 07:23:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "US veteran gets 5 years in Russian prison after authorities reportedly force him to dock with firearm onboard",
      "description": "U.S. Navy veteran Charles Wayne Zimmerman was sentenced to 5 years in Russian prison after allegedly failing to declare a firearm oboard his yacht in Sochi port.",
      "url": "https://www.foxnews.com/world/us-veteran-gets-5-years-russian-prison-authorities-reportedly-force-him-dock-firearm",
      "published": "Mon, 19 Jan 2026 18:06:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "UK defends Chagos deal after Trump calls it 'act of great stupidity'",
      "description": "The US president says it is \"another in a very long line of National Security reasons why Greenland has to be acquired\".",
      "url": "https://www.bbc.com/news/articles/c0mkp021rvro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 16:42:13 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Fresh fighting in Syria: What you need to know",
      "description": "Syria's government is trying to forcefully absorb a Syrian Kurdish paramilitary group that once controlled much of the country's northeast. The fight ultimately comes down to a clash about Syria's future governance.",
      "url": "https://www.dw.com/en/fresh-fighting-in-syria-what-you-need-to-know/a-75580975?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 19:26:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "France's PM invokes Article 49.3 to force through budget bill",
      "description": "French PM Sébastien Lecornu on Tuesday forced part of of a highly-contested budget bill through parliament without a vote by invoking Article 49.3 of the Constitution. FRANCE 24's James André said two votes of no-confidence are expected, one by the hard left France Unbowed party and the other by the far-right National Rally party.",
      "url": "https://www.france24.com/en/france-s-pm-invokes-article-49-3-to-force-through-budget-bill",
      "published": "Tue, 20 Jan 2026 16:40:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "French PM Lecornu forces 2026 budget through parliament without a vote",
      "description": "France's Prime Minister Sébastien Lecornu invoked Article 49.3 of the Constitution on Tuesday to force part of his 2026 budget ​bill through the deeply divided lower house of parliament ‍without a vote. Opposition parties, including the hard-left France Unbowed (LFI) and far-right National Rally (RN), were expected to file no-confidence motions in response.",
      "url": "https://www.france24.com/en/france/20260120-french-pm-lecornu-forces-2026-budget-through-parliament-without-a-vote",
      "published": "Tue, 20 Jan 2026 16:16:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "North Korea's Kim Jong Un dismisses vice premier, comparing him to 'a goat yoked to pull an ox cart'",
      "description": "North Korean leader Kim Jong Un has dismissed a vice premier over a factory modernisation project in a rare public rebuke ahead of a ruling party congress, state media has reported.",
      "url": "https://news.sky.com/story/north-koreas-kim-jong-un-dismisses-vice-premier-comparing-him-to-a-goat-yoked-to-pull-an-ox-cart-13496580",
      "published": "Tue, 20 Jan 2026 12:01:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Jailed Ugandan opposition figure Besigye's health is failing, his party says",
      "description": "The health of jailed Ugandan opposition figure Kizza Besigye is failing, his party says, after he was driven overnight to a medical facility in the capital of Kampala",
      "url": "https://abcnews.go.com/International/wireStory/jailed-ugandan-opposition-figure-besigyes-health-failing-party-129373380",
      "published": "Tue, 20 Jan 2026 04:09:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Human trafficking depends on corruption at every step",
      "description": "In 2011, a trafficker in Chile was convicted for recruiting economically vulnerable Peruvian citizens and arranging for them to be brought into the country – destined to become victims of sexual exploitation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166797",
      "published": "Tue, 20 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "New ceasefire in Syria after Kurdish-led forces pull out of camp for IS families",
      "description": "The government announces a four-day ceasefire with the SDF, which says it was \"compelled\" to withdraw its fighters from al-Hol camp.",
      "url": "https://www.bbc.com/news/articles/c4g39w8k8zwo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 19:12:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "UK approves Chinese embassy in London despite fears over security, protests",
      "description": "People residing near the Tower of London, the future site of the embassy, have vowed to challenge the ruling.",
      "url": "https://www.aljazeera.com/news/2026/1/20/uk-approves-chinese-embassy-in-london-despite-fears-over-security-protests?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 19:00:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Macron: Europe won’t be ‘intimidated’ by US’ Greenland threats",
      "description": "Macron said Europe will not be “intimidated” by US President Donald Trump’s threat of tariffs over Greenland.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/macron-europe-wont-be-intimidated-by-us-greenland-threats?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 18:49:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Museveni’s son threatens Bobi Wine after Uganda election",
      "description": "Uganda's General Kainerugaba threatens opposition leader Bobi Wine and labels him an outlaw since the election results.",
      "url": "https://www.aljazeera.com/news/2026/1/20/musevenis-son-threatens-bobi-wine-after-uganda-election?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 17:45:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Davos 2026: 'We prefer respect to bullies,' Macron says",
      "description": "France's president said it was \"fundamentally unacceptable\" for the US to use tariff threats as \"leverage against territorial sovereignty.\" His speech came ahead of US President Trump's visit to Davos. DW has more.",
      "url": "https://www.dw.com/en/davos-2026-we-prefer-respect-to-bullies-macron-says/live-75560683?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 14:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "What is an exiled Iranian opposition group doing in Albania?",
      "description": "Far from Tehran in a Balkan nation, some 3,000 members of the banned group Mujahedeen-e-Khalq (MEK) have been sheltering. What's their role in the protests?",
      "url": "https://www.dw.com/en/what-is-an-exiled-iranian-opposition-group-doing-in-albania/a-75574006?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 08:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump and Macron: A bromance break-up?",
      "description": "The French and American presidents have long touted their friendly relationship. In front of the cameras, they're known for long handshakes and pats on the back, but is this tactile camaraderie a facade? Could their so-called \"bromance\" be over? On the first anniversary of Donald Trump's inauguration, and after the US president leaked a private text message from Emmanuel Macron, while threatening France with tariffs and repeatedly mocking Macron's accent, we take a look at how their relationship is going.",
      "url": "https://www.france24.com/en/tv-shows/entre-nous/20260120-trump-and-macron-a-bromance-break-up",
      "published": "Tue, 20 Jan 2026 15:56:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Six-year-old girl the sole survivor of a family that perished in Spanish train wreck",
      "description": "A 6-year-old girl has survived Sunday's deadly train crash in southern Spain",
      "url": "https://abcnews.go.com/International/wireStory/miracle-6-year-girl-sole-survivor-family-perished-129378631",
      "published": "Tue, 20 Jan 2026 08:52:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Top EU official questions Trump’s trustworthiness over Greenland tariff threat",
      "description": "The European Union’s top official has described U_S_ President Donald Trump’s planned new tariffs over Greenland as “a mistake especially between long-standing allies.\"",
      "url": "https://abcnews.go.com/International/wireStory/top-eu-official-questions-trumps-trustworthiness-greenland-tariff-129372454",
      "published": "Tue, 20 Jan 2026 08:09:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Families in ‘survival mode’ amid Russian strikes and deadly cold",
      "description": "Families across Ukraine are in “constant survival mode” amid ongoing waves of Russian missile and drone strikes that have left blocks without power for days at a time, while temperatures plunge to deadly lows, the UN Children's Fund (UNICEF) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166774",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US Marshals nab fugitive hiding under child's bed: officials",
      "description": "Fugitive found hiding under child's bed during dramatic U.S. Marshals arrest operation in Spokane. Authorities said suspect was wanted on firearm charges.",
      "url": "https://www.foxnews.com/us/us-marshals-nab-fugitive-hiding-under-childs-bed-officials",
      "published": "Tue, 20 Jan 2026 08:01:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China demands Taliban protect its citizens after deadly Kabul blast",
      "description": "The Islamic State group says they were behind the blast in Kabul, but police say they are still investigating the cause.",
      "url": "https://www.bbc.com/news/articles/c5yvqx22dyvo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 11:16:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syria: Kurdish forces leave IS camp as army advances",
      "description": "The Kurdish-led Syrian Democratic Forces said they had to withdraw from the al-Hol camp, which holds thousands of Islamic State fighters' relatives, to redeploy elsewhere. It's the second such pullout in as many days.",
      "url": "https://www.dw.com/en/syria-kurdish-forces-leave-is-camp-as-army-advances/a-75583296?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 18:11:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "A rollercoaster year in US–Brazil relations",
      "description": "Relations between the United States and Brazil have been on a rollercoaster over the past year. US President Donald Trump announced 40 percent tariffs on Brazilian goods over the prosecution of former president Jair Bolsonaro, FRANCE 24’s Jan Onoszko said, adding that Trump later changed his tone after meeting President Luiz Inacio Lula da Silva and dropped most of the tariffs.",
      "url": "https://www.france24.com/en/video/20260120-a-rollercoaster-year-in-us%E2%80%93brazil-relations",
      "published": "Tue, 20 Jan 2026 15:59:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syrian military claims that Kurdish-led forces abandoned camp housing families of Islamic State militants",
      "description": "Syrian military claims that Kurdish-led forces abandoned camp housing families of Islamic State militants",
      "url": "https://abcnews.go.com/International/wireStory/syrian-military-claims-kurdish-led-forces-abandoned-camp-129377438",
      "published": "Tue, 20 Jan 2026 08:17:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Syrian interior ministry: 120 Islamic State group members escape from prison amid clashes",
      "description": "Syria's interior ministry says 120 Islamic State group members have escaped from a prison in northeast Syria",
      "url": "https://abcnews.go.com/International/wireStory/syrian-interior-ministry-120-islamic-state-group-members-129374085",
      "published": "Tue, 20 Jan 2026 05:29:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "ISIS fighters break free from Syrian jail amid chaotic government handover",
      "description": "U.S. military boosts regional presence with F-15 fighter jets and USS Abraham Lincoln deployment as ISIS prison break highlights security risks amid Syria's political realignment.",
      "url": "https://www.foxnews.com/world/isis-fighters-break-free-from-syrian-jail-amid-chaotic-government-handover",
      "published": "Mon, 19 Jan 2026 22:10:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Gunmen abduct dozens of worshippers from multiple Nigerian churches using sophisticated weapons",
      "description": "Gunmen allegedly abducted dozens of worshippers from two churches in Nigeria's Kaduna state, with security forces deployed to track the captors.",
      "url": "https://www.foxnews.com/world/gunmen-abduct-dozens-worshippers-multiple-nigerian-churches-using-sophisticated-weapons",
      "published": "Mon, 19 Jan 2026 21:51:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "China’s population falls again as birthrate drops 17% to record low",
      "description": "Fourth year of decline deepens concerns over ageing, shrinking workforce and long-term economic impact China’s population fell for a fourth consecutive year in 2025 as the birthrate plunged to another record low despite the introduction of polices aimed at encouraging people to have children. Registered births dropped to 7.92 million in 2025 – or 5.63 for every 1,000 members of the population – down 17% from 9.54 million in 2024, and the lowest since records began in 1949. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/china-population-falls-again-birthrate-record-low",
      "published": "Mon, 19 Jan 2026 12:12:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "ASEAN won't endorse election in military-ruled Myanmar, Malaysia says",
      "description": "Malaysia's foreign minister Mohamad Hasan cited concerns over the lack of inclusive and free participation.",
      "url": "https://www.npr.org/2026/01/20/g-s1-106551/asean-wont-endorse-election-in-military-ruled-myanmar-malaysia-says",
      "published": "Tue, 20 Jan 2026 14:10:22 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "EU prosecutor: Third of VAT fraud cases linked to Slovakia",
      "description": "The EU's most senior prosecutor told Slovak MPs that a staggering one in three VAT fraud cases investigated by her office has links to Slovakia. How can such fraud flourish in Slovakia and is it a new problem?",
      "url": "https://www.dw.com/en/eu-prosecutor-third-of-vat-fraud-cases-linked-to-slovakia/a-75577538?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 12:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Europe to suspend approval of US tariffs deal",
      "description": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland.",
      "url": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 18:16:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cow astonishes scientists with rare use of tools",
      "description": "The discovery suggests cows may have far greater cognitive abilities than previously assumed.",
      "url": "https://www.bbc.com/news/articles/cj0n127y74go?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 14:54:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Colombia sentences ex-paramilitary leader Mancuso to 40 years in jail",
      "description": "Salvatore Mancuso's group committed more than 100 crimes, many targeting an indigenous group, the tribunal ruled.",
      "url": "https://www.bbc.com/news/articles/c338mdg1gn5o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 16:39:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-president accused of murder plot extradited to Burkina Faso",
      "description": "Paul-Henri Sandaogo Damiba has not commented on the accusations from Burkina Faso.",
      "url": "https://www.bbc.com/news/articles/cddg5ermzn7o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 16:34:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France makes first interception targeting small boat crossings to UK",
      "description": "The operation follows a change of tactics agreed amid growing pressure from the UK government to step up interventions.",
      "url": "https://www.bbc.com/news/articles/ceqz1lzdxw1o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 14:37:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Europe is at a total loss': Russia gloats over Greenland tensions",
      "description": "The BBC's Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump's desire to buy Greenland.",
      "url": "https://www.bbc.com/news/articles/c17zpvkddpzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 16:26:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bobi Wine tells the BBC from hiding he will not contest Uganda election results in court",
      "description": "The losing presidential candidate calls for \"peaceful change\", saying Uganda's judiciary is not independent.",
      "url": "https://www.bbc.com/news/articles/c394pk4p707o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 10:05:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland 'will stay Greenland', former Trump adviser declares",
      "description": "Donald Trump's former chief economic adviser said the US president's actions are a negotiating tactic.",
      "url": "https://www.bbc.com/news/articles/c98p6m0r53no?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 20 Jan 2026 10:36:28 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ghana arrests Nigerians accused of running cyber-crime networks",
      "description": "There is a growing trend of foreigners being lured to Ghana under the pretext of lucrative work.",
      "url": "https://www.bbc.com/news/articles/cr4k35q6yr0o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 15:15:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israeli withdrawal from Gaza a top priority, Qatari PM says",
      "description": "Qatar’s prime minister said that Israeli withdrawal from Gaza should be a “key focus” of Trump’s “Board of Peace”.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/israeli-withdrawal-from-gaza-a-top-priority-qatari-pm-says?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 18:59:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US envoy says SDF’s role in Syria has ‘largely expired’ after ISIL",
      "description": "US Envoy Tom Barrack says the Syrian government is taking the SDF's former position as the 'anti-ISIS (ISIL)' force.",
      "url": "https://www.aljazeera.com/news/2026/1/20/us-envoy-says-sdfs-role-in-syria-has-largely-expired-after-isil?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 18:49:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marseille vs Liverpool: Champions League – Salah, team news, start, lineup",
      "description": "Liverpool hope to take a step closer to securing a place in the last 16 of the UEFA Champions League against Marseille.",
      "url": "https://www.aljazeera.com/sports/2026/1/20/marseille-vs-liverpool-champions-league-salah-team-news-start-lineup?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 17:02:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Inter Milan vs Arsenal – UEFA Champions League",
      "description": "Follow our live build-up, with full team news coverage, ahead of our text commentary stream of the UCL league stage tie.",
      "url": "https://www.aljazeera.com/sports/liveblog/2026/1/20/live-inter-milan-vs-arsenal-uefa-champions-league?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 17:00:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘A deal is a deal’: EU blasts Trump’s Greenland tariffs in Davos",
      "description": "EU chief Ursula von der Leyen questioned Donald Trump’s trustworthiness after his proposed tariffs over Greenland.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/a-deal-is-a-deal-eu-blasts-trumps-greenland-tariffs-in-davos?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 16:28:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Baby girl in Gaza dies from cold amid Israeli aid restrictions",
      "description": "Shaza Abu Jarad became the ninth child in Gaza to die from cold weather this winter amid Israeli aid restrictions.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/20/baby-girl-in-gaza-dies-from-cold-amid-israeli-aid-restrictions?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 16:22:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Act fast’: How speed defined the start of Donald Trump’s second term",
      "description": "The first year of the US president’s second term has been a whirlwind of activity. What does that mean for democracy?",
      "url": "https://www.aljazeera.com/news/longform/2026/1/20/act-fast-how-speed-defined-the-start-of-trumps-second-term?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 16:18:46 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON: To walk or not to walk?",
      "description": "In the #AFCON25 final between Morocco and Senegal, for a few minutes, the outcome risked being shaped by the rulebook",
      "url": "https://www.aljazeera.com/video/game-theory/2026/1/20/afcon-to-walk-or-not-to-walk?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 16:16:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A year in images: Donald Trump’s return to the White House",
      "description": "Explore some of the images and headlines that defined the first year of Trump's second term as US president.",
      "url": "https://www.aljazeera.com/news/longform/2026/1/20/a-year-in-images-donald-trumps-return-to-the-white-house?traffic_source=rss",
      "published": "Tue, 20 Jan 2026 16:16:10 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Chinese tourists shun Japan in wake of Taiwan invasion row",
      "description": "Number of high-spending Chinese tourists visiting Japan halved last month after PM said an invasion of Taiwan could spark Japanese military involvement Chinese tourism to Japan almost halved in December amid a bitter diplomatic row between Beijing and Tokyo over the security of Taiwan . The number of tourists from mainland China dropped by about 45% from the same month a year earlier to about 330,000, Japan’s transport ministry said on Tuesday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/20/chinese-japan-tourist-numbers-halve-wake-taiwan-invasion-row",
      "published": "Tue, 20 Jan 2026 04:58:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.247°W Depth 8.80 km (5.47 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-20T20:11:17.365Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-20T20:06:23.611Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-20T03:35:57.734Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says U.K. return of Chagos Islands to Mauritius is a reason to acquire Greenland",
      "description": "The president previously supported Britain's agreement to hand back sovereignty of the Indian Ocean archipelago, where the U.K. continues to lease the U.S.-U.K. Diego Garcia military base.",
      "url": "https://www.npr.org/2026/01/20/g-s1-106549/chagos-uk-trump-diego-garcia-mauritius-greenland",
      "published": "Tue, 20 Jan 2026 13:19:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's birth rate fell to a record low last year despite attempts to boost it",
      "description": "Despite government efforts to boost fertility, China's birth rate fell to a record low in 2025.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5682326/chinas-birth-rate-fell-to-a-record-low-last-year-despite-attempts-to-boost-it",
      "published": "Tue, 20 Jan 2026 06:44:14 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's Board of Peace has several invited leaders trying to figure out how it'll work",
      "description": "It's unclear how many leaders have been asked to join the board, and the large number of invitations being sent out, including to countries that don't get along, has raised questions about the board's mandate and decision-making processes.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5682816/trumps-board-of-peace-has-several-invited-leaders-trying-to-figure-out-how-itll-work",
      "published": "Tue, 20 Jan 2026 06:01:23 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India tightened its egg donation rules, creating a vibrant black market for sellers",
      "description": "India radically tightened its rules on egg donation to make it altruistic, but that move triggered a vibrant black market for human eggs.",
      "url": "https://www.npr.org/2026/01/20/nx-s1-5653357/india-tightened-its-egg-donation-rules-creating-a-vibrant-black-market-for-sellers",
      "published": "Tue, 20 Jan 2026 04:49:13 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel demolishes structures inside UNRWA compound",
      "description": "Israel banned the UN agency for Palestinian refugees last year, claiming it had been infiltrated by militants, a charge the United Nations strongly denies.",
      "url": "https://www.dw.com/en/israel-demolishes-structures-inside-unrwa-compound/a-75583759?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 17:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany updates: Majority of Germans reject Teslas",
      "description": "In a recent survey, some 60% of Germans said buying a Tesla was \"completely out of the question,\" Meanwhile, the German military has filled its ranks to highest levels in over a decade. DW has more.",
      "url": "https://www.dw.com/en/germany-updates-majority-of-germans-reject-teslas/live-75574052?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 16:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "High inflation in Nigeria weighs heavily on everyday life",
      "description": "Nigerians are grappling with rising inflation, particularly in food prices, driven by subsidy cuts. President Bola Tinubu's government hopes that such measures will improve the situation in the long term.",
      "url": "https://www.dw.com/en/high-inflation-in-nigeria-weighs-heavily-on-everyday-life/a-75503303?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 13:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How bringing back a humble algae to Arctic waters makes all the difference",
      "description": "For decades researchers in northern Norway had tried to bring back vital kelp forests after overfishing damaged marine ecosystems. Now a simple solution is proving successful.",
      "url": "https://www.dw.com/en/how-bringing-back-a-humble-algae-to-arctic-waters-makes-all-the-difference/a-75182003?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 10:31:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran's economic woes expose regime's tight grip",
      "description": "As religious elites and Revolutionary Guards strengthen their hold on the economy, experts question how long the regime can survive.",
      "url": "https://www.dw.com/en/iran-s-economic-woes-expose-regime-s-tight-grip/a-75567127?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 10:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Like potatoes? Berlin is giving away 4 million kilos",
      "description": "As an initiative redistributes a bumper surplus of spuds, here's a look at the Germans' great love affair with the potato.",
      "url": "https://www.dw.com/en/like-potatoes-berlin-is-giving-away-4-million-kilos/a-75524577?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 20 Jan 2026 08:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bully Pulpit: One year on, Trump tests limits of executive power",
      "description": "Back with a vengeance. On the first anniversary of his second inauguration, Donald Trump using all the levers at his disposal to enact retribution on his adversaries at home and the guardians of the old liberal order abroad.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260120-bully-pulpit-one-year-on-trump-tests-limits-of-executive-power",
      "published": "Tue, 20 Jan 2026 19:15:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French far-right leader Le Pen takes the stand, denies party had ‘system’ to embezzle EU funds",
      "description": "Far-right French leader Marine Le Pen at an appeals trial on Tuesday rejected allegations that her party had any \"system\" to embezzle European Parliament funds. A French court last year barred Le Pen from running for office for five years over a fake jobs scam at the European institution.",
      "url": "https://www.france24.com/en/france/20260120-french-far-right-leader-le-pen-takes-the-stand-denies-party-had-system-to-embezzle-eu-funds",
      "published": "Tue, 20 Jan 2026 18:13:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syrian government forces advance in northeast as Kurds vow to resist",
      "description": "Syrian government forces on Tuesday made further gains in the northeastern region long held by the Kurdish-led Syrian Democratic Forces (SDF), according to Syrian military sources. Kurdish fighters have vowed to defend their remaining enclaves in a bid to stem the biggest shift in territorial control in Syria since Bashar al-Assad fall in 2024.",
      "url": "https://www.france24.com/en/middle-east/20260120-syrian-government-forces-advance-in-northeast-as-kurds-vow-to-resist",
      "published": "Tue, 20 Jan 2026 15:17:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "As Trump brands decision 'act of great stupidity' - what is in the Chagos Islands deal?",
      "description": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base.",
      "url": "https://news.sky.com/story/what-is-in-the-chagos-islands-deal-and-why-is-it-controversial-13496512",
      "published": "Tue, 20 Jan 2026 08:38:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's extraordinary letter to Norway about Greenland - in full and fact-checked",
      "description": "The letter from US President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary.",
      "url": "https://news.sky.com/story/trumps-extraordinary-letter-to-norway-about-greenland-in-full-and-fact-checked-13496272",
      "published": "Mon, 19 Jan 2026 15:40:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What to know about the Chagos Islands as Trump slams the UK's sovereignty deal",
      "description": "President Trump has criticized a deal between Britain and Mauritius over the Chagos Islands, calling it \"an act of GREAT STUPIDITY.\"",
      "url": "https://abcnews.go.com/International/wireStory/chagos-islands-trump-slams-uks-sovereignty-deal-129375040",
      "published": "Tue, 20 Jan 2026 06:58:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK approves a ‘mega’ Chinese Embassy in London despite criticism of security risks",
      "description": "Britain's government has approved a massive new Chinese Embassy in central London",
      "url": "https://abcnews.go.com/International/wireStory/uk-approves-mega-chinese-embassy-london-despite-criticism-129374853",
      "published": "Tue, 20 Jan 2026 07:02:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "ASEAN won't endorse election in military-ruled Myanmar, Malaysia says",
      "description": "Malaysia-s foreign minister says The Association of Southeast Asian Nations will not endorse elections in military-ruled Myanmar",
      "url": "https://abcnews.go.com/International/wireStory/asean-endorse-election-military-ruled-myanmar-malaysia-129373796",
      "published": "Tue, 20 Jan 2026 06:50:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Marine Le Pen faces crucial Paris appeals trial over misuse of EU funds",
      "description": "Marine Le Pen's political future is uncertain as she faces an appeals trial in Paris",
      "url": "https://abcnews.go.com/International/wireStory/marine-le-pen-faces-crucial-paris-appeals-trial-129372031",
      "published": "Tue, 20 Jan 2026 01:21:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Anti-ICE agitator defends invading church, claims 'it's what needed to be done'",
      "description": "Anti-ICE agitators disrupted a Minnesota church service, with a Black Lives Matter leader claiming it \"needed to be done\" after a pastor was linked to ICE.",
      "url": "https://www.foxnews.com/us/anti-ice-agitator-defends-invading-church-claims-its-what-needed-done",
      "published": "Tue, 20 Jan 2026 13:19:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Video shows anti-ICE agitator berating Christians in Minnesota church service",
      "description": "An anti-U.S. Immigration and Customs Enforcement agitator berated churchgoers during a service at Cities Church in Minneapolis on Sunday.",
      "url": "https://www.foxnews.com/us/video-shows-anti-ice-agitator-berating-christians-minnesota-church-service",
      "published": "Tue, 20 Jan 2026 13:03:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ex-husband charged in Ohio dentist murders allegedly tried to 'disguise' himself with fake information: expert",
      "description": "Ohio dentist double murder case takes turn as accused ex-husband allegedly used fake address and phone number to \"disguise\" himself before killings.",
      "url": "https://www.foxnews.com/us/ex-husband-charged-ohio-dentist-murders-allegedly-tried-disguise-himself-fake-information-expert",
      "published": "Tue, 20 Jan 2026 08:00:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Man stabbed, officer assaulted as fight breaks out after MLK Day parade in Los Angeles",
      "description": "Los Angeles Police respond to an alleged stabbing, and an officer was assaulted following the Martin Luther King Jr. parade as multiple fights broke out.",
      "url": "https://www.foxnews.com/us/man-stabbed-officer-assaulted-fight-breaks-out-after-mlk-day-parade-los-angeles",
      "published": "Tue, 20 Jan 2026 06:06:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Judge presiding over Tyler Robinson case urged to rein in defense delay tactics",
      "description": "Utah judge urged to crack down on defense delay tactics in Tyler Robinson case as legal analysts call motions \"frivolous\" in assassination charges.",
      "url": "https://www.foxnews.com/us/judge-presiding-over-tyler-robinson-case-urged-rein-defense-delay-tactics",
      "published": "Tue, 20 Jan 2026 06:00:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump confirms he invited Putin to join his Board of Peace: 'He's been invited'",
      "description": "U.S. President Donald Trump on Monday confirmed Russian President Vladimir Putin was invited to the Board of Peace for supervision of the Gaza plan.",
      "url": "https://www.foxnews.com/world/trump-confirms-he-invited-putin-join-his-board-peace-hes-been-invited",
      "published": "Tue, 20 Jan 2026 02:40:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Denmark ramps up defenses in Greenland as Trump zeros in on control of territory",
      "description": "Denmark deploys additional troops to Greenland after President Donald Trump claims the island is not secure from Russia or China.",
      "url": "https://www.foxnews.com/world/denmark-ramps-up-defenses-greenland-trump-zeros-control-territory",
      "published": "Mon, 19 Jan 2026 20:09:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}