{
  "last_updated": "2026-01-26T19:44:55.299517Z",
  "event_count": 225,
  "events": [
    {
      "title": "Crocodile warnings as floods devastate southern Africa",
      "description": "More than 100 people killed and hundreds of thousands displaced in South Africa, Mozambique and Zimbabwe Devastating floods have killed more than 100 people in southern Africa since the beginning of the year and displaced hundreds of thousands, as authorities and aid workers warn of hunger, cholera and attacks by crocodiles that have spread with the waters. More than 70 people have died in Zimbabwe and 30 in South Africa, where hundreds of people were evacuated from Kruger national park earlier this month after a deluge of rain . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/crocodile-warnings-floods-devastate-southern-africa",
      "published": "Mon, 26 Jan 2026 13:44:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Above the law? Outrage over ICE killings in Minneapolis",
      "description": "17 days after the shooting death of Renée Good, masked Immigration and Customs Enforcement agents in Minneapolis again shooting dead a US citizen, this time 37-year old Alex Pretti. Again, there's video evidence to contradict official narrative that the the victims were acting as domestic terrorists, the race to gather evidence before it can be tainted or destroyed, media echo chambers, and a US president who watches from on high.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260126-above-the-law-outrage-over-ice-killings-in-minneapolis",
      "published": "Mon, 26 Jan 2026 19:13:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Narratives clash after Trump and victim's family react to second Minneapolis shooting",
      "description": "Narratives clashed over shooting death of Minneapolis nurse Alex Pretti this weekend, with the Trump administration calling him a \"domestic terrorist.\"",
      "url": "https://www.foxnews.com/us/narratives-clash-after-trump-victims-family-react-second-minneapolis-shooting",
      "published": "Sun, 25 Jan 2026 09:39:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns ‘law of the jungle’ is replacing rule of law",
      "description": "Warning that the “rule of law is being replaced by the law of the jungle,” the UN Secretary-General on Monday urged world powers to recommit to international law as the foundation of peace, justice and multilateral cooperation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166832",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of rising internet shutdowns as digital blackouts spread worldwide",
      "description": "A rising trend towards government-enforced internet shutdowns – with at least 300 incidents in more than 54 countries over the last two years – is prompting renewed warnings from the UN about the threat these digital blackouts pose to freedom of expression, access to information and human rights.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166813",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Greece: Cookie factory blast leaves 3 dead",
      "description": "Emergency crews have been battling a major overnight fire after an explosion tore through a food production plant in central Greece. Three people were discovered dead with an investigation underway.",
      "url": "https://www.dw.com/en/greece-cookie-factory-blast-leaves-3-dead/a-75660911?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 11:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly Indonesian landslide leaves dozens missing",
      "description": "At least 17 people have been confirmed dead after a landslide in Indonesia's West Java province last weekend. More than 20 naval officers are said to be among those who were trapped by the disaster.",
      "url": "https://www.dw.com/en/deadly-indonesian-landslide-leaves-dozens-missing/a-75657596?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 10:13:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Iran in the Human Rights Council, Myanmar election ‘fraud’, migration chief in Cyprus, Mozambique flood update",
      "description": "Disturbing details continued to emerge on Friday about Iran’s State-led crackdown against mass protests, while UN rights chief Volker Türk expressed deep concern that demonstrators could be executed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166819",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime reportedly issued nationwide shoot-to-kill orders as protest death toll surges",
      "description": "Iran protest death toll estimates range from several thousand to over 35,000 as brutal crackdown intensifies. Medical data reveals shocking scale of violence.",
      "url": "https://www.foxnews.com/world/iran-regime-reportedly-issued-nationwide-shoot-to-kill-orders-protest-death-toll-surges",
      "published": "Mon, 26 Jan 2026 13:10:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "After Trump strikes Islamist terrorists, US general travels to Nigeria with militants 'on the run'",
      "description": "Lt. Gen. John Brennan details U.S. military support helping Nigerian forces combat Islamic State and Boko Haram terrorists following strikes that disrupted terror networks.",
      "url": "https://www.foxnews.com/world/after-trump-strikes-islamist-terrorists-us-general-travels-nigeria-militants-on-run",
      "published": "Sun, 25 Jan 2026 12:23:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Another Christian community at risk in Africa as extremists and war take their toll",
      "description": "Sudan's civil war has reportedly killed 150,000 people and displaced 13 million as Christians face daily terror. Government forces allegedly killed 11 Christians on Christmas Day.",
      "url": "https://www.foxnews.com/world/another-christian-community-risk-africa-extremists-war-take-toll",
      "published": "Sat, 24 Jan 2026 12:55:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Gunmen open fire at football match in Mexico, killing at least 11",
      "description": "Mayor of Salamanca in Guanajuato state says attack is part of ‘wave of violence’ as he appeals to president for help Gunmen opened fire at a football match in central Mexico on Sunday, killing at least 11 people and wounding 12, in the latest outburst of violence in Guanajuato state. César Prieto, the mayor of the town of Salamanca in central Guanajuato state, said in a statement posted to social media platforms that the gunmen arrived at the end of a match. Ten people died at the scene and one died later at a hospital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/gunmen-invade-salamanca-football-match-guanajuato-mexico-crime",
      "published": "Mon, 26 Jan 2026 16:19:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Iran warns any attack will mean 'all-out war' after Trump says US 'armada' on its way",
      "description": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region.",
      "url": "https://news.sky.com/story/iran-warns-any-attack-will-mean-all-out-war-after-trump-says-us-armada-on-its-way-13498251",
      "published": "Sat, 24 Jan 2026 01:13:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "US withdrawal from WHO ‘risks global safety’, agency says in detailed rebuttal",
      "description": "The World Health Organization (WHO) has issued a detailed statement regretting the United States decision to leave the UN agency, and declaring that it will leave both the US and the world less safe as a result.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166828",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "25 killed in attack by Islamic State-backed group in eastern Congo, rights group says",
      "description": "A militant group linked to the Islamic State has attacked eastern Congo, killing at least 25 people",
      "url": "https://abcnews.go.com/International/wireStory/25-killed-attack-islamic-state-backed-group-eastern-129549813",
      "published": "Sun, 25 Jan 2026 18:57:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UK supermarkets push for Amazon soy safeguards after traders abandon ban",
      "description": "European retailers urge traders to adhere to commitments after Brazilian lawmakers wreck forest protection pact Leading British and European retailers are trying to salvage the core elements of the Amazon soy moratorium after the world’s most successful forest protection agreement was wrecked by Brazilian lawmakers and abandoned by international traders. In an open letter, high street brands including Tesco, Sainsbury’s and Asda say the breakdown this month of the 20-year-old agreement will damage consumer confidence unless new arrangements are put in place to ensure grain production is not linked to deforestation. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/26/uk-supermarkets-push-for-amazon-soy-safeguards-after-brazil-scraps-ban",
      "published": "Mon, 26 Jan 2026 17:43:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Killing of K’gari dingoes in wake of backpacker’s death could create ‘extinction vortex’, expert says",
      "description": "Queensland government says it has already killed six of the 10 dingoes seen near the body of 19-year-old Piper James Get our breaking news email , free app or daily news podcast Dingo experts have said a decision to kill a 10-strong pack of the animals linked with the death of Canadian tourist Piper James on K’gari could push the island’s population towards extinction while doing little to protect humans. The Queensland government revealed on Sunday it had already killed six of the pack seen around the body of the 19-year-old in a move that has angered the island’s traditional owners who have said they were not consulted. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/27/killing-of-kgari-dingoes-in-wake-of-backpackers-death-could-create-extinction-vortex-expert-says",
      "published": "Mon, 26 Jan 2026 14:00:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US government shutdown looms as Democrats reject DHS funding over ICE issues",
      "description": "A US government shutdown is increasingly likely as Democratic Senators refuse to approve the DHS funding bill, following the fatal shooting of a second US citizen by federal agents in Minneapolis. Key Democrats, including Chuck Schumer, Catherine Cortez Masto, and Patty Murray, demand changes to ICE operations before backing the bill. Without a resolution, the funding package could miss the January 31st deadline.",
      "url": "https://www.france24.com/en/us-government-shutdown-looms-as-democrats-reject-dhs-funding-over-ice-issues",
      "published": "Mon, 26 Jan 2026 15:57:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Appeal trial over 2020 teacher's beheading opens in France",
      "description": "An appeal trial opened in Paris on Monday for four men convicted over the 2020 beheading of schoolteacher Samuel Paty, which shocked France. Paty, 47, was murdered by an 18-year-old Islamist radical for showing cartoons of the Prophet Mohammed in class. His attacker, Abdoullakh Anzorov, was killed in a police shootout. In December 2024, eight individuals were found guilty of fostering the climate of hatred leading to Paty’s death. Our journalist Claire Paccalin has the latest from the Paris court.",
      "url": "https://www.france24.com/en/appeal-trial-over-2020-teacher-s-beheading-opens-in-france",
      "published": "Mon, 26 Jan 2026 14:10:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Explosion at cookie factory in central Greece kills at least 4",
      "description": "An explosion and fire at a cookie factory in central Greece killed at least four workers and left one person unaccounted for",
      "url": "https://abcnews.go.com/International/wireStory/explosion-cookie-factory-central-greece-kills-4-129556195",
      "published": "Mon, 26 Jan 2026 04:36:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: UN and rights experts warn against risk of mass violence in Jonglei",
      "description": "The UN Mission in South Sudan (UNMISS) is sounding the alarm over the threat of escalating violence in Jonglei state which is putting lives at risk and further weakening prospects for peace.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166831",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN rights chief decries US treatment of migrants, as deaths in ICE custody rise",
      "description": "The UN’s top human rights official has raised alarm over what he described as the growing dehumanisation of migrants in the United States, warning that current immigration enforcement practices are undermining due process, family unity and basic human dignity.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166816",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Lindsey Graham says there's 'strong consensus' to protect Kurds as Syrian forces advance on territory",
      "description": "Sen. Lindsey Graham and former Secretary of State Mike Pompeo warn of dire threats to Syrian Kurds as Syrian forces attack Kurdish-controlled territory in northern Syria.",
      "url": "https://www.foxnews.com/world/lindsey-graham-says-strong-consensus-protect-kurds-syrian-forces-advance-territory",
      "published": "Sat, 24 Jan 2026 17:45:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "ICE under scrutiny amid rising protests over deadly shootings",
      "description": "Protests continue in the US after a second American citizen was killed by immigration agents in Minneapolis. ICE, created in 2002, has been heavily utilized under President Trump’s administration, with a focus on mass deportations and aggressive tactics. The agency's rapid expansion and controversial operations, including deporting US citizens and documented immigrants, have raised concerns about oversight and the quality of training for new recruits.",
      "url": "https://www.france24.com/en/ice-under-scrutiny-amid-rising-protests-over-deadly-shootings",
      "published": "Mon, 26 Jan 2026 17:27:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Winter attacks in Ukraine, looming food aid cuts in Nigeria, drought in Kenya",
      "description": "Russian forces launched a fresh wave of strikes across Ukraine this week which have left hundreds of thousands of families without electricity and heating amid freezing temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166810",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Advantage China: Trump’s tantrums push US allies closer to Beijing",
      "description": "In the search for stability, some western nations are turning to a country that many in Washington see as an existential threat If geopolitics relies at least in part on bonhomie between global leaders, China made an unexpected play for Ireland’s good graces when the taoiseach visited Beijing this month. Meeting Ireland’s leader, Micheál Martin, in the Great Hall of the People in Beijing, China’s president, Xi Jinping, said a favourite book of his as a teenager was The Gadfly, by the Irish author Ethel Voynich, a novel set in the revolutionary fervour of Italy in the 1840s. “It was unusual that we ended up discussing The Gadfly and its impact on both of us but there you are,” Martin told reporters in Beijing. Continue reading...",
      "url": "https://www.theguardian.com/news/ng-interactive/2026/jan/25/china-europe-canada-charm-offensive-trump",
      "published": "Sun, 25 Jan 2026 11:06:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump warned off Iran strikes in 'you will reap the whirlwind' threat",
      "description": "A new mural warning the US not to launch a military strike on Iran has been unveiled in a square in central Tehran.",
      "url": "https://news.sky.com/story/iran-unveils-mural-warning-us-not-to-launch-military-strike-13498878",
      "published": "Sun, 25 Jan 2026 15:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian drone swarms pose 'credible threat' to USS Abraham Lincoln carrier group, defense expert says",
      "description": "USS Abraham Lincoln strike group approaches Middle East amid warnings that Iranian drone capabilities worth \"tens of millions of dollars\" threaten U.S. naval vessels.",
      "url": "https://www.foxnews.com/world/iranian-drone-swarms-pose-credible-threat-uss-abraham-lincoln-carrier-group-defense-expert-says",
      "published": "Sun, 25 Jan 2026 21:00:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How the Oct 7 Hamas terror attacks exposed long-running concerns about UNRWA, new film charges",
      "description": "Tracing UNRWA from 1949 to today, the film examines refugee policy, weak oversight and alleged links to Hamas control in Gaza, raising questions about the agency’s role and accountability.",
      "url": "https://www.foxnews.com/world/how-oct-7-hamas-terror-attacks-exposed-long-running-concerns-about-unrwa-new-film-charges",
      "published": "Sun, 25 Jan 2026 12:43:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "As US ‘armada’ approaches, Iran warns of dire consequences if attacked",
      "description": "Iranian authorities are keeping the population offline for a third week amid lingering threats of another war.",
      "url": "https://www.aljazeera.com/news/2026/1/26/as-us-armada-approaches-iran-warns-of-dire-consequences-if-attacked?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 16:19:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gunfire, arson and vandalism: Tracking political violence in America",
      "description": "Political violence timeline reveals shocking attacks on Republicans, Democrats and foreign embassy workers with \"assassination culture\" on the rise.",
      "url": "https://www.foxnews.com/us/gunfire-arson-vandalism-tracking-political-violence-america",
      "published": "Mon, 26 Jan 2026 06:00:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Is the Trump administration’s immigration crackdown working?",
      "description": "There has been a second fatal shooting in the US state of Minnesota this month.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/26/is-the-trump-administrations-immigration-crackdown-working?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 18:47:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Biscuit factory explosion in Greece kills at least four",
      "description": "An overnight explosion at a biscuit factory in Trikala, Greece, has killed at least four workers.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/biscuit-factory-explosion-in-greece-kills-at-least-four?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 15:29:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the sovereignty of the country’: Guinea-Bissau says US vaccine study suspended",
      "description": "Despite US pushback, officials in west Africa say controversial hepatitis B study on pause amid ethics concerns US health officials insisted it was still on. African health leaders said it was cancelled . At the heart of the controversy is the west African nation of Guinea-Bissau – one of the poorest countries in the world and the proposed site of a hotly debated US-funded study on vaccines. The study on hepatitis B vaccination, to be led by Danish researchers, became a flashpoint after major changes to the US vaccination schedule and prompted questions about how research is conducted ethically in other countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/guinea-bissau-hepatitis-b-vaccine-study",
      "published": "Fri, 23 Jan 2026 17:09:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "At least 18 people dead as Philippines ferry with 350 onboard sinks",
      "description": "Rescuers save at least 316 after inter-island ferry sank en route from city of Zamboanga to southern Jolo island A ferry with more than 350 people onboard sank early on Monday near an island in the southern Philippines, killing at least 18 people, officials said. Rescuers saved hundreds more, while a fleet of coastguard and naval ships searched for those still missing. Coastguard officials said the cargo and passenger ferry apparently encountered technical problems and sank after midnight. The steel-hulled vessel abruptly tilted to one side and took on water, hurling people into the sea in the darkness, according to a rescued passenger who lost his six-month-old baby. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/philippines-ferry-capsizes-sinks-death-toll",
      "published": "Mon, 26 Jan 2026 13:55:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Hundreds rescued from deadly ferry disaster in Philippines",
      "description": "An inter-island ferry with more than 350 on board has sunk in the southern Philippines after midnight and rescuers have saved at least 316 passengers and retrieved 15 bodies",
      "url": "https://abcnews.go.com/International/wireStory/ferry-carrying-350-people-sinks-southern-philippines-rescuers-129550025",
      "published": "Mon, 26 Jan 2026 01:53:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Florida deputies race to save 4-year-old who stopped breathing and had no pulse on interstate, video shows",
      "description": "Florida deputies heroically rescued a 4-year-old boy who stopped breathing on Interstate 275, performing life-saving CPR after a medical emergency.",
      "url": "https://www.foxnews.com/us/florida-deputies-race-save-4-year-old-who-stopped-breathing-had-no-pulse-interstate-video",
      "published": "Mon, 26 Jan 2026 13:18:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Heatwave warnings across Australia as millions celebrate national day",
      "description": "Temperatures are expected to peak on Tuesday, reaching the \"high forties\" in Victoria and South Australia.",
      "url": "https://www.bbc.com/news/articles/cz6y7nxx5jvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 07:15:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Winter storm causes deaths, power outages and flight cancellations in US",
      "description": "At least 819,000 homes and businesses are without power, and travel is disrupted nationwide.",
      "url": "https://www.aljazeera.com/news/2026/1/26/winter-storm-causes-deaths-power-outages-and-flight-cancellations-in-us?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 14:58:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Gustavo Petro: Colombia’s former rebel fighter turned president",
      "description": "From urban rebel to senator facing death threats, what drives Petro, 65, the country’s first progressive president?",
      "url": "https://www.aljazeera.com/features/2026/1/26/gustavo-petro-colombias-former-rebel-fighter-turned-president-2?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 14:41:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "China’s top general under investigation for alleged violations amid corruption crackdown",
      "description": "Zhang Youxia, long seen as Xi Jinping’s closest military ally, reportedly accused of leaking nuclear secrets to US China’s military leadership is in turmoil after its most senior general – a close ally of Xi Jinping – was placed under investigation for “suspected serious violations of discipline and law”. Zhang Youxia is the joint vice-chairperson of the Central Military Commission (CMC), the ruling body of China’s People’s Liberation Army (PLA). Second only to Xi in the military command structure, Zhang has long been seen as the Chinese president’s closest military ally. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/china-top-ranking-general-zhang-youxia-investigation",
      "published": "Mon, 26 Jan 2026 01:40:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Interpol arrests more than 3,700 suspects in global trafficking crackdown",
      "description": "A global crackdown on human traffickers and migrant smugglers coordinated by Interpol has led to the arrest of more than 3,700 suspects and aided over 4,400 potential trafficking victims around the world",
      "url": "https://abcnews.go.com/International/wireStory/interpol-arrests-3700-suspects-global-trafficking-crackdown-129560370",
      "published": "Mon, 26 Jan 2026 09:40:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Historic winter storm kills at least in the United States",
      "description": "The #snowstorm barrelling through the United States is considered to be one of the worst #winter episodes the country has known in several decades. At least 10 have died. In some area, #temperatures could drop as low as -45°C.",
      "url": "https://www.france24.com/en/video/20260126-historic-winter-storm-kills-at-least-in-the-united-states",
      "published": "Mon, 26 Jan 2026 15:17:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Minnesota school board member Chauntyll Allen ripped by state lawmaker after anti-ICE church invasion arrest",
      "description": "Saint Paul school board member storms church with protesters, which sparked DOJ investigation after targeting pastor allegedly working as ICE agent.",
      "url": "https://www.foxnews.com/us/minnesota-school-board-member-chauntyll-allen-ripped-by-state-lawmaker-after-anti-ice-church-invasion-arrest",
      "published": "Sun, 25 Jan 2026 10:00:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "USS Abraham Lincoln Aircraft Carrier Strike Group makes move amid threat from Iran",
      "description": "USS Abraham Lincoln entered CENTCOM waters Monday amid escalating threats from Iran and the potential for a \"credible\" drone attack on the U.S.",
      "url": "https://www.foxnews.com/world/uss-abraham-lincoln-aircraft-carrier-strike-group-makes-move-threat-iran",
      "published": "Mon, 26 Jan 2026 06:58:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Death toll from Indonesia landslide rises to 17 as dozens remain missing",
      "description": "Among the 42 people missing after landslide in West Java, 19 were members of Indonesia’s elite marine force.",
      "url": "https://www.aljazeera.com/news/2026/1/26/death-toll-from-indonesia-landslide-rises-to-17-as-dozens-remain-missing?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 18:45:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ukrainians are sharing hacks online on how to survive winter power cuts",
      "description": "After repeated Russian attacks on Ukraine's energy grid, Ukrainians face long outages during a cold winter at war. On social media, Ukrainians share tips for keeping warm at home.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5686455/ukraine-winter-power-outage",
      "published": "Mon, 26 Jan 2026 13:24:44 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Focus turns to future of Gaza after final hostage remains returned to Israel",
      "description": "Ran Gvili was one of the first Israelis killed on 7 October 2023 when Hamas fighters poured into Israel and launched their ferocious attack.",
      "url": "https://news.sky.com/story/focus-turns-to-future-of-gaza-after-final-hostage-remains-returned-to-israel-13499322",
      "published": "Mon, 26 Jan 2026 17:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Dozens still missing after Indonesia landslide kills at least 25 people",
      "description": "Dozens of people are still missing following a landslide on Indonesia's Java island on Saturday that killed at least 25 people.",
      "url": "https://news.sky.com/story/dozens-still-missing-after-landslide-on-indonesias-java-island-kills-at-least-11-people-13498297",
      "published": "Sat, 24 Jan 2026 10:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UN envoy highlights ‘window to advance peace’ in Colombia",
      "description": "The new year provides an opportunity for Colombia to keep advancing towards lasting peace, a decade after a landmark accord that ended more than 50 years of conflict, the UN Special Representative told the Security Council on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166818",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Italy’s Meloni rebukes Trump remarks on NATO’s role in Afghanistan",
      "description": "Italian PM Giorgia Meloni calls Trump's NATO comments about Afghanistan \"unacceptable,\" defending Italy's sacrifice of 53 soldiers killed in the conflict.",
      "url": "https://www.foxnews.com/world/italys-meloni-rebukes-trump-remarks-natos-role-afghanistan",
      "published": "Sun, 25 Jan 2026 14:10:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "'This is horrifying' - Minneapolis residents reel from second deadly shooting",
      "description": "Two people have been shot dead by federal agents in the city in recent weeks, leaving many angry and frustrated.",
      "url": "https://www.bbc.com/news/articles/cvg50vv1ezko?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 03:50:14 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Terror in the trees: Why extremists take cover in Nigeria's forests",
      "description": "Armed groups use Nigeria's forest reserves as bases, illicit trade hubs and to terrorize communities. A new government strategy hopes to claw back control over the conservation areas.",
      "url": "https://www.dw.com/en/terror-in-the-trees-why-extremists-take-cover-in-nigeria-s-forests/a-75661454?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 13:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "ICC judges find former Philippine president Rodrigo Duterte fit to stand trial",
      "description": "Judges at the International Criminal Court have ruled that former Philippine President Rodrigo Duterte is fit to stand trial",
      "url": "https://abcnews.go.com/International/wireStory/icc-judges-find-former-philippine-president-rodrigo-duterte-129556516",
      "published": "Mon, 26 Jan 2026 05:55:04 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘Cycle of attacks must end’: Lead UN official in Ukraine",
      "description": "The senior UN official in Ukraine, Matthias Schmale, has issued a condemnation of the massive overnight Russian drone and missile strike on several major Ukrainian cities, killing and injuring civilians, and knocking out energy infrastructure amid sub-zero temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166825",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Gunmen storm Mexico football pitch and kill at least 11 people",
      "description": "The incident happened in Salamanca, a city particularly subject to gang-related violence.",
      "url": "https://www.bbc.com/news/articles/cp80419gggro?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 11:29:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Greece biscuit factory fire leaves at least four dead",
      "description": "A search is continuing for one person still missing after a blaze broke out at a biscuit factory near the city of Trikala.",
      "url": "https://www.bbc.com/news/articles/c89q5q8leeqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 12:48:17 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "EU agrees on complete ban of Russian gas imports by 2027",
      "description": "The European Union has taken another step toward ending its energy reliance on Russia by agreeing to stop gas imports from the country. But not all countries voted in favor of the ban.",
      "url": "https://www.dw.com/en/eu-agrees-on-complete-ban-of-russian-gas-imports-by-2027/a-75660043?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 11:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Gaza faces firewood shortage and harsh winter conditions",
      "description": "The dire conditions in Gaza persist as residents struggle with a lack of basic necessities, including cooking gas and electricity. Many families rely on expensive firewood to cook and stay warm during the cold winter months, while some 10 children have died from hypothermia since winter began. Despite the US administration's promises to rebuild Gaza, the situation remains dire, with many still living in tents and damaged buildings, and aid efforts, including soup kitchens, working desperately to meet basic needs.",
      "url": "https://www.france24.com/en/gaza-faces-firewood-shortage-and-harsh-winter-conditions",
      "published": "Mon, 26 Jan 2026 16:29:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Residents in Venezuela describe climate of fear and uncertainty after Maduro’s fall",
      "description": "Following the capture of Nicolas Maduro and his wife Cilia Flores by US forces on January 3, Venezuelans inside the country who welcomed the operation did not dare celebrate in the streets or online. Fears, fueled by “colectivos” patrolling the streets and an emergency order banning support for the US operation, kept them off the streets.",
      "url": "https://www.france24.com/en/tv-shows/the-observers/20260126-residents-venezuela-describe-climate-fear-uncertainty-maduro-fall",
      "published": "Mon, 26 Jan 2026 14:42:24 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "At least 15 dead and hundreds rescued after ferry sinks in southern Philippines",
      "description": "At least 15 people have died after a ferry sank in the southern Philippines overnight.",
      "url": "https://news.sky.com/story/at-least-15-dead-and-hundreds-rescued-after-ferry-sinks-in-southern-philippines-13499059",
      "published": "Mon, 26 Jan 2026 04:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria: Renewed clashes risk derailing fragile transition",
      "description": "A tense standoff between the Syrian Government and Kurdish-led forces in the country’s northeast risks igniting wider instability just as Syria struggles to emerge from years of conflict and authoritarian rule, senior UN officials told the Security Council on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166811",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Self-described Minn. Antifa member calls for 'armed' men to stop immigration agents he calls 'mass murderers'",
      "description": "Minneapolis Antifa activist Kyle Wagner demands armed response against federal immigration agents after two anti-ICE agitators killed this month.",
      "url": "https://www.foxnews.com/us/self-described-minn-antifa-member-calls-armed-men-stop-immigration-agents-he-calls-mass-murderers",
      "published": "Mon, 26 Jan 2026 13:59:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Plane with 8 on board crashes at Maine airport, leaving 7 dead: FAA",
      "description": "An airplane crashed in Maine on Sunday with eight individuals aboard, according to the Federal Aviation Administration, which noted that it and the NTSB would investigate.",
      "url": "https://www.foxnews.com/us/airplane-crashes-maine-airport-8-board-faa-says",
      "published": "Mon, 26 Jan 2026 09:03:05 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE agitators clash with federal agents at Minneapolis hotel, as agents deploy tear gas, flashbangs",
      "description": "Anti-ICE agitators clashed with federal agents at a Minneapolis hotel, with multiple arrests made, after Border Patrol killed an American citizen over the weekend.",
      "url": "https://www.foxnews.com/us/anti-ice-agitators-clash-federal-agents-minneapolis-hotel-agents-deploy-tear-gas-flashbangs",
      "published": "Mon, 26 Jan 2026 02:59:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Protests in Paris over death of migrant worker in police custody",
      "description": "Thousands of people are demanding justice in Paris after videos surfaced of the violent arrest of a Mauritian migrant.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/protests-in-paris-over-death-of-migrant-worker-in-police-custody?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 12:21:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russian strikes knock out heat in freezing Kyiv as peace talks continue",
      "description": "Russian strikes left much of Kyiv without heat, water and power during freezing temperature, even as Ukraine, Russia and the U.S. held talks on ending the nearly four-year war.",
      "url": "https://www.npr.org/2026/01/24/g-s1-107248/russia-strikes-kyiv-cold",
      "published": "Sat, 24 Jan 2026 19:42:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "From deepfakes to grooming: UN warns of escalating AI threats to children",
      "description": "The staggering amount of harmful AI-generated online content has prompted an urgent call from across the UN system for a raft of measures to protect children from abuse, exploitation and mental trauma.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166827",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Kansas elementary school teacher found dead in snow days after going missing",
      "description": "Kansas elementary school teacher Rebecca Rauber found dead after going missing from Emporia bar. Police say she may have succumbed to hypothermia during snowstorm.",
      "url": "https://www.foxnews.com/us/kansas-elementary-school-teacher-found-dead-snow-days-going-missing",
      "published": "Mon, 26 Jan 2026 13:57:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iran Revolutionary Guard commander says regime has 'finger on the trigger' as US warships head to Middle East",
      "description": "Iran's Revolutionary Guard chief warns the U.S. it has a \"finger on the trigger\" as American warships head to the Middle East amid anti-regime protests.",
      "url": "https://www.foxnews.com/world/iran-revolutionary-guard-commander-says-regime-has-finger-trigger-us-warships-head-middle-east",
      "published": "Sat, 24 Jan 2026 16:09:04 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Private jet carrying eight people crashes in Maine",
      "description": "Poor visibility was reported at the airport during a winter storm that has affected a large swathe of the US.",
      "url": "https://www.bbc.com/news/articles/cddgqqd0peno?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 16:51:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "France pays tribute to fallen soldiers in Afghanistan after Trump’s false NATO troops claim",
      "description": "A senior French Defence Ministry official on Monday laid a wreath at a monument in Paris dedicated to the 90 French soldiers who died in Afghanistan while serving in a NATO mission that began after the September 11, 2001, attacks. It came days after President Donald Trump's assertion that non-US troops avoided the front line, sparking outrage in other NATO member states.",
      "url": "https://www.france24.com/en/asia-pacific/20260126-france-pays-tribute-to-fallen-soldiers-in-afghanistan-after-trump-s-false-nato-troops-claim",
      "published": "Mon, 26 Jan 2026 15:18:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Syria: How Damascus tries to secure newly controlled areas",
      "description": "Damascus has secured a significant victory with the capture of several newly controlled areas, previously held by Kurdish-led forces, including YPG and PKK. While the ceasefire is mostly holding, security forces have been deployed to prevent civilians from reaching the frontlines and to maintain calm, especially in Kobane, where there is concern over potential vendettas. Additionally, government envoys are working to convince local tribes to stay peaceful. One of the ongoing challenges for Damascus is managing the prisons holding ISIS prisoners. FRANCE 24's Wassim Nasr has the latest.",
      "url": "https://www.france24.com/en/syria-how-damascus-tries-to-secure-newly-controlled-areas",
      "published": "Mon, 26 Jan 2026 15:11:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Indonesian marines among 80 missing in deadly West Java landslide",
      "description": "Nineteen Indonesian marines are among 80 people missing after a landslide in West Java province",
      "url": "https://abcnews.go.com/International/wireStory/indonesian-marines-80-missing-deadly-west-java-landslide-129556799",
      "published": "Mon, 26 Jan 2026 05:53:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Gaza reconstruction talks must not distract from massive needs, say UN aid agencies",
      "description": "Amid reconstruction talks on Gaza linked to President Trump's just-launched Board of Peace, UN aid agencies insisted on Friday that what Gazans need most is immediate relief from the ongoing humanitarian catastrophe there.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166815",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Grandson charged with murdering retired grandparents found dead in their South Carolina home",
      "description": "The grandson of a couple who were killed has been charged with murder in an upstate South Carolina case that has devastated a small community.",
      "url": "https://www.foxnews.com/us/grandson-charged-murdering-retired-grandparents-found-dead-south-carolina-home",
      "published": "Mon, 26 Jan 2026 12:08:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "New York boy, 15, missing after traveling to NYC to meet someone he met on Roblox, family says",
      "description": "Thomas Medlin, 15, was last seen at Grand Central in New York City on Jan. 9 after reportedly leaving Long Island to meet up with someone he met through Roblox.",
      "url": "https://www.foxnews.com/us/new-york-boy-15-missing-after-traveling-nyc-meet-someone-he-met-roblox-family-says",
      "published": "Sun, 25 Jan 2026 12:09:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Spain slashes speed limit on popular train route after fault found",
      "description": "The discovery of a crack on the Madrid-Barcelona line follows two recent deadly crashes in the country.",
      "url": "https://www.bbc.com/news/articles/ckgy049ypd5o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 15:17:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Services Australia has not applied child support law properly and some parents are owed money, report finds",
      "description": "Ombudsman says agency knew for years that part of its child support processing not in line with law Get our breaking news email , free app or daily news podcast Services Australia knew its internal practices relating to child support payments conflict with the law but did nothing about it for six years, a report from the commonwealth ombudsman has found. In 2019, the agency identified that its child support practice that stipulated that parents with less than 35% care of a child do not receive financial support was not aligned with the law. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/27/services-australia-has-not-applied-child-support-law-properly-and-some-parents-are-owed-money-report-finds",
      "published": "Mon, 26 Jan 2026 14:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Bunnings accused of ‘greenwashing’ timber amid concerns about supplier’s illegal logging",
      "description": "The Wilderness Society lodges complaint with consumer watchdog over hardware and garden chain’s sale of timber sourced from NSW Forestry Corporation Get our breaking news email , free app or daily news podcast One of Australia’s biggest environment groups has accused Bunnings of “greenwashing” its timber, claiming it may have sold products illegally logged by the New South Wales forestry agency. The Wilderness Society (TWS) has asked the Australian Competition and Consumer Commission to investigate the hardware and garden chain because it could be selling unlawfully logged timber, despite Bunnings’ policies and websites promoting responsible sourcing. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/27/bunnings-accused-of-greenwashing-timber-amid-concerns-about-suppliers-logging",
      "published": "Mon, 26 Jan 2026 14:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "China's top generals under investigation as country's leader clears out ranks",
      "description": "China announced two of its top generals are under investigation, including the country's most senior general. Analysts suspect it's a political purge by Chinese leader Xi Jinping.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5687896/chinas-top-generals-under-investigation-as-countrys-leader-clears-out-ranks",
      "published": "Mon, 26 Jan 2026 04:47:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Kremlin says Abu Dhabi talks 'constructive'",
      "description": "Moscow says trilateral talks with the US and Ukraine are set to continue next week, but key issues remain open. Germany and Latvia called for more action against Russian hybrid attacks and shadow fleet. DW has more.",
      "url": "https://www.dw.com/en/ukraine-updates-kremlin-says-abu-dhabi-talks-constructive/live-75667003?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 18:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "China's accidental 'crying horse' plush toy goes viral",
      "description": "As the Lunar New Year approaches, a production error at a toy factory has led to the creation of a viral 'crying horse' plush toy. Intended to celebrate the Year of the Horse, the toy's upside-down mouth has resonated with China's overworked, stressed young white-collar employees. The toy has become a symbol of their struggles, with sales booming amid the country’s economic challenges and youth unemployment.",
      "url": "https://www.france24.com/en/china-s-accidental-crying-horse-plush-toy-goes-viral",
      "published": "Mon, 26 Jan 2026 15:51:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Myanmar military using paramotors and gyrocopters for aerial attacks on civilians, opposition forces",
      "description": "Myanmar's military is increasingly using paramotors and gyrocopters to attack civilians and anti-government forces, according to a new report",
      "url": "https://abcnews.go.com/International/wireStory/myanmar-military-paramotors-gyrocopters-aerial-attacks-civilians-opposition-129556193",
      "published": "Mon, 26 Jan 2026 04:10:25 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "National Guard in Minnesota hands out coffee, donuts to anti-ICE protesters",
      "description": "Minnesota National Guard members handed out coffee and donuts to anti-ICE protesters in St. Paul, calling it a \"demonstration of safety and security.\"",
      "url": "https://www.foxnews.com/us/national-guard-minnesota-hands-out-coffee-donuts-anti-ice-protesters",
      "published": "Mon, 26 Jan 2026 09:53:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "ICE says violent mob helped criminal escape and left ICE agent permanently maimed",
      "description": "Federal officials say Minneapolis unrest derailed immigration arrest, leaving suspect at large while ICE agent lost part of finger to agitator bite.",
      "url": "https://www.foxnews.com/us/ice-says-violent-mob-helped-criminal-escape-left-ice-agent-permanently-maimed",
      "published": "Sun, 25 Jan 2026 17:38:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Eighteen dead after Philippines ferry with 300 passengers sinks",
      "description": "The local coast guard is still searching for 24 missing passengers of the MV Trisha Kerstin.",
      "url": "https://www.bbc.com/news/articles/cwy1vpqpy23o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 08:17:35 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Guyanese businessman facing US extradition elected opposition leader",
      "description": "Azruddin Mohamed’s election comes six months after he formed political party that became country’s second largest A Guyanese businessman facing extradition to the US on gold-smuggling and money-laundering charges has been elected as the country’s opposition leader, six months after he formed a political party that quickly became the second largest in the South American country . Azruddin Mohamed, 38, was confirmed as Guyana’s opposition leader after 16 lawmakers from the We Invest in Nationhood party (Win) and another from a single-seat outfit voted in his favor. The tally made Win the second-largest party in parliament, securing Mohamed’s election even as a magistrate’s court hears state arguments for his extradition to the US. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/guyana-opposition-leader-us-extradition",
      "published": "Mon, 26 Jan 2026 18:26:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Minnesota: Trump sends border czar amid political blame game",
      "description": "US President Donald Trump is deploying border czar Tom Homan to Minnesota, as federal and state officials clash over the description of events that led to the killing of Alex Pretti. DW has the latest.",
      "url": "https://www.dw.com/en/minnesota-trump-sends-border-czar-amid-political-blame-game/live-75666369?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 17:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU pushes for deals as Trump's tariffs upset global trade",
      "description": "Fear over Trump's tariff walls and the aggressive tone coming from the White House is pushing the European Union to focus on getting other trade agreements done. Despite all efforts, the EU sometimes gets in its own way.",
      "url": "https://www.dw.com/en/eu-pushes-for-deals-as-trump-s-tariffs-upset-global-trade/a-75622014?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 12:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "ICE killings a ‘watershed moment’: Trump, Republicans risk breaking with the American people",
      "description": "Nadia Massih welcomes former New York State Assemblyman Kenny Burgos (D) who offers a candid reflection on the killing of Alex Pretti by an ICE agent, described as a veritable \"watershed\" in American political consciousness. Mr. Burgos speaks from both political and personal vantage points, invoking the silent fear ripping beyond immigrant communities. The violent tactics of ICE, also targeting lawful migrants and US citizens, are striking fear across American as the country faces a reckoning with the very soul of American democracy.",
      "url": "https://www.france24.com/en/ice-killings-a-watershed-moment-trump-republicans-risk-breaking-with-the-american-people",
      "published": "Mon, 26 Jan 2026 18:10:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump dispatches border czar as judge weighs legality of ICE raids in Minnesota",
      "description": "President Donald Trump said Monday that border czar Tom Homan is heading to Minnesota as outrage mounts over the killing of US citizen Alex Pretti by Immigration and Customs Enforcement (ICE) agents. The move came as a federal judge began hearing arguments on whether the ICE crackdown in Minnesota violates the state's sovereignty and should be halted.",
      "url": "https://www.france24.com/en/americas/20260126-trump-to-send-homan-architect-of-his-anti-immigration-policy-to-minneapolis-amid-shooting-scrutiny",
      "published": "Mon, 26 Jan 2026 16:54:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "House of MAGA: As Trump seeks to fortify constituency, is he 'losing the rest of America'?",
      "description": "Delano D'Souza welcomes Todd Belt, Professor and Director of the Political Management Program at George Washington University's Graduate School of Political Management. In the wake of Alex Pretti’s killing by ICE agents in Minneapolis, the Trump administration is no longer controlling the narrative. The MAGA world's unyielding support for ICE's methods has started to erode under the weight of stark video evidence, widespread public outcry, and mounting pressure from within the Republican Party itself.",
      "url": "https://www.france24.com/en/house-of-maga-as-trump-seeks-to-fortify-constituency-is-he-losing-the-rest-of-america",
      "published": "Mon, 26 Jan 2026 16:48:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Child kidnapped for organ removal among 4,414 helped in trafficking crackdown",
      "description": "An eight-year-old boy kidnapped for organ removal is among 4,414 people police say have been safeguarded from human trafficking in a global operation.",
      "url": "https://news.sky.com/story/child-kidnapped-for-organ-removal-among-4414-helped-in-trafficking-crackdown-13499144",
      "published": "Mon, 26 Jan 2026 10:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Climber Alex Honnold scales Taipei 101 skyscraper without ropes",
      "description": "American climber Alex Honnold ascended one of the world's tallest buildings on Sunday without a rope or protective equipment.",
      "url": "https://news.sky.com/story/climber-alex-honnold-scales-taipei-101-skyscraper-without-ropes-13498734",
      "published": "Sun, 25 Jan 2026 08:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Young people must be ‘truly involved’ in transforming education",
      "description": "With young people under 30 making up more than half of the global population and over 272 million children and youth still out of school, their participation in shaping education is becoming increasingly vital.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166820",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Eighty years at the heart of global development",
      "description": "From humanitarian crises and youth unemployment, to climate resilience and development financing, many of today’s global challenges pass through a single United Nations body that is quietly turning 80 this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166814",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "FBI makes another arrest after Minneapolis 'rioters destroyed and stole equipment’ from agent’s vehicle: Patel",
      "description": "FBI Director Kash Patel announced the arrest of a suspect who allegedly used stolen ID material to threaten a Minneapolis agent and his family.",
      "url": "https://www.foxnews.com/us/fbi-makes-another-arrest-after-minneapolis-rioters-destroyed-stole-equipment-from-agents-vehicle-patel",
      "published": "Mon, 26 Jan 2026 12:10:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Emory fires Iranian official's daughter after campus protests over controversial hiring decision",
      "description": "Fatemeh Ardeshir-Larijani, daughter of sanctioned Iranian official Ali Larijani, lost her position at Emory University as activists called for review of her immigration status.",
      "url": "https://www.foxnews.com/world/emory-university-dismisses-daughter-senior-iranian-official-ali-larijani-campus-demonstrations",
      "published": "Sun, 25 Jan 2026 20:25:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian militiaman shows off what he claims to be severed Kurdish fighter's braid as Damascus asserts control",
      "description": "A video of a Syrian fighter holding a braid he claims was taken from a Kurdish woman in Raqqa sparked outrage and protests as Damascus expands control amid a fragile ceasefire.",
      "url": "https://www.foxnews.com/world/syrian-militiaman-shows-off-what-he-claims-severed-kurdish-fighters-braid-damascus-asserts-control",
      "published": "Sun, 25 Jan 2026 16:42:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Kenya's ex-deputy president alleges assassination attempt in church attack",
      "description": "The interior minister condemned the attack, which police say they are investigating.",
      "url": "https://www.bbc.com/news/articles/cpqyxew338po?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 12:58:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "NRA and other US gun activists push back at Trump officials over Minneapolis shooting",
      "description": "The gun-lobby group, typically aligned with Trump, criticises a suggestion that those who carry guns risk being lawfully shot.",
      "url": "https://www.bbc.com/news/articles/cnvg812n01no?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 22:29:48 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Massive search underway for dozens missing in deadly Indonesia landslide",
      "description": "At least 80 people, including 19 members of an elite marine force, are missing in a landslide in Indonesia.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/massive-search-underway-for-dozens-missing-in-deadly-indonesia-landslide?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 17:42:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds feared dead in attempt to cross Mediterranean during cyclone",
      "description": "Fifty killed in one incident as Italian authorities estimate 380 people may have drowned last week Europe live – latest updates Up to 380 people may have drowned attempting to cross the Mediterranean last week as Cyclone Harry battered southern Italy and Malta, the Italian coastguard has said, as a shipwreck with the loss of 50 lives was confirmed by Maltese authorities. Just one person, who was hospitalised in Malta, survived the shipwreck, which happened on Friday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/hundreds-feared-dead-after-attempting-to-cross-mediterranean-amid-cyclone-harry",
      "published": "Mon, 26 Jan 2026 14:54:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel has recovered the final hostage remains from Gaza",
      "description": "The Israeli military says the body of Ran Gvili, a 24-year-old special forces policeman killed while fighting Hamas militants on Oct. 7, 2023, has been found.",
      "url": "https://www.npr.org/2026/01/26/g-s1-107340/israel-gaza-hostage-remains-hamas",
      "published": "Mon, 26 Jan 2026 09:17:36 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "France could become second country to ban social media for some teens",
      "description": "France is set to debate a proposed social media ban for those under 15 years old, as the country's president backs stricter rules and a high school phone ban.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5686578/france-could-become-second-country-to-ban-social-media-for-some-teens",
      "published": "Mon, 26 Jan 2026 04:48:37 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Holocaust survivor Leon Weintraub: \"We were dehumanized\"",
      "description": "The 100-year-old vividly recalls the hunger, death camps and cruelty of the guards. Thus, he tirelessly works to ensure that the Holocaust is never forgotten.",
      "url": "https://www.dw.com/en/holocaust-survivor-leon-weintraub-we-were-dehumanized/a-75663240?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 16:34:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Media freedom in the spotlight as Kuciak murder case reopens",
      "description": "Europe presents itself as a defender of the free press, yet some high-profile murders of EU journalists have yet to be resolved. Will a new trial into the death of Slovak journalist Jan Kuciak change that?",
      "url": "https://www.dw.com/en/media-freedom-in-the-spotlight-as-kuciak-murder-case-reopens/a-75623291?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 10:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany news: Bounty offered over Berlin power grid attack",
      "description": "German authorities have offered a €1 million bounty for tips related to this month's massive Berlin blackout. Meanwhile, European leaders discussed energy and security cooperation in Hamburg. DW has more.",
      "url": "https://www.dw.com/en/germany-news-bounty-offered-over-berlin-power-grid-attack/live-75656216?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 08:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel retrieves remains of last Gaza hostage, Netanyahu says",
      "description": "Israel on Monday retrieved ⁠the remains of Ran Gvili, the last remaining hostage held in Gaza, fulfilling a key condition of ‍the initial phase of US President Donald Trump's ​plan to end the Gaza war. Israeli Prime Minister Benjamin Netanyahu hailed an \"incredible achievement\" for the Israeli military and its people.",
      "url": "https://www.france24.com/en/middle-east/20260126-israel-retrieves-remains-of-last-gaza-hostage-netanyahu-says",
      "published": "Mon, 26 Jan 2026 14:13:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Barbaric' attack during Ukraine peace talks - but 'unexpected chemistry' raises hopes",
      "description": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said.",
      "url": "https://news.sky.com/story/barbaric-attack-on-ukraines-largest-cities-during-peace-talks-further-negotiations-expected-as-early-as-next-week-13498413",
      "published": "Sat, 24 Jan 2026 14:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A search for 6 presumed dead in a New Zealand landslide is expected to take days",
      "description": "Authorities in New Zealand have resumed a search for six people presumed killed in a landslide at a popular beach campsite",
      "url": "https://abcnews.go.com/International/wireStory/search-6-presumed-dead-new-zealand-landslide-expected-129556008",
      "published": "Mon, 26 Jan 2026 04:34:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Philippine officials say ferry carrying more than 350 people has sunk",
      "description": "Philippine officials say ferry carrying more than 350 people has sunk and rescuers have saved more than 200 passengers",
      "url": "https://abcnews.go.com/International/wireStory/philippine-officials-ferry-carrying-350-people-sunk-rescuers-129549816",
      "published": "Sun, 25 Jan 2026 18:54:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Between fear and survival: Women and girls flee violence in northern Syria",
      "description": "When fighting recently intensified near her neighbourhood in Aleppo, in northern Syria, Fatima and her family had to run.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166833",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Keeping people warm amid hostilities and harsh winter weather in Ukraine",
      "description": "As people in war-torn Ukraine face the coldest winter in more than a decade, authorities and humanitarians are working to help them stay warm, particularly the most vulnerable residents.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166822",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Zelenskyy touts ‘constructive’ trilateral talks between the US, Russia and Ukraine in Abu Dhabi",
      "description": "Ukraine's Zelenskyy calls recent US-Russia-Ukraine talks in Abu Dhabi \"constructive,\" marking potential breakthrough in diplomatic efforts to end the war.",
      "url": "https://www.foxnews.com/world/zelenskyy-touts-constructive-trilateral-talks-between-us-russia-ukraine-abu-dhabi",
      "published": "Sun, 25 Jan 2026 08:00:49 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Boy, 12, dies after shark attack while swimming at popular cliff-jumping spot: 'We are heartbroken'",
      "description": "Nico Antic, 12, died from injuries after a shark attack at Sydney Harbour's Jump Rock. Friends heroically pulled him to safety after the attack.",
      "url": "https://www.foxnews.com/world/boy-12-dies-following-shark-attack-popular-cliff-jumping-spot-heartbroken",
      "published": "Sat, 24 Jan 2026 20:45:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia, Ukraine to discuss territory as Trump says both sides 'want to make a deal'",
      "description": "Abu Dhabi hosts trilateral meeting with the U.S., Ukraine and Russia in a possible sign that the nearly four-year war could be coming to an end.",
      "url": "https://www.foxnews.com/world/russia-ukraine-discuss-territory-trump-says-both-sides-want-make-deal",
      "published": "Fri, 23 Jan 2026 15:25:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens Canada with 100% tariffs over its new trade deal with China",
      "description": "The announcement is a reversal for Trump, who initially initially praised the agreement with China as something Canadian Prime Minister Mark Carney \"should be doing.\"",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5687236/canada-china-tariffs-trump",
      "published": "Sat, 24 Jan 2026 11:53:17 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "A new blow for UNRWA as headquarters in East Jerusalem 'set on fire'",
      "description": "The head of embattled UN relief agency for Palestinians, UNRWA, has condemned reports that its headquarters in East Jerusalem have been set alight deliberately.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166829",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Mamdani announces remote school day due to dangerous winter storm conditions",
      "description": "NYC Mayor Mamdani cites safety concerns from winter storm in decision for public schools to go remote on Monday.",
      "url": "https://www.foxnews.com/us/mamdani-announces-remote-school-day-due-dangerous-winter-storm-conditions",
      "published": "Sun, 25 Jan 2026 12:12:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Military-backed party secures Myanmar election win with opposition excluded",
      "description": "Myanmar’s military-backed Union Solidarity and Development Party has claimed victory in the country's first election since the army seized power in 2021",
      "url": "https://abcnews.go.com/International/wireStory/military-backed-party-secures-myanmar-election-win-opposition-129558469",
      "published": "Mon, 26 Jan 2026 07:45:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Japanese court orders Pyongyang to pay damages to survivors of deceptive repatriation program",
      "description": "A Japanese court has held North Korea responsible for human rights violations against four plaintiffs lured to the country by false promises of a \"paradise on Earth.\"",
      "url": "https://abcnews.go.com/International/wireStory/japanese-court-orders-pyongyang-pay-damages-survivors-deceptive-129557777",
      "published": "Mon, 26 Jan 2026 07:29:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Messages show 'rapid responders' mobilized demonstrators to harass federal agents and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/messages-show-rapid-responders-mobilized-demonstrators-harass-federal-agents-more-top-headlines",
      "published": "Mon, 26 Jan 2026 06:59:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "EU launches probe into Grok AI feature creating deepfakes of women, minors",
      "description": "European Commission says its investigation will examine if the AI tool has met its legal obligations.",
      "url": "https://www.aljazeera.com/news/2026/1/26/eu-launches-probe-into-grok-ai-feature-creating-deepfakes-of-women-minors?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 16:49:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Netanyahu says next phase of ceasefire is ‘demilitarising’ Gaza",
      "description": "Benjamin Netanyahu said the next phase of the ceasefire will be “disarming Hamas and demilitarising the Gaza Strip.”",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/netanyahu-says-next-phase-of-ceasefire-is-demilitarising-gaza?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 16:22:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Remains of last Israeli captive Ran Gvili recovered from Gaza, says Israel",
      "description": "Retrieval of Gvili's body could pave the way for next phase of the ceasefire, including reopening the Rafah crossing.",
      "url": "https://www.aljazeera.com/news/2026/1/26/remains-of-last-israeli-captive-in-gaza-retrieved-says-israel?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 13:54:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Video: Thousands of protesters march on Australia’s ‘Invasion Day’",
      "description": "Thousands of Australians rallied in support of Indigenous rights.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/video-thousands-of-protesters-march-on-australias-invasion-day?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 12:40:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian army, Kurdish-led SDF accuse each other of ceasefire violations",
      "description": "Exchange of barbs comes a day after the Syrian government extended the ceasefire with the SDF by 15 days.",
      "url": "https://www.aljazeera.com/news/2026/1/26/syrian-army-kurdish-led-sdf-accuse-each-other-of-ceasefire-violations?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 12:10:48 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fate of China’s top general more likely to do with power struggle than corruption",
      "description": "Experts suggest Xi Jinping is asserting his authority by sidelining an officer who has significantly betrayed his trust Standing inches from Xi Jinping at a military ceremony in late December, China’s highest-ranking general, Zhang Youxia, may have had little inkling about the fate that was to befall him just a few weeks later when he was put under investigation. The 75-year-old’s physical proximity to China’s leader, who stands to his right, reflects the position he holds in China’s hierarchy. As vice-chair of the Central Military Commission (CMC), the ruling body of the People’s Liberation Army (PLA), he is the second-most powerful person in China’s military, after Xi, the commander-in-chief. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/china-top-general-zhang-youxia-power-struggle-corruption",
      "published": "Mon, 26 Jan 2026 19:09:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Man charged after allegedly making comments aligned with neo-Nazi ideology at Sydney anti-immigration march",
      "description": "Thousands of people across Sydney and Melbourne take part in March for Australia rallies on Invasion Day Get our breaking news email , free app or daily news podcast A man who made antisemitic comments that police allege were “unequivocally” aligned with neo-Nazi ideology in front of a cheering crowd at an anti-immigration protest in Sydney has been charged with inciting hatred. An estimated 2,000 people took part in a March for Australia rally in Sydney on Monday, while hundreds marched in a March for Australia rally in Melbourne, with police working to keep the groups separate from Invasion Day rallies which were held at the same time . Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/26/man-charged-after-allegedly-making-comments-aligned-with-neo-nazi-ideology-at-sydney-anti-immigration-march-ntwnfb",
      "published": "Mon, 26 Jan 2026 08:06:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel launches 'large-scale operation' to locate last hostage in Gaza",
      "description": "The return of the remaining hostage, Ran Gvili, has been widely seen as removing the remaining obstacle to proceeding with the U.S.-brokered ceasefire's second phase.",
      "url": "https://www.npr.org/2026/01/26/g-s1-107323/israel-operation-locate-last-hostage",
      "published": "Mon, 26 Jan 2026 01:39:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Where is the threat from Russia and China in the Arctic?",
      "description": "As Trump points to Russia and China near Greenland, experts say the biggest Russian and Chinese activity is elsewhere in the Arctic.",
      "url": "https://www.npr.org/2026/01/25/nx-s1-5682932/where-is-the-threat-from-russia-and-china-in-the-arctic",
      "published": "Sun, 25 Jan 2026 17:35:07 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syria peace deal at risk as government forces and Kurdish fighters accuse each other of violations",
      "description": "Since the January 18th peace deal, Syrian government forces and Kurdish-led SDF have accused each other of violating the ceasefire. The government opened humanitarian corridors and released some prisoners, while many Kurdish families returned home. Despite this, tensions remain, with both sides accusing each other of violations, and the truce is considered fragile. Sunni families in Raqqa are also waiting for news on relatives held in government prisons.",
      "url": "https://www.france24.com/en/syria-peace-deal-at-risk-as-government-forces-and-kurdish-fighters-accuse-each-other-of-violations",
      "published": "Mon, 26 Jan 2026 14:18:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ethiopia declares the end of its first Marburg virus outbreak",
      "description": "Ethiopia has declared the end of its first Marburg virus outbreak",
      "url": "https://abcnews.go.com/International/wireStory/ethiopia-declares-end-marburg-virus-outbreak-129564220",
      "published": "Mon, 26 Jan 2026 10:11:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gunmen open fire at soccer field in central Mexico, killing 11 and wounding 12",
      "description": "Authorities say gunmen opened fire at a soccer field in central Mexico, killing at least 11 people and wounding 12 others",
      "url": "https://abcnews.go.com/International/wireStory/gunmen-open-fire-soccer-field-central-mexico-killing-129554650",
      "published": "Mon, 26 Jan 2026 02:17:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Dangerous nostalgia’ is a threat to multilateralism, UN deputy chief tells Danish MPs",
      "description": "United Nations Deputy Secretary-General Amina Mohammed urged countries to protect the UN Charter in a powerful speech to the Danish Parliament on Thursday, urging countries to “stand up for a rules-based order” – or pay the price.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166812",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Video shows masked robbers crash car through jewelry store entrance, steal owner's gun in brazen heist",
      "description": "Surveillance video shows masked suspects ramming a car into a California jewelry store, looting cases, stealing the owner’s gun and fleeing in cars that later crashed during police chases.",
      "url": "https://www.foxnews.com/us/video-shows-masked-robbers-crash-car-through-jewelry-store-entrance-steal-owners-gun-brazen-heist",
      "published": "Sun, 25 Jan 2026 20:04:54 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China's top general ousted, placed under investigation in latest military purge",
      "description": "Chinese President Xi Jinping removed China's top general Zhang Youxia amid an investigation for violating party discipline in latest military purge.",
      "url": "https://www.foxnews.com/world/chinas-top-general-ousted-placed-under-investigation-latest-military-purge",
      "published": "Sun, 25 Jan 2026 12:10:48 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret",
      "description": "Can the state, especially when it is implicated in killing, be trusted as the arbiter of what should remain confidential?",
      "url": "https://www.bbc.com/news/articles/c1w94v205y2o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 00:25:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Lula, Trump discuss ‘Board of Peace’, agree to meet in Washington: Brazil",
      "description": "Lula criticises US actions in Venezuela, calling the capture of Maduro an unacceptable line against regional stability.",
      "url": "https://www.aljazeera.com/news/2026/1/26/lula-trump-discuss-board-of-peace-agree-to-meet-in-washington-brazil?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 19:11:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "‘They threw us out like baggage’: Russian family deported from US to Costa Rica still in limbo",
      "description": "Alexander, his wife and son, who fled danger under Putin, fighting for security – and compensation – after torment of migration journey Almost a year after Donald Trump strong-armed a deal with Costa Rica to receive 200 people from other countries who were being deported from the United States after being denied the right to request asylum, a small handful remain there in legal limbo and fighting for compensation. The asylum seekers flown to Costa Rica in chains last February, despite not being criminals, were from 20 other countries, chiefly parts of Asia and Africa and included 81 children. They had all tried to request refuge at the US-Mexico border but were quickly removed from American soil after Trump returned to the White House and effectively closed the US asylum system. In the face of a variety of political difficulties with deporting them to their native countries, the Trump administration sent them to Costa Rica, as he did others to Panama . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/26/costa-rica-us-deportation",
      "published": "Mon, 26 Jan 2026 13:00:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany: Business index starts year with 'little momentum'",
      "description": "Germany's Ifo business barometer was stagnant in January, bucking predictions of a slight improvement. A dip in confidence in the service sector put the brakes on improved sentiments in other areas.",
      "url": "https://www.dw.com/en/germany-business-index-starts-year-with-little-momentum/a-75661116?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 12:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Israel announces limited Rafah crossing reopening after hostage recovery",
      "description": "Israel announced a 'limited reopening' of the Rafah crossing for pedestrians, contingent on recovering the last hostage’s remains. While the US and others push for a broader reopening, Israel has stated that the crossing will not allow humanitarian aid at this stage, and the full reopening remains uncertain.",
      "url": "https://www.france24.com/en/israel-announces-limited-rafah-crossing-reopening-after-hostage-recovery",
      "published": "Mon, 26 Jan 2026 15:09:04 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Cuba's Santeros offer gifts and ask deities for peace as tensions rise with US",
      "description": "Priests and priestesses of the Afro-Cuban religion known as Santería have offered gifts to deities and asked for peace as tensions rise between the United States and Cuba and the island braces for more economic difficulties",
      "url": "https://abcnews.go.com/International/wireStory/cubas-santeros-offer-gifts-deities-peace-tensions-rise-129551607",
      "published": "Sun, 25 Jan 2026 20:41:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Watchdog group exposes Idaho colleges' alleged scheme to sidestep new DEI law",
      "description": "Goldwater Institute demands Idaho attorney general investigate state universities allegedly violating new anti-DEI law designed to protect students from mandatory courses.",
      "url": "https://www.foxnews.com/us/watchdog-group-exposes-idaho-colleges-alleged-scheme-sidestep-new-dei-law",
      "published": "Mon, 26 Jan 2026 08:00:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "France debates under-15s social media ban endorsed by Macron",
      "description": "Prime Minister Sébastien Lecornu has said he will use a fast-track procedure to get the legislation on the books by September.",
      "url": "https://www.bbc.com/news/articles/c07x003vx0yo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 12:14:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "ICC judges find former Philippine President Duterte fit to stand trial",
      "description": "Judges cite report by medical experts saying the 80-year-old is able 'effectively to exercise his procedural rights'.",
      "url": "https://www.aljazeera.com/news/2026/1/26/icc-judges-find-former-philippine-president-duterte-fit-to-stand-trial?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 14:15:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "President Xi's purge is extraordinary - here's why",
      "description": "In a bombshell announcement, China's Ministry of Defence has said it is investigating General Zhang Youxia, China's most senior general and a man who was second only to Xi Jinping himself on China's top military decision-making body.",
      "url": "https://news.sky.com/story/xis-purge-of-top-general-paints-a-fascinating-picture-of-power-and-control-within-a-ruthless-and-unforgiving-system-13499060",
      "published": "Mon, 26 Jan 2026 04:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Limited access restored to Syria’s Al Hol camp amid security concerns",
      "description": "United Nations agencies have regained limited access to Syria’s Al Hol camp and resumed the delivery of essential supplies after days of disruption caused by a volatile security situation, the UN Deputy Spokesperson said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166824",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Toronto digs itself out after largest snowfall in city’s history",
      "description": "Some parts of city were buried under nearly 60cm of snow and over 500 flights were cancelled Sunday Toronto is beginning to dig itself out from the largest snowfall in the city’s history, a process which officials say is likely to take “several days”. Some parts of Canada’s largest city were buried under nearly 60cm (about 23in) of snow and more than 500 flights were cancelled Sunday after Toronto’s main airport was snowed in. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/toronto-snowstorm-record-snowfall-total",
      "published": "Mon, 26 Jan 2026 17:40:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Luxury blue-city landlords accused of looking the other way as high-end buildings turn into crime hubs",
      "description": "A woman allegedly sex trafficked as a minor sued luxury San Francisco apartment complexes, claiming staff accepted cash payments to ignore a trafficking operation.",
      "url": "https://www.foxnews.com/us/luxury-blue-city-landlords-accused-looking-other-way-high-end-buildings-turn-crime-hubs",
      "published": "Mon, 26 Jan 2026 14:11:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Israel says it has retrieved remains of final Gaza hostage",
      "description": "Israeli Prime Minister Benjamin Netanyahu called Ran Gvili’s return \"an extraordinary achievement\".",
      "url": "https://www.bbc.com/news/articles/c5ydvz7nz4mo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 18:37:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's military chief denies army assaulted Bobi Wine's wife",
      "description": "Barbara Kyagulanyi, married to the opposition leader, says she refused to reveal her husband's whereabouts.",
      "url": "https://www.bbc.com/news/articles/c20zdj8n7vgo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 10:31:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU investigates Elon Musk's X over Grok AI sexual deepfakes",
      "description": "The Commission will assess whether \"manipulated sexually explicit images\" have been shown to users in the EU.",
      "url": "https://www.bbc.com/news/articles/clye99wg0y8o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 13:34:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tearful goodbyes as Japan returns pandas to China amid worsening ties",
      "description": "The twin cubs' departure will leave Japan without any pandas for the first time since 1972.",
      "url": "https://www.bbc.com/news/articles/c8d0l778dero?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 03:08:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tributes pour in across India for revered BBC broadcaster Sir Mark Tully",
      "description": "Sir Mark Tully's cremation was held on Monday in Delhi, where he lived even after leaving the BBC.",
      "url": "https://www.bbc.com/news/articles/cgjw0w0qq4wo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 11:58:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gold tops $5,000 for first time ever, adding to historic rally",
      "description": "Gold is seen as a so-called safe-haven asset that investors buy in times of uncertainty and low interest rates.",
      "url": "https://www.bbc.com/news/articles/cvgd8kj2y2po?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 11:05:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russia using Interpol's wanted list to target critics abroad, leak reveals",
      "description": "A leak exposes for the first time the extent of Russia’s misuse of Interpol to request the arrest of critics.",
      "url": "https://www.bbc.com/news/articles/c20gg729y1yo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 00:15:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japanese ex-soldier reaches settlements in landmark sex abuse case",
      "description": "Rina Gonoi, a former soldier, was sexually assaulted while serving in Japan's Self-Defense Forces.",
      "url": "https://www.bbc.com/news/articles/cr4k2kw500zo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 06:39:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
      "description": "He has been described as an avid outdoorsman who loved mountain biking.",
      "url": "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 25 Jan 2026 12:24:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump’s second term: ‘Reality has overtaken satire’",
      "description": "Marc Lamont Hill sits down with The Nation’s Katrina vanden Heuvel to unpack the first year of Trump’s second term.",
      "url": "https://www.aljazeera.com/video/upfront/2026/1/26/trumps-second-term-reality-has-overtaken?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 15:59:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says US Justice Department ‘looking at’ Ilhan Omar’s wealth",
      "description": "Somali American congresswoman accuses US president of deflecting from his own 'failures' with 'conspiracy theories'.",
      "url": "https://www.aljazeera.com/news/2026/1/26/trump-says-justice-department-looking-at-ilhan-omars-wealth?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 14:30:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Anger as MSF agrees to Israel’s ‘unreasonable demands’: What to know",
      "description": "Medical charity will hand over details of its Palestinian staff to Israel, which targeted aid workers during genocide.",
      "url": "https://www.aljazeera.com/news/2026/1/26/anger-as-msf-agrees-to-israels-unreasonable-demands-what-to-know?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 13:10:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The ‘discombobulator’: Did US use ‘secret weapon’ in Maduro abduction?",
      "description": "US President Donald Trump refers to a ‘sonic weapon’ he describes as a ‘discombobulator’, but what is he talking about?",
      "url": "https://www.aljazeera.com/features/2026/1/26/the-discombobulator-did-us-use-secret-weapon-in-maduro-abduction?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 13:02:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel’s genocide wiped out over 2,700 families in Gaza",
      "description": "Over 2,700 Palestinian families have been wiped out in 27 months by Israel’s genocide.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/israels-genocide-wiped-out-over-2700-families-in-gaza?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 12:26:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alex Honnold free solos Taipei 101 skyscraper in live Netflix climb",
      "description": "US climber takes an hour and half to scale one of Asia’s tallest buildings without ropes or a harness The US rock climber Alex Honnold climbed one of Asia’s tallest skyscrapers without ropes or a harness on Sunday, fulfilling an ambition that began more than a decade ago and which he hoped would inspire people to pursue their own challenges because “time is finite”. Honnold, who starred in the 2019 Oscar-winning documentary Free Solo, ascended the 508-metre (1,667ft) Taipei 101 using the skyscraper’s horizontal metal beams to pull himself up with his bare hands. The challenge had originally been scheduled to take place on Saturday but was postponed because of rain. Continue reading...",
      "url": "https://www.theguardian.com/sport/2026/jan/24/alex-honnold-free-solo-taipei-101-netflix",
      "published": "Sun, 25 Jan 2026 13:05:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australia cancels visa of Jewish influencer who previously called for Islam to be banned",
      "description": "Sammy Yahood had his visa cancelled three hours before his flight was due to depart, according to the Australian Jewish Association The government has cancelled the visa of a Jewish influencer, who has previously called for the ban of Islam and was booked to speak at several events in Australia. The right-leaning Australian Jewish Association (AJA) said Sammy Yahood’s visa was cancelled three hours before his flight was due to depart. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/26/australia-cancels-visa-jewish-influencer-sammy-yahood-islam-banned-ntwnfb",
      "published": "Mon, 26 Jan 2026 08:01:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 5.5 - 9 km ESE of Dianga, China",
      "description": "PAGER - YELLOW ShakeMap - VII DYFI? - IV Time 2026-01-26 06:56:02 UTC 2026-01-26 06:56:02 UTC at epicenter Location 34.028°N 103.305°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rs2q",
      "published": "2026-01-26T14:33:40.040Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-26T16:26:41.447Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-25T08:09:13.060Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-25T19:42:07.295Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.9 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - VI Time 2026-01-20 01:56:14 UTC 2026-01-20 01:56:14 UTC at epicenter Location 33.894°N 116.169°W Depth 3.09 km (1.92 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41162719",
      "published": "2026-01-26T02:06:22.354Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "U.S. rock climber Alex Honnold reaches top of Taipei 101 skyscraper without ropes",
      "description": "Cheers erupted from a street-level crowd as Alex Honnold reached the top of the spire of the 508-meter (1,667-foot) tower, about 90 minutes after he started.",
      "url": "https://www.npr.org/2026/01/25/nx-s1-5687809/american-rock-climber-alex-honnold-reaches-top-of-taipei-skyscraper",
      "published": "Sun, 25 Jan 2026 07:33:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland, tariffs and NATO: a rollercoaster week in transatlantic relations",
      "description": "After President Trump's upheaval at Davos, U.S. allies are openly questioning whether Washington can still anchor the rules-based order.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5685215/greenland-tariffs-and-nato-a-rollercoaster-week-in-transatlantic-relations",
      "published": "Sat, 24 Jan 2026 17:39:59 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany, France, others rebuke Trump's NATO troop disrespect",
      "description": "German Defense Minister Boris Pistorius said it would show \"decency\" for Donald Trump to apologize for comments on NATO troops in Afghanistan. \"But we all know how the US president operates,\" Pistorius added.",
      "url": "https://www.dw.com/en/germany-france-others-rebuke-trump-s-nato-troop-disrespect/a-75666924?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 18:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Latin America waiting: What’s next for the EU-Mercosur deal?",
      "description": "The European Commission eyes pushing the bloc’s biggest ever trade deal ahead without the European Parliament’s okay ― for now.",
      "url": "https://www.dw.com/en/latin-america-waiting-what-s-next-for-the-eu-mercosur-deal/a-75666418?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 17:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Retrial in murder of Slovak journalist and fiancee begins",
      "description": "The second retrial in the Jan Kuciak murder case began on January 26. Businessman Marian Kocner again faces charges after the Slovak Supreme Court overturned his previous two acquittals.",
      "url": "https://www.dw.com/en/retrial-in-murder-of-slovak-journalist-and-fiancee-begins/a-75665546?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 16:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gold breaks $5,000: What's fueling the price rally and where will it end?",
      "description": "Gold continues to hit record highs, having already had a bumper run in 2025. Geopolitical and economic uncertainty are the key factors, while doubts over the US dollar are also attracting new investors.",
      "url": "https://www.dw.com/en/gold-breaks-5-000-what-s-fueling-the-price-rally-and-where-will-it-end/a-75665999?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 16:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK: Suella Braverman defects from Conservatives to Reform",
      "description": "The former UK Cabinet member is the latest high-ranking Conservative politician to defect to Reform UK, led by Nigel Farage. Another senior Tory, Robert Jenrick, was pushed before he could leave earlier this month.",
      "url": "https://www.dw.com/en/uk-suella-braverman-defects-from-conservatives-to-reform/a-75664224?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 15:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cricket: Don Bradman's India cap fetches $318,000",
      "description": "A cap that was worn by the Australian cricket legend Don Bradman against India has raised a tidy sum, having been sold to an anonymous bidder. Bradman, the star of the series, had gifted the cap to an Indian player.",
      "url": "https://www.dw.com/en/cricket-don-bradman-s-india-cap-fetches-318-000/a-75664187?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 14:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Vietnam bets big on To Lam's power and growth strategy",
      "description": "Vietnam's Communist Party has handed To Lam another five-year term and endorsed a reform agenda aimed at transforming the economy by 2030.",
      "url": "https://www.dw.com/en/vietnam-bets-big-on-to-lam-s-power-and-growth-strategy/a-75664156?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 13:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU opens probe into Musk's Grok chatbot",
      "description": "The European Commission is to look into whether Elon Musk's Grok AI chatbot is spreading illegal content in the EU. Among other things, Grok has been used to make manipulated sexualized images, often of women and minors.",
      "url": "https://www.dw.com/en/eu-opens-probe-into-musk-s-grok-chatbot/a-75663255?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 13:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India courts EU at Republic Day as trade deal nears",
      "description": "EU leaders Antonio Costa and Ursula von der Leyen were guests of honor for India's Republic Day celebrations. As tariff tensions with the US continue, New Delhi and Brussels are seeking more reliable trading partners.",
      "url": "https://www.dw.com/en/india-courts-eu-at-republic-day-as-trade-deal-nears/a-75657896?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 09:36:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French ex-senator goes on trial over allegedly spiking MPs drink to sexually assault her",
      "description": "Former French senator Joel Guerriau went on trial Monday for allegedly spiking lawmaker Sandrine Josso's champagne in November 2023 in order to sexually abuse her. Guerriau denies the charges. The case has gripped France following the 2024 conviction of Dominique Pelicot, who was found guilty of repeatedly drugging and raping his wife, Gisèle.",
      "url": "https://www.france24.com/en/france/20260126-french-ex-senator-goes-on-trial-over-allegedly-spiking-mps-drink-to-sexually-assault-her",
      "published": "Mon, 26 Jan 2026 17:25:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's Macron vows to speed up social media ban for under-15s",
      "description": "French President Emmanuel Macron announced plans to fast-track legislation banning social media use for children under 15, aiming for implementation by September. The move follows Australia's recent ban on under-16s using popular platforms like Instagram, TikTok, and YouTube. Macron also supports a ban on mobile phones in schools, with the draft legislation set to be submitted to the French parliament. FRANCE 24's Angela Diffley has the details.",
      "url": "https://www.france24.com/en/france-s-macron-vows-to-speed-up-social-media-ban-for-under-15s",
      "published": "Mon, 26 Jan 2026 17:23:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India holds annual military parade with EU leaders as its guests of honour",
      "description": "#India held its annual #military parade, which celebrates the foundation of its Republic 77 years ago. This year, #EU leaders Ursula von der Leyen and Antonio Costa were in the front seats, ahead of a decisive EU-India summit on January 27.",
      "url": "https://www.france24.com/en/video/20260126-india-holds-annual-military-parade-with-eu-leaders-as-its-guests-of-honour-5",
      "published": "Mon, 26 Jan 2026 17:03:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's former Senator Joël Guerriau on trial for drugging MP Sandrine Josso",
      "description": "Former French Senator Joël Guerriau is on trial for drugging MP Sandrine Josso with ecstasy, allegedly to rape her. During a search of Guerriau's property, 30 grams of ecstasy were found. If convicted, he faces up to 5 years in prison and a 75,000 euro fine, while Josso has since campaigned against drug-facilitated sexual assault.",
      "url": "https://www.france24.com/en/video/20260126-france-s-former-senator-jo%C3%ABl-guerriau-on-trial-for-drugging-mp-sandrine-josso",
      "published": "Mon, 26 Jan 2026 15:17:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Remains of last Israeli hostage found in Gaza",
      "description": "The remains of the last Israeli hostage in Gaza have been found.",
      "url": "https://news.sky.com/story/remains-of-last-israeli-hostage-found-in-gaza-13499223",
      "published": "Mon, 26 Jan 2026 13:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Talks with US and Ukraine were constructive but major challenges remain, Kremlin says",
      "description": "Negotiations to end Russia's invasion of Ukraine are showing signs of progress, but major challenges remain, according to a senior Kremlin official",
      "url": "https://abcnews.go.com/International/wireStory/talks-us-ukraine-abu-dhabi-constructive-major-challenges-129558732",
      "published": "Mon, 26 Jan 2026 09:03:12 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France honors fallen soldiers in Afghanistan after Trump's false claim about NATO troops",
      "description": "A senior French official has emphasized the importance of honoring French soldiers who died in Afghanistan",
      "url": "https://abcnews.go.com/International/wireStory/france-honors-fallen-soldiers-afghanistan-after-trumps-false-129557778",
      "published": "Mon, 26 Jan 2026 07:37:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What to know about a French ex-senator on trial for drugging a lawmaker to sexually assault her",
      "description": "A former French senator is on trial in Paris, accused of drugging a lawmaker to sexually assault her",
      "url": "https://abcnews.go.com/International/wireStory/french-senator-trial-drugging-lawmaker-sexually-assault-129557408",
      "published": "Mon, 26 Jan 2026 07:05:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Philippines tells Beijing it is alarmed over escalating verbal tussle in South China Sea dispute",
      "description": "The Philippines has told China that it is alarmed about heated exchanges with Chinese diplomats in Manila over the long-standing territorial dispute between the two countries in the South China Sea",
      "url": "https://abcnews.go.com/International/wireStory/philippines-tells-beijing-alarmed-escalating-verbal-tussle-south-129557051",
      "published": "Mon, 26 Jan 2026 06:41:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How a purge of China's military leadership could impact the army and Taiwan",
      "description": "China says it is investigating the army’s top general for suspected serious violations of discipline and law",
      "url": "https://abcnews.go.com/International/wireStory/purge-chinas-military-leadership-impact-army-future-taiwan-129555905",
      "published": "Mon, 26 Jan 2026 03:47:50 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mark Tully, BBC correspondent known as the 'voice of India,' dies at 90",
      "description": "Mark Tully, a longtime BBC correspondent known as the “voice of India,” has died at 90",
      "url": "https://abcnews.go.com/International/wireStory/mark-tully-bbc-correspondent-voice-india-dies-90-129555430",
      "published": "Mon, 26 Jan 2026 01:53:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From family farm to climate tech: How one Kenyan woman is helping farmers outsmart drought",
      "description": "“Giving up is not an option - so many people depend on you,” the words of Maryanne Gichanga, a participant in a UN supported initiative, which aims to help farmers in Kenya find solutions to alleviate the pressures of climate change on agriculture production.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166823",
      "published": "Sun, 25 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Viral video shows man stomped during chaotic gas station brawl as teen is arrested",
      "description": "Viral video shows Arkansas teenager allegedly stomping victim's head at Hot Springs gas station, leaving 20-year-old with skull fracture in intensive care.",
      "url": "https://www.foxnews.com/us/viral-video-shows-man-stomped-during-chaotic-gas-station-brawl-teen-arrested",
      "published": "Mon, 26 Jan 2026 11:48:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Texas cult in crosshairs of killer mom’s bathtub slayings case as questions hang over family horror",
      "description": "New documentary explores shocking allegations that Andrea Yates was influenced by religious cult before drowning her five children in 2001 Texas tragedy.",
      "url": "https://www.foxnews.com/us/texas-cult-crosshairs-killer-moms-bathtub-slayings-case-questions-hang-over-family-horror",
      "published": "Sun, 25 Jan 2026 14:00:36 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan opposition leader says democratic transition would be 'fall of the Berlin Wall' for Americas",
      "description": "Opposition leader María Corina Machado said she intends to return to Venezuela soon to help drive a democratic transition.",
      "url": "https://www.foxnews.com/world/venezuelan-opposition-leader-says-democratic-transition-would-be-fall-berlin-wall-americas",
      "published": "Mon, 26 Jan 2026 13:36:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel confirms recovery of last hostage's remains from Gaza",
      "description": "The remains of Ran Gvili, the final Israeli hostage held by Hamas, have been recovered from Gaza. The police officer died defending Israel on Oct. 7.",
      "url": "https://www.foxnews.com/world/israel-confirms-recovery-last-hostages-remains-from-gaza",
      "published": "Mon, 26 Jan 2026 09:11:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy says US security guarantees document is '100% ready' for signing",
      "description": "Ukraine's Zelenskyy says U.S. security guarantees document is \"100% ready\" for signing as trilateral peace talks with Russia expected to continue in Abu Dhabi.",
      "url": "https://www.foxnews.com/world/zelenskyy-says-us-security-guarantees-document-100-ready-signing",
      "published": "Mon, 26 Jan 2026 08:11:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel announces limited reopening of Rafah Crossing under Trump’s 20-point plan",
      "description": "Netanyahu agrees to reopen Gaza's Rafah crossing under President Trump's 20-point peace plan, pending the recovery of the final Israeli hostage.",
      "url": "https://www.foxnews.com/world/israel-announces-limited-reopening-rafah-crossing-under-trumps-20-point-plan",
      "published": "Sun, 25 Jan 2026 17:45:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Macron says children's brains are 'not for sale,' urges fast-track to ban social media for kids under 15",
      "description": "French President Emmanuel Macron pushes lawmakers to ban social media for kids under 15, saying children's emotions won't be manipulated by \"American Platforms\" or \"Chinese algorithms.\"",
      "url": "https://www.foxnews.com/world/macron-says-childrens-brains-not-sale-urges-fast-track-ban-social-media-kids-under-15",
      "published": "Sun, 25 Jan 2026 13:35:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}