{
  "last_updated": "2025-12-28T07:21:28.780481Z",
  "event_count": 224,
  "events": [
    {
      "title": "Trump supporters hail US strikes in Nigeria as ‘amazing Christmas present’",
      "description": "Some even celebrated ‘mass killing’ and the president’s ‘resolve’ in attacking Islamic State targets The US’s Christmas Day strikes against Islamic State targets in Nigeria have been met with praise by Donald Trump supporters who for months had been agitating for the president to respond forcefully to the killings of Christians in the country. “I can’t think of a better way to celebrate Christmas than by avenging the death of Christians through the justified mass killing of Islamic terrorists,” the far-right political activist Laura Loomer posted on X. “You’ve got to love it! Death to all Islamic terrorists! Thank you.” Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/26/trump-supporters-nigeria-airstrikes",
      "published": "Fri, 26 Dec 2025 17:50:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Israel FM accuses Palestinian Authority of aiding terror with ‘Pay-for-Slay’ after deadly attack",
      "description": "Two Israelis were killed in terrorist attacks in Israel on Friday, as officials accused the Palestinian Authority of misleading the world about its active terror payment policy.",
      "url": "https://www.foxnews.com/world/israel-fm-accuses-palestinian-authority-aiding-terror-pay-for-slay-after-deadly-attack",
      "published": "Fri, 26 Dec 2025 12:16:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 43,
      "severity_level": "Critical"
    },
    {
      "title": "Australian prime minister announces national bravery honors after antisemitic terror attack",
      "description": "Australia announced a national bravery award for heroes who confronted ISIS-inspired gunmen during a deadly Hanukkah attack that killed 15 people in Sydney.",
      "url": "https://www.foxnews.com/world/australian-pm-announces-national-bravery-honors-after-antisemitic-terror-attack",
      "published": "Thu, 25 Dec 2025 21:02:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Trump launches Christmas night airstrikes on ISIS 'Terrorist Scum' in Nigeria after killings of Christians",
      "description": "Trump said the United States launched Christmas night airstrikes in Nigeria targeting ISIS militants he accused of killing Christians in recent attacks.",
      "url": "https://www.foxnews.com/world/trump-launches-christmas-night-airstrikes-isis-terrorist-scum-nigeria-after-killings-christians",
      "published": "Thu, 25 Dec 2025 18:16:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan civil war: Health system ‘on the verge of collapse’",
      "description": "The war in Sudan has been tearing the country apart for almost 1,000 days, putting the country’s health system under intolerable pressure. The World Health Organization (WHO) is reporting widespread disease outbreaks, severe shortages, malnutrition and rising deaths.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166673",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Syria: Guterres deplores deadly mosque blast in Homs",
      "description": "UN Secretary-General António Guterres “unequivocally condemns” the deadly terrorist attack on a mosque in Homs, Syria during Friday prayers, his spokesperson said in a statement",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166674",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Gangs use sexual violence to control communities in Haiti",
      "description": "Jacqueline Charles of the Miami Herald reports on how gangs in Haiti are using sexual violence as a tool of terror amid the country's deepening political and humanitarian crisis.",
      "url": "https://www.npr.org/2025/12/27/nx-s1-5651322/gangs-use-sexual-violence-to-control-communities-in-haiti",
      "published": "Sat, 27 Dec 2025 17:01:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Minns government ‘actively’ considering if Jewish security group should be armed after Bondi attack",
      "description": "NSW premier also announces police will carry long-arm rifles at major New Year’s Eve event in Sydney Get our breaking news email , free app or daily news podcast Chris Minns has said his government is “actively” considering whether a Jewish security group should be armed in the wake of the Bondi terror attack, as he confirms police will carry long-arm rifles for the first time at Sydney’s major New Year’s Eve event. The New South Wales premier said he was considering the extraordinary step of arming the Community Security Group (CSG) after fielding questions about reports police had failed to heed a warning from the group about the event posing a high security risk, and the need for a greater police presence. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/28/minns-government-actively-considering-if-jewish-security-group-should-be-armed-after-bondi-attack-ntwnfb",
      "published": "Sun, 28 Dec 2025 05:05:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Queensland braces for days of heavy rain as BoM issues flood warnings for parts of state",
      "description": "Livestock at risk as some areas expected to receive up to 500mm in the coming week, according to the Bureau of Meteorology Get our breaking news email , free app or daily news podcast Large parts of north Queensland are set to be battered by days of heavy rain, with some areas expected to receive up to 500mm in the coming week, according to the weather bureau. The Bureau of Meteorology has issued a severe weather warning for heavy rainfall in the gulf region, and is expected to issue another for the coastal region around Townsville later today. Sign up: AU Breaking News email Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/28/queensland-braces-for-days-of-heavy-rain-as-bom-issues-flood-warnings-for-parts-of-state",
      "published": "Sun, 28 Dec 2025 02:03:18 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly blast hits Alawite mosque in Syria's Homs",
      "description": "At least eight people were killed and 18 wounded in a blast that struck a mosque in an Alawite neighbourhood of Homs province in Syria on Friday (December 26), state media reported. An Islamist militant group claimed responsibility for the attack.",
      "url": "https://www.france24.com/en/video/20251227-deadly-blast-hits-alawite-mosque-in-syria-s-homs",
      "published": "Sat, 27 Dec 2025 12:06:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Albanese announces bravery award for heroes of Bondi antisemitic attack",
      "description": "Australian Prime Minister Anthony Albanese has announced a national bravery award to honor those who confronted an antisemitic terror attack",
      "url": "https://abcnews.go.com/International/wireStory/albanese-announces-bravery-award-heroes-bondi-antisemitic-attack-128689526",
      "published": "Wed, 24 Dec 2025 23:53:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Thailand and Cambodia agree ‘immediate’ ceasefire after weeks of deadly border clashes",
      "description": "Two countries pledge in joint statement to halt all forms of attacks and further troop deployments in long-running dispute over contested territory Thailand and Cambodia have agreed to an “immediate” ceasefire, pledging to end weeks of deadly border clashes that have killed more than 100 people and displaced more than half a million on both sides. In a joint statement, the two south-east Asian neighbours said the ceasefire would take effect on Saturday at noon local time and involve “all types of weapons, including attacks on civilians, civilian objects and infrastructures, and military objectives of either side, in all cases and all areas”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/27/thailand-and-cambodia-agree-immediate-ceasefire-after-weeks-of-deadly-border-clashes",
      "published": "Sat, 27 Dec 2025 05:08:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "US air strikes won’t fix Nigeria’s security crisis but could make it worse",
      "description": "An attack on local armed groups does not address the root cause of violence; it could, however, drive polarisation.",
      "url": "https://www.aljazeera.com/opinions/2025/12/27/us-air-strikes-wont-fix-nigerias-security-crisis-but-could-make-it-worse?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 17:31:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Airstrikes, shootings, hypothermia: The harsh reality of life in Gaza under US-backed ceasefire",
      "description": "Warning: This article contains images and descriptions some people may find distressing",
      "url": "https://news.sky.com/story/airstrikes-shootings-hypothermia-the-harsh-reality-of-life-in-gaza-under-us-backed-ceasefire-13487924",
      "published": "Sat, 27 Dec 2025 21:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Sri Lanka cyclone: More than a million still need aid weeks after Ditwah floods",
      "description": "Nearly a month after Cyclone Ditwah tore across Sri Lanka, more than a million people – including over half a million children – remain in urgent need of humanitarian assistance, as floods, landslides and renewed rainfall continue to compound one of the country’s worst disasters in decades.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166671",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Hundreds mourn in Syria's Homs after deadly mosque bombing",
      "description": "Hundreds of mourners have gathered outside a mosque in Homs, Syria, after a bombing killed eight people and wounded 18",
      "url": "https://abcnews.go.com/International/wireStory/hundreds-mourn-syrias-homs-after-deadly-mosque-bombing-128717611",
      "published": "Sat, 27 Dec 2025 06:49:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Cambodia accuses Thailand of launching strikes during border peace talks",
      "description": "Thai reports claim Cambodia carried out overnight attacks ahead of officials from both countries meeting for a third day of negotiations on Friday Cambodia has accused Thailand of intensifying its bombardment of disputed border areas, even as officials from the two countries attend a multi-day meeting aimed at negotiating an end to deadly clashes. The neighbours’ longstanding border conflict reignited this month , shattering an earlier truce and killing more than 40 people, according to official counts. About a million people have also been displaced. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/cambodia-accuses-thailand-of-launching-strikes-during-border-peace-talks",
      "published": "Fri, 26 Dec 2025 06:56:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Top 10 natural disasters cost more than $120 billion in 2025, Christian Aid report says",
      "description": "A report out Saturday (December 27) has sought to catalogue some of the most significant extreme weather events of the year. UK charity Christian aid found that heatwaves are pushing the limits of human adaptation, hurricanes and typhoons are breaking records and extreme rainfall, and droughts are devastating lives and livelihoods across the globe. It's all coming at a heavy financial cost.",
      "url": "https://www.france24.com/en/video/20251227-top-10-natural-disasters-cost-more-than-120-billion-in-2025-christian-aid-report-says",
      "published": "Sat, 27 Dec 2025 16:44:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Pope Leo XIV delivers first Christmas message calling for end to violence in Middle East, Russia-Ukraine war",
      "description": "Pope Leo XIV delivers Christmas message calling for peace in Middle East and Ukraine, urging world leaders to reject violence and embrace dialogue.",
      "url": "https://www.foxnews.com/world/pope-leo-xiv-delivers-first-christmas-message-calling-end-violence-middle-east-russia-ukraine-war",
      "published": "Thu, 25 Dec 2025 08:44:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Palestinians suffer flooded tents and debris as cold and rain lash Gaza",
      "description": "Authorities in the enclave warn that the downpour could intensify into a full-blown storm.",
      "url": "https://www.aljazeera.com/news/2025/12/27/palestinians-suffer-flooded-tents-and-debris-as-cold-and-rain-lash-gaza?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 22:54:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Israel becomes first country to recognise Somaliland as sovereign state",
      "description": "Diplomatic breakthrough criticised by African Union, which said it could have ‘far-reaching implications for peace and stability across the continent’ Israel has become the first country to recognise Somaliland as a sovereign state, a breakthrough in its quest for international recognition since it declared independence from Somalia 34 years ago. The Israeli foreign minister, Gideon Sa’ar, announced on Friday that Israel and Somaliland had signed an agreement establishing full diplomatic relations, which would include the opening of embassies and the appointment of ambassadors. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/israel-first-country-to-recognise-somaliland-sovereign-state",
      "published": "Sat, 27 Dec 2025 02:14:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "‘They’re scared of us now’: how co-investment in a tropical forest saw off loggers",
      "description": "Low-cost tech and joined-up funding have reduced illegal logging, mining and poaching in the Darién Gap – it’s a success story that could stop deforestation worldwide There are no roads through the Darién Gap. This vast impenetrable forest spans the width of the land bridge between South and Central America, but there is almost no way through it: hundreds have lost their lives trying to cross it on foot. Its size and hostility have shielded it from development for millennia, protecting hundreds of species – from harpy eagles and giant anteaters to jaguars and red-crested tamarins – in one of the most biodiverse places on Earth. But it has also made it incredibly difficult to protect. Looking after 575,000 hectares (1,420,856 acres) of beach, mangrove and rainforest with just 20 rangers often felt impossible, says Segundo Sugasti, the director of Darién national park. Like tropical forests all over the world, it has been steadily shrinking, with at least 15% lost to logging, mining and cattle ranching in two decades. Continue reading...",
      "url": "https://www.theguardian.com/environment/2025/dec/25/they-are-scared-of-us-now-how-one-tropical-forest-turned-the-tide-on-loggers",
      "published": "Thu, 25 Dec 2025 15:00:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Yemen: 'The status quo is no longer feasible', analyst says",
      "description": "Saudi Arabia warned Saturday (December 27) it would back Yemen's government in any military confrontation with separatist forces and urged them to withdraw \"peacefully\" from recently-seized provinces. The statements came a day after reported Saudi air strikes on separatist positions in Yemen's Hadramawt province. For more analysis, FRANCE 24's Liza Kaminov is joined by Mohammed Al-Basha, Founder of Basha Report, a US-based risk advisory firm.",
      "url": "https://www.france24.com/en/video/20251227-yemen-the-status-quo-is-no-longer-feasible-analyst-says",
      "published": "Sat, 27 Dec 2025 14:50:36 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN peacekeeper injured in gunfire near ‘Blue Line’ in south Lebanon",
      "description": "One United Nations peacekeeper was injured on Friday after heavy machine gunfire from Israel Defense Forces (IDF) positions south of the Blue Line, following a nearby grenade explosion, impacted close to a UN patrol in southern Lebanon.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166676",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Historic vote looms in Central African Republic as UN urges peaceful participation",
      "description": "With Central Africans set to vote in presidential, legislative, regional and long-delayed municipal elections this weekend, the United Nations has appealed for calm and restraint, warning that the credibility of the process will be critical to consolidating peace after years of conflict and instability.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166665",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian president says his country is at 'total war' with the US, Israel and Europe: reports",
      "description": "Iranian President Masoud Pezeshkian says his country is at 'total war' with the U.S., Israel and Europe, claiming the conflict is more complex than Iran's 1980s war with Iraq.",
      "url": "https://www.foxnews.com/world/iranian-president-says-country-total-war-us-israel-europe",
      "published": "Sat, 27 Dec 2025 21:58:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Blast at Syrian mosque during Friday prayers leaves at least eight dead",
      "description": "The explosion in Homs targeted a predominantly Alawite area, a sect that has faced crackdowns and violence since the fall of former-President Bashar al-Assad.",
      "url": "https://www.bbc.com/news/articles/cx25387dj8no?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 15:01:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Millions of Afghans face hunger as aid cuts deepen a humanitarian crisis",
      "description": "Millions of Afghans are struggling as international aid cuts sever a lifeline many relied on for food and heating",
      "url": "https://abcnews.go.com/International/wireStory/millions-afghans-face-hunger-aid-cuts-deepen-humanitarian-128716351",
      "published": "Sat, 27 Dec 2025 00:33:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Italian authorities arrest 9 people who allegedly used charities to funnel more than $8m to Hamas",
      "description": "Italy arrested nine people linked to three charities that allegedly funneled approximately $8.2 million to the Hamas terrorist organization.",
      "url": "https://www.foxnews.com/world/italian-authorities-arrest-9-people-who-allegedly-used-charities-funnel-more-than-8m-hamas",
      "published": "Sat, 27 Dec 2025 12:04:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran president says US, Israel, Europe waging ‘full-fledged war’ on country",
      "description": "If Israel and the US were to attack Iran again, they would 'face a more decisive response', Pezeshkian warns.",
      "url": "https://www.aljazeera.com/news/2025/12/27/iran-president-says-us-israel-europe-waging-full-fledged-war-on-country?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 21:22:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Germany news: Medical association demands home firework ban",
      "description": "The appeal came after injuries and outbreaks of violence linked to New Year’s Eve fireworks, both public and private. Meanwhile, a spate of black ice has caused numerous accidents across Germany.",
      "url": "https://www.dw.com/en/germany-news-medical-association-demands-home-firework-ban/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 17:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Russia pummels Kyiv ahead of Zelensky-Trump meeting",
      "description": "Russia pummelled Ukraine's capital with drones and missiles on Saturday, killing a woman and cutting power to hundreds of thousands, ahead of President Volodymyr Zelensky's latest talks with US leader Donald Trump. Zelensky said Russia’s attack on Ukraine shows that Russia does “not want to end the war”. FRANCE 24's Douglas Herbert gives us his analysis.",
      "url": "https://www.france24.com/en/video/20251227-russia-pummels-kyiv-ahead-of-zelensky-trump-meeting",
      "published": "Sat, 27 Dec 2025 15:35:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How climate change is threatening human rights",
      "description": "With rising effects of climate change across the globe, the world has started recognising that climate change is not just an ecological collapse, but also a human rights crisis.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166649",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Industrialisation without destruction: A UN blueprint for the future",
      "description": "Since the 19th century, industrialisation has had a transformative effect on the world, both positive and negative. It has created jobs and lifted millions out of poverty. But it has also had devastating consequences; destroying ecosystems, polluting the air, and driving the climate crisis that threatens to make large parts of the planet uninhabitable.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166635",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Repeat offender freed after SWAT standoff tied to three shootings in one month: report",
      "description": "Texas repeat offender allegedly linked to three separate shootings in one month, including random drive-by attacks and SWAT standoff in Hays County area.",
      "url": "https://www.foxnews.com/us/repeat-offender-freed-after-swat-standoff-tied-three-shootings-one-month-report",
      "published": "Fri, 26 Dec 2025 10:10:40 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "COVID-19 in Germany: What did politicians learn?",
      "description": "A parliamentary inquiry has been looking into the policy decisions made to contain the COVID-19 pandemic in Germany. The decisions made by key leaders from the time are being questioned.",
      "url": "https://www.dw.com/en/covid-19-in-germany-what-did-politicians-learn/a-75283320?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 06:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "A massive crash on a highway in Japan kills 1 person and injures 26 as the holiday season starts",
      "description": "A massive crash in snowy weather has killed one person and injured 26 on an expressway in Japan",
      "url": "https://abcnews.go.com/International/wireStory/massive-crash-highway-japan-kills-1-person-injures-128713859",
      "published": "Fri, 26 Dec 2025 21:29:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "UN renews ceasefire push in Sudan",
      "description": "The UN has urged Sudan’s warring parties to pursue compromise and an immediate ceasefire, even as drone attacks, displacement and the killing of peacekeepers underscore the growing risks to civilians and humanitarians.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166675",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Overnight strikes leave death, destruction and power outages in Ukraine",
      "description": "A new wave of overnight strikes and front-line hostilities in Ukraine have caused further civilian casualties and damage to critical energy infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166664",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Myanmar elections marked by fear as UN warns civilians are coerced from all sides",
      "description": "As Myanmar approaches elections scheduled for 28 December, the UN’s top human rights official has said that civilians are being coerced from all sides – forced by the military to vote and threatened by armed opposition groups to boycott – in a climate of fear, violence and mass repression.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166662",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Trump’s peace through strength in 2025: where wars stopped and rivals came to the table",
      "description": "Trump's 2025 peace agenda produced mostly positive results with new ceasefires in Gaza and other regions, but major conflicts like Ukraine remain unresolved.",
      "url": "https://www.foxnews.com/world/trumps-peace-through-strength-2025-where-wars-stopped-rivals-came-table",
      "published": "Sat, 27 Dec 2025 07:00:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "At least 15 dead, 19 injured in Guatemala as bus plunges into ravine",
      "description": "The bus, which was travelling between Guatemala City and San Marcos, crashed for unknown reasons, authorities say.",
      "url": "https://www.aljazeera.com/news/2025/12/27/at-least-15-dead-19-injured-in-guatemala-as-bus-plunges-into-ravine?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 15:23:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the wildest place I have walked’: new national park will join up Chile’s 2,800km wildlife corridor",
      "description": "Government poised to officially protect 200,000 hectares of remote Patagonian coastline and forest Chile’s government is poised to create the country’s 47th national park, protecting nearly 200,000 hectares (500,000 acres) of pristine wilderness and completing a wildlife corridor stretching 1,700 miles (2,800km) to the southernmost tip of the Americas. The Cape Froward national park is a wild expanse of wind-torn coastline and forested valleys that harbours unrivalled biodiversity and has played host to millennia of human history. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/25/cape-froward-new-national-park-patagonia-chile",
      "published": "Thu, 25 Dec 2025 12:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Niger junta orders 'general mobilisation' in fight against jihadists",
      "description": "Niger's military junta has declared a general mobilisation and requisition of people and resources to combat jihadist insurgents, a government statement said Saturday. The measure requires citizens to comply with call-up orders to contribute to national defense as the junta faces growing militant attacks since its July 2023 coup.",
      "url": "https://www.france24.com/en/africa/20251227-niger-junta-orders-general-mobilisation-in-fight-against-jihadists",
      "published": "Sat, 27 Dec 2025 21:43:15 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Saudi Arabia backs Yemen's government, urges separatists to withdraw from seized provinces",
      "description": "Saudi Arabia on Saturday said it would back Sanaa's government in any military confrontation with separatist forces in a statement that came a day after reported Saudi air strikes in Yemen's Hadramawt province.The Southern Transition Council (STC) separatists backed by the United Arab Emirates have recently made territorial gains, embarrassing regional heavyweight Saudi Arabia.",
      "url": "https://www.france24.com/en/live-news/20251227-saudi-arabia-demands-yemen-separatists-withdraw-forces",
      "published": "Sat, 27 Dec 2025 12:03:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Security Council remains divided over Iran nuclear programme, sanctions stay in place",
      "description": "At a meeting to discuss nuclear non-proliferation on Tuesday, the Security Council’s stance on Iran’s nuclear activities remained divided on the issue, split between those who support the reinstatement of sanctions, and the members who believe the sanctions should be permanently lifted, whilst questioning the legality of the meeting itself.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166660",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Security Council meets on Venezuela, Iran, Somalia",
      "description": "The Security Council convened earlier today for a packed agenda, adopting a resolution extending the authorisation of the African Union support mission in Somalia (AUSSOM) and hearing a briefing on Iran and the implementation of resolution 2231, which endorsed the 2015 nuclear deal known as the Joint Comprehensive Plan of Action (JCPOA). Members are set to reconvene at 3 pm for an emergency meeting requested by Venezuela, amid heightened tensions between Caracas and Washington. Assistant Secretary-General for Political Affairs Khaled Khiari is expected to brief ambassadors. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166656",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Israel’s recognition of Somaliland slammed across world capitals",
      "description": "Regional blocs join nations in condemning Israel's move to formally recognise breakaway Somali region as independent.",
      "url": "https://www.aljazeera.com/news/2025/12/27/israels-recognition-of-somaliland-slammed-across-world-capitals?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 18:35:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Man arrested after allegedly stabbing former partner and another man to death in Sydney",
      "description": "Woman in her 30s found dead at home in Quakers Hill on Sunday morning while man in his 30s died in hospital Get our breaking news email , free app or daily news podcast A man has been arrested after allegedly stabbing his former partner and another man to death in Sydney. Police said emergency services were called to the home in Quakers Hill just before 5am on Sunday, responding to reports of a disturbance. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/28/man-arrested-after-woman-found-dead-at-sydney-home-and-another-man-critically-injured-from-stab-wounds-ntwnfb",
      "published": "Sat, 27 Dec 2025 23:03:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Thailand and Cambodia agree to ceasefire",
      "description": "Thailand and Cambodia agreed to an \"immediate\" ceasefire on Saturday (December 26), the two countries said in a joint statement, pledging to end border clashes that killed dozens of people.",
      "url": "https://www.france24.com/en/video/20251227-thailand-and-cambodia-agree-to-ceasefire",
      "published": "Sat, 27 Dec 2025 14:37:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "UN Security Council hears warnings over escalating US-Venezuela standoff",
      "description": "Tensions between the United States and Venezuela have sharply escalated amid increased US military operations in the Southern Caribbean, prompting accusations of sovereignty violations, concerns over civilian harm and growing calls at the UN Security Council for restraint and de-escalation.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166668",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Zelenskyy says Ukraine, ahead of Trump meeting, is 'willing to do whatever it takes' to end war with Russia",
      "description": "Russian drone and missile attack on Kyiv reportedly kills one, injures 27 as Ukraine's president prepares for crucial Trump meeting with peace proposal.",
      "url": "https://www.foxnews.com/world/zelenskyy-says-fresh-russian-attack-ukraine-shows-putins-true-attitude-ahead-trump-meeting",
      "published": "Sat, 27 Dec 2025 08:32:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "7.0-magnitude earthquake rattles Taiwan",
      "description": "The quake struck off Taiwan's northeastern coast, and shook buildings in the capital, Taipei.",
      "url": "https://www.dw.com/en/7-0-magnitude-earthquake-rattles-taiwan/a-75317087?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 15:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Two killed in suspected Palestinian ramming and knife attack in Israel",
      "description": "Police say the attacker, from the occupied West Bank, ran over at least one person before stabbing another victim several miles away.",
      "url": "https://www.bbc.com/news/articles/c9d9znp22pyo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 23:49:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Mane rescues Senegal in draw with DR Congo, as Benin find first AFCON win",
      "description": "Former Liverpool forward Sadio Mane scores the equaliser as Senegal avoid DR Congo upset, while Benin beat Botswana.",
      "url": "https://www.aljazeera.com/sports/2025/12/27/mane-rescues-senegal-in-draw-with-dr-congo-as-benin-find-first-afcon-win?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 17:41:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Major winter storm sweeps across Nordic states",
      "description": "A falling branch killed one person near a Swedish ski resort. Thousands of homes in Finland, Sweden and Norway were left without power.",
      "url": "https://www.dw.com/en/major-winter-storm-sweeps-across-nordic-states/a-75317472?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 20:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russian drones, missiles pound Ukraine ahead of Zelensky's US visit",
      "description": "Russia attacked Kyiv and other parts of Ukraine with missiles and drones on Saturday (December 27), ahead of what President Volodymyr Zelensky said ⁠would be a crucial meeting with U.S. President Donald Trump to work out a plan to end nearly four years of war.",
      "url": "https://www.france24.com/en/video/20251227-russian-drones-missiles-pound-ukraine-ahead-of-zelensky-s-us-visit",
      "published": "Sat, 27 Dec 2025 15:29:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Fifteen injured in knife and chemical attack at tyre factory in Japan",
      "description": "Fifteen people have been injured after a knife and chemical attack at a tyre factory in Japan.",
      "url": "https://news.sky.com/story/15-injured-in-knife-and-chemical-attack-at-tyre-factory-in-japan-13487702",
      "published": "Sat, 27 Dec 2025 10:16:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "A magnitude 6.6 earthquake strikes off the coast of Taiwan",
      "description": "The U.S. Geological Survey says a magnitude 6.6 earthquake has hit Taiwan just off its northeast coast",
      "url": "https://abcnews.go.com/International/wireStory/magnitude-66-earthquake-strikes-off-coast-taiwan-128723667",
      "published": "Sat, 27 Dec 2025 14:36:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "At least 15 injured in a knife and chemical attack at a factory in Japan",
      "description": "A man has been arrested after stabbing eight people and injuring seven others with a chemical believed to be bleach at a rubber factory in central Japan",
      "url": "https://abcnews.go.com/International/wireStory/japanese-media-people-injured-after-stabbed-factory-central-128699763",
      "published": "Fri, 26 Dec 2025 06:02:45 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Crime lords turn Motor City into car-theft supermarket for Middle East buyers: ‘Somebody's getting paid’",
      "description": "International organized crime groups are recruiting juveniles to steal vehicles in Detroit before shipping them to the Middle East, alarming law enforcement officials.",
      "url": "https://www.foxnews.com/us/crime-lords-turn-motor-city-car-theft-supermarket-middle-east-buyers-somebodys-getting-paid",
      "published": "Sat, 27 Dec 2025 08:00:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Late-night joyride ends in disaster as driver smashes into towering Christmas tree on camera",
      "description": "Wild CCTV footage captures driver's joyride gone wrong as car crashes into Christmas tree in Kazakhstan square, toppling holiday display before fleeing.",
      "url": "https://www.foxnews.com/world/late-night-joyride-ends-disaster-driver-smashes-towering-christmas-tree-camera",
      "published": "Wed, 24 Dec 2025 18:49:39 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Central African Republic goes to polls as president seeks third term",
      "description": "Opposition hopes to tap into frustrations of people living in country where conflict remains a daily reality Central African Republic goes to the polls on Sunday with the president, Faustin-Archange Touadéra, seeking a third term. As many as 2.3 million registered voters will cast ballots for what observers are calling a quadruple election: votes for the presidency and parliament as well as local and municipal offices. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/central-african-republic-goes-to-polls-as-president-seeks-third-term",
      "published": "Sun, 28 Dec 2025 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Venezuela says it released 99 people detained for 2024 election protests",
      "description": "Government said the move was due to its ‘unrestricted respect for human rights’ in the face of US aggression Venezuela has said it has carried out its largest release of political prisoners this year, claiming to have freed 99 people detained for taking part in protests after the 2024 election, widely believed to have been stolen by the dictator Nicolás Maduro , as it comes under increasing military pressure from the US. Civil society organisations have treated the news with caution and stressed that the releases were insufficient, noting that at least 900 political prisoners remain in the country. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/venezuela-political-prisoner-release",
      "published": "Fri, 26 Dec 2025 14:25:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Russia attacks Kyiv, killing 1 and wounding many ahead of Ukraine-U.S. talks",
      "description": "Russia attacked Ukraine's capital with missiles and drones early Saturday morning, killing one and wounding over 20 people a day before talks between Ukraine and the U.S., local authorities said.",
      "url": "https://www.npr.org/2025/12/27/g-s1-103802/russia-attacks-kyiv-ahead-of-talks",
      "published": "Sat, 27 Dec 2025 05:44:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Myanmar's ruling junta says election will provide path to peace - but opponents criticise 'sham' vote",
      "description": "Yangon is Myanmar's beating heart. The bustle of busy market stalls and sight of glittering Buddhist monuments are a vision of the country those in power want the world to see.",
      "url": "https://news.sky.com/story/myanmars-ruling-junta-says-election-will-provide-path-to-peace-as-polls-open-but-opponents-criticise-sham-vote-13487942",
      "published": "Sat, 27 Dec 2025 22:55:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Myanmar is set to hold phased elections. Here's why they're being called a 'sham'",
      "description": "Myanmar's military rulers are holding a general election in phases starting Dec. 28 amid the country's civil war. The head of the U.N. says the vote will be anything but free and fair.",
      "url": "https://www.npr.org/2025/12/27/nx-s1-5649519/myanmar-election",
      "published": "Sat, 27 Dec 2025 05:01:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Guatemala: At least 15 killed after bus plunges into ravine",
      "description": "A passenger bus plunged into a ravine on the Inter-American Highway in western Guatemala, killing at least 15 people.",
      "url": "https://www.dw.com/en/guatemala-at-least-15-killed-after-bus-plunges-into-ravine/a-75316661?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 14:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "US air strikes in Nigeria targeted IS group fighters trying to enter from Sahel, govt says",
      "description": "US-backed air strikes in Nigeria targeted Islamic State group fighters who were attempting to enter the country from the Sahel region, according to the Nigerian government. US President Donald Trump said on his social media platform that the strikes were carried out on Thursday at the request of Nigeria's government, and that the group had been targeting Christians in the region.",
      "url": "https://www.france24.com/en/africa/20251227-us-air-strikes-nigeria-targeted-is-group-fighters-trying-enter-from-sahel",
      "published": "Sat, 27 Dec 2025 11:25:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "At least 15 killed in Guatemala as bus falls into ravine",
      "description": "A bus plunged into a ravine along Guatemala’s Inter-American Highway, killing at least 15 people, authorities said.",
      "url": "https://news.sky.com/story/at-least-15-killed-and-15-injured-in-guatemala-as-bus-falls-into-ravine-13487910",
      "published": "Sat, 27 Dec 2025 19:48:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Russia attacks Kyiv with missiles and drones, wounding 11 ahead of Ukraine-US meeting",
      "description": "Russia has attacked Ukraine's capital with missiles and drones, wounding at least 11 people",
      "url": "https://abcnews.go.com/International/wireStory/russia-attacks-kyiv-missiles-drones-wounding-11-ahead-128717011",
      "published": "Sat, 27 Dec 2025 04:17:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Polls open for military-ruled Myanmar's first election in 5 years",
      "description": "Voters in Myanmar are participating in the first phase of the country’s general election, held under military rule amid a civil war",
      "url": "https://abcnews.go.com/International/wireStory/polls-open-military-ruled-myanmars-election-5-years-128726023",
      "published": "Sat, 27 Dec 2025 19:14:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Pakistan summons UK diplomat over a threat to army chief during a rally",
      "description": "Pakistan has summoned Britain’s deputy high commissioner after a viral video showed a woman at a rally in the city of Bradford saying the Pakistani army chief would die in a possible attack",
      "url": "https://abcnews.go.com/International/wireStory/pakistan-summons-uk-diplomat-threat-army-chief-rally-128706850",
      "published": "Fri, 26 Dec 2025 11:45:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza aid restrictions, Syria humanitarian needs, lawyer reprisals in Burundi",
      "description": "The UN and partners continue to provide assistance to people in Gaza, where recent winter storms have worsened conditions for thousands across the enclave.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166663",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Cruise ship hits reef on first trip since leaving passenger on island",
      "description": "The Coral Adventurer is under investigation for the death of Suzanne Rees, who was found dead on a remote island after being left behind by the ship.",
      "url": "https://www.bbc.com/news/articles/cd9z1k4g40jo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 04:35:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Two dead in 50-vehicle pile up on Japan highway",
      "description": "A further 26 people are injured in the crash on a highway in central Japan, police say.",
      "url": "https://www.bbc.com/news/articles/c157e9dddwwo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 12:03:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Former Malaysian PM Najib Razak jailed for 15 more years in 1MDB graft scandal",
      "description": "New conviction over plunder of state fund substantially increases six-year term in separate case The jailed former Malaysian prime minister Najib Razak has been sentenced to an additional 15 years after he was found guilty of abuse of power, in the biggest trial yet in the multibillion-dollar fraud scandal related to the state fund 1MDB. Najib’s conviction substantially increases the six-year prison term he is already serving for a separate case related to the 1MDB graft scandal, one of the world’s biggest financial frauds in which billions were plundered from the now defunct sovereign wealth fund. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/former-malaysian-pm-najib-razak-found-guilty-of-abuse-of-power-in-latest-1mdb-trial",
      "published": "Fri, 26 Dec 2025 16:35:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peak Oil: Why the world can't break its fossil fuel habit",
      "description": "Climate change shifted the oil production debate from scarcity to demand. If countries do not deliver on ambitious green pledges, one expert predicts that production may peak within two years, forcing a chaotic decline.",
      "url": "https://www.dw.com/en/peak-oil-why-the-world-can-t-break-its-fossil-fuel-habit/a-75214502?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 12:32:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Turkey holds military funeral for Libyan officers killed in plane crash",
      "description": "Turkey has held a military funeral for five Libyan officers who died in a plane crash earlier this week",
      "url": "https://abcnews.go.com/International/wireStory/turkey-holds-military-funeral-libyan-officers-killed-plane-128716907",
      "published": "Sat, 27 Dec 2025 01:45:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Kosovo heads to a snap vote to end political deadlock",
      "description": "Voters in Kosovo are headed for a second election this year in a bid to resolve a political deadlock that has threatened to push the small Balkan nation into a prolonged crisis",
      "url": "https://abcnews.go.com/International/wireStory/kosovo-heads-snap-vote-end-political-deadlock-128716540",
      "published": "Sat, 27 Dec 2025 01:45:32 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Murder in small-town America: The crimes that tore quiet communities apart in 2025",
      "description": "Small towns across the United States faced shocking violence in 2025, exposing deep vulnerabilities in quiet communities from Mississippi to Montana.",
      "url": "https://www.foxnews.com/us/murder-small-town-america-crimes-tore-quiet-communities-apart-2025",
      "published": "Sat, 27 Dec 2025 14:00:39 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Christmas spirit returns to Jesus' birthplace after more than two years of war",
      "description": "Thousands celebrate Christmas in Bethlehem for the first time since the implementation of the U.S.-brokered Israel-Hamas ceasefire agreement.",
      "url": "https://www.foxnews.com/world/christmas-spirit-returns-jesus-birthplace-after-more-than-two-years-war",
      "published": "Wed, 24 Dec 2025 10:51:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "M 6.0 - 2025 Taitung, Taiwan Earthquake",
      "description": "PAGER - GREEN ShakeMap - VII DYFI? - VI Time 2025-12-24 09:47:06 UTC 2025-12-24 09:47:06 UTC at epicenter Location 22.851°N 121.207°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rkjm",
      "published": "2025-12-27T15:33:29.814Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The latest on the nuclear sub deal between the U.S. and South Korea",
      "description": "The U.S. will shift some of the burden of defense to its allies, and it will equip them for it. One ally's equipment: nuclear submarines for South Korea.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5648214/the-latest-on-the-nuclear-sub-deal-between-the-u-s-and-south-korea",
      "published": "Fri, 26 Dec 2025 17:46:18 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Munich surfers abandon attempt to restart Eisbach wave",
      "description": "City authorities are putting up unnecessary resistance to restoring the world-famous surf spot, the local sports association said.",
      "url": "https://www.dw.com/en/munich-surfers-abandon-attempt-to-restart-eisbach-wave/a-75313639?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 08:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Live: Zelensky to meet Trump for talks on Ukraine peace plan",
      "description": "US President Donald Trump will meet his Ukrainian counterpart, Volodymyr Zelensky, in Florida on Sunday for talks on a peace agreement to end the nearly four-year war with Russia. This comes as Moscow's Foreign ​Minister Sergei Lavrov said that any ‍European ​troops deployed ⁠to Ukraine would become legitimate targets for ​Russia’s armed ‍forces, according to state news agency TASS. Follow our liveblog for the latest updates.",
      "url": "https://www.france24.com/en/europe/20251228-live-zelensky-to-meet-trump-for-talks-on-ukraine-peace-plan",
      "published": "Sun, 28 Dec 2025 06:08:13 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Myanmar heads to the polls for first election since military seized power",
      "description": "Voters head to the polls on Sunday for Myanmar's heavily restricted election that campaigners, Western diplomats and the UN's rights chief have all condemned. The Southeast Asian nation is riven by civil war, and residents will not be able to cast ballots in areas controlled by rebel factions.",
      "url": "https://www.france24.com/en/live-news/20251227-myanmar-junta-stages-election-after-five-years-of-civil-war",
      "published": "Sat, 27 Dec 2025 21:03:17 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Saudi-led coalition in Yemen warns UAE-backed separatists of immediate action",
      "description": "The Saudi-led coalition in Yemen has warned it will respond immediately to any military movements of separatists backed by the United Arab Emirates that undermine de-escalation efforts in the south, as the United States urged diplomacy",
      "url": "https://abcnews.go.com/International/wireStory/saudi-led-coalition-yemen-warns-uae-backed-separatists-128717707",
      "published": "Sat, 27 Dec 2025 06:49:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Turkish authorities say arrested suspected IS member was planning New Year's attacks",
      "description": "Turkish authorities have apprehended a suspected member of the extremist Islamic State group planning attacks on New Year's celebrations",
      "url": "https://abcnews.go.com/International/wireStory/turkish-authorities-arrested-suspected-member-planning-new-years-128699759",
      "published": "Fri, 26 Dec 2025 04:51:18 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Grand jury declines to indict man in deadly Kentucky State University shooting",
      "description": "A grand jury refused to indict a father of two Kentucky State University students who shot two people who were beating his son's head against the pavement.",
      "url": "https://www.foxnews.com/us/grand-jury-declines-indict-man-deadly-kentucky-state-university-shooting",
      "published": "Fri, 26 Dec 2025 10:25:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "North Korea releases images of development of nuclear-powered submarine",
      "description": "New photos show North Korea's apparent progress in the development of a nuclear-powered submarine as Kim Jong Un condemns South Korea's efforts.",
      "url": "https://www.foxnews.com/world/north-korea-releases-images-development-nuclear-powered-submarine",
      "published": "Thu, 25 Dec 2025 07:46:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "BBC visits Myanmar polling station as civil war rages on",
      "description": "Voters in Myanmar's election say the poll is taking place in a \"climate of fear\", the BBC's South East Asia Correspondent Jonathan Head reports.",
      "url": "https://www.bbc.com/news/videos/cwyv4gwyxxwo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 04:23:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "US launches strikes against Islamic State in Nigeria",
      "description": "Trump tells Politico he ordered the strikes as \"a Christmas present\" - contradicting a statement by Nigerian officials.",
      "url": "https://www.bbc.com/news/articles/cj69j8l918do?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 16:54:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Bus accident leaves 15 dead in Guatemala, government declares 3-day mourning period",
      "description": "An intermunicipal bus in Guatemala veered off a road and fell into a deep ravine, killing 15 passengers and injuring at least 15 others",
      "url": "https://abcnews.go.com/International/wireStory/bus-accident-leaves-15-dead-guatemala-government-declares-128724173",
      "published": "Sat, 27 Dec 2025 14:51:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Times Square ball goes red, white and blue for America's 250th birthday",
      "description": "Times Square's 2025 ball drop will sparkle in red, white and blue patriotic colors to kick off America's 250th birthday celebrations nationwide this year.",
      "url": "https://www.foxnews.com/us/times-square-ball-goes-red-white-blue-americas-250th-birthday",
      "published": "Fri, 26 Dec 2025 13:22:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Brown, MIT shootings may have stemmed from suspect’s failures, fixation on scientist’s success: report",
      "description": "Portuguese official reveals suspected shooter allegedly fixated on MIT scientist as symbol of success he never achieved in tragic academic obsession case.",
      "url": "https://www.foxnews.com/us/brown-mit-shootings-may-have-stemmed-from-suspects-failures-fixation-scientists-success-report",
      "published": "Fri, 26 Dec 2025 11:24:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Annette Dionne, last surviving Dionne quintuplet, dies aged 91",
      "description": "The sisters, who were the first known quintuplets to survive past infancy, became a global phenomenon after their 1934 birth.",
      "url": "https://www.bbc.com/news/articles/cpvd90k2zn4o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 22:24:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Ex-Malaysia PM Najib Razak given 15-year jail term over state funds scandal",
      "description": "Najib was convicted for his role in the billion-dollar scandal involving the country's sovereign wealth fund 1MDB.",
      "url": "https://www.bbc.com/news/articles/crk7y27vp1eo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 14:15:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Investigation after jet carrying Libyan officers crashes in Turkiye",
      "description": "Authorities are examining a wide range of data, including flight recordings and airpot CCTV footage, officials say.",
      "url": "https://www.aljazeera.com/news/2025/12/27/investigation-after-jet-carrying-libyan-officers-crashes-in-turkiye?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 14:34:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "What happened to U.S. foreign aid this year?",
      "description": "Historically, the U.S. had been the top donor for global health. That changed dramatically this year. We look at the new approach the U.S. is pursuing and what this has meant for people on the ground.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5638557/what-happened-to-u-s-foreign-aid-this-year",
      "published": "Fri, 26 Dec 2025 16:59:26 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Germany at the 2026 World Cup: What next?",
      "description": "Now that they have qualified and drawn in group E, Germany head into the final part of their 2026 World Cup preparations. Here's what to know.",
      "url": "https://www.dw.com/en/germany-at-the-2026-world-cup-what-next/a-74787002?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 14:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Blast at mosque in Nigeria kills 5 and injures more than 30 in apparent suicide attack",
      "description": "A bomb has exploded during prayers at a mosque in Nigeria's northeastern city of Maiduguri, killing five people",
      "url": "https://abcnews.go.com/International/wireStory/blast-mosque-nigeria-kills-5-injures-30-apparent-128689527",
      "published": "Thu, 25 Dec 2025 06:57:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "First Person: Felipe Paullier, the youngest ever senior UN official, charged with giving a voice to young people around the world",
      "description": "A paediatrician by training, Felipe Paullier has long been an advocate for youth. Formerly Director of the Uruguayan Government's Youth Institute, a role which involved several joint actions with various UN agencies, he was appointed to run the UN Youth Office in 2023, the youngest senior appointment in United Nations history.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166651",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Paper and wood: Forest products show signs of recovery, UN agency says",
      "description": "From wood-based panels used in construction, to charcoal for cooking food, forest products are valued and traded all around the world.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166666",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "War-torn Myanmar voting in widely criticised 'sham' election",
      "description": "Observers say the vote, accompanied by a renewed crackdown on dissent, is meant to entrench the junta's power.",
      "url": "https://www.bbc.com/news/articles/cy7vly6gm76o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 06:49:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Four hikers found dead after avalanche in central Greece",
      "description": "A search operation was launched after three men and a woman went missing on Christmas Day.",
      "url": "https://www.bbc.com/news/articles/c23ejnge95jo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 12:36:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Rich and voiceless: How Putin has kept Russia's billionaires on side in the war",
      "description": "Western sanctions have failed to turn the uber-rich into opponents, and Putin's policies have turned them into silent backers.",
      "url": "https://www.bbc.com/news/articles/c4g6xgv1n41o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 00:44:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,403",
      "description": "These are the key developments from day 1,403 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2025/12/28/russia-ukraine-war-list-of-key-events-day-1403?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 00:54:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "What’s happening in Myanmar’s civil war as military stages elections?",
      "description": "Myanmar's military seeks to entrench rule as it begins to claw back territory and China presses for stability.",
      "url": "https://www.aljazeera.com/news/2025/12/27/whats-happening-in-myanmars-civil-war-as-military-holds-elections?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 17:45:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Weather tracker: Deep freeze grips Canada as US records warmest Christmas",
      "description": "Temperatures plunge below -50C in the Yukon, while swaths of US experience springlike weather Northern Canada has been gripped by an intense and prolonged cold spell, with temperatures hovering between -20C and -40C for weeks. On Tuesday, Braeburn in the Yukon recorded -55.7C, its coldest December temperature since 1975. Meanwhile, Mayo and Dawson endured 16 consecutive nights below -40C, with Mayo plunging to -50.4C on Monday. Whitehorse also recorded 10 nights when temperatures dropped below -30C. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/weather-tracker-deep-freeze-canada-us-records-warmest-christmas",
      "published": "Fri, 26 Dec 2025 11:52:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "U.S. strikes alleged Islamic State camps in Nigeria",
      "description": "President Trump ordered U.S. strikes on ISIS targets in northwest Nigeria, in response to what he claimed is persecution of Christians",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5658261/u-s-strikes-alleged-islamic-state-camps-in-nigeria",
      "published": "Fri, 26 Dec 2025 16:39:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Guinea junta leader Doumbouya expected to win election",
      "description": "Doumbouya, who seized power in a 2021 coup, faces weak opposition as UN warns of intimidation and restricted freedoms ahead of the vote.",
      "url": "https://www.dw.com/en/guinea-junta-leader-doumbouya-expected-to-win-election/a-75318988?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 07:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Kosovo votes again amid political deadlock",
      "description": "With parliament paralysed and EU-backed loans at risk, parties face pressure to compromise as Kosovars vote again, unsure whether any result can restore governance, unlock funding and ease a deepening political crisis.",
      "url": "https://www.dw.com/en/kosovo-votes-again-amid-political-deadlock/a-75319167?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 07:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Myanmar's military junta holds controversial election",
      "description": "Civil war-torn Myanmar went to the polls on Sunday in a three-phased election. Critics say the political exercise is a ploy to keep the military's grip on power.",
      "url": "https://www.dw.com/en/myanmar-s-military-junta-holds-controversial-election/a-75318714?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 03:43:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Putin has barely shifted on Ukraine - and any Russian reluctance to peace plan will be a test for Trump",
      "description": "Amid the forward momentum, it's telling that Trump touched the brakes.",
      "url": "https://news.sky.com/story/vladimir-putin-has-barely-shifted-on-ukraine-and-any-russian-reluctance-to-peace-plan-will-be-a-test-for-donald-trump-13487952",
      "published": "Sun, 28 Dec 2025 02:21:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Florida bell ringer allegedly tries to 'impale' store manager with donation tripod while drunk",
      "description": "Drunken bell ringer Steven Pavlik, 63, allegedly attacked a Publix manager with a tripod after confronting shoppers outside a Stuart, Florida, store location.",
      "url": "https://www.foxnews.com/us/florida-bell-ringer-allegedly-tries-impale-store-manager-donation-tripod-drunk",
      "published": "Sat, 27 Dec 2025 17:03:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Texas father rescues kidnapped daughter by tracing her phone's location, sheriff's office says",
      "description": "The Montgomery County Sheriff's Office said a father in Texas found his kidnapped 15-year-old daughter on Christmas Day by tracing her phone's location.",
      "url": "https://www.foxnews.com/us/texas-father-rescues-kidnapped-daughter-tracing-her-phones-location-sheriffs-office-says",
      "published": "Sat, 27 Dec 2025 13:36:34 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "California family revives beloved Christmas tradition with surprise sleepover visit",
      "description": "A California family surprised grandparents with a heartwarming Christmas sleepover at home, reviving a 25-year tradition in a viral video.",
      "url": "https://www.foxnews.com/us/california-family-revives-beloved-christmas-tradition-surprise-sleepover-visit",
      "published": "Fri, 26 Dec 2025 21:17:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Stabbing spree, chemical attack at Japan factory injures 15",
      "description": "A 38-year-old male suspect is in custody following an alleged stabbing spree and chemical attack at a Yokohama Rubber Co. tire factory in central Japan.",
      "url": "https://www.foxnews.com/world/stabbing-spree-chemical-attack-japan-factory-injures-15",
      "published": "Sat, 27 Dec 2025 09:50:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK restricts DR Congo visas over migrant return policy",
      "description": "The Home Office says Kinshasa has failed to agree to measures allowing the return of illegal immigrants and foreign national offenders.",
      "url": "https://www.bbc.com/news/articles/c5y21xlxng2o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 22:35:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump-backed candidate Asfura declared new president of Honduras",
      "description": "Winning margin of 28,000 votes announced a month late but before review of all ‘inconsistent’ ballots was completed Donald Trump-backed candidate Nasry “Tito” Asfura has been declared the winner of Honduras’s presidential election after a vote count that dragged on for almost a month and was marred by fraud allegations and criticism of interference by the US president . The rightwing Asfura, 67, a construction magnate and former mayor of the capital, Tegucigalpa, secured 40.27% of the vote, against 39.53% for the centre-right Salvador Nasralla, a margin of just 28,000 votes. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/24/honduras-nasry-tito-asfura-declared-president-donald-trump-backed",
      "published": "Wed, 24 Dec 2025 23:42:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Snow storm blankets New York City, disrupting holiday travel",
      "description": "Thousands of flights were cancelled or delayed during the busy travel period between Christmas and New Year's Eve. Forecasters said the worst of the storm had passed and conditions were set to clear.",
      "url": "https://www.dw.com/en/snow-storm-blankets-new-york-city-disrupting-holiday-travel/a-75318333?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 28 Dec 2025 00:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "The man saving Lebanon's cinema history, a poster at a time",
      "description": "In a country without film archives, one man is preserving Lebanon's film industry history. With thousands of movie posters, Abboudi Bou Jaoude is saving cinematic heritage in an archive that's emotional for many.",
      "url": "https://www.dw.com/en/the-man-saving-lebanon-s-cinema-history-a-poster-at-a-time/a-75312263?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 20:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Cote d'Ivoire election held amid opposition boycott",
      "description": "Voting was held in parliamentary elections in the West African country, despite allegations of repression for opposition parties.",
      "url": "https://www.dw.com/en/cote-d-ivoire-election-held-amid-opposition-boycott/a-75314914?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 11:44:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Berlin: Archaeologists on a treasure hunt in the capital",
      "description": "As traces of the Middle Ages are uncovered in the heart of Berlin, a new museum — PETRI Berlin — has been founded to house these discoveries.",
      "url": "https://www.dw.com/en/berlin-archaeologists-on-a-treasure-hunt-in-the-capital/a-75263442?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 10:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Israel criticised after becoming first country to formally recognise Somaliland as independent nation",
      "description": "Israel has been criticised after it became the first country to formally recognise Somalia's breakaway region of Somaliland as an independent nation.",
      "url": "https://news.sky.com/story/israel-criticised-after-becoming-first-country-to-formally-recognise-somaliland-as-independent-nation-13487923",
      "published": "Sat, 27 Dec 2025 20:51:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Israel becomes first country to recognize Somaliland; Trump 'not ready'",
      "description": "Israel became the first country to officially recognize Somaliland as an independent nation in a historic diplomatic move tied to the Abraham Accords framework.",
      "url": "https://www.foxnews.com/world/israel-becomes-first-country-recognize-somaliland-trump-not-ready",
      "published": "Fri, 26 Dec 2025 18:42:07 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Thailand-Cambodia ceasefire begins after weeks of deadly clashes",
      "description": "Almost one million people were displaced when hostilities resumed earlier this month after the first truce broke.",
      "url": "https://www.bbc.com/news/articles/c0q5je8048xo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 13:55:22 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "New York blanketed in snow, sparking travel chaos",
      "description": "Hundreds of flights have been cancelled and more than 3,000 were delayed by the winter storm.",
      "url": "https://www.bbc.com/news/articles/c0je0l55zq3o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 01:54:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Do Donald Trump’s strikes in Nigeria serve any purpose?",
      "description": "The US president says air strikes are against ISIL, claiming the group targets Christians.",
      "url": "https://www.aljazeera.com/video/inside-story/2025/12/27/do-donald-trumps-strikes-in-nigeria-serve-any-purpose?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 19:16:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thailand and Cambodia sign new ceasefire agreement to end border fighting",
      "description": "In addition to ending fighting, the agreement calls for no further military movements by either side and no violations of either side's airspace for military purposes.",
      "url": "https://www.npr.org/2025/12/27/g-s1-103785/thailand-cambodia-new-ceasefire-agreement",
      "published": "Sat, 27 Dec 2025 02:44:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Achraf Hakimi and football's growing issue: playing time",
      "description": "According to a new FIFPRO report, Morocco and Paris Saint-Germain star Achraf Hakimi is a footballer at his limit, having had a season that lasted nearly a whole year. After an injury, he is now at AFCON with Morocco.",
      "url": "https://www.dw.com/en/achraf-hakimi-and-football-s-growing-issue-playing-time/a-74145216?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 14:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine updates: Russia pummels Kyiv, Zelenskyy heads to US",
      "description": "Russia launched missile and drone strikes on Kyiv and other Ukrainian regions, ahead of President Volodmyr Zelenskyy's key meeting with US President Trump. Follow DW for more.",
      "url": "https://www.dw.com/en/ukraine-updates-russia-pummels-kyiv-zelenskyy-heads-to-us/live-75308039?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 09:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thailand and Cambodia sign ceasefire agreement after weeks of intense fighting",
      "description": "Thailand and Cambodia have signed a ceasefire agreement to end weeks of armed combat along their border over competing claims to territory.",
      "url": "https://news.sky.com/story/thailand-and-cambodia-sign-ceasefire-agreement-after-weeks-of-intense-fighting-13487680",
      "published": "Sat, 27 Dec 2025 06:52:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Thailand and Cambodia sign new ceasefire agreement to end border fighting",
      "description": "Thailand and Cambodia have signed an agreement to implement a ceasefire to end weeks of armed combat along their border over competing claims to territory",
      "url": "https://abcnews.go.com/International/wireStory/thailand-cambodia-sign-new-ceasefire-agreement-end-border-128716722",
      "published": "Sat, 27 Dec 2025 01:50:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump launches Christmas night airstrikes in Nigeria and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/trump-launches-christmas-night-airstrikes-nigeria-more-top-headlines",
      "published": "Fri, 26 Dec 2025 07:23:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Nigeria says it shared intelligence to support US strikes on ISIS",
      "description": "Nigeria confirmed it shared intelligence with the U.S. ahead of Christmas night airstrikes against ISIS targets accused of killing Christians.",
      "url": "https://www.foxnews.com/world/nigeria-says-shared-intelligence-support-us-strikes-isis",
      "published": "Fri, 26 Dec 2025 07:34:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel recognises Somaliland as independent state, Netanyahu says",
      "description": "The decision has been condemned by Somalia, Egypt, Turkey and Djibouti, who call it a dangerous precedent.",
      "url": "https://www.bbc.com/news/articles/c4g417md05go?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 21:44:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Saudi coalition will counter Yemen separatists undermining de-escalation",
      "description": "Saudi defence minister urges Yemen's STC to withdraw \"peacefully\" from seized provinces, Hadramout and al-Mahra.",
      "url": "https://www.aljazeera.com/news/2025/12/27/saudi-says-it-will-militarily-back-yemens-government-against-separatists?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 16:36:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "How the U.S. has changed its approach to foreign aid this year",
      "description": "This year saw the dismantling of USAID, the United States' premier aid agency. What was the impact and what does the future of U.S. foreign aid look like in the health realm?",
      "url": "https://www.npr.org/2025/12/27/nx-s1-5653295/how-the-u-s-has-changed-its-approach-to-foreign-aid-this-year",
      "published": "Sat, 27 Dec 2025 07:43:30 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Development cooperation agreement marks new phase in UN-Iraq partnership",
      "description": "Better access to education, the protection of the environment and good governance are some of the areas in which the United Nations helps countries improve.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166670",
      "published": "Fri, 26 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "DR Congo: Displaced people in South Kivu close to ‘utter desperation’, WFP says",
      "description": "An estimated 500,000 people have been forced from their homes since fighting erupted in South Kivu province, Democratic Republic of Congo (DRC), at the beginning of December.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166657",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "WATCH: Video shows suspect push trooper to ground before stealing patrol cruiser on Christmas Day",
      "description": "Dramatic video shows a suspect allegedly pulling a Washington trooper from a car on Christmas Day and stealing a cruiser on a Seattle interstate before his arrest.",
      "url": "https://www.foxnews.com/us/watch-video-shows-suspect-push-trooper-ground-before-stealing-patrol-cruiser-christmas-day",
      "published": "Fri, 26 Dec 2025 19:00:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Russian forces near collapse in Kupyansk as Moscow allies concede city lost: report",
      "description": "Russian forces were reportedly cut off and surrendering in Ukraine's Kupyansk as supply lines fail. Only dozens of isolated troops remain in the strategic city.",
      "url": "https://www.foxnews.com/world/russian-forces-near-collapse-kupyansk-moscow-allies-concede-city-lost-report",
      "published": "Thu, 25 Dec 2025 21:04:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Kennedy Center seeks $1m from musician who cancelled after Trump name added to venue",
      "description": "Drummer Chuck Redd reportedly called off his Christmas Eve performance after a vote by the board to rename the site.",
      "url": "https://www.bbc.com/news/articles/cz68q3p8xqxo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 19:00:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Taiwan rocked by magnitude 7.0 quake but no major damage reported",
      "description": "The weather administration said damage from the quake should be limited because it was deep and hit offshore.",
      "url": "https://www.aljazeera.com/news/2025/12/27/taiwan-rocked-by-7-0-magnitude-quake-but-no-major-damage-reported?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 17:50:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine peace talks: What are the major issues remaining as Zelenskyy prepares to meet Trump?",
      "description": "Volodymyr Zelenskyy is set to meet Donald Trump in Florida on Sunday for further talks aimed at ending Russia's invasion of Ukraine.",
      "url": "https://news.sky.com/story/ukraine-peace-talks-what-are-the-major-issues-remaining-as-zelenskyy-prepares-to-meet-trump-13487781",
      "published": "Sat, 27 Dec 2025 15:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Brazilian judge puts coup plot convicts under house arrest after former police commander flees",
      "description": "A Brazilian judge has issued house arrest orders for 10 people involved in a plot to keep former President Jair Bolsonaro in power after his 2022 election loss",
      "url": "https://abcnews.go.com/International/wireStory/brazilian-judge-puts-coup-plot-convicts-house-arrest-128722156",
      "published": "Sat, 27 Dec 2025 12:02:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Former Florida law enforcement officer accused of forcing 6-year-old underwater in hotel pool: report",
      "description": "Former law enforcement officer Tiffany Lee Griffith has been charged with aggravated child abuse after allegedly holding a 6-year-old underwater at a Florida hotel.",
      "url": "https://www.foxnews.com/us/former-florida-law-enforcement-officer-accused-forcing-6-year-old-underwater-hotel-pool-report",
      "published": "Fri, 26 Dec 2025 21:29:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Christmas returns to Holy Land cities as Bethlehem’s Christian population dwindles, Nazareth remains strong",
      "description": "Christmas returns to Bethlehem amid ongoing concerns over Christian population decline from 86% in 1950 to just 10% today, while Nazareth enjoys growth.",
      "url": "https://www.foxnews.com/world/christmas-returns-holy-land-cities-bethlehems-christian-population-dwindles-nazareth-remains-strong",
      "published": "Thu, 25 Dec 2025 15:24:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Villa come back at Chelsea, while Arsenal and Man City win again",
      "description": "Aston Villa win 2-1 at Chelsea in the English Premier League, while leaders Arsenal and Man City maintain pace.",
      "url": "https://www.aljazeera.com/sports/2025/12/27/villa-comeback-at-chelsea-while-arsenal-and-man-city-win-again?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 21:59:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Australian cruise ship investigated after leaving passenger behind runs aground off PNG with 120 people on board",
      "description": "Coral Adventurer says passengers and crew are safe while team tries to refloat ship and inspects the hull Get our breaking news email , free app or daily news podcast An Australian cruise ship being investigated after allegedly leaving behind a passenger who died alone has run aground off the coast of Papua New Guinea with more than 120 people aboard. The Coral Adventurer ran aground early on Saturday morning, about 30km from PNG’s second-largest city, Lae. The vessel’s operator, Coral Expeditions, said no one was hurt in the incident. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/australian-cruise-ship-investigated-after-leaving-passenger-behind-runs-aground-off-png-with-120-people-on-board",
      "published": "Sun, 28 Dec 2025 05:31:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Zelensky says Russia 'doesn't want peace', ahead of Florida meeting with Trump",
      "description": "The pair are expected to discuss territorial concessions and security guarantees during the negotiations.",
      "url": "https://www.bbc.com/news/articles/c1dzvpg1341o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 05:53:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Snow-capped Mount Etna erupts as skiers glide down slopes",
      "description": "Scientists say volcanic activity at the site, which frequently erupts, had intensified this week, with craters continuously emitting ash.",
      "url": "https://www.bbc.com/news/videos/cz7n4px7e41o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 28 Dec 2025 01:40:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nine arrested in Italy for allegedly raising millions for Hamas",
      "description": "Police say the suspects raised around €7m (£6m) for the militant group over more than two years.",
      "url": "https://www.bbc.com/news/articles/cqxq59np394o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 27 Dec 2025 15:25:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'We will vote but not with our hearts': Inside the election staged by Myanmar's military rulers",
      "description": "This is the first election since the army's coup in early 2021 - and it is being widely condemned as a sham.",
      "url": "https://www.bbc.com/news/articles/cwyxller1j5o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 26 Dec 2025 23:01:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Kosovo votes in snap election to end a year of political deadlock",
      "description": "The Balkan nation votes again as PM Albin Kurti seeks majority to break the stalemate and form a government.",
      "url": "https://www.aljazeera.com/news/2025/12/28/kosovo-votes-in-snap-election-to-end-a-year-of-political-deadlock?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 07:10:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil court orders house arrest for Bolsonaro accomplices",
      "description": "Move comes after a former police chief convicted in the coup plot was caught in Paraguay trying to flee to El Salvador.",
      "url": "https://www.aljazeera.com/news/2025/12/28/brazil-court-orders-house-arrest-for-bolsonaro-accomplices?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 07:08:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The TAZARA turns 50: Riding the railway that bridges Tanzania and Zambia",
      "description": "Businesspeople, students, tourists among those sharing space on the 1,860km TAZARA railway built by China in the 1970s.",
      "url": "https://www.aljazeera.com/features/longform/2025/12/28/the-tazara-turns-50-riding-the-railway-that-bridges-tanzania-and-zambia?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 05:57:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK curbs DRC visas, announces migrant return deals with Angola, Namibia",
      "description": "Home Office announces visa restrictions on DRC for alleged failure to cooperate with UK's new migrant return policy.",
      "url": "https://www.aljazeera.com/news/2025/12/28/uk-curbs-drc-visas-announces-migrant-return-deals-with-angola-namibia?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 04:40:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar votes as military holds first election since 2021 coup",
      "description": "The UN, human rights groups and opposition parties say the electoral process is not free, fair or credible.",
      "url": "https://www.aljazeera.com/news/2025/12/28/polls-open-in-myanmar-as-military-stages-first-election-since-2021-coup?traffic_source=rss",
      "published": "Sun, 28 Dec 2025 02:13:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria reach AFCON knockouts despite late Tunisia scare",
      "description": "Nigeria handed nervy ending by Tunisia but hold on to become second team to reach 2025 Africa Cup of Nations knockouts.",
      "url": "https://www.aljazeera.com/sports/2025/12/27/nigeria-reach-afcon-knockouts-despite-late-tunisia-scare?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 22:35:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria vs Tunisia 3-2: AFCON 2025 – as it happened",
      "description": "All the updates from our text commentary stream of the Africa Cup of Nations tie, as the Super Eagles win 3-2 in Fez.",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/12/27/live-nigeria-vs-tunisia-afcon-2025?traffic_source=rss",
      "published": "Sat, 27 Dec 2025 16:34:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Opposition anger as Guinea’s junta leader is frontrunner to be elected president",
      "description": "Mamady Doumbouya accused of betraying his promise to be the restorer of democracy after leading 2021 coup In September 2021, a tall, young colonel in the Guinean army announced that he and his comrades had forcibly seized power and toppled the longtime leader Alpha Condé. “The will of the strongest has always supplanted the law,” Mamady Doumbouya said in a speech, stressing that the soldiers were acting to restore the will of the people. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/27/guinea-junta-leader-mamady-doumbouya-frontrunner-president-election",
      "published": "Sat, 27 Dec 2025 08:00:33 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "British-Egyptian activist Alaa Abd el-Fattah arrives in UK after travel ban lifted",
      "description": "Family say campaigner, who has a son in Brighton, will be able to travel freely between UK and Cairo months after his release from Egyptian jail The British-Egyptian dissident Alaa Abd el-Fattah has arrived in London after the Egyptian government lifted a travel ban that it had imposed on him despite releasing him from jail in September . Abd el-Fattah had been held in jail nearly continuously for 10 years, mainly due to expressing his opposition to the treatment of dissidents by the Egyptian government. He had been detained in jail two years beyond his five-year sentence as the Cairo authorities refused to recognise the period he held in pre-trial detention as part of his time served. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/british-egyptian-activist-alaa-abd-el-fattah-arrives-in-uk-after-travel-ban-lifted",
      "published": "Fri, 26 Dec 2025 17:57:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar is going to the polls. But it’s not the people who hold the power – it’s China",
      "description": "As the military pushes ahead with a widely condemned election, Beijing’s priorities are proving decisive Myanmar’s first election since the 2021 coup: everything you need to know Myanmar’s military has managed to regain momentum in its battle against a determined patchwork of opposition groups, retaking some territory, and pushing ahead with a widely condemned election that begins on Sunday. It is a turnaround for the military, which had appeared so beleaguered that some dared to question if it could collapse. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/28/myanmar-is-going-to-the-polls-but-its-not-the-people-who-hold-the-power-its-china",
      "published": "Sun, 28 Dec 2025 00:01:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China imposes sanctions on US defence firms over Taiwan arms deal",
      "description": "$10bn Trump-approved sale to Taipei triggers Beijing sanctions against firms such as Boeing and Northrop Grumman China’s foreign ministry has hit US defence companies including Boeing with sanctions after Donald Trump approved a large package of arms sales to Taiwan. The ministry said on Friday that the measures – against 10 individuals and 20 US firms including Boeing’s production hub at St Louis in Missouri – would freeze any assets the companies and individuals hold in China and bar domestic organisations and individuals from doing business with them. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/26/china-imposes-sanctions-on-us-defence-firms-over-taiwan-arms-deal",
      "published": "Fri, 26 Dec 2025 16:01:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Man charged with displaying Nazi hate symbol after showing off tattoos at NSW beach",
      "description": "Man spotted at beach in Newcastle on Wednesday with tattoos linked to white supremacist ideology Get our breaking news email , free app or daily news podcast A man who allegedly displayed Nazi hate symbols by showing off his tattoos at a popular beach in New South Wales has been charged. Ben Parsons was at Bar beach in Newcastle on 24 December with his children, when he noticed a man with tattoos linked to white supremacist ideology, including symbols associated with the Nazi SS. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/28/man-charged-with-displaying-nazi-hate-symbol-after-showing-off-tattoos-at-nsw-beach-ntwnfb",
      "published": "Sun, 28 Dec 2025 00:36:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.2 - 36 km W of Puerto Santa, Peru",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - V Time 2025-12-28 02:51:50 UTC 2025-12-28 02:51:50 UTC at epicenter Location 8.960°S 78.974°W Depth 66.41 km (41.27 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl57",
      "published": "2025-12-28T05:17:46.846Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.6 - 31 km ESE of Yilan, Taiwan",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-27 15:05:56 UTC 2025-12-27 15:05:56 UTC at epicenter Location 24.657°N 122.041°E Depth 67.53 km (41.96 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rl2n",
      "published": "2025-12-28T07:11:54.560Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 42 km NNE of Goroka, Papua New Guinea",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-22 10:31:28 UTC 2025-12-22 10:31:28 UTC at epicenter Location 5.720°S 145.496°E Depth 110.18 km (68.46 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000rwgh",
      "published": "2025-12-23T10:56:00.234Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'It's behind you!' How Britain goes wild for pantomimes during the holidays",
      "description": "Pantomimes are plays based on a well-known story — often a fairy tale — which are given a bawdy twist. The audience is expected to join in throughout, shouting as loudly as they can.",
      "url": "https://www.npr.org/2025/12/26/nx-s1-5645845/its-behind-you-how-britain-goes-wild-for-pantomimes-during-the-holidays",
      "published": "Sat, 27 Dec 2025 17:01:09 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Myanmar is holding its first elections in five years",
      "description": "Myanmar's is holding its first elections since the military seized power five years ago. It could give the military junta more legitimacy.",
      "url": "https://www.npr.org/2025/12/27/nx-s1-5622076/myanmar-is-holding-its-first-elections-in-five-years",
      "published": "Sat, 27 Dec 2025 07:43:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU backs Somalia after Israel recognizes Somaliland",
      "description": "Israel’s support for Somaliland has triggered sharp pushback across Africa, the Middle East and beyond, with the EU urging calm and Somalia vowing to defend its sovereignty.",
      "url": "https://www.dw.com/en/eu-backs-somalia-after-israel-recognizes-somaliland/a-75318108?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 23:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany: Drones disrupt air traffic in Hanover",
      "description": "Several flights were diverted after at least five drones were spotted near an airport in northern Germany.",
      "url": "https://www.dw.com/en/germany-drones-disrupt-air-traffic-in-hanover/a-75316744?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 15:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fax and furious: Why Germany struggles to go digital",
      "description": "Germany, the land of tech pioneers, still relies on fax and paper for basic public services. Why is digital government stuck in the slow lane while Denmark and India race ahead?",
      "url": "https://www.dw.com/en/fax-and-furious-why-germany-struggles-to-go-digital/a-75206481?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sat, 27 Dec 2025 12:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria Super Eagles fly off with 3 points against Tunisia",
      "description": "Nigeria Super Eagles fly off with 3 points against Tunisia",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251227-nigeria-super-eagles-fly-off-with-3-points-against-tunisia",
      "published": "Sat, 27 Dec 2025 23:14:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON big cat fight ends in draw: Senegal 1-1 DR Congo",
      "description": "No description available.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251227-afcon-big-cat-fight-ends-in-draw-senegal-1-1-dr-congo",
      "published": "Sat, 27 Dec 2025 23:06:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON Daily Round Up: Super Eagles beat Tunisia 3-2, Big cats Senegal and DRC stay level",
      "description": "It was another busy day of Afcon, four games being played across Morocco, as teams in groups C and D looked to secure their spot in the knockout stages of the competition. In group D, Benin won their first game ever at an Afcon, beating Botswana 1-0. The battle of the big cats ended in gridlock as the Lions of Teranga drew against The Leopards of DR Congo. In group C, Uganda and Tanzania stayed level, whilst the Super Eagles and the Eagles of Carthage battled it out for the top spot in the standings. Nigeria absolutely dominated the first half, but Tunisia snapped back, to make it 3-2 at the final whistle.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20251227-afcon-daily-round-up-super-eagles-beat-tunisia-3-2-big-cats-senegal-and-drc-stay-level",
      "published": "Sat, 27 Dec 2025 22:50:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "U.S. President Donald Trump set to hold talks with Zelensky on Sunday",
      "description": "No description available.",
      "url": "https://www.france24.com/en/video/20251227-u-s-president-donald-trump-set-to-hold-talks-with-zelensky-on-sunday",
      "published": "Sat, 27 Dec 2025 18:48:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Mane scores for Senegal to see them tie with DR Congo",
      "description": "Sadio Mane ​scored for Senegal as they came ⁠from behind to tie 1-1 with the Democratic Republic of Congo on Saturday, maintaining their position at the top of Group D at the Africa Cup of ​Nations finals in Morocco.",
      "url": "https://www.france24.com/en/sport/20251227-afcon-2025-mane-scores-for-senegal-to-see-them-tie-with-dr-congo",
      "published": "Sat, 27 Dec 2025 17:19:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Senegal and DR Congo to target second win",
      "description": "Senegal will take on the Democratic Republic of Congo in Group D on Saturday (December 26) in Tanger. FRANCE 24's Selina Sykes tells us more from Tangier.",
      "url": "https://www.france24.com/en/video/20251227-afcon-2025-senegal-and-dr-congo-to-target-second-win",
      "published": "Sat, 27 Dec 2025 14:55:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine's anti-corruption agency attempts raid of parliament in new graft probe",
      "description": "Ukraine’s anti-corruption agency said on Saturday that security services were blocking its attempt to raid parliament, as investigators alleged that sitting MPs were implicated in a new graft probe. The probe comes at a delicate time for President Volodymyr Zelensky, as he seeks better terms for Ukraine in US-brokered peace talks.",
      "url": "https://www.france24.com/en/europe/20251227-ukraine-anti-corruption-agency-attempts-raid-parliament-new-graft-probe",
      "published": "Sat, 27 Dec 2025 14:09:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "2025 AFCON jerseys:  ‘An opportunity to bring some light' on brands' work",
      "description": "As with every tournament- the Africa Cup of Nations is also notable for the uniforms worn by the players of the different nations - whose jerseys celebrate the diversity of cultures. For more on this, FRANCE 24’s Catherine Viette is joined by Matthieu Morge Zucconi - fashion editor at Le Figaro newspaper.",
      "url": "https://www.france24.com/en/video/20251227-2025-afcon-jerseys-an-opportunity-to-bring-some-light-on-brands-work",
      "published": "Sat, 27 Dec 2025 12:23:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Malaysian PM Najib Razak sentenced to 15 more years in landmark corruption case",
      "description": "A Malaysian judge sentenced former prime minister Najib Razak to 15 more years in jail on Friday (December 26) after convicting him of abuse of power and money laundering in a sovereign wealth fund graft scandal.",
      "url": "https://www.france24.com/en/video/20251227-former-malaysian-pm-najib-razak-sentenced-to-15-more-years-in-landmark-corruption-case",
      "published": "Sat, 27 Dec 2025 12:12:33 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Man is told Himmler was his grandad - this is how he felt",
      "description": "\"Evil monster, murderer, Nazi,\" - that's how Henrik Lenkeit describes his grandfather.",
      "url": "https://news.sky.com/story/heinrich-himmler-man-discovers-architect-of-the-holocaust-was-his-grandfather-13487431",
      "published": "Fri, 26 Dec 2025 12:09:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Clinton told to avoid public handshake with Gerry Adams, records show",
      "description": "White House officials wanted Bill Clinton to avoid shaking Sinn Fein leader Gerry Adams' hand in front of cameras during his historic visit to Ireland in 1995, newly released records show.",
      "url": "https://news.sky.com/story/clinton-told-to-to-avoid-public-handshake-with-gerry-adams-records-show-13487676",
      "published": "Sat, 27 Dec 2025 01:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "GLIMPSES: Prepping polling machines ahead of Myanmar's weekend election",
      "description": "Before the polls comes the preparation",
      "url": "https://abcnews.go.com/International/wireStory/glimpses-prepping-polling-machines-ahead-myanmars-weekend-election-128717101",
      "published": "Sat, 27 Dec 2025 04:17:48 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Algeria votes to declare French colonization a crime and demands restitution",
      "description": "Algerian legislators have declared France's colonization a crime, demanding restitution for property taken during its 130-year rule",
      "url": "https://abcnews.go.com/International/wireStory/algeria-votes-declare-french-colonization-crime-demands-restitution-128691093",
      "published": "Thu, 25 Dec 2025 06:57:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "South Korea vows to end foreign adoptions as UN presses Seoul to address past abuses",
      "description": "South Korea’s government says it plans to end the waning foreign adoptions of Korean children",
      "url": "https://abcnews.go.com/International/wireStory/south-korea-vows-end-foreign-adoptions-presses-seoul-128699370",
      "published": "Fri, 26 Dec 2025 02:57:17 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gaza: Humanitarian response ongoing despite restrictions",
      "description": "Although “significant restrictions and impediments” continue to hamper humanitarian operations in Gaza, teams are still responding to the population’s needs, the UN aid coordination office OCHA said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166669",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UN celebrates 10 years of progress in youth, peace and security agenda",
      "description": "The UN has long been at the forefront of efforts to involve young people in decision-making, and the last decade has seen significant progress, thanks to the adoption of a Security Council resolution on youth, peace and security which led to widespread changes in the ways that the voices of young people are not just heard, but also incorporated in peace plans and policies.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166637",
      "published": "Wed, 24 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Year in focus: Images that defined America in 2025",
      "description": "From moments of celebration to scenes of devastation, 2025 delivered images that defined a turbulent year in America. These photos captured some of those defining stories.",
      "url": "https://www.foxnews.com/us/year-focus-images-that-defined-america-2025",
      "published": "Sat, 27 Dec 2025 16:00:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Texas 19-year-old Camila Mendoza Olmos vanishes outside her home on Christmas Eve",
      "description": "Camila Mendoza Olmos, a 19-year-old who \"normally goes for a morning walk,\" was last seen outside her home on the morning of Christmas Eve, authorities said.",
      "url": "https://www.foxnews.com/us/texas-19-year-old-camila-mendoza-olmos-vanishes-outside-her-home-christmas-eve",
      "published": "Sat, 27 Dec 2025 12:21:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Defiant TPUSA leader won't quit despite chapter facing harassment, hostility after Kirk assassination",
      "description": "Northern Arizona University Turning Point USA leader Rose Lombardo is standing strong despite backlash from critics for her right-wing activism.",
      "url": "https://www.foxnews.com/us/defiant-tpusa-leader-wont-quit-despite-chapter-facing-harassment-hostility-after-kirk-assassination",
      "published": "Sat, 27 Dec 2025 10:00:43 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida man allegedly steals 400 pounds of avocados to buy Christmas presents for children",
      "description": "A Florida man was arrested after he allegedly trespassed in an avocado grove and stole roughly 400 pounds of the fruit in order to sell them for money to buy Christmas gifts.",
      "url": "https://www.foxnews.com/us/florida-man-allegedly-steals-400-pounds-avocados-buy-christmas-presents-children",
      "published": "Sat, 27 Dec 2025 05:15:44 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nude burglar arrested on Christmas night after allegedly breaking into two luxury Florida homes",
      "description": "A nude man allegedly broke into two luxury Golden Beach homes Christmas night and was found hiding in the garage of a $12 million home after drinking.",
      "url": "https://www.foxnews.com/us/nude-burglar-arrested-christmas-night-breaking-two-luxury-florida-homes",
      "published": "Fri, 26 Dec 2025 21:54:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump reveals potential Kennedy Center marble armrests 'unlike anything ever done or seen before'",
      "description": "President Donald Trump posted images of new marble armrests for the renamed Kennedy Center as an ongoing lawsuit continues to challenge the rebrand decision.",
      "url": "https://www.foxnews.com/us/trump-reveals-potential-kennedy-center-marble-armrests-unlike-anything-ever-done-seen-before",
      "published": "Fri, 26 Dec 2025 19:12:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Fox News True Crime Newsletter: JonBenet Ramsey case, Scott Peterson's bid, Kimberlee Singler returns",
      "description": "Stay up to date with the Fox News True Crime Newsletter, which brings you the latest cases ripped from the headlines, from crime to courts, legal and scandal.",
      "url": "https://www.foxnews.com/us/fox-news-true-crime-newsletter-jonbenet-ramsey-case-break-scott-peterson-bid-kimberlee-singler-returns",
      "published": "Fri, 26 Dec 2025 16:00:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "JonBenet Ramsey case could benefit from new DNA technology as police renew commitment",
      "description": "Boulder police renew efforts in JonBenet Ramsey murder case with new chief praising advanced DNA testing, nearly 30 years after the Christmas tragedy that shocked America.",
      "url": "https://www.foxnews.com/us/jonbenet-ramsey-case-could-benefit-from-new-dna-technology-police-renew-commitment",
      "published": "Fri, 26 Dec 2025 08:00:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trio of Palestinians arrested for allegedly torching Christmas tree at Catholic church in West Bank",
      "description": "Three Palestinians accused of torching a Christmas tree and damaging part of a Nativity scene at a West Bank Catholic church were arrested.",
      "url": "https://www.foxnews.com/world/trio-palestinians-arrested-allegedly-torching-christmas-tree-catholic-church-west-bank",
      "published": "Thu, 25 Dec 2025 21:31:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy encouraged by 'very good' Christmas talks with US",
      "description": "Ukrainian President Volodymyr Zelenskyy expresses optimism about Ukraine peace talks after Christmas conversation with U.S. envoys, as negotiations show progress.",
      "url": "https://www.foxnews.com/world/zelenskyy-encouraged-very-good-christmas-talks-us",
      "published": "Thu, 25 Dec 2025 13:53:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Poland scrambles jets on Christmas after detecting Russian reconnaissance aircraft near its airspace",
      "description": "Poland scrambled fighter jets on Christmas morning after detecting a Russian reconnaissance aircraft near its airspace over the Baltic Sea.",
      "url": "https://www.foxnews.com/world/poland-scrambles-jets-christmas-after-detecting-russian-reconnaissance-aircraft-near-its-airspace",
      "published": "Thu, 25 Dec 2025 11:26:17 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump-backed candidate Asfura wins Honduras presidential election",
      "description": "Tito Asfura secured Honduras' presidency, defeating Salvador Nasralla and Rixi Ramona Moncada Godoy in a polarized campaign that shifts Central America's political landscape.",
      "url": "https://www.foxnews.com/world/trump-backed-candidate-asfura-wins-honduras-presidential-election",
      "published": "Wed, 24 Dec 2025 19:21:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}