{
  "last_updated": "2026-01-27T05:28:43.126219Z",
  "event_count": 224,
  "events": [
    {
      "title": "Video evidence of Alex Pretti’s killing contradicts Trump administration’s account",
      "description": "37 year old ICU nurse Alex Pretti was shot and killed in Minneapolis, just week's after Renee Good's fatal shooting in the same city. The Department of Homeland Security claims Pretti was \"brandishing\" a gun, a \"domestic terrorist\" and aggressively approaching federal agents...but video evidence directly contradicts the Trump administration's \"official\" version of events. Vedika Bahl goes through multiple angles of the incident in Truth or Fake.",
      "url": "https://www.france24.com/en/tv-shows/truth-or-fake/20260126-video-evidence-of-alex-pretti-s-killing-contradicts-trump-administration-s-account",
      "published": "Mon, 26 Jan 2026 20:33:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 48,
      "severity_level": "Critical"
    },
    {
      "title": "Crocodile warnings as floods devastate southern Africa",
      "description": "More than 100 people killed and hundreds of thousands displaced in South Africa, Mozambique and Zimbabwe Devastating floods have killed more than 100 people in southern Africa since the beginning of the year and displaced hundreds of thousands, as authorities and aid workers warn of hunger, cholera and attacks by crocodiles that have spread with the waters. More than 70 people have died in Zimbabwe and 30 in South Africa, where hundreds of people were evacuated from Kruger national park earlier this month after a deluge of rain . Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/crocodile-warnings-floods-devastate-southern-africa",
      "published": "Mon, 26 Jan 2026 13:44:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 44,
      "severity_level": "Critical"
    },
    {
      "title": "Above the law? Outrage over ICE killings in Minneapolis",
      "description": "17 days after the shooting death of Renée Good, masked Immigration and Customs Enforcement agents in Minneapolis again shooting dead a US citizen, this time 37-year old Alex Pretti. Again, there's video evidence to contradict official narrative that the the victims were acting as domestic terrorists, the race to gather evidence before it can be tainted or destroyed, media echo chambers, and a US president who watches from on high.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20260126-above-the-law-outrage-over-ice-killings-in-minneapolis",
      "published": "Mon, 26 Jan 2026 19:13:23 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns ‘law of the jungle’ is replacing rule of law",
      "description": "Warning that the “rule of law is being replaced by the law of the jungle,” the UN Secretary-General on Monday urged world powers to recommit to international law as the foundation of peace, justice and multilateral cooperation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166832",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns of rising internet shutdowns as digital blackouts spread worldwide",
      "description": "A rising trend towards government-enforced internet shutdowns – with at least 300 incidents in more than 54 countries over the last two years – is prompting renewed warnings from the UN about the threat these digital blackouts pose to freedom of expression, access to information and human rights.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166813",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "DHS probes whether agents killed VA nurse following accidental discharge during Minneapolis ICE raid",
      "description": "DHS is investigating whether Border Patrol agents believed they were under fire when accidental gun discharge preceded fatal shooting of Alex Pretti.",
      "url": "https://www.foxnews.com/us/dhs-probes-whether-agents-killed-va-nurse-accidental-discharge-minneapolis-ice-raid",
      "published": "Mon, 26 Jan 2026 18:29:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Iran in the Human Rights Council, Myanmar election ‘fraud’, migration chief in Cyprus, Mozambique flood update",
      "description": "Disturbing details continued to emerge on Friday about Iran’s State-led crackdown against mass protests, while UN rights chief Volker Türk expressed deep concern that demonstrators could be executed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166819",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime reportedly issued nationwide shoot-to-kill orders as protest death toll surges",
      "description": "Iran protest death toll estimates range from several thousand to over 35,000 as brutal crackdown intensifies. Medical data reveals shocking scale of violence.",
      "url": "https://www.foxnews.com/world/iran-regime-reportedly-issued-nationwide-shoot-to-kill-orders-protest-death-toll-surges",
      "published": "Mon, 26 Jan 2026 13:10:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "After Trump strikes Islamist terrorists, US general travels to Nigeria with militants 'on the run'",
      "description": "Lt. Gen. John Brennan details U.S. military support helping Nigerian forces combat Islamic State and Boko Haram terrorists following strikes that disrupted terror networks.",
      "url": "https://www.foxnews.com/world/after-trump-strikes-islamist-terrorists-us-general-travels-nigeria-militants-on-run",
      "published": "Sun, 25 Jan 2026 12:23:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian security forces gun down amateur boxer as father searches morgues for missing son: source",
      "description": "Iranian security forces allegedly killed amateur boxer Sepehr Ebrahimi during ongoing protests near Tehran. The death adds to Iran's rising protest toll of at least 6,126 people killed.",
      "url": "https://www.foxnews.com/world/iranian-security-forces-gun-down-amateur-boxer-father-searches-morgues-missing-son-source",
      "published": "Mon, 26 Jan 2026 21:34:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "TV presenter killed in Israeli strike in southern Lebanon: Hezbollah",
      "description": "A Lebanese minister condemns the latest Israeli killing and calls on the international community to 'take action'.",
      "url": "https://www.aljazeera.com/news/2026/1/27/tv-presenter-killed-in-israeli-strike-in-southern-lebanon-hezbollah?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 03:12:36 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Gunmen open fire at football match in Mexico, killing at least 11",
      "description": "Mayor of Salamanca in Guanajuato state says attack is part of ‘wave of violence’ as he appeals to president for help Gunmen opened fire at a football match in central Mexico on Sunday, killing at least 11 people and wounding 12, in the latest outburst of violence in Guanajuato state. César Prieto, the mayor of the town of Salamanca in central Guanajuato state, said in a statement posted to social media platforms that the gunmen arrived at the end of a match. Ten people died at the scene and one died later at a hospital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/gunmen-invade-salamanca-football-match-guanajuato-mexico-crime",
      "published": "Mon, 26 Jan 2026 16:19:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "US withdrawal from WHO ‘risks global safety’, agency says in detailed rebuttal",
      "description": "The World Health Organization (WHO) has issued a detailed statement regretting the United States decision to leave the UN agency, and declaring that it will leave both the US and the world less safe as a result.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166828",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "'We're all terrified', Minnesotan tells the BBC in tears",
      "description": "The BBC's Ana Faguy speaks to residents in the state after the second fatal shooting by federal immigration officers.",
      "url": "https://www.bbc.com/news/videos/crkr1g5vnveo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 22:22:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Two killed in plane crash near Gold Coast, igniting bushfire",
      "description": "A 73-year-old pilot and a male passenger died after the wreckage caught fire on impact, with emergency services now working to contain the bushfire Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Two men have been killed in a light plane crash near the Gold Coast, sparking a bushfire. Emergency crews rushed to Heck Field, a private airstrip north of the Gold Coast, after the plane went down in nearby bushland about 6am on Tuesday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/27/gold-coast-plane-crash-bushfire-two-killed",
      "published": "Tue, 27 Jan 2026 02:32:21 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UK supermarkets push for Amazon soy safeguards after traders abandon ban",
      "description": "European retailers urge traders to adhere to commitments after Brazilian lawmakers wreck forest protection pact Leading British and European retailers are trying to salvage the core elements of the Amazon soy moratorium after the world’s most successful forest protection agreement was wrecked by Brazilian lawmakers and abandoned by international traders. In an open letter, high street brands including Tesco, Sainsbury’s and Asda say the breakdown this month of the 20-year-old agreement will damage consumer confidence unless new arrangements are put in place to ensure grain production is not linked to deforestation. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/26/uk-supermarkets-push-for-amazon-soy-safeguards-after-brazil-scraps-ban",
      "published": "Mon, 26 Jan 2026 17:43:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Extreme heatwave may break records in Victoria as firefighters warn of bushfire risk in ‘very dry’ state",
      "description": "Ouyen and Mildura in northern Victoria forecast to break state’s all-time maximum on Tuesday, as weather warnings issued Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A day of record-breaking heat looms for Victoria, with temperatures forecast to hit 49C in the Mallee and Melbourne facing its hottest day since Black Saturday 2009. It was 26.1C as the sun rose on Tuesday over the small Victorian town of Ouyen, the Mallee town of 1,170 people whose forecast high of 49C would break the state’s temperature record of 48.8C set in Hopetoun on Black Saturday in 2009. The mercury had climbed to 47C just after lunch. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/27/victoria-melbourne-weather-forecast-fire-danger-extreme-heatwave-bushfire-risk",
      "published": "Tue, 27 Jan 2026 03:21:14 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US government shutdown looms as Democrats reject DHS funding over ICE issues",
      "description": "A US government shutdown is increasingly likely as Democratic Senators refuse to approve the DHS funding bill, following the fatal shooting of a second US citizen by federal agents in Minneapolis. Key Democrats, including Chuck Schumer, Catherine Cortez Masto, and Patty Murray, demand changes to ICE operations before backing the bill. Without a resolution, the funding package could miss the January 31st deadline.",
      "url": "https://www.france24.com/en/us-government-shutdown-looms-as-democrats-reject-dhs-funding-over-ice-issues",
      "published": "Mon, 26 Jan 2026 15:57:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Mexico investigates soccer field attack that killed at least 11 people",
      "description": "Authorities in Mexico are investigating an attack that killed 11 people and injured 12 others during a post-match gathering in central Mexico",
      "url": "https://abcnews.go.com/International/wireStory/mexico-investigates-soccer-field-attack-killed-11-people-129576651",
      "published": "Mon, 26 Jan 2026 16:22:33 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Explosion at cookie factory in central Greece kills at least 4",
      "description": "An explosion and fire at a cookie factory in central Greece killed at least four workers and left one person unaccounted for",
      "url": "https://abcnews.go.com/International/wireStory/explosion-cookie-factory-central-greece-kills-4-129556195",
      "published": "Mon, 26 Jan 2026 04:36:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "South Sudan: UN and rights experts warn against risk of mass violence in Jonglei",
      "description": "The UN Mission in South Sudan (UNMISS) is sounding the alarm over the threat of escalating violence in Jonglei state which is putting lives at risk and further weakening prospects for peace.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166831",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN rights chief decries US treatment of migrants, as deaths in ICE custody rise",
      "description": "The UN’s top human rights official has raised alarm over what he described as the growing dehumanisation of migrants in the United States, warning that current immigration enforcement practices are undermining due process, family unity and basic human dignity.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166816",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "ICE under scrutiny amid rising protests over deadly shootings",
      "description": "Protests continue in the US after a second American citizen was killed by immigration agents in Minneapolis. ICE, created in 2002, has been heavily utilized under President Trump’s administration, with a focus on mass deportations and aggressive tactics. The agency's rapid expansion and controversial operations, including deporting US citizens and documented immigrants, have raised concerns about oversight and the quality of training for new recruits.",
      "url": "https://www.france24.com/en/ice-under-scrutiny-amid-rising-protests-over-deadly-shootings",
      "published": "Mon, 26 Jan 2026 17:27:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Winter attacks in Ukraine, looming food aid cuts in Nigeria, drought in Kenya",
      "description": "Russian forces launched a fresh wave of strikes across Ukraine this week which have left hundreds of thousands of families without electricity and heating amid freezing temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166810",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "FBI says woman threatened to murder agent and his family after stealing ID from car during Minneapolis riot",
      "description": "Federal authorities arrested a woman accused of making death threats against an FBI agent and his family following a January riot that destroyed FBI equipment in Minneapolis.",
      "url": "https://www.foxnews.com/us/fbi-says-woman-threatened-murder-agent-his-family-after-stealing-id-from-car-during-minneapolis-riot",
      "published": "Mon, 26 Jan 2026 18:17:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Australia news live: Victoria heat record under threat as temperatures pass 48C and six major fires burn across state",
      "description": "Follow today’s news live Extreme heatwave may break records in Victoria as firefighters warn of bushfire risk in ‘very dry’ state Get our breaking news email , free app or daily news podcast Victoria to open nation’s first offshore wind auction this year Australia’s first offshore wind auction is set to kick off this year, with the Victorian Government announcing it would invite tenders for 2 gigawatts of capacity in August. We want to give industry the certainty it needs to invest and help us keep building the renewable energy Victoria needs to push down energy bills. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/27/australia-news-live-out-of-control-victorian-bushfire-threatens-towns-as-intense-heatwave-moves-east",
      "published": "Tue, 27 Jan 2026 05:23:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Trump warned off Iran strikes in 'you will reap the whirlwind' threat",
      "description": "A new mural warning the US not to launch a military strike on Iran has been unveiled in a square in central Tehran.",
      "url": "https://news.sky.com/story/iran-unveils-mural-warning-us-not-to-launch-military-strike-13498878",
      "published": "Sun, 25 Jan 2026 15:45:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iranian drone swarms pose 'credible threat' to USS Abraham Lincoln carrier group, defense expert says",
      "description": "USS Abraham Lincoln strike group approaches Middle East amid warnings that Iranian drone capabilities worth \"tens of millions of dollars\" threaten U.S. naval vessels.",
      "url": "https://www.foxnews.com/world/iranian-drone-swarms-pose-credible-threat-uss-abraham-lincoln-carrier-group-defense-expert-says",
      "published": "Sun, 25 Jan 2026 21:00:57 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "How the Oct 7 Hamas terror attacks exposed long-running concerns about UNRWA, new film charges",
      "description": "Tracing UNRWA from 1949 to today, the film examines refugee policy, weak oversight and alleged links to Hamas control in Gaza, raising questions about the agency’s role and accountability.",
      "url": "https://www.foxnews.com/world/how-oct-7-hamas-terror-attacks-exposed-long-running-concerns-about-unrwa-new-film-charges",
      "published": "Sun, 25 Jan 2026 12:43:35 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "As US ‘armada’ approaches, Iran warns of dire consequences if attacked",
      "description": "Iranian authorities are keeping the population offline for a third week amid lingering threats of another war.",
      "url": "https://www.aljazeera.com/news/2026/1/26/as-us-armada-approaches-iran-warns-of-dire-consequences-if-attacked?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 16:19:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Is the Trump administration’s immigration crackdown working?",
      "description": "There has been a second fatal shooting in the US state of Minnesota this month.",
      "url": "https://www.aljazeera.com/video/inside-story/2026/1/26/is-the-trump-administrations-immigration-crackdown-working?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 18:47:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Biscuit factory explosion in Greece kills at least four",
      "description": "An overnight explosion at a biscuit factory in Trikala, Greece, has killed at least four workers.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/biscuit-factory-explosion-in-greece-kills-at-least-four?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 15:29:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘It’s the sovereignty of the country’: Guinea-Bissau says US vaccine study suspended",
      "description": "Despite US pushback, officials in west Africa say controversial hepatitis B study on pause amid ethics concerns US health officials insisted it was still on. African health leaders said it was cancelled . At the heart of the controversy is the west African nation of Guinea-Bissau – one of the poorest countries in the world and the proposed site of a hotly debated US-funded study on vaccines. The study on hepatitis B vaccination, to be led by Danish researchers, became a flashpoint after major changes to the US vaccination schedule and prompted questions about how research is conducted ethically in other countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/23/guinea-bissau-hepatitis-b-vaccine-study",
      "published": "Fri, 23 Jan 2026 17:09:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "At least 18 people dead as Philippines ferry with 350 onboard sinks",
      "description": "Rescuers save at least 316 after inter-island ferry sank en route from city of Zamboanga to southern Jolo island A ferry with more than 350 people onboard sank early on Monday near an island in the southern Philippines, killing at least 18 people, officials said. Rescuers saved hundreds more, while a fleet of coastguard and naval ships searched for those still missing. Coastguard officials said the cargo and passenger ferry apparently encountered technical problems and sank after midnight. The steel-hulled vessel abruptly tilted to one side and took on water, hurling people into the sea in the darkness, according to a rescued passenger who lost his six-month-old baby. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/philippines-ferry-capsizes-sinks-death-toll",
      "published": "Mon, 26 Jan 2026 13:55:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Minnesota: Mayor says some federal agents to leave Minneapolis amid outrage over protester shootings",
      "description": "Minneapolis Mayor Jacob Frey said some federal immigration officers will leave the city after a call with Donald Trump. Earlier the president said he is deploying border czar Tom Homan to Minnesota.",
      "url": "https://www.dw.com/en/minnesota-mayor-says-some-federal-agents-to-leave-minneapolis-amid-outrage-over-protester-shootings/live-75666369?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 23:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "'Starry Night Murderer' allegedly terrorizing people after early prison release, parole violations",
      "description": "Larry Hurwitz, convicted in 1990 murder case, allegedly violated parole and faces new domestic violence charges in Clackamas County with $500,000 bail set.",
      "url": "https://www.foxnews.com/us/starry-night-murderer-allegedly-terrorizing-people-after-early-prison-release-parole-violations",
      "published": "Mon, 26 Jan 2026 16:08:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Florida deputies race to save 4-year-old who stopped breathing and had no pulse on interstate, video shows",
      "description": "Florida deputies heroically rescued a 4-year-old boy who stopped breathing on Interstate 275, performing life-saving CPR after a medical emergency.",
      "url": "https://www.foxnews.com/us/florida-deputies-race-save-4-year-old-who-stopped-breathing-had-no-pulse-interstate-video",
      "published": "Mon, 26 Jan 2026 13:18:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Heatwave warnings across Australia as millions celebrate national day",
      "description": "Temperatures are expected to peak on Tuesday, reaching the \"high forties\" in Victoria and South Australia.",
      "url": "https://www.bbc.com/news/articles/cz6y7nxx5jvo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 07:15:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "China’s top general under investigation for alleged violations amid corruption crackdown",
      "description": "Zhang Youxia, long seen as Xi Jinping’s closest military ally, reportedly accused of leaking nuclear secrets to US China’s military leadership is in turmoil after its most senior general – a close ally of Xi Jinping – was placed under investigation for “suspected serious violations of discipline and law”. Zhang Youxia is the joint vice-chairperson of the Central Military Commission (CMC), the ruling body of China’s People’s Liberation Army (PLA). Second only to Xi in the military command structure, Zhang has long been seen as the Chinese president’s closest military ally. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/china-top-ranking-general-zhang-youxia-investigation",
      "published": "Mon, 26 Jan 2026 01:40:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Interpol arrests more than 3,700 suspects in global trafficking crackdown",
      "description": "A global crackdown on human traffickers and migrant smugglers coordinated by Interpol has led to the arrest of more than 3,700 suspects and aided over 4,400 potential trafficking victims around the world",
      "url": "https://abcnews.go.com/International/wireStory/interpol-arrests-3700-suspects-global-trafficking-crackdown-129560370",
      "published": "Mon, 26 Jan 2026 09:40:15 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Minnesota, ICE and the makings of a US civil war",
      "description": "A 2024 simulation found US civil war could be triggered by clashes between state and federal law enforcement.",
      "url": "https://www.aljazeera.com/video/the-take-2/2026/1/26/aje-onl-usa_civilwarmn_av_v2-260126?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 20:34:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "ActionAid to rethink child sponsorship as part of plan to ‘decolonise’ its work",
      "description": "Development charity’s new co-chief executives signal shift from controversial sponsor a child scheme launched in 1972 to long-term grassroots funding Child sponsorship schemes that allow donors to handpick children to support in poor countries can carry racialised, paternalistic undertones and need to be transformed, the newly appointed co-chief executives of ActionAid UK said as they set out to “decolonise” the organisation’s work. ActionAid began in 1972 by finding sponsors for schoolchildren in India and Kenya, but Taahra Ghazi and Hannah Bond have launched their co-leadership this month with the goal of shifting narratives around aid from sympathy towards solidarity and partnership with global movements. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/22/actionaid-rethink-child-sponsorship-decolonise-funding",
      "published": "Thu, 22 Jan 2026 05:00:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "USS Abraham Lincoln Aircraft Carrier Strike Group makes move amid threat from Iran",
      "description": "USS Abraham Lincoln entered CENTCOM waters Monday amid escalating threats from Iran and the potential for a \"credible\" drone attack on the U.S.",
      "url": "https://www.foxnews.com/world/uss-abraham-lincoln-aircraft-carrier-strike-group-makes-move-threat-iran",
      "published": "Mon, 26 Jan 2026 06:58:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "‘Frightening situation’: Bangladesh elections haunted by political violence",
      "description": "At least 16 political activists have been killed since elections were announced in December.",
      "url": "https://www.aljazeera.com/features/2026/1/27/fear-and-hope-in-bangladesh-how-political-violence-is-haunting-elections?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 05:07:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Death toll from Indonesia landslide rises to 17 as dozens remain missing",
      "description": "Among the 42 people missing after landslide in West Java, 19 were members of Indonesia’s elite marine force.",
      "url": "https://www.aljazeera.com/news/2026/1/26/death-toll-from-indonesia-landslide-rises-to-17-as-dozens-remain-missing?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 18:45:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ukrainians are sharing hacks online on how to survive winter power cuts",
      "description": "After repeated Russian attacks on Ukraine's energy grid, Ukrainians face long outages during a cold winter at war. On social media, Ukrainians share tips for keeping warm at home.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5686455/ukraine-winter-power-outage",
      "published": "Mon, 26 Jan 2026 13:24:44 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Focus turns to future of Gaza after final hostage remains returned to Israel",
      "description": "Ran Gvili was one of the first Israelis killed on 7 October 2023 when Hamas fighters poured into Israel and launched their ferocious attack.",
      "url": "https://news.sky.com/story/focus-turns-to-future-of-gaza-after-final-hostage-remains-returned-to-israel-13499322",
      "published": "Mon, 26 Jan 2026 17:22:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UN envoy highlights ‘window to advance peace’ in Colombia",
      "description": "The new year provides an opportunity for Colombia to keep advancing towards lasting peace, a decade after a landmark accord that ended more than 50 years of conflict, the UN Special Representative told the Security Council on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166818",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Anti-ICE mobs bankrolled by 'shadowy interests' putting law enforcement in danger, CEO warns",
      "description": "Violent ICE protests in Minnesota allegedly driven by outside actors exploiting chaos, warns protest insider as confrontations escalate across the state.",
      "url": "https://www.foxnews.com/us/anti-ice-mobs-bankrolled-shadowy-interests-putting-law-enforcement-danger-ceo-warns",
      "published": "Mon, 26 Jan 2026 19:22:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Knife-wielding nut allegedly asked Christian his religion – then stabbed him and dog before police shot him",
      "description": "Armed Washington suspect died after police shooting following alleged stabbing attack on man and dog that occurred after asking victim about Christian faith in Parkland on Sunday.",
      "url": "https://www.foxnews.com/us/knife-wielding-nut-allegedly-asked-christian-his-religion-then-stabbed-him-dog-before-police-shot-him",
      "published": "Mon, 26 Jan 2026 17:29:22 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Italy’s Meloni rebukes Trump remarks on NATO’s role in Afghanistan",
      "description": "Italian PM Giorgia Meloni calls Trump's NATO comments about Afghanistan \"unacceptable,\" defending Italy's sacrifice of 53 soldiers killed in the conflict.",
      "url": "https://www.foxnews.com/world/italys-meloni-rebukes-trump-remarks-natos-role-afghanistan",
      "published": "Sun, 25 Jan 2026 14:10:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Terror in the trees: Why extremists take cover in Nigeria's forests",
      "description": "Armed groups use Nigeria's forest reserves as bases, illicit trade hubs and to terrorize communities. A new government strategy hopes to claw back control over the conservation areas.",
      "url": "https://www.dw.com/en/terror-in-the-trees-why-extremists-take-cover-in-nigeria-s-forests/a-75661454?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 13:51:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "ICC judges rule former Philippine president Duterte fit for trial",
      "description": "Judges at the International Criminal Court have ruled that former Philippine president Rodrigo Duterte is fit to take part in pre-trial proceedings, rejecting defence claims of cognitive decline and setting a confirmation of charges hearing for February 23.",
      "url": "https://www.france24.com/en/asia-pacific/20260127-icc-judges-rule-former-philippine-president-duterte-fit-for-trial",
      "published": "Tue, 27 Jan 2026 02:44:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "ICC judges find former Philippine president Rodrigo Duterte fit to stand trial",
      "description": "Judges at the International Criminal Court have ruled that former Philippine President Rodrigo Duterte is fit to stand trial",
      "url": "https://abcnews.go.com/International/wireStory/icc-judges-find-former-philippine-president-rodrigo-duterte-129556516",
      "published": "Mon, 26 Jan 2026 05:55:04 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "‘Cycle of attacks must end’: Lead UN official in Ukraine",
      "description": "The senior UN official in Ukraine, Matthias Schmale, has issued a condemnation of the massive overnight Russian drone and missile strike on several major Ukrainian cities, killing and injuring civilians, and knocking out energy infrastructure amid sub-zero temperatures.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166825",
      "published": "Sat, 24 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Chinese hackers reportedly breached phones at 'heart of Downing Street' in global spy campaign",
      "description": "Chinese state-linked hackers reportedly breached phones \"at the heart of Downing Street,\" and allegedly accessed the phone data of millions.",
      "url": "https://www.foxnews.com/world/chinese-hackers-reportedly-breached-phones-heart-downing-street-global-spy-campaign",
      "published": "Mon, 26 Jan 2026 18:53:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Gunmen storm Mexico football pitch and kill at least 11 people",
      "description": "The incident happened in Salamanca, a city particularly subject to gang-related violence.",
      "url": "https://www.bbc.com/news/articles/cp80419gggro?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 11:29:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Gaza faces firewood shortage and harsh winter conditions",
      "description": "The dire conditions in Gaza persist as residents struggle with a lack of basic necessities, including cooking gas and electricity. Many families rely on expensive firewood to cook and stay warm during the cold winter months, while some 10 children have died from hypothermia since winter began. Despite the US administration's promises to rebuild Gaza, the situation remains dire, with many still living in tents and damaged buildings, and aid efforts, including soup kitchens, working desperately to meet basic needs.",
      "url": "https://www.france24.com/en/gaza-faces-firewood-shortage-and-harsh-winter-conditions",
      "published": "Mon, 26 Jan 2026 16:29:19 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "At least 15 dead and hundreds rescued after ferry sinks in southern Philippines",
      "description": "At least 15 people have died after a ferry sank in the southern Philippines overnight.",
      "url": "https://news.sky.com/story/at-least-15-dead-and-hundreds-rescued-after-ferry-sinks-in-southern-philippines-13499059",
      "published": "Mon, 26 Jan 2026 04:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Syria: Renewed clashes risk derailing fragile transition",
      "description": "A tense standoff between the Syrian Government and Kurdish-led forces in the country’s northeast risks igniting wider instability just as Syria struggles to emerge from years of conflict and authoritarian rule, senior UN officials told the Security Council on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166811",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Self-described Minn. Antifa member calls for 'armed' men to stop immigration agents he calls 'mass murderers'",
      "description": "Minneapolis Antifa activist Kyle Wagner demands armed response against federal immigration agents after two anti-ICE agitators killed this month.",
      "url": "https://www.foxnews.com/us/self-described-minn-antifa-member-calls-armed-men-stop-immigration-agents-he-calls-mass-murderers",
      "published": "Mon, 26 Jan 2026 13:59:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Russian strikes knock out heat in freezing Kyiv as peace talks continue",
      "description": "Russian strikes left much of Kyiv without heat, water and power during freezing temperature, even as Ukraine, Russia and the U.S. held talks on ending the nearly four-year war.",
      "url": "https://www.npr.org/2026/01/24/g-s1-107248/russia-strikes-kyiv-cold",
      "published": "Sat, 24 Jan 2026 19:42:24 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "From deepfakes to grooming: UN warns of escalating AI threats to children",
      "description": "The staggering amount of harmful AI-generated online content has prompted an urgent call from across the UN system for a raft of measures to protect children from abuse, exploitation and mental trauma.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166827",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Repeat offender street racing at 106 mph mows down EMT after previously killing someone in crash: police",
      "description": "Dayton Milligan of Wisconsin was arrested after EMT Meng Kue was killed this month in a Milwaukee hit-and-run street-racing crash, police say.",
      "url": "https://www.foxnews.com/us/repeat-offender-street-racing-106-mph-mows-down-emt-after-previously-killing-someone-crash-police",
      "published": "Mon, 26 Jan 2026 15:39:14 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Kansas elementary school teacher found dead in snow days after going missing",
      "description": "Kansas elementary school teacher Rebecca Rauber found dead after going missing from Emporia bar. Police say she may have succumbed to hypothermia during snowstorm.",
      "url": "https://www.foxnews.com/us/kansas-elementary-school-teacher-found-dead-snow-days-going-missing",
      "published": "Mon, 26 Jan 2026 13:57:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Private jet carrying eight people crashes in Maine",
      "description": "Poor visibility was reported at the airport during a winter storm that has affected a large swathe of the US.",
      "url": "https://www.bbc.com/news/articles/cddgqqd0peno?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 16:51:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Head of US Africa bureau urges staff to highlight US ‘generosity’ despite aid cuts",
      "description": "Email sent to diplomats by state department office’s new boss is labelled ‘racist’ after dismissing Africa as a priority US diplomats have been encouraged to “unabashedly and aggressively” remind African governments about the “generosity” of the American people, according to a leaked email sent to staff in the US state department’s Bureau of African Affairs this January and obtained by the Guardian. “It’s not gauche to remind these countries of the American people’s generosity in containing HIV/Aids or alleviating famine,” says the email. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/20/us-diplomats-urged-to-remind-african-leaders-of-us-generosity-despite-usaid-closing",
      "published": "Tue, 20 Jan 2026 17:11:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "India–EU summit: Free trade deal announcement expected",
      "description": "If sealed, the deal would forge a market of two billion people and nearly a quarter of global GDP, according to the European Commission. Follow DW for more.",
      "url": "https://www.dw.com/en/india-eu-summit-free-trade-deal-announcement-expected/live-75669574?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 02:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Canada gives approval for Marineland to export remaining belugas to the US",
      "description": "Canada’s last captive whales have a received a reprieve from death after the Canadian government conditionally approved a plan to export them to the United States",
      "url": "https://abcnews.go.com/International/wireStory/canada-conditional-approval-marineland-export-remaining-belugas-us-129582288",
      "published": "Mon, 26 Jan 2026 19:15:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Indonesian marines among 80 missing in deadly West Java landslide",
      "description": "Nineteen Indonesian marines are among 80 people missing after a landslide in West Java province",
      "url": "https://abcnews.go.com/International/wireStory/indonesian-marines-80-missing-deadly-west-java-landslide-129556799",
      "published": "Mon, 26 Jan 2026 05:53:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Gaza reconstruction talks must not distract from massive needs, say UN aid agencies",
      "description": "Amid reconstruction talks on Gaza linked to President Trump's just-launched Board of Peace, UN aid agencies insisted on Friday that what Gazans need most is immediate relief from the ongoing humanitarian catastrophe there.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166815",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Feds charge 87 individuals in massive ATM 'jackpotting' operation linked to Tren de Aragua gang",
      "description": "Massive ATM theft ring exposed 87 members of Venezuelan gang Tren de Aragua accused of stealing millions through \"jackpotting\" scheme to fund terrorism.",
      "url": "https://www.foxnews.com/us/feds-charge-87-individuals-massive-atm-jackpotting-operation-linked-tren-de-aragua-gang",
      "published": "Mon, 26 Jan 2026 21:20:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Grandson charged with murdering retired grandparents found dead in their South Carolina home",
      "description": "The grandson of a couple who were killed has been charged with murder in an upstate South Carolina case that has devastated a small community.",
      "url": "https://www.foxnews.com/us/grandson-charged-murdering-retired-grandparents-found-dead-south-carolina-home",
      "published": "Mon, 26 Jan 2026 12:08:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Spain slashes speed limit on popular train route after fault found",
      "description": "The discovery of a crack on the Madrid-Barcelona line follows two recent deadly crashes in the country.",
      "url": "https://www.bbc.com/news/articles/ckgy049ypd5o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 15:17:32 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "China's top generals under investigation as country's leader clears out ranks",
      "description": "China announced two of its top generals are under investigation, including the country's most senior general. Analysts suspect it's a political purge by Chinese leader Xi Jinping.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5687896/chinas-top-generals-under-investigation-as-countrys-leader-clears-out-ranks",
      "published": "Mon, 26 Jan 2026 04:47:39 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Kremlin says Abu Dhabi talks 'constructive'",
      "description": "Moscow says trilateral talks with the US and Ukraine are set to continue next week, but key issues remain open. Germany and Latvia called for more action against Russian hybrid attacks and shadow fleet.",
      "url": "https://www.dw.com/en/ukraine-updates-kremlin-says-abu-dhabi-talks-constructive/live-75667003?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 18:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "China's accidental 'crying horse' plush toy goes viral",
      "description": "As the Lunar New Year approaches, a production error at a toy factory has led to the creation of a viral 'crying horse' plush toy. Intended to celebrate the Year of the Horse, the toy's upside-down mouth has resonated with China's overworked, stressed young white-collar employees. The toy has become a symbol of their struggles, with sales booming amid the country’s economic challenges and youth unemployment.",
      "url": "https://www.france24.com/en/china-s-accidental-crying-horse-plush-toy-goes-viral",
      "published": "Mon, 26 Jan 2026 15:51:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "A ceasefire holds in Syria but civilians live with fear and resentment",
      "description": "A fragile ceasefire between Syria's government and Kurdish-led forces has temporarily eased tensions in the country's northeast",
      "url": "https://abcnews.go.com/International/wireStory/ceasefire-holds-syria-civilians-live-fear-resentment-129587814",
      "published": "Tue, 27 Jan 2026 00:10:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Skier suffers brutal mauling after stepping within 10 feet of snow leopard for photo, video shows",
      "description": "Female skier survives snow leopard mauling in China's Fuyun County after authorities warned tourists about predator sightings near hotel, according to reports.",
      "url": "https://www.foxnews.com/world/skier-suffers-brutal-mauling-stepping-10-feet-snow-leopard-photo-video-shows",
      "published": "Mon, 26 Jan 2026 19:18:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "China experts raise alarms over Xi’s sweeping military purge",
      "description": "Military turmoil in China raises Taiwan invasion concerns as Xi Jinping removes senior officers. Analysts warn of growing instability despite control.",
      "url": "https://www.foxnews.com/world/china-experts-raise-alarms-over-xis-sweeping-military-purge",
      "published": "Mon, 26 Jan 2026 15:51:33 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Guyanese businessman facing US extradition elected opposition leader",
      "description": "Azruddin Mohamed’s election comes six months after he formed political party that became country’s second largest A Guyanese businessman facing extradition to the US on gold-smuggling and money-laundering charges has been elected as the country’s opposition leader, six months after he formed a political party that quickly became the second largest in the South American country . Azruddin Mohamed, 38, was confirmed as Guyana’s opposition leader after 16 lawmakers from the We Invest in Nationhood party (Win) and another from a single-seat outfit voted in his favor. The tally made Win the second-largest party in parliament, securing Mohamed’s election even as a magistrate’s court hears state arguments for his extradition to the US. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/guyana-opposition-leader-us-extradition",
      "published": "Mon, 26 Jan 2026 18:26:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU pushes for deals as Trump's tariffs upset global trade",
      "description": "Fear over Trump's tariff walls and the aggressive tone coming from the White House is pushing the European Union to focus on getting other trade agreements done. Despite all efforts, the EU sometimes gets in its own way.",
      "url": "https://www.dw.com/en/eu-pushes-for-deals-as-trump-s-tariffs-upset-global-trade/a-75622014?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 12:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU, India to sign major trade deal",
      "description": "India rolled out the red carpet, hosting top EU leaders as guests of honour at its Republic Day parade, a day before the two sides are expected to sign a free trade agreement at an EU-India summit. Negotiations had started long before US president Donald Trump started imposing new tariffs on the rest of the world, but had taken on a sense of renewed urgency amid rising geopolitical and trade tensions.",
      "url": "https://www.france24.com/en/tv-shows/business/20260126-eu-india-to-sign-major-trade-deal",
      "published": "Mon, 26 Jan 2026 22:21:52 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "ICE killings a ‘watershed moment’: Trump, Republicans risk breaking with the American people",
      "description": "Nadia Massih welcomes former New York State Assemblyman Kenny Burgos (D) who offers a candid reflection on the killing of Alex Pretti by an ICE agent, described as a veritable \"watershed\" in American political consciousness. Mr. Burgos speaks from both political and personal vantage points, invoking the silent fear ripping beyond immigrant communities. The violent tactics of ICE, also targeting lawful migrants and US citizens, are striking fear across American as the country faces a reckoning with the very soul of American democracy.",
      "url": "https://www.france24.com/en/ice-killings-a-watershed-moment-trump-republicans-risk-breaking-with-the-american-people",
      "published": "Mon, 26 Jan 2026 18:10:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump dispatches border czar as judge weighs legality of ICE raids in Minnesota",
      "description": "President Donald Trump said Monday that border czar Tom Homan is heading to Minnesota as outrage mounts over the killing of US citizen Alex Pretti by Immigration and Customs Enforcement (ICE) agents. The move came as a federal judge began hearing arguments on whether the ICE crackdown in Minnesota violates the state's sovereignty and should be halted.",
      "url": "https://www.france24.com/en/americas/20260126-trump-to-send-homan-architect-of-his-anti-immigration-policy-to-minneapolis-amid-shooting-scrutiny",
      "published": "Mon, 26 Jan 2026 16:54:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "House of MAGA: As Trump seeks to fortify constituency, is he 'losing the rest of America'?",
      "description": "Delano D'Souza welcomes Todd Belt, Professor and Director of the Political Management Program at George Washington University's Graduate School of Political Management. In the wake of Alex Pretti’s killing by ICE agents in Minneapolis, the Trump administration is no longer controlling the narrative. The MAGA world's unyielding support for ICE's methods has started to erode under the weight of stark video evidence, widespread public outcry, and mounting pressure from within the Republican Party itself.",
      "url": "https://www.france24.com/en/house-of-maga-as-trump-seeks-to-fortify-constituency-is-he-losing-the-rest-of-america",
      "published": "Mon, 26 Jan 2026 16:48:11 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Child kidnapped for organ removal among 4,414 helped in trafficking crackdown",
      "description": "An eight-year-old boy kidnapped for organ removal is among 4,414 people police say have been safeguarded from human trafficking in a global operation.",
      "url": "https://news.sky.com/story/child-kidnapped-for-organ-removal-among-4414-helped-in-trafficking-crackdown-13499144",
      "published": "Mon, 26 Jan 2026 10:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Climber Alex Honnold scales Taipei 101 skyscraper without ropes",
      "description": "American climber Alex Honnold ascended one of the world's tallest buildings on Sunday without a rope or protective equipment.",
      "url": "https://news.sky.com/story/climber-alex-honnold-scales-taipei-101-skyscraper-without-ropes-13498734",
      "published": "Sun, 25 Jan 2026 08:27:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Young people must be ‘truly involved’ in transforming education",
      "description": "With young people under 30 making up more than half of the global population and over 272 million children and youth still out of school, their participation in shaping education is becoming increasingly vital.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166820",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Eighty years at the heart of global development",
      "description": "From humanitarian crises and youth unemployment, to climate resilience and development financing, many of today’s global challenges pass through a single United Nations body that is quietly turning 80 this year.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166814",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "FBI makes another arrest after Minneapolis 'rioters destroyed and stole equipment’ from agent’s vehicle: Patel",
      "description": "FBI Director Kash Patel announced the arrest of a suspect who allegedly used stolen ID material to threaten a Minneapolis agent and his family.",
      "url": "https://www.foxnews.com/us/fbi-makes-another-arrest-after-minneapolis-rioters-destroyed-stole-equipment-from-agents-vehicle-patel",
      "published": "Mon, 26 Jan 2026 12:10:00 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Emory fires Iranian official's daughter after campus protests over controversial hiring decision",
      "description": "Fatemeh Ardeshir-Larijani, daughter of sanctioned Iranian official Ali Larijani, lost her position at Emory University as activists called for review of her immigration status.",
      "url": "https://www.foxnews.com/world/emory-university-dismisses-daughter-senior-iranian-official-ali-larijani-campus-demonstrations",
      "published": "Sun, 25 Jan 2026 20:25:45 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Syrian militiaman shows off what he claims to be severed Kurdish fighter's braid as Damascus asserts control",
      "description": "A video of a Syrian fighter holding a braid he claims was taken from a Kurdish woman in Raqqa sparked outrage and protests as Damascus expands control amid a fragile ceasefire.",
      "url": "https://www.foxnews.com/world/syrian-militiaman-shows-off-what-he-claims-severed-kurdish-fighters-braid-damascus-asserts-control",
      "published": "Sun, 25 Jan 2026 16:42:55 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Deadly US winter storm leaves flights delayed and thousands without power",
      "description": "At least a dozen people have died in multiple US states possibly due to the storm, officials have said.",
      "url": "https://www.bbc.com/news/articles/cp3z8ek7eqyo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 22:49:39 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,433",
      "description": "These are the key developments from day 1,433 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/27/russia-ukraine-war-list-of-key-events-day-1433?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 02:02:03 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "White House attacks ‘sensationalist’ media over Alex Pretti coverage",
      "description": "The White House attacked the \"liberal biased media\" in response to a leading question about the killing of Alex Pretti.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/white-house-attacks-sensationalist-media-over-alex-pretti-coverage?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 20:27:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Much of US digging out from snow, sleet, ice from massive winter storm",
      "description": "A huge winter storm has brought frigid temperatures, snow, and sleet to more than a dozen US states.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/much-of-us-digging-out-from-snow-sleet-ice-from-massive-winter-storm?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 19:35:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Massive search underway for dozens missing in deadly Indonesia landslide",
      "description": "At least 80 people, including 19 members of an elite marine force, are missing in a landslide in Indonesia.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/massive-search-underway-for-dozens-missing-in-deadly-indonesia-landslide?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 17:42:40 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Hundreds feared dead in attempt to cross Mediterranean during cyclone",
      "description": "Fifty killed in one incident as Italian authorities estimate 380 people may have drowned last week Up to 380 people may have drowned attempting to cross the Mediterranean last week as Cyclone Harry battered southern Italy and Malta, the Italian coastguard has said, as a shipwreck with the loss of 50 lives was confirmed by Maltese authorities. Just one person, who was hospitalised in Malta, survived the shipwreck, which happened on Friday. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/hundreds-feared-dead-after-attempting-to-cross-mediterranean-amid-cyclone-harry",
      "published": "Mon, 26 Jan 2026 14:54:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Israel finds the last hostage body in Gaza, paving the way for next steps in Trump plan",
      "description": "The Israeli military says the body of Ran Gvili, a 24-year-old special forces policeman killed while fighting Hamas militants on Oct. 7, 2023, has been found.",
      "url": "https://www.npr.org/2026/01/26/g-s1-107340/israel-gaza-hostage-remains-hamas",
      "published": "Mon, 26 Jan 2026 09:17:36 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "France could become second country to ban social media for some teens",
      "description": "France is set to debate a proposed social media ban for those under 15 years old, as the country's president backs stricter rules and a high school phone ban.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5686578/france-could-become-second-country-to-ban-social-media-for-some-teens",
      "published": "Mon, 26 Jan 2026 04:48:37 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Holocaust survivor Leon Weintraub: \"We were dehumanized\"",
      "description": "The 100-year-old vividly recalls the hunger, death camps and cruelty of the guards. Thus, he tirelessly works to ensure that the Holocaust is never forgotten.",
      "url": "https://www.dw.com/en/holocaust-survivor-leon-weintraub-we-were-dehumanized/a-75663240?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 16:34:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'Barbaric' attack during Ukraine peace talks - but 'unexpected chemistry' raises hopes",
      "description": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said.",
      "url": "https://news.sky.com/story/barbaric-attack-on-ukraines-largest-cities-during-peace-talks-further-negotiations-expected-as-early-as-next-week-13498413",
      "published": "Sat, 24 Jan 2026 14:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Between fear and survival: Women and girls flee violence in northern Syria",
      "description": "When fighting recently intensified near her neighbourhood in Aleppo, in northern Syria, Fatima and her family had to run.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166833",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Keeping people warm amid hostilities and harsh winter weather in Ukraine",
      "description": "As people in war-torn Ukraine face the coldest winter in more than a decade, authorities and humanitarians are working to help them stay warm, particularly the most vulnerable residents.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166822",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A new blow for UNRWA as headquarters in East Jerusalem 'set on fire'",
      "description": "The head of embattled UN relief agency for Palestinians, UNRWA, has condemned reports that its headquarters in East Jerusalem have been set alight deliberately.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166829",
      "published": "Mon, 26 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says he will impose new tariffs on South Korea as he criticises delays in trade deal",
      "description": "US president says tariffs on automobiles, lumber and pharmaceuticals will rise to 25%, accusing Seoul of not living up to a trade deal struck last year Donald Trump has said he is raising tariffs on South Korean goods including automobiles, lumber and pharmaceuticals, accusing the country of not living up to a trade deal struck last year and briefly sending shares in Korean carmakers tumbling. In a post on social media, the US president said the tariffs paid on South Korean exports into America would rise from 15% to 25% because the “Korean Legislature hasn’t enacted our Historic Trade Agreement, which is their prerogative”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/27/trump-raises-south-korea-tariffs-carmakers-shares-fall",
      "published": "Tue, 27 Jan 2026 03:24:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Gavin Newsom accuses TikTok of suppressing content critical of Trump",
      "description": "California Governor Gavin Newsom has accused TikTok of suppressing content critical of President Donald Trump and has launched a review into whether the platform’s moderation practices violate state law. The move follows TikTok’s announcement that its Chinese owner, ByteDance, has finalised a deal to avoid a potential US ban.",
      "url": "https://www.france24.com/en/technology/20260127-gavin-newsom-accuses-tiktok-of-suppressing-content-critical-of-trump",
      "published": "Tue, 27 Jan 2026 03:03:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Military-backed party secures Myanmar election win with opposition excluded",
      "description": "Myanmar’s military-backed Union Solidarity and Development Party has claimed victory in the country's first election since the army seized power in 2021",
      "url": "https://abcnews.go.com/International/wireStory/military-backed-party-secures-myanmar-election-win-opposition-129558469",
      "published": "Mon, 26 Jan 2026 07:45:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Japanese court orders Pyongyang to pay damages to survivors of deceptive repatriation program",
      "description": "A Japanese court has held North Korea responsible for human rights violations against four plaintiffs lured to the country by false promises of a \"paradise on Earth.\"",
      "url": "https://abcnews.go.com/International/wireStory/japanese-court-orders-pyongyang-pay-damages-survivors-deceptive-129557777",
      "published": "Mon, 26 Jan 2026 07:29:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Sewage spill sends E coli surging in the Potomac River near DC",
      "description": "Potomac River sewage spill creates E. coli contamination 12,000 times above safe limits near Washington, D.C., affecting local waterways and public health.",
      "url": "https://www.foxnews.com/us/sewage-spill-sends-e-coli-surging-potomac-river-near-dc",
      "published": "Mon, 26 Jan 2026 21:55:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Former Louisiana high school teacher indicted for allegedly trying to entice student into sex",
      "description": "Ex-Louisiana teacher Katherine Albarado accused of sending explicit messages to 16-year-old student faces federal charges and potential life sentence.",
      "url": "https://www.foxnews.com/us/former-louisiana-high-school-teacher-indicted-entice-student-sex",
      "published": "Mon, 26 Jan 2026 15:48:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Nigerian officers to face trial over coup-plot allegations",
      "description": "Following an investigation some of the 16 detained last year are accused of planning to unseat President Bola Tinubu.",
      "url": "https://www.bbc.com/news/articles/c9dv4wlw3yzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 19:07:08 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Hamas disarmament in Gaza comes with ‘some sort of amnesty’: US official",
      "description": "Official's comment on amnesty for Hamas members seen as 'significant step', as focus moves to next stage of ceasefire.",
      "url": "https://www.aljazeera.com/news/2026/1/27/hamas-disarmament-in-gaza-comes-with-some-sort-of-amnesty-us-official?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 01:25:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli and Palestinian captives and prisoners: A timeline of key events",
      "description": "Israelis held captive in Gaza and Palestinians swept into Israel detention centres have been focus of ceasefire talks.",
      "url": "https://www.aljazeera.com/news/2026/1/26/israeli-and-palestinian-captives-and-prisoners-a-timeline-of-key-events?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 19:40:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "EU probes Musk’s Grok AI feature over deepfakes of women, minors",
      "description": "European Commission says its investigation will examine if the AI tool has met its legal obligations.",
      "url": "https://www.aljazeera.com/news/2026/1/26/eu-launches-probe-into-grok-ai-feature-creating-deepfakes-of-women-minors?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 16:49:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Netanyahu says next phase of ceasefire is ‘demilitarising’ Gaza",
      "description": "Benjamin Netanyahu said the next phase of the ceasefire will be “disarming Hamas and demilitarising the Gaza Strip.”",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/26/netanyahu-says-next-phase-of-ceasefire-is-demilitarising-gaza?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 16:22:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fate of China’s top general more likely to do with power struggle than corruption",
      "description": "Experts suggest Xi Jinping is asserting his authority by sidelining an officer who has significantly betrayed his trust Standing inches from Xi Jinping at a military ceremony in late December, China’s highest-ranking general, Zhang Youxia, may have had little inkling about the fate that was to befall him just a few weeks later when he was put under investigation. The 75-year-old’s physical proximity to China’s leader, who stands to his right, reflects the position he holds in China’s hierarchy. As vice-chair of the Central Military Commission (CMC), the ruling body of the People’s Liberation Army (PLA), he is the second-most powerful person in China’s military, after Xi, the commander-in-chief. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/china-top-general-zhang-youxia-power-struggle-corruption",
      "published": "Mon, 26 Jan 2026 19:09:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Police allege man charged with hate speech at Sydney protest has links to disbanded neo-Nazi group",
      "description": "Brandan Koschel was denied bail after appearing virtually before the court on Tuesday on charges of publicly inciting hatred on the grounds of race Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Police have alleged in court that there is information online that suggests a man charged under hate speech laws after an alleged antisemitic comment during a speech at an anti-immigration rally yesterday has links to or may have been a member of a now disbanded neo-Nazi group. Brandan Koschel was refused bail and remanded in custody after he appeared before the NSW bail division court on Tuesday from custody before magistrate Daniel Convington. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/27/police-allege-man-charged-with-hate-speech-at-sydney-protest-has-links-to-disbanded-neo-nazi-group-ntwnfb",
      "published": "Tue, 27 Jan 2026 01:58:22 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel says it has recovered the last remaining body of a hostage held in Gaza",
      "description": "The recovery is a major breakthrough in moving a three-month ceasefire in Gaza into its next phase.",
      "url": "https://www.npr.org/2026/01/26/nx-s1-5688794/israel-says-it-has-recovered-the-last-remaining-body-of-a-hostage-held-in-gaza",
      "published": "Mon, 26 Jan 2026 15:03:19 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israel launches 'large-scale operation' to locate last hostage in Gaza",
      "description": "The return of the remaining hostage, Ran Gvili, has been widely seen as removing the remaining obstacle to proceeding with the U.S.-brokered ceasefire's second phase.",
      "url": "https://www.npr.org/2026/01/26/g-s1-107323/israel-operation-locate-last-hostage",
      "published": "Mon, 26 Jan 2026 01:39:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Where is the threat from Russia and China in the Arctic?",
      "description": "As Trump points to Russia and China near Greenland, experts say the biggest Russian and Chinese activity is elsewhere in the Arctic.",
      "url": "https://www.npr.org/2026/01/25/nx-s1-5682932/where-is-the-threat-from-russia-and-china-in-the-arctic",
      "published": "Sun, 25 Jan 2026 17:35:07 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump threatens to raise tariffs on South Korean goods to 25 percent",
      "description": "US President Donald Trump has threatened to sharply increase tariffs on South Korean exports, accusing Seoul of failing to honour a trade agreement and raising the prospect of renewed tensions with one of Washington’s key Asian allies.",
      "url": "https://www.france24.com/en/asia-pacific/20260127-trump-threatens-to-raise-tariffs-on-south-korean-goods-to-25-percent",
      "published": "Tue, 27 Jan 2026 00:20:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration's response to Alex Pretti killing 'raises questions of principles vs hypocrisy'",
      "description": "Speaking with FRANCE 24's Mark Owen, David Schultz, Professor of Political Science at Hamline University, says that the Trump administration response to the killing of ICU nurse Alex Pretti during the protests in Minneapolis 'raises questions of principles versus hypocrisy' in relation to gun ownership.",
      "url": "https://www.france24.com/en/trump-administration-s-response-to-alex-pretti-killing-raises-questions-of-principles-vs-hypocrisy",
      "published": "Mon, 26 Jan 2026 20:32:00 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Carney calls Trump's tariff threats bluster ahead of US-Canada free trade talks",
      "description": "Canadian Prime Minister Mark Carney says some of U.S. President Donald Trump’s threats should be viewed as prepositioning ahead negotiations to renew the free trade pact between the two large trading partners",
      "url": "https://abcnews.go.com/International/wireStory/carney-calls-trumps-tariff-threats-bluster-ahead-us-129572146",
      "published": "Mon, 26 Jan 2026 13:29:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ethiopia declares the end of its first Marburg virus outbreak",
      "description": "Ethiopia has declared the end of its first Marburg virus outbreak",
      "url": "https://abcnews.go.com/International/wireStory/ethiopia-declares-end-marburg-virus-outbreak-129564220",
      "published": "Mon, 26 Jan 2026 10:11:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "‘Dangerous nostalgia’ is a threat to multilateralism, UN deputy chief tells Danish MPs",
      "description": "United Nations Deputy Secretary-General Amina Mohammed urged countries to protect the UN Charter in a powerful speech to the Danish Parliament on Thursday, urging countries to “stand up for a rules-based order” – or pay the price.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166812",
      "published": "Thu, 22 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Shirtless Florida man who jumped through Taco Bell window, robbed it with 'large rock' sentenced to 4 years",
      "description": "A Florida man was sentenced to four years in prison after his shirtless Taco Bell robbery using a \"large rock\" to threaten workers and customers.",
      "url": "https://www.foxnews.com/us/shirtless-florida-man-who-jumped-through-taco-bell-window-robbed-large-rock-sentenced-4-years",
      "published": "Mon, 26 Jan 2026 23:04:27 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says Iran called 'numerous' times to make deal as carrier enters Middle East waters",
      "description": "President Donald Trump indicated Iran is seeking negotiations as the USS Abraham Lincoln carrier enters the region and protests continue inside Iran.",
      "url": "https://www.foxnews.com/world/trump-says-iran-called-numerous-times-make-deal-carrier-enters-middle-east-waters",
      "published": "Mon, 26 Jan 2026 19:55:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China's top general ousted, placed under investigation in latest military purge",
      "description": "Chinese President Xi Jinping removed China's top general Zhang Youxia amid an investigation for violating party discipline in latest military purge.",
      "url": "https://www.foxnews.com/world/chinas-top-general-ousted-placed-under-investigation-latest-military-purge",
      "published": "Sun, 25 Jan 2026 12:10:48 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Lula, Trump discuss ‘Board of Peace’, agree to meet in Washington: Brazil",
      "description": "Lula criticises US actions in Venezuela, calling the capture of Maduro an unacceptable line against regional stability.",
      "url": "https://www.aljazeera.com/news/2026/1/26/lula-trump-discuss-board-of-peace-agree-to-meet-in-washington-brazil?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 19:11:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "‘They threw us out like baggage’: Russian family deported from US to Costa Rica still in limbo",
      "description": "Alexander, his wife and son, who fled danger under Putin, fighting for security – and compensation – after torment of migration journey Almost a year after Donald Trump strong-armed a deal with Costa Rica to receive 200 people from other countries who were being deported from the United States after being denied the right to request asylum, a small handful remain there in legal limbo and fighting for compensation. The asylum seekers flown to Costa Rica in chains last February, despite not being criminals, were from 20 other countries, chiefly parts of Asia and Africa and included 81 children. They had all tried to request refuge at the US-Mexico border but were quickly removed from American soil after Trump returned to the White House and effectively closed the US asylum system. In the face of a variety of political difficulties with deporting them to their native countries, the Trump administration sent them to Costa Rica, as he did others to Panama . Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/26/costa-rica-us-deportation",
      "published": "Mon, 26 Jan 2026 13:00:37 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany: Business index starts year with 'little momentum'",
      "description": "Germany's Ifo business barometer was stagnant in January, bucking predictions of a slight improvement. A dip in confidence in the service sector put the brakes on improved sentiments in other areas.",
      "url": "https://www.dw.com/en/germany-business-index-starts-year-with-little-momentum/a-75661116?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 12:05:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "France's lawmakers vote to ban social media for under-15s",
      "description": "As social media usage has grown, it has heightened concerns about excessive screen time and its negative impact on child development and mental health.",
      "url": "https://www.dw.com/en/france-s-lawmakers-vote-to-ban-social-media-for-under-15s/a-75669653?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 02:47:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Nigeria: Military officers to face trial over coup plot",
      "description": "The alleged coup plot raises concerns in a region that has already witnessed a series of military takeovers in recent years.",
      "url": "https://www.dw.com/en/nigeria-military-officers-to-face-trial-over-coup-plot/a-75669470?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 00:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "EU 'is still very uncomfortable about India-Russia relations', expert says ahead of free trade deal",
      "description": "The European Union ⁠and India will explore possibilities for Indian participation in European defence initiatives, according to reports. Speaking with FRANCE 24's Sharon Gaffney, Christophe Jaffrelot, Research Director at CNRS, explains that the addition of defence cooperation to a wide-ranging free trade deal is a political message from the EU to both current allies and rivals, but adds that the EU 'is still very uncomfortable about India-Russia relations'.",
      "url": "https://www.france24.com/en/tv-shows/a-propos/20260126-eu-is-still-very-uncomfortable-about-india-russia-relations-expert-says-ahead-of-free-trade-deal",
      "published": "Mon, 26 Jan 2026 22:17:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "EU countries' final approval to Russian gas ban, four years after full scale invasion of Ukraine",
      "description": "European ‍Union countries on Monday ​gave their final approval to the bloc's plan ⁠to ban Russian gas imports by late 2027, allowing it to pass into law. The policy makes legally-binding the ​EU's vow to cut ties with its former ‍top gas supplier, nearly four years after Russia's 2022 full-scale invasion ​of Ukraine. FRANCE 24's Emerald Maxwell reports.",
      "url": "https://www.france24.com/en/eu-countries-final-approval-to-russian-gas-ban-four-years-after-full-scale-invasion-of-ukraine",
      "published": "Mon, 26 Jan 2026 21:26:06 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "President Xi's purge is extraordinary - here's why",
      "description": "In a bombshell announcement, China's Ministry of Defence has said it is investigating General Zhang Youxia, China's most senior general and a man who was second only to Xi Jinping himself on China's top military decision-making body.",
      "url": "https://news.sky.com/story/xis-purge-of-top-general-paints-a-fascinating-picture-of-power-and-control-within-a-ruthless-and-unforgiving-system-13499060",
      "published": "Mon, 26 Jan 2026 04:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Limited access restored to Syria’s Al Hol camp amid security concerns",
      "description": "United Nations agencies have regained limited access to Syria’s Al Hol camp and resumed the delivery of essential supplies after days of disruption caused by a volatile security situation, the UN Deputy Spokesperson said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166824",
      "published": "Fri, 23 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Russia reportedly slams Trump’s Golden Dome as 'provocative' as trillion-dollar shield takes shape",
      "description": "Russia reportedly called the U.S. Golden Dome missile defense project \"provocative\" as an expert says Russia's reaction shows the system's power as a bargaining chip.",
      "url": "https://www.foxnews.com/world/russia-reportedly-slams-trumps-golden-dome-provocative-trillion-dollar-shield-takes-shape",
      "published": "Mon, 26 Jan 2026 16:26:40 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Toronto digs itself out after largest snowfall in city’s history",
      "description": "Some parts of city were buried under nearly 60cm of snow and over 500 flights were cancelled Sunday Toronto is beginning to dig itself out from the largest snowfall in the city’s history, a process which officials say is likely to take “several days”. Some parts of Canada’s largest city were buried under nearly 60cm (about 23in) of snow and more than 500 flights were cancelled Sunday after Toronto’s main airport was snowed in. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/26/toronto-snowstorm-record-snowfall-total",
      "published": "Mon, 26 Jan 2026 17:40:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Luxury blue-city landlords accused of looking the other way as high-end buildings turn into crime hubs",
      "description": "A woman allegedly sex trafficked as a minor sued luxury San Francisco apartment complexes, claiming staff accepted cash payments to ignore a trafficking operation.",
      "url": "https://www.foxnews.com/us/luxury-blue-city-landlords-accused-looking-other-way-high-end-buildings-turn-crime-hubs",
      "published": "Mon, 26 Jan 2026 14:11:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Immigration chief departing Minneapolis as Trump sends border tsar Tom Homan to scene",
      "description": "The decision may indicate that the administration is walking back more aggressive immigration enforcement.",
      "url": "https://www.bbc.com/news/articles/cgrdlr70qg4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 04:31:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel says it has retrieved remains of final Gaza hostage",
      "description": "Israeli Prime Minister Benjamin Netanyahu called Ran Gvili’s return \"an extraordinary achievement\".",
      "url": "https://www.bbc.com/news/articles/c5ydvz7nz4mo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 18:37:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "New Iran videos show bodies piled in hospital and snipers on roofs",
      "description": "Footage from a hospital in Tehran shows at least 31 bodies piled inside and seven body bags outside.",
      "url": "https://www.bbc.com/news/articles/c1m7kde3y3zo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 21:34:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump raises US tariffs on South Korea imports to 25%",
      "description": "Trump has accused Seoul of \"not living up\" to a trade deal that was reached last year.",
      "url": "https://www.bbc.com/news/articles/cwyw3ynwe37o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 03:06:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan court orders compensation for migrants lured to North Korea",
      "description": "The plaintiffs said North Korea was marketed to them as \"paradise on Earth\".",
      "url": "https://www.bbc.com/news/articles/c23r2l81708o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 02:23:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tech giants face landmark trial over social media addiction claims",
      "description": "Defendants include Meta, which owns Instagram and Facebook, TikTok's owner ByteDance and YouTube parent Google.",
      "url": "https://www.bbc.com/news/articles/c24g8v6qr1mo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 00:01:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Meta to trial premium subscriptions for Instagram, Facebook and WhatsApp",
      "description": "Under the plan, access to the platforms' core services would remain free to use.",
      "url": "https://www.bbc.com/news/articles/ce8rpdmm284o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 04:45:59 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former Olympian Ryan Wedding pleads not guilty to drug kingpin charges",
      "description": "The ex-Olympic snowboarder and accused cartel leader was taken into custody in Mexico last week by the FBI.",
      "url": "https://www.bbc.com/news/articles/cedweq4lj25o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 22:46:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Major step': French MPs vote in favour of bill to ban social media for under-15s",
      "description": "If the bill passes the upper house it could take effect by the start of France's new school year in September.",
      "url": "https://www.bbc.com/news/articles/c07x003vx0yo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 27 Jan 2026 01:12:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's military chief denies army assaulted Bobi Wine's wife",
      "description": "Barbara Kyagulanyi, married to the opposition leader, says she refused to reveal her husband's whereabouts.",
      "url": "https://www.bbc.com/news/articles/c20zdj8n7vgo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 10:31:33 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU investigates Elon Musk's X over Grok AI sexual deepfakes",
      "description": "The Commission will assess whether \"manipulated sexually explicit images\" have been shown to users in the EU.",
      "url": "https://www.bbc.com/news/articles/clye99wg0y8o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 13:34:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tearful goodbyes as Japan returns pandas to China amid worsening ties",
      "description": "The twin cubs' departure will leave Japan without any pandas for the first time since 1972.",
      "url": "https://www.bbc.com/news/articles/c8d0l778dero?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 03:08:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tributes pour in across India for revered BBC broadcaster Sir Mark Tully",
      "description": "Sir Mark Tully's cremation was held on Monday in Delhi, where he lived even after leaving the BBC.",
      "url": "https://www.bbc.com/news/articles/cgjw0w0qq4wo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 26 Jan 2026 11:58:00 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Lives on hold for two years: Hope, fear stuck behind Gaza’s Rafah crossing",
      "description": "Among those seeking an exit: severely ill children, a mother trying to reunite with her husband and an aspirant student.",
      "url": "https://www.aljazeera.com/news/2026/1/27/lives-on-hold-for-two-years-some-hope-stuck-behind-gazas-rafah-crossing?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 04:58:48 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says he’s raising tariffs on South Korea to 25%",
      "description": "US president says he is raising tariffs from 15 percent due to Seoul's failure to ratif trade deal.",
      "url": "https://www.aljazeera.com/news/2026/1/27/trump-says-he-is-raising-tariffs-on-south-korea-to-25?traffic_source=rss",
      "published": "Tue, 27 Jan 2026 01:18:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian PM Carney unveils multibillion-dollar push to lower food costs",
      "description": "Carney has been under pressure from the opposition to lower prices of food and other essentials for lower income people.",
      "url": "https://www.aljazeera.com/economy/2026/1/26/canadian-pm-carney-unveils-multibillion-dollar-push-to-lower-food-costs?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 21:14:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump’s second term: ‘Reality has overtaken satire’",
      "description": "Marc Lamont Hill sits down with The Nation’s Katrina vanden Heuvel to unpack the first year of Trump’s second term.",
      "url": "https://www.aljazeera.com/video/upfront/2026/1/26/trumps-second-term-reality-has-overtaken?traffic_source=rss",
      "published": "Mon, 26 Jan 2026 15:59:37 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Alex Honnold free solos Taipei 101 skyscraper in live Netflix climb",
      "description": "US climber takes an hour and half to scale one of Asia’s tallest buildings without ropes or a harness The US rock climber Alex Honnold climbed one of Asia’s tallest skyscrapers without ropes or a harness on Sunday, fulfilling an ambition that began more than a decade ago and which he hoped would inspire people to pursue their own challenges because “time is finite”. Honnold, who starred in the 2019 Oscar-winning documentary Free Solo, ascended the 508-metre (1,667ft) Taipei 101 using the skyscraper’s horizontal metal beams to pull himself up with his bare hands. The challenge had originally been scheduled to take place on Saturday but was postponed because of rain. Continue reading...",
      "url": "https://www.theguardian.com/sport/2026/jan/24/alex-honnold-free-solo-taipei-101-netflix",
      "published": "Sun, 25 Jan 2026 13:05:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australia cancels visa of Jewish influencer who previously called for Islam to be banned",
      "description": "Sammy Yahood accuses Labor of ‘tyranny’ after the government cancelled his visa hours before his flight was due to depart Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The government has cancelled the visa of a Jewish influencer who has previously called for the ban of Islam and was booked to speak at several events in Australia. The right-leaning Australian Jewish Association (AJA) said Sammy Yahood’s visa was cancelled three hours before his flight was due to depart. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/26/australia-cancels-visa-jewish-influencer-sammy-yahood-islam-banned-ntwnfb",
      "published": "Mon, 26 Jan 2026 23:57:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 5.5 - 9 km ESE of Dianga, China",
      "description": "PAGER - YELLOW ShakeMap - VII DYFI? - IV Time 2026-01-26 06:56:02 UTC 2026-01-26 06:56:02 UTC at epicenter Location 34.028°N 103.305°E Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rs2q",
      "published": "2026-01-26T14:33:40.040Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.7 - 40 km S of Evanston, Wyoming",
      "description": "PAGER - GREEN ShakeMap - V DYFI? - V Time 2026-01-22 14:49:20 UTC 2026-01-22 14:49:20 UTC at epicenter Location 40.911°N 110.875°W Depth 14.72 km (9.15 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/uu80127891",
      "published": "2026-01-26T22:26:52.574Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.3 - 20 km NNE of Indio, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - IV Time 2026-01-21 08:30:07 UTC 2026-01-21 08:30:07 UTC at epicenter Location 33.900°N 116.170°W Depth 3.67 km (2.28 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/ci41166223",
      "published": "2026-01-25T08:09:13.060Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 4 km NW of Ohlman, Illinois",
      "description": "ShakeMap - IV DYFI? - V Time 2026-01-20 07:27:40 UTC 2026-01-20 07:27:40 UTC at epicenter Location 39.375°N 89.246°W Depth 8.76 km (5.44 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nm60617031",
      "published": "2026-01-27T00:20:51.353Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "U.S. rock climber Alex Honnold reaches top of Taipei 101 skyscraper without ropes",
      "description": "Cheers erupted from a street-level crowd as Alex Honnold reached the top of the spire of the 508-meter (1,667-foot) tower, about 90 minutes after he started.",
      "url": "https://www.npr.org/2026/01/25/nx-s1-5687809/american-rock-climber-alex-honnold-reaches-top-of-taipei-skyscraper",
      "published": "Sun, 25 Jan 2026 07:33:57 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Greenland, tariffs and NATO: a rollercoaster week in transatlantic relations",
      "description": "After President Trump's upheaval at Davos, U.S. allies are openly questioning whether Washington can still anchor the rules-based order.",
      "url": "https://www.npr.org/2026/01/24/nx-s1-5685215/greenland-tariffs-and-nato-a-rollercoaster-week-in-transatlantic-relations",
      "published": "Sat, 24 Jan 2026 17:39:59 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Australian Open tennis encounters extreme heat",
      "description": "Tournament organizers have instituted their extreme heat protocols amid blistering temperatures in the region.",
      "url": "https://www.dw.com/en/australian-open-tennis-encounters-extreme-heat/a-75669794?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 27 Jan 2026 05:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ye aka Kanye West apologizes for antisemitic remarks",
      "description": "The artist previously known as Kanye West blamed his behavior on bipolar disorder, saying he \"lost touch with reality.\"",
      "url": "https://www.dw.com/en/ye-aka-kanye-west-apologizes-for-antisemitic-remarks/a-75669379?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 22:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Berlin's young Jews reveal complex experiences with antisemitism",
      "description": "Jewish people in Berlin have had varying experiences since October 7, 2023, but several DW spoke to say they have seen more antisemitism and have become increasingly cautious.",
      "url": "https://www.dw.com/en/berlin-s-young-jews-reveal-complex-experiences-with-antisemitism/a-75665838?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 20:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany, France, others rebuke Trump's NATO troop disrespect",
      "description": "German Defense Minister Boris Pistorius said it would show \"decency\" for Donald Trump to apologize for comments on NATO troops in Afghanistan. \"But we all know how the US president operates,\" Pistorius added.",
      "url": "https://www.dw.com/en/germany-france-others-rebuke-trump-s-nato-troop-disrespect/a-75666924?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 18:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Latin America waiting: What's next for the EU-Mercosur deal?",
      "description": "The European Commission eyes pushing the bloc’s biggest ever trade deal ahead without the European Parliament’s okay ― for now.",
      "url": "https://www.dw.com/en/latin-america-waiting-what-s-next-for-the-eu-mercosur-deal/a-75666418?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 17:33:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Retrial in murder of Slovak journalist and fiancee begins",
      "description": "The second retrial in the Jan Kuciak murder case began on January 26. Businessman Marian Kocner again faces charges after the Slovak Supreme Court overturned his previous two acquittals.",
      "url": "https://www.dw.com/en/retrial-in-murder-of-slovak-journalist-and-fiancee-begins/a-75665546?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 16:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gold breaks $5,000: What's fueling the price rally and where will it end?",
      "description": "Gold continues to hit record highs, having already had a bumper run in 2025. Geopolitical and economic uncertainty are the key factors, while doubts over the US dollar are also attracting new investors.",
      "url": "https://www.dw.com/en/gold-breaks-5-000-what-s-fueling-the-price-rally-and-where-will-it-end/a-75665999?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 16:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK: Suella Braverman defects from Conservatives to Reform",
      "description": "The former UK Cabinet member is the latest high-ranking Conservative politician to defect to Reform UK, led by Nigel Farage. Another senior Tory, Robert Jenrick, was pushed before he could leave earlier this month.",
      "url": "https://www.dw.com/en/uk-suella-braverman-defects-from-conservatives-to-reform/a-75664224?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 15:18:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Cricket: Don Bradman's India cap fetches $318,000",
      "description": "A cap that was worn by the Australian cricket legend Don Bradman against India has raised a tidy sum, having been sold to an anonymous bidder. Bradman, the star of the series, had gifted the cap to an Indian player.",
      "url": "https://www.dw.com/en/cricket-don-bradman-s-india-cap-fetches-318-000/a-75664187?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 14:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Vietnam bets big on To Lam's power and growth strategy",
      "description": "Vietnam's Communist Party has handed To Lam another five-year term and endorsed a reform agenda aimed at transforming the economy by 2030.",
      "url": "https://www.dw.com/en/vietnam-bets-big-on-to-lam-s-power-and-growth-strategy/a-75664156?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 13:50:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU opens probe into Musk's Grok chatbot",
      "description": "The European Commission is to look into whether Elon Musk's Grok AI chatbot is spreading illegal content in the EU. Among other things, Grok has been used to make manipulated sexualized images, often of women and minors.",
      "url": "https://www.dw.com/en/eu-opens-probe-into-musk-s-grok-chatbot/a-75663255?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 26 Jan 2026 13:06:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda: Battered Barbra Kyagulanyi tells husband Bobi Wine to stay in hiding",
      "description": "Muhoozi Kainerugaba, Uganda's military chief, denied accusations that soldiers had been sent to the home of opposition leader Bobi Wine to beat his wife in posts on X. Wine has been in hiding since disputing the outcome of the mid-January elections that returned President Yoweri Museveni to power for a seventh term. Kainerugaba claims that troops did not raid Wine's home and assault his wife, Barbra, because it is not worth the army's time. Barbra is currently in hospital. She recorded the intruders on her phone and says they forced their way into her home, choked her, mocked her and assaulted her staff, demanding that she tell them where her husband was.",
      "url": "https://www.france24.com/en/tv-shows/eye-on-africa/20260126-uganda-battered-barbra-kyagulanyi-tells-husband-bobi-wine-to-stay-in-hiding",
      "published": "Mon, 26 Jan 2026 21:44:05 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French ex-senator goes on trial over allegedly spiking MPs drink to sexually assault her",
      "description": "Former French senator Joel Guerriau went on trial Monday for allegedly spiking lawmaker Sandrine Josso's champagne in November 2023 in order to sexually abuse her. Guerriau denies the charges. The case has gripped France following the 2024 conviction of Dominique Pelicot, who was found guilty of repeatedly drugging and raping his wife, Gisèle.",
      "url": "https://www.france24.com/en/france/20260126-french-ex-senator-goes-on-trial-over-allegedly-spiking-mps-drink-to-sexually-assault-her",
      "published": "Mon, 26 Jan 2026 17:25:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France's Macron vows to speed up social media ban for under-15s",
      "description": "French President Emmanuel Macron announced plans to fast-track legislation banning social media use for children under 15, aiming for implementation by September. The move follows Australia's recent ban on under-16s using popular platforms like Instagram, TikTok, and YouTube. Macron also supports a ban on mobile phones in schools, with the draft legislation set to be submitted to the French parliament. FRANCE 24's Angela Diffley has the details.",
      "url": "https://www.france24.com/en/france-s-macron-vows-to-speed-up-social-media-ban-for-under-15s",
      "published": "Mon, 26 Jan 2026 17:23:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "India holds annual military parade with EU leaders as its guests of honour",
      "description": "#India held its annual #military parade, which celebrates the foundation of its Republic 77 years ago. This year, #EU leaders Ursula von der Leyen and Antonio Costa were in the front seats, ahead of a decisive EU-India summit on January 27.",
      "url": "https://www.france24.com/en/video/20260126-india-holds-annual-military-parade-with-eu-leaders-as-its-guests-of-honour-5",
      "published": "Mon, 26 Jan 2026 17:03:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Every day you have to fight - it's one continuous day of survival'",
      "description": "The sound of deep, slow breaths echoes up a frozen staircase, followed by footsteps.",
      "url": "https://news.sky.com/story/how-ukrainians-are-coping-with-brutal-winter-as-russia-brings-war-into-peoples-homes-13499175",
      "published": "Mon, 26 Jan 2026 11:35:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Public face' of Trump's ICE operation to leave Minneapolis",
      "description": "The border commander who has emerged as the face of the Trump administration's ICE operation in Minneapolis is leaving his role.",
      "url": "https://news.sky.com/story/public-face-of-trumps-minneapolis-crackdown-set-to-leave-city-as-presidents-tone-shifts-13499461",
      "published": "Mon, 26 Jan 2026 23:37:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Remains of last Israeli hostage found in Gaza",
      "description": "The remains of the last Israeli hostage in Gaza have been found.",
      "url": "https://news.sky.com/story/remains-of-last-israeli-hostage-found-in-gaza-13499223",
      "published": "Mon, 26 Jan 2026 13:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal's aquagym classes offer hope and healing for people with reduced mobility",
      "description": "Senegal’s first aquagym program has drawn praise from health professionals for helping people with reduced mobility caused by noncommunicable diseases",
      "url": "https://abcnews.go.com/International/wireStory/senegals-aquagym-classes-offer-hope-healing-people-reduced-129587838",
      "published": "Tue, 27 Jan 2026 00:17:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela releases dozens of prisoners in 2 days, hundreds more still detained",
      "description": "Venezuela’s leading prisoner rights organization says that dozens of prisoners were released over the weekend",
      "url": "https://abcnews.go.com/International/wireStory/venezuela-releases-dozens-prisoners-2-days-hundreds-detained-129578400",
      "published": "Mon, 26 Jan 2026 17:43:12 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hungary's Orbán accuses Ukraine of election interference and summons ambassador",
      "description": "Hungary's Prime Minister Viktor Orbán is accusing Ukraine of meddling in upcoming elections, and has summoned Kyiv's ambassador",
      "url": "https://abcnews.go.com/International/wireStory/hungarys-orbn-accuses-ukraine-election-interference-summons-ambassador-129575413",
      "published": "Mon, 26 Jan 2026 14:34:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Guyanese businessman facing US extradition elected opposition leader",
      "description": "A Guyanese businessman facing extradition to the U.S. on gold smuggling and money laundering charges has been elected as Guyana's opposition leader",
      "url": "https://abcnews.go.com/International/wireStory/guyanese-businessman-facing-us-extradition-elected-opposition-leader-129569578",
      "published": "Mon, 26 Jan 2026 14:09:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Britain's Conservative Party loses another high-profile lawmaker to hard-right Reform",
      "description": "Former British Home Secretary Suella Braverman has defected to the hard-right Reform UK party",
      "url": "https://abcnews.go.com/International/wireStory/britains-conservative-party-loses-high-profile-lawmaker-hard-129562102",
      "published": "Mon, 26 Jan 2026 12:33:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Talks with US and Ukraine were constructive but major challenges remain, Kremlin says",
      "description": "Negotiations to end Russia's invasion of Ukraine are showing signs of progress, but major challenges remain, according to a senior Kremlin official",
      "url": "https://abcnews.go.com/International/wireStory/talks-us-ukraine-abu-dhabi-constructive-major-challenges-129558732",
      "published": "Mon, 26 Jan 2026 09:03:12 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France honors fallen soldiers in Afghanistan after Trump's false claim about NATO troops",
      "description": "A senior French official has emphasized the importance of honoring French soldiers who died in Afghanistan",
      "url": "https://abcnews.go.com/International/wireStory/france-honors-fallen-soldiers-afghanistan-after-trumps-false-129557778",
      "published": "Mon, 26 Jan 2026 07:37:38 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What to know about a French ex-senator on trial for drugging a lawmaker to sexually assault her",
      "description": "A former French senator is on trial in Paris, accused of drugging a lawmaker to sexually assault her",
      "url": "https://abcnews.go.com/International/wireStory/french-senator-trial-drugging-lawmaker-sexually-assault-129557408",
      "published": "Mon, 26 Jan 2026 07:05:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Philippines tells Beijing it is alarmed over escalating verbal tussle in South China Sea dispute",
      "description": "The Philippines has told China that it is alarmed about heated exchanges with Chinese diplomats in Manila over the long-standing territorial dispute between the two countries in the South China Sea",
      "url": "https://abcnews.go.com/International/wireStory/philippines-tells-beijing-alarmed-escalating-verbal-tussle-south-129557051",
      "published": "Mon, 26 Jan 2026 06:41:28 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From family farm to climate tech: How one Kenyan woman is helping farmers outsmart drought",
      "description": "“Giving up is not an option - so many people depend on you,” the words of Maryanne Gichanga, a participant in a UN supported initiative, which aims to help farmers in Kenya find solutions to alleviate the pressures of climate change on agriculture production.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166823",
      "published": "Sun, 25 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Unsealed records in Idaho student murders detail victims' injuries, final movements",
      "description": "A forensic account of the 2022 University of Idaho slayings revealed specific injury counts and new analysis regarding the students' final movements.",
      "url": "https://www.foxnews.com/us/unsealed-records-idaho-student-murders-detail-injuries-final-movements",
      "published": "Mon, 26 Jan 2026 18:42:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Columbia University anti-Israel group slams new president as 'fascist' over previous encampment bust-up",
      "description": "Anti-Israel groups are criticizing Columbia University's new president Jennifer Mnookin over her previous actions against student encampments.",
      "url": "https://www.foxnews.com/us/columbia-university-anti-israel-group-slams-new-president-fascist-over-previous-encampment-bust-up",
      "published": "Mon, 26 Jan 2026 18:01:20 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "West Virginia librarian arrested for allegedly recruiting people on social media to assassinate Trump",
      "description": "A Jackson County, West Virginia librarian is accused of posting a video on social media that seemed to seek a \"sniper\" to target President Donald Trump.",
      "url": "https://www.foxnews.com/us/west-virginia-librarian-arrested-recruiting-people-social-media-assassinate-trump",
      "published": "Mon, 26 Jan 2026 16:50:02 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Viral video shows man stomped during chaotic gas station brawl as teen is arrested",
      "description": "Viral video shows Arkansas teenager allegedly stomping victim's head at Hot Springs gas station, leaving 20-year-old with skull fracture in intensive care.",
      "url": "https://www.foxnews.com/us/viral-video-shows-man-stomped-during-chaotic-gas-station-brawl-teen-arrested",
      "published": "Mon, 26 Jan 2026 11:48:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuelan opposition leader says democratic transition would be 'fall of the Berlin Wall' for Americas",
      "description": "Opposition leader María Corina Machado said she intends to return to Venezuela soon to help drive a democratic transition.",
      "url": "https://www.foxnews.com/world/venezuelan-opposition-leader-says-democratic-transition-would-be-fall-berlin-wall-americas",
      "published": "Mon, 26 Jan 2026 13:36:01 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel confirms recovery of last hostage's remains from Gaza",
      "description": "The remains of Ran Gvili, the final Israeli hostage held by Hamas, have been recovered from Gaza. The police officer died defending Israel on Oct. 7.",
      "url": "https://www.foxnews.com/world/israel-confirms-recovery-last-hostages-remains-from-gaza",
      "published": "Mon, 26 Jan 2026 09:11:28 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Zelenskyy says US security guarantees document is '100% ready' for signing",
      "description": "Ukraine's Zelenskyy says U.S. security guarantees document is \"100% ready\" for signing as trilateral peace talks with Russia expected to continue in Abu Dhabi.",
      "url": "https://www.foxnews.com/world/zelenskyy-says-us-security-guarantees-document-100-ready-signing",
      "published": "Mon, 26 Jan 2026 08:11:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel announces limited reopening of Rafah Crossing under Trump’s 20-point plan",
      "description": "Netanyahu agrees to reopen Gaza's Rafah crossing under President Trump's 20-point peace plan, pending the recovery of the final Israeli hostage.",
      "url": "https://www.foxnews.com/world/israel-announces-limited-reopening-rafah-crossing-under-trumps-20-point-plan",
      "published": "Sun, 25 Jan 2026 17:45:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Macron says children's brains are 'not for sale,' urges fast-track to ban social media for kids under 15",
      "description": "French President Emmanuel Macron pushes lawmakers to ban social media for kids under 15, saying children's emotions won't be manipulated by \"American Platforms\" or \"Chinese algorithms.\"",
      "url": "https://www.foxnews.com/world/macron-says-childrens-brains-not-sale-urges-fast-track-ban-social-media-kids-under-15",
      "published": "Sun, 25 Jan 2026 13:35:36 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}