{
  "last_updated": "2025-12-23T22:21:02.538913Z",
  "event_count": 224,
  "events": [
    {
      "title": "Fundraiser for 'Australian hero' who disarmed terrorist during Bondi Beach mass shooting surpasses $2.6M",
      "description": "Australian hero who tackled Bondi Beach gunman receives $2.6M in donations in response to brave actions during deadly attack that left him wounded but praised globally.",
      "url": "https://www.foxnews.com/world/fundraiser-australian-hero-disarmed-terrorist-bondi-beach-mass-shooting-surpasses-2-6m",
      "published": "Sun, 21 Dec 2025 04:42:08 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 50,
      "severity_level": "Critical"
    },
    {
      "title": "Jeju Air crash: South Korea sets up independent inquiry into disaster that killed 179 amid delays and acrimony",
      "description": "MPs vote to investigate crash amid accusations from victims’ relatives of cover-ups and delays South Korea’s parliament has launched an independent inquiry into the deadliest air disaster on its soil amid accusations of investigation delays and cover-ups of last year’s Jeju Air crash. On 29 December 2024 all but two of the 181 people onboard a Jeju Air Boeing 737-800 died when it crashed at Muan international airport, 288km south of Seoul, after reporting a bird strike during landing. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/jeju-air-crash-independent-inquiry-south-korea",
      "published": "Mon, 22 Dec 2025 06:33:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: More UN staff detentions in Yemen, peacekeepers killed in Sudan sent home, attacks in Ukraine",
      "description": "The UN Secretary-General on Friday condemned the arbitrary detention of 10 more UN personnel by Houthi de facto authorities in Yemen, warning that the growing crackdown is crippling humanitarian operations and putting millions of lives at risk.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166644",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Australia terror attack exposes ISIS resurgence as experts warn of global jihadist networks",
      "description": "Terror attack in Australia exposes growing jihadist networks as security experts warn ISIS remains far from defeated despite recent government claims.",
      "url": "https://www.foxnews.com/world/australia-terror-attack-exposes-isis-resurgence-experts-warn-global-jihadist-networks",
      "published": "Mon, 22 Dec 2025 06:00:53 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Bondi policeman injured in mass shooting wakes from coma",
      "description": "A police officer injured in the Bondi terror attack has woken from a coma.",
      "url": "https://news.sky.com/story/bondi-policeman-injured-in-mass-shooting-wakes-from-coma-13487062",
      "published": "Tue, 23 Dec 2025 14:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 32,
      "severity_level": "Critical"
    },
    {
      "title": "Libya’s army chief dies in plane crash in Turkey",
      "description": "Libyan PM says Mohammed Ali Ahmed al-Haddad died after aircraft lost radio contact above Ankara The Libyan army’s chief of staff, Mohammed Ali Ahmed al-Haddad, has been killed in a plane crash after leaving Turkey’s capital, Ankara. The prime minister of Libya’s internationally recognised government confirmed on Tuesday evening that Mohammed Ali Ahmed al-Haddad had died and that four others were on the jet with him. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/libyas-army-chief-dies-in-plane-crash-in-turkey",
      "published": "Tue, 23 Dec 2025 21:03:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Japan preparing to restart the world's largest nuclear power plant",
      "description": "A local government in Japan voted Monday to restart the world's largest nuclear power plant, which has been closed since 2011 Fukushima nuclear disaster.",
      "url": "https://www.npr.org/2025/12/22/nx-s1-5648212/japan-preparing-to-restart-the-worlds-largest-nuclear-power-plant",
      "published": "Mon, 22 Dec 2025 06:49:49 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Guilty verdicts in ISIS plot police say could have been 'the deadliest terrorist attack in UK history'",
      "description": "Three men convicted of planning alleged gun attacks on Jewish targets in Manchester as British Jews report feeling increasingly unsafe across the U.K.",
      "url": "https://www.foxnews.com/world/guilty-verdicts-isis-plot-police-say-could-have-been-the-deadliest-terrorist-attack-uk-history",
      "published": "Tue, 23 Dec 2025 13:17:24 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "UN warns Sudan war entering deadlier phase as fighting spreads in Kordofan",
      "description": "The war in Sudan is entering a deadlier phase, the United Nations has warned, as intensified fighting in the Kordofan region, mounting civilian casualties from drone strikes and growing risks of regional spillover push the conflict toward the 1,000-day mark.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166655",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Delaware state trooper killed in DMV shooting incident, gunman also dead with no active threat: officials",
      "description": "A Delaware state trooper was killed Tuesday in a shooting at a Wilmington DMV. Officials say the suspect is dead and the scene is secure.",
      "url": "https://www.foxnews.com/us/delaware-state-trooper-killed-dmv-shooting-incident-gunman-dead-no-active-threat-officials",
      "published": "Tue, 23 Dec 2025 17:06:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "NSW passes controversial new gun and protest laws in wake of Bondi attacks after marathon debate",
      "description": "The omnibus bill, which included amendments to multiple pieces of legislation, was criticised by both progressives and conservatives Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The New South Wales government has passed controversial changes to gun laws and new powers for police to ban street protests for up to three months, after a marathon debate in the upper house. The laws, which were drafted in response to the 14 December massacre at Sydney’s Bondi beach in which two gunmen fired on a Hanukah event, killing 15 people , were voted through at 2.51am on Wednesday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/23/nsw-passes-controversial-new-gun-and-protest-laws-in-wake-of-bondi-attacks-after-marathon-debate-ntwnfb",
      "published": "Tue, 23 Dec 2025 17:51:52 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Explosion at Pennsylvania senior home prompts mass casualty response",
      "description": "Multiple people reportedly trapped after explosion rocks Silver Lake Nursing Home in Bristol, Pennsylvania. Large emergency response operation underway.",
      "url": "https://www.foxnews.com/us/explosion-pennsylvania-senior-home-prompts-mass-casualty-response",
      "published": "Tue, 23 Dec 2025 16:35:37 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "ISIS, Iran escalating global campaign against Jews, Israel spy chief says",
      "description": "Mossad Director David Barnea said Israel will pursue the Bondi attackers and those who sent them, warning Iran and ISIS are accelerating global plots against Jews.",
      "url": "https://www.foxnews.com/world/isis-iran-escalating-global-campaign-against-jews-israel-spy-chief-says",
      "published": "Sun, 21 Dec 2025 13:04:30 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Screams for help and panic as tourists rescued from fatal Laos ferry disaster",
      "description": "People scrambled to safety as the ferry sank on the Mekong River, with a local woman and two children feared dead.",
      "url": "https://www.bbc.com/news/articles/cx2gk56pd5eo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 12:47:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Brown University police chief placed on leave after deadly shooting as Trump admin opens investigation",
      "description": "Brown University places police chief Rodney Chatman on administrative leave following deadly campus shooting that killed two people and injured nine others.",
      "url": "https://www.foxnews.com/us/brown-university-police-chief-placed-leave-after-deadly-shooting-trump-admin-opens-investigation",
      "published": "Tue, 23 Dec 2025 11:35:04 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russian general killed by car bomb, third senior military leader killed this year",
      "description": "Russian Lt. General Fanil Sarvarov killed in Moscow car bombing as investigators suspect Ukrainian intelligence involvement in the deadly attack on Monday.",
      "url": "https://www.foxnews.com/world/russian-general-killed-car-bomb-third-senior-military-leader-killed-year",
      "published": "Mon, 22 Dec 2025 07:53:26 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Labor’s changes to listing hate groups will target Islamist and far-right extremists operating just inside the limits of law",
      "description": "Home affairs minister says the proposal would clamp down on groups like Hizb ut-Tahrir and the National Socialist Network Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The federal government wants to shut down Islamist and far-right extremists with a new regime for listing hate groups, which would operate nearly identically to the terror listing scheme that outlaws the Islamic State, al-Qaida and Hamas. The changes to clamp down on groups like the Islamist Hizb ut-Tahrir and the neo-Nazi National Socialist Network are overdue, according to one leading terror researcher, because those radical groups have managed to operate just inside the limits of current hate laws. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/23/labors-changes-to-listing-hate-groups-will-target-islamist-and-far-right-extremists-operating-just-inside-the-limits-of-law-ntwnfb",
      "published": "Tue, 23 Dec 2025 14:00:43 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Russia attacks Ukraine energy sector with drones and missiles strikes",
      "description": "Russia fired more than 650 drones and three dozen missiles at Ukraine in a large-scale attack that began during the night and stretched into daylight hours Tuesday, officials said. At least three people were killed, including a 4-year-old child, two days before Christmas.",
      "url": "https://www.france24.com/en/video/20251223-russia-attacks-ukraine-energy-sector-with-drones-and-missiles-strikes",
      "published": "Tue, 23 Dec 2025 15:54:27 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN urges calm in Bangladesh after killing of protest leader sparks unrest",
      "description": "The United Nations has urged calm in Bangladesh after the killing of a prominent youth protest leader sparked fresh unrest, raising concerns about political violence and the safety of civic space as the country prepares for elections early next year.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166642",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "American journalist injured in Israeli attack wants answers from Washington",
      "description": "AFP's Dylan Collins was among journalists injured in an Israeli attack on Lebanon in 2023. The attack killed Reuters' Issam Abdallah. Collins was in Washington this month to press for accountability.",
      "url": "https://www.npr.org/2025/12/23/g-s1-103310/dylan-collins-lebanon-israel-attack-washington-congress",
      "published": "Tue, 23 Dec 2025 05:02:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Australia's NSW poised for gun law reform after Bondi attack",
      "description": "New South Wales, Australia's most populous state, is expected to pass sweeping new gun laws and give police power to temporarily ban protests in the wake of the mass shooting at Bondi.",
      "url": "https://www.dw.com/en/australia-s-nsw-poised-for-gun-law-reform-after-bondi-attack/a-75284100?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 12:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "LIVE: Security Council meets on escalating violence in Sudan",
      "description": "Senior UN political and humanitarian officials are set brief the Security Council this afternoon as members meet to discuss the rapidly deteriorating situation in Sudan, where intensified fighting – including in the Kordofan region – has driven widespread civilian harm and displacement. The region has seen a sharp escalation, including a deadly drone attack on a UN peacekeeping base that killed six Bangladeshi peacekeepers. The meeting was requested by Sudan and Transitional Prime Minister, Kamil Eltayeb Idris, is expected to attend. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166650",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Australian PM Albanese gets booed during Bondi Beach vigil honoring Hanukkah attack victims",
      "description": "Prime Minister Anthony Albanese faced boos at a vigil for Bondi Beach shooting victims Sunday, as some 10,000 mourners gathered to honor those killed.",
      "url": "https://www.foxnews.com/world/australian-pm-albanese-gets-booed-during-bondi-beach-vigil-honoring-hanukkah-attack-victims",
      "published": "Sun, 21 Dec 2025 11:07:04 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Sweden and Germany slash aid budgets to focus on Ukraine and defence spending",
      "description": "Echoing the dismantling of USAID, other countries are changing funding priorities and health and hunger programmes in Africa will lose out The notion of humanitarian aid being used to combat poverty and hunger is being replaced in Europe with geopolitical “games” as states redirect aid to Ukraine and to defence spending, analysts warn after recent announcements by Sweden and Germany. Earlier this year, humanitarian groups called for European donors to fill the gap as President Donald Trump dismantled the USAID programme, but instead other nations are further pulling back from their commitments around the world. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/21/sweden-and-germany-slash-aid-budgets-to-focus-on-ukraine-and-defence-spending",
      "published": "Sun, 21 Dec 2025 14:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trust issues: Could there be more 'Islamic State' supporters in Syrian army?",
      "description": "The attack on US troops by a Syrian security forces member who was a supporter of the extremist \"Islamic State\" group in mid-December has consequences well beyond the four deaths that resulted.",
      "url": "https://www.dw.com/en/trust-issues-could-there-be-more-islamic-state-supporters-in-syrian-army/a-75288349?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 17:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Workers organized by a key union rally in Bolivia against scrapping fuel subsidies",
      "description": "Bolivian miners have marched in downtown La Paz, the country’s capital, and union-organized protesters took to the streets elsewhere on the first day of a strike over the government’s scrapping of fuel subsidies that have been blamed for contributing t...",
      "url": "https://abcnews.go.com/International/wireStory/workers-organized-key-union-rally-bolivia-scrapping-fuel-128635978",
      "published": "Mon, 22 Dec 2025 19:37:36 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "'Extremely cunning' suspect in deadly Taiwan knife attack planned it for over a year",
      "description": "Police say the suspect in a deadly knife and grenade attack that left three dead and 11 wounded in Taiwan’s capital had been meticulously planning the assault for more than a year",
      "url": "https://abcnews.go.com/International/wireStory/extremely-cunning-suspect-deadly-taiwan-knife-attack-planned-128612935",
      "published": "Mon, 22 Dec 2025 05:17:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Croatian man sentenced to 50 years for killing 7-year-old student in school attack",
      "description": "A Croatian man has been sentenced to 50 years in prison for fatally stabbing a 7-year-old student in an attack at a school that shocked the European Union country",
      "url": "https://abcnews.go.com/International/wireStory/croatian-man-sentenced-50-years-killing-7-year-128644215",
      "published": "Tue, 23 Dec 2025 06:40:30 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Freed Nigerian schoolchildren to be reunited with families",
      "description": "Month-long ordeal ends but no details released on how they regained their freedom or who was behind abduction A final group of 130 kidnapped Nigerian schoolchildren freed by the government on Sunday are expected to be reunited with their families in the central Niger state on Monday, ending a month-long ordeal that drew global concern. Last month, unknown gunmen took hundreds of schoolchildren and 12 teachers from St Mary’s Catholic school, Papiri community in Niger state, which runs west from the capital, Abuja, to neighbouring Benin. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/freed-nigerian-schoolchildren-set-to-be-reunited-with-families",
      "published": "Mon, 22 Dec 2025 12:00:34 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘Gunboat diplomacy on steroids’: US signs security deals across Latin America",
      "description": "Venezuela’s Nicolás Maduro warns Trump administration may ‘destabilise the entire region’ amid rising tensions While all eyes are on the four-month-long US military campaign against Venezuela, the White House has been quietly striking security agreements with other countries to deploy US troops across Latin America and the Caribbean. As Donald Trump announced a blockade on oil tankers under sanctions and ordered the seizure of vessels amid airstrikes that have killed more than 100 people in the Caribbean and the Pacific, the US secured military deals with Paraguay, Ecuador, Peru and Trinidad and Tobago in the past week alone. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/23/us-trump-administration-signs-security-deals-across-latin-america",
      "published": "Tue, 23 Dec 2025 12:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Bondi Beach shooting suspect trained with father before attack, police say",
      "description": "A man suspected of killing 15 people during a shooting in Bondi Beach \"conducted firearms training\" with his father before the attack on a Jewish event, Australian police have said.",
      "url": "https://news.sky.com/story/bondi-beach-shooting-suspect-trained-with-father-before-attack-police-say-13486555",
      "published": "Mon, 22 Dec 2025 04:30:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Myanmar elections marked by fear as UN warns civilians are coerced from all sides",
      "description": "As Myanmar approaches elections scheduled for 28 December, the UN’s top human rights official has said that civilians are being coerced from all sides – forced by the military to vote and threatened by armed opposition groups to boycott – in a climate of fear, violence and mass repression.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166662",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "‘Israel is only the appetizer’: Huckabee warns Iran threat looms as Netanyahu eyes Trump talks",
      "description": "Israeli Prime Minister Benjamin Netanyahu seeks meeting with President Donald Trump as officials warn Iranian missile drills could cover surprise attack plans.",
      "url": "https://www.foxnews.com/world/israel-only-appetizer-huckabee-warns-iran-threat-looms-netanyahu-eyes-trump-talks",
      "published": "Mon, 22 Dec 2025 11:35:34 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "France probes cyberattack on postal service claimed by pro-Russian hackers",
      "description": "France's internal intelligence services are investigating a cyberattack on the country's national postal service that has disrupted deliveries during the busy Christmas season. The attack was claimed by Noname057(16), a pro-Russian group of hackers that has previously targeted Ukrainian media websites and government and corporate websites in countries including Poland, Sweden and Germany.",
      "url": "https://www.france24.com/en/france/20251223-france-probes-cyberattack-on-postal-service-claimed-by-pro-russian-hackers",
      "published": "Tue, 23 Dec 2025 21:39:47 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Security Council remains divided over Iran nuclear programme, sanctions stay in place",
      "description": "At a meeting to discuss nuclear non-proliferation on Tuesday, the Security Council’s stance on Iran’s nuclear activities remained divided on the issue, split between those who support the reinstatement of sanctions, and the members who believe the sanctions should be permanently lifted, whilst questioning the legality of the meeting itself.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166660",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "LIVE: Security Council meets on Venezuela, Iran, Somalia",
      "description": "The Security Council convened earlier today for a packed agenda, adopting a resolution extending the authorisation of the African Union support mission in Somalia (AUSSOM) and hearing a briefing on Iran and the implementation of resolution 2231, which endorsed the 2015 nuclear deal known as the Joint Comprehensive Plan of Action (JCPOA). Members are set to reconvene at 3 pm for an emergency meeting requested by Venezuela, amid heightened tensions between Caracas and Washington. Assistant Secretary-General for Political Affairs Khaled Khiari is expected to brief ambassadors. Follow live below and UN News app users can click here.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166656",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Israeli diaspora minister says Australia should have seen 'writing on the wall' before terror attack",
      "description": "Israel’s Amichai Chikli said Australian officials overlooked rising antisemitism and extremist rhetoric ahead of the Bondi Beach Hanukkah attack, criticizing the focus on gun laws.",
      "url": "https://www.foxnews.com/world/israeli-diaspora-minister-australia-writing-wall-terror-attack",
      "published": "Sun, 21 Dec 2025 15:20:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Libyan army chief killed in plane crash near Turkiye’s capital, Ankara",
      "description": "Libya's PM confirms that four other Libyan passengers also died after the plane crashed shortly after takeoff.",
      "url": "https://www.aljazeera.com/news/2025/12/23/signal-lost-with-jet-carrying-libyan-army-chief-over-ankara-turkiye-says?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 19:28:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "How Germany's Deutsche Bahn aims to fix chronic delays",
      "description": "German trains used to run like clockwork. Today, delays are the rule, not the exception. As public anger is boiling over, what went wrong with a system once envied worldwide, and why are the Swiss getting it right?",
      "url": "https://www.dw.com/en/how-germany-s-deutsche-bahn-aims-to-fix-chronic-delays/a-75206414?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 14:21:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Weekend attacks in Ukraine bring more casualties, damage infrastructure",
      "description": "Hostilities in Ukraine this weekend resulted in more civilian casualties and widespread damage to critical infrastructure, the UN Office for the Coordination of Humanitarian Affairs (OCHA) reported on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166652",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Calming the mind and promoting global peace on World Meditation Day",
      "description": "Meditation, which has its roots in religious, yogic and secular traditions from various civilisations, calls for living in the present moment.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166641",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Nonstop laughing for 20 minutes: Japan’s ritual for good fortune",
      "description": "Every winter in Osaka, thousands gather at a temple to laugh—nonstop—for 20 minutes. Known as \"Owarai Shinji\", this rare ritual draws on ancient Japanese mythology, where laughter once brought the sun back to the world. More than humor, they see it as a disciplined act of unity, hope, and renewal.",
      "url": "https://www.france24.com/en/video/20251223-nonstop-laughing-for-20-minutes-japan-s-ritual-for-good-fortune",
      "published": "Tue, 23 Dec 2025 15:27:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Australia news live: Tony Burke defends decision not to call royal commission into Bondi attack; Australia records highest number of road deaths since 2010",
      "description": "Home affairs minister says royal commissions ‘always ask for extensions’ and Dennis Richardson will urgently lead review of intelligence agencies instead Get our breaking news email , free app or daily news podcast Sabra Lane signs off as host of AM after eight years The ABC journalist Sabra Lane has signed off as the host of flagship radio current affairs program AM after more than eight years in the role. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2025/dec/24/nsw-gun-and-protest-laws-bondi-terror-attack-hate-crime-database-anthony-albanese-sussan-ley-chris-minns-labor-coalition-ntwnfb",
      "published": "Tue, 23 Dec 2025 21:53:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "UK police arrest Greta Thunberg under Terrorism Act",
      "description": "British police have arrested climate activist Greta Thunberg during a pro-Palestinian protest in central London. The detention, under terrorism legislation, was linked to a placard referencing a banned group.",
      "url": "https://www.dw.com/en/uk-police-arrest-greta-thunberg-under-terrorism-act/a-75286097?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 14:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Ukraine updates: Deadly Russian air attacks force power cuts",
      "description": "The drone and missile attacks on 13 regions across Ukraine have killed at least three people, including a child, Ukraine's President Volodymyr Zelenskyy said. DW has more.",
      "url": "https://www.dw.com/en/ukraine-updates-deadly-russian-air-attacks-force-power-cuts/live-75281718?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 10:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Palestinian farmers in West Bank face rising Israeli settler attacks",
      "description": "Israeli settler attacks on Palestinian homes, businesses and farmland are on the rise across the West Bank. The Observers team spoke with a Palestinian olive farmer whose land is frequently targeted, and an Israeli activist who helps protect West Bank farmers from settler violence.",
      "url": "https://www.france24.com/en/tv-shows/the-observers/20251223-west-bank-palestinian-farmers-rising-israeli-settler-attacks",
      "published": "Tue, 23 Dec 2025 16:03:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Russia launches major deadly missile and drone attack on Ukraine",
      "description": "Russia launched a major overnight missile and drone attack on Ukraine that killed at least three people - including a four-year-old child.",
      "url": "https://news.sky.com/story/russia-launches-major-deadly-missile-and-drone-attack-on-ukraine-13486997",
      "published": "Tue, 23 Dec 2025 11:12:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Sudan war: Kordofan’s El-Obeid ‘one or two steps’ away from being attacked",
      "description": "As fighting escalates in Sudan, “people are scared, people are fleeing their homes”, the UN migration agency, IOM, said on Friday, noting that more than 50,000 people have been uprooted since late October in the Kordofans region alone.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166633",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Walz under fire as Minnesota mayors sound alarm on 'financial disaster' ahead and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/walz-under-fire-mayors-sound-alarm-more-top-headlines",
      "published": "Tue, 23 Dec 2025 06:51:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Manhunt underway for suspect accused of killing two people outside Chipotle restaurant",
      "description": "Davinci Leonard manhunt: U.S. Marshals offer $7,500 reward for suspect accused of killing two people in March shooting outside Brockton, Massachusetts Chipotle.",
      "url": "https://www.foxnews.com/us/manhunt-underway-suspect-accused-killing-two-people-chipotle-restaurant",
      "published": "Mon, 22 Dec 2025 16:32:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Bolsonaro supporters ‘cancel’ Havaianas flip-flop brand over television ad",
      "description": "Son of jailed former Brazilian president says spokesperson for ‘national symbol’ sandals is ‘openly left wing’ Leaderless since its figurehead was jailed for attempting a coup , Brazil’s far right has found a new nemesis: the flip-flop brand Havaianas, which has been “cancelled” by Jair Bolsonaro ’s supporters over a television advert. The controversy stems from the actor Fernanda Torres – the star of I’m Still Here , the Brazilian film that won an Oscar for best international feature – saying in the ad that she hoped audiences would not start 2026 “on the right foot”, but “with both feet”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/brazil-jair-bolsonaro-eduardo-havaianas-television-ad-fernanda-torres",
      "published": "Tue, 23 Dec 2025 14:02:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Severe flooding hits towns in south of France",
      "description": "Heavy rainfall near the southern French city of Montpellier has unleashed widespread flooding, which local officials say could be the worst they have seen in 30 years.",
      "url": "https://www.dw.com/en/severe-flooding-hits-towns-in-south-of-france/a-75289081?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 16:16:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Multiple fatalities reported as Mexican Navy plane crashes off Texas coast, recovery effort underway",
      "description": "Mexican Navy plane reportedly crashes near Galveston Causeway during medical mission, resulting in multiple fatalities as search and recovery efforts continue.",
      "url": "https://www.foxnews.com/us/multiple-fatalities-reported-mexican-navy-plane-crashes-texas-coast-recovery-effort",
      "published": "Mon, 22 Dec 2025 20:17:08 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "India's jobs guarantee scheme: A global model under threat?",
      "description": "India’s rural jobs guarantee, a global model, faces controversy as a new law reshapes the original scheme.",
      "url": "https://www.bbc.com/news/articles/c1lr980vvjpo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 23:33:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Cambodia’s economy squeezed by Thai conflict",
      "description": "Conflict with Thailand is hitting Cambodia’s economy. The country depends heavily on Thailand for trade, tourism and",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/23/cambodias-economy-squeezed-by-thai-conflict?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 19:23:39 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Katie Allen, former federal Liberal MP, dies aged 59",
      "description": "The family of the specialist doctor and former member for the Victorian seat of Higgins announced her death on Tuesday Follow our Australia news live blog for latest updates Former federal Liberal MP Katie Allen has died aged 59, her family has announced. Allen served as the member for the former seat of Higgins in Victoria from 2019 to 2022. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/24/katie-allen-former-federal-liberal-mp-dies-aged-59",
      "published": "Tue, 23 Dec 2025 21:12:48 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Wayne Swan removes retweet about Bondi vigil after criticism from Jewish groups – as it happened",
      "description": "This blog is now closed Sydney council seeks to shut down Islamic centre linked to controversial preacher Wisam Haddad Get our breaking news email , free app or daily news podcast Shareholders have overwhelmingly thrown their support behind a deal to create an Australian media giant spanning television, radio, print and digital, Australian Associated Press reports. Shareholders in the company that owns Seven Network and the West Australian yesterday approved its merger with the group that owns Triple M and the Hit Network radio stations. The combination of these two great companies will bring together the best content creators in the country and deliver significant financial and strategic benefits. This is an opportunity to create a national, diversified media organisation with extensive scale and reach across free-to-air television, streaming, audio and digital publishing assets. There will be a public version of the report. I mean, there will be elements of it which necessarily deal with classified information and it’s, by definition, important that remains classified. But we’ve made clear there’ll be transparency in respect of this. Dennis Richardson is a person with enormous experience, first-hand experience, in terms of being secretaries of departments, but also these intelligence agencies. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2025/dec/23/bondi-terror-attacks-response-nsw-law-changes-gun-law-reform-protest-restrictions-chris-minns-anthony-albanese-labr-sussan-ley-coalition-ntwnfb",
      "published": "Tue, 23 Dec 2025 07:26:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Trump's plans for warship fleet. And, deported Venezuelans must receive due process",
      "description": "President Trump has announced the Navy will begin building a new fleet of warships. And, a federal judge has ruled the deportations of more than 100 Venezuelan men to El Salvador were illegal.",
      "url": "https://www.npr.org/2025/12/23/g-s1-103442/up-first-newsletter-caribbean-oil-tankers-venezuelan-due-process-heritage-due-process",
      "published": "Tue, 23 Dec 2025 07:32:09 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "What interest do China and Russia have in Venezuela?",
      "description": "US president Donald Trump continues to ratchet up pressure on Venezuela. There is also a geopolitical element to the conflict. What interests do China and Russia have in the country?",
      "url": "https://www.dw.com/en/what-interest-do-china-and-russia-have-in-venezuela/a-75290223?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 19:12:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Saudi Arabia awards Pakistan's powerful army chief highest national honor after defense pact",
      "description": "Pakistan's military says Saudi Arabia has awarded its highest national honor to Pakistan’s powerful army chief, Field Marshal Asim Munir, during his visit to Riyadh, underscoring deepening ties between the two countries, including cooperation on defens...",
      "url": "https://abcnews.go.com/International/wireStory/saudi-arabia-awards-pakistans-powerful-army-chief-highest-128613025",
      "published": "Mon, 22 Dec 2025 04:33:52 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Cyberattack disrupts France's postal service and banking during Christmas rush",
      "description": "A suspected cyberattack has knocked France’s national postal service and its banking arm offline during the busy Christmas season",
      "url": "https://abcnews.go.com/International/wireStory/cyberattack-disrupts-frances-postal-service-banking-christmas-rush-128616353",
      "published": "Mon, 22 Dec 2025 08:39:40 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza aid restrictions, Syria humanitarian needs, lawyer reprisals in Burundi",
      "description": "The UN and partners continue to provide assistance to people in Gaza, where recent winter storms have worsened conditions for thousands across the enclave.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166663",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Army veteran accused in Beanie Babies founder mansion break-in claimed pop star controlled him: report",
      "description": "Army veteran accused of violent break-in at billionaire's estate allegedly believed Katy Perry was controlling him during severe mental health crisis.",
      "url": "https://www.foxnews.com/us/army-veteran-accused-beanie-babies-founder-mansion-break-in-claimed-pop-star-controlled-him-report",
      "published": "Mon, 22 Dec 2025 18:28:08 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "China quietly loads 100+ ICBMs into new missile silos near Mongolia: report",
      "description": "China has reportedly loaded over 100 new intercontinental ballistic missiles into border silos, accelerating nuclear expansion faster than any other power.",
      "url": "https://www.foxnews.com/world/china-quietly-loads-100-icbms-new-missile-silos-near-mongolia-report",
      "published": "Mon, 22 Dec 2025 16:15:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Manhunt underway in South Africa after gunmen open fire at tavern, killing 9 and wounding 10",
      "description": "Manhunt underway after masked gunmen kill nine people at South African tavern in Bekkersdal township. At least 10 others hospitalized in the attack.",
      "url": "https://www.foxnews.com/world/manhunt-underway-south-africa-after-gunmen-open-fire-tavern-killing-wounding",
      "published": "Sun, 21 Dec 2025 09:54:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Libya's army chief killed in air crash in Turkey",
      "description": "Signal was earlier lost with a jet that took off from Ankara with Gen Mohammed Ali Ahmed al-Haddad and four others on board.",
      "url": "https://www.bbc.com/news/articles/cyvgzyepdqno?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 21:33:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Israel extends order allowing closure of foreign broadcasters",
      "description": "A bill passed by parliament expands temporary powers introduced during the Gaza war to shutter outlets seen as a security threat.",
      "url": "https://www.bbc.com/news/articles/c2k47wg2j90o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 11:55:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Mexican plane carrying burn victims crashes in Texas",
      "description": "Several people were killed when a Mexican navy plane, flying a medical mission, went down on approach to Galveston in the southern US.",
      "url": "https://www.dw.com/en/mexican-plane-carrying-burn-victims-crashes-in-texas/a-75278307?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 07:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Ecuadorian soldiers jailed over disappearance of four murdered boys - whose deaths sparked protests",
      "description": "Eleven soldiers have been jailed for more than 34 years over the disappearance of four murdered boys in Ecuador.",
      "url": "https://news.sky.com/story/ecuador-soldiers-jailed-for-34-years-over-disappearance-of-four-murdered-boys-13486836",
      "published": "Mon, 22 Dec 2025 19:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand and Cambodia to resume ceasefire talks after deadly border clashes",
      "description": "Thailand’s foreign minister says Thailand and Cambodia will resume talks to work toward a more durable ceasefire along their border",
      "url": "https://abcnews.go.com/International/wireStory/thailand-cambodia-resume-ceasefire-talks-after-deadly-border-128610230",
      "published": "Mon, 22 Dec 2025 04:09:47 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Bondi Beach shooting suspect conducted firearms training with his father, police say",
      "description": "A man accused of killing 15 people at Sydney’s Bondi Beach allegedly conducted firearms training with his father",
      "url": "https://abcnews.go.com/International/wireStory/bondi-beach-shooting-suspect-conducted-firearms-training-father-128610473",
      "published": "Mon, 22 Dec 2025 02:16:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "ICE officers injured after illegal immigrant strikes agents, rams vehicles during arrest attempt",
      "description": "ICE officers injured in violent encounter as Cuban migrant allegedly rams vehicles, strikes agents during arrest attempt in St. Paul. Two hospitalized.",
      "url": "https://www.foxnews.com/us/ice-officers-injured-illegal-immigrant-strikes-agents-rams-vehicles-arrest-attempt",
      "published": "Mon, 22 Dec 2025 18:28:55 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Several elephants killed in train crash after impact causes multiple coaches to derail",
      "description": "A high-speed passenger train struck an elephant herd in northeastern India, killing seven wild animals while all 650 passengers escape unharmed.",
      "url": "https://www.foxnews.com/world/several-elephants-killed-train-collision-impact-causes-multiple-coaches-derail",
      "published": "Sat, 20 Dec 2025 17:26:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "60 Minutes episode on brutal El Salvador prison, pulled from air by CBS, appears online",
      "description": "Segment that Bari Weiss had removed provides in-depth look at the Centro de Confinamiento del Terrorismo prison A 60 Minutes episode investigating a brutal prison in El Salvador , which CBS News’s editor-in-chief, Bari Weiss, pulled from the air on Sunday, appeared online on Monday after appearing on a Canadian TV app. The segment, which runs for nearly 14 minutes and was viewed by the Guardian, provides an in-depth look at the Centro de Confinamiento del Terrorismo (Cecot) prison in El Salvador. It opens with footage of the mega-prison and shows detainees being shackled upon arrival in El Salvador. Continue reading...",
      "url": "https://www.theguardian.com/media/2025/dec/23/60-minutes-cecot-appears-online",
      "published": "Tue, 23 Dec 2025 20:53:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "‘Is this real?’: wife of detained pastor describes anguish as China cracks down on unofficial churches",
      "description": "Church leaders and members detained as government tightens controls on underground Christian gatherings The knocks came at 2am. Hiding out at a friend’s house in a Beijing suburb, Gao Yingjia and his wife, Geng Pengpeng, rushed downstairs to meet the group of plain-clothed men who said they were police officers. Their son, nearly six, was sleeping upstairs, and Gao and Geng wanted to minimise the ruckus. They knew their time was up. Two months later, Gao is in a detention centre in Guangxi province, southern China, charged with “illegal use of information networks”. His arrest was part of the biggest crackdown on Christians in China since 2018. It has prompted alarm from the US government and human rights groups, with some analysts describing it as the death knell for unofficial churches in China. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/christians-pastors-arrested-detained-china-crackdown-house-churches",
      "published": "Tue, 23 Dec 2025 01:00:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Japan: TEPCO's nuclear restart plan sparks angst",
      "description": "Japan wants to boost nuclear power generation to slash its reliance on imported fossil fuels. The public is torn between energy needs and security risks.",
      "url": "https://www.dw.com/en/japan-tepco-s-nuclear-restart-plan-sparks-angst/a-75285419?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 13:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Settlements, hotels and farms flooded in Kenya’s Rift Valley",
      "description": "Dickson Ngome's farm at Lake Naivasha in Kenya's Rift Valley has been submerged due to rising water levels",
      "url": "https://abcnews.go.com/International/wireStory/water-settlements-hotels-farms-flooded-kenyas-rift-valley-128609598",
      "published": "Mon, 22 Dec 2025 02:13:12 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Winter aid delivery continues in Gaza",
      "description": "Despite the ceasefire in the Gaza Strip, humanitarians continue to receive reports of airstrikes, shelling and gunfire in all five governorates, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166653",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Bondi Beach suspects filmed antisemitic video manifesto, Australian investigators say",
      "description": "Father-son duo accused in Bondi Beach shooting allegedly created antisemitic manifesto with Islamic State ideology, Australian investigators reveal.",
      "url": "https://www.foxnews.com/world/bondi-beach-suspects-filmed-antisemitic-video-manifesto-australian-investigators-say",
      "published": "Mon, 22 Dec 2025 10:40:05 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "‘Miracle’ of Zealandia: chick is born to rare takahē pair thought to be infertile",
      "description": "Unexpected arrival is a boon for birdlife in New Zealand, where there are only 500 takahē left A pair of rare native New Zealand takahē birds who were believed infertile have stunned staff at the world’s largest urban eco-sanctuary, after hatching a “miracle” chick. The roughly seven-week old chick was discovered inside Zealandia, a fully fenced eco-sanctuary 10 minutes from Wellington’s city centre, in November, but its arrival has been a closely guarded secret to ensure its safety. Continue reading...",
      "url": "https://www.theguardian.com/environment/2025/dec/21/takahe-chick-rare-born-new-zealand",
      "published": "Sun, 21 Dec 2025 18:00:05 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Missing Melodee Buzzard’s body found, girl’s mother taken into custody: report",
      "description": "Mother who allegedly failed to explain missing daughter's whereabouts now in custody as officials promise major updates in the Melodee Buzzard case.",
      "url": "https://www.foxnews.com/us/missing-melodee-buzzard-body-found-girls-mother-taken-into-custody-report",
      "published": "Tue, 23 Dec 2025 14:23:17 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Brown University custodian told security suspicious man was ‘casing’ building weeks before shooting: report",
      "description": "Derek Lisi told Boston Globe he saw Brown University shooting suspect \"casing\" engineering building about 10 times since early January.",
      "url": "https://www.foxnews.com/us/brown-university-custodian-told-security-suspicious-man-was-casing-building-weeks-before-shooting-report",
      "published": "Mon, 22 Dec 2025 15:01:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Jet crash carrying Libya’s top general triggers airspace shutdown over NATO capital",
      "description": "Turkey shuts down Ankara airspace after business jet carrying Libya's top military commander crashes. Ali Ahmed Al-Haddad is feared dead.",
      "url": "https://www.foxnews.com/world/jet-crash-carrying-libyas-top-general-triggers-airspace-shutdown-over-nato-capital",
      "published": "Tue, 23 Dec 2025 16:31:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Australia vows to strengthen hate speech laws, gun control in wake of Bondi Beach attack",
      "description": "Australia proposes new hate speech laws and gun buyback program after Bondi Beach attack, sparking a heated debate over the government's response.",
      "url": "https://www.foxnews.com/world/australia-vows-strengthen-hate-speech-laws-gun-control-wake-bondi-beach-attack",
      "published": "Sun, 21 Dec 2025 08:01:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Hindutva protest at Bangladesh High Commission over lynching of Hindu man",
      "description": "Hindutva activists tried to storm the Bangladesh High Commission in New Delhi, India as they rallied against a lynching.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/23/hindutva-protest-at-bangladesh-high-commission-over-lynching-of-hindu-man?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 20:34:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Manchester Museum seeks help to uncover hidden histories of African collection",
      "description": "New Africa Hub confronts colonial-era silences by asking visitors to share insights on 40,000 objects It’s a rare thing for a museum to talk about what it doesn’t know. But unanswered questions and archival silences are at the heart of the new Africa Hub at Manchester Museum, north-west England, which is inviting people around the world to help fill the gaps. The museum holds more than 40,000 items from across Africa, many of which were traded, collected, looted or preserved during the era of the British empire. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2025/dec/21/manchester-museum-uncover-hidden-histories-africa-hub",
      "published": "Sun, 21 Dec 2025 15:00:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "‘Slightly haunted but manageable’: new signs cause confusion – and delight – in Christchurch",
      "description": "Six absurdist signs resembling official city council information boards have popped up across New Zealand’s second-largest city Outside an abandoned building in New Zealand’s second-biggest city, a sign reads “slightly haunted but manageable”. In the middle of a busy shopping strip, pedestrians are warned to keep to a 2.83km/h walking speed. In another part of Christchurch, one piece of signage declares simply “don’t”. The baffling boards are not an overzealous new council initiative, but a piece of art designed to “play with the way we take authority and signage so seriously”. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/22/new-zealand-christchurch-spoof-absurdist-road-signs",
      "published": "Mon, 22 Dec 2025 02:28:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Senegal gets its AFCON 2025 campaign started with victory over Botswana",
      "description": "A Nicolas Jackson double has helped Senegal get its Africa Cup of Nations campaign off to a winning start, defeating Botswana 3-0 in Tangier. Senegal, the winner of the AFCON 2021, was the hot favourite going into the match against a team ranked 138th in the world.",
      "url": "https://www.france24.com/en/sport/20251223-senegal-gets-its-afcon-2025-campaign-started-with-victory-over-botswana",
      "published": "Tue, 23 Dec 2025 18:52:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Louvre installs metal bars over infamous gallery window after $102M jewel heist",
      "description": "The Louvre Museum has installed a large metal grille over the windows of the gallery from which thieves stole jewellery worth an estimated $102 million. The bars are the latest measure put in place in recent month as the security standards at the world's most visited museum are facing intense scrutiny following the October heist.",
      "url": "https://www.france24.com/en/france/20251223-louvre-installs-metal-bars-over-infamous-gallery-window-after-102m-jewel-heist",
      "published": "Tue, 23 Dec 2025 14:57:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Car hits people waiting to watch a parade in a Dutch town, injuring 9",
      "description": "Police in the Netherlands say a car has driven into a crowd waiting to watch a parade in an eastern town and injured nine people",
      "url": "https://abcnews.go.com/International/wireStory/car-hits-people-waiting-watch-parade-dutch-town-128629470",
      "published": "Mon, 22 Dec 2025 17:06:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza: Access to food improves but living conditions remain dire",
      "description": "A pregnant woman in Gaza thought she might lose her child because of malnourishment. Ten days ago, she gave birth and is now in recovery thanks to World Food Programme (WFP) facilities that are back up and running again, the agency’s representative for Palestine said on Thursday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166632",
      "published": "Thu, 18 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Greta Thunberg arrested supporting Palestinian prisoners on hunger strike during London protest",
      "description": "Greta Thunberg was arrested and later released on bail after supporting pro-Palestinian activists protesting detentions and a hunger strike in London.",
      "url": "https://www.foxnews.com/world/greta-thunberg-arrested-supporting-palestinian-prisoners-hunger-strike-london-protest",
      "published": "Tue, 23 Dec 2025 15:35:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "UN experts urge Iran to stop execution of woman activist",
      "description": "Zahra Tabari, 67, was sentenced to death after a trial that lasted less than 10 minutes, her family says.",
      "url": "https://www.bbc.com/news/articles/cwyxz5jken3o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 22:11:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'A miracle': Officer shot in head during Bondi attack home from hospital",
      "description": "The Christmas homecoming of Jack Hibbert, who was shot in the head and shoulder, is a \"miracle\", his family say.",
      "url": "https://www.bbc.com/news/articles/cd0kxrr2jyko?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 06:06:34 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Thousands fleeing DR Congo violence face 'dire conditions' in Burundi - aid agencies",
      "description": "Those particularly affected are children and pregnant women - some going without food for days.",
      "url": "https://www.bbc.com/news/articles/cjdr4vx4n8ro?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 12:21:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Baby followed by BBC back in Gaza hospital after treatment abroad",
      "description": "The BBC revisits one-year-old Siwar Ashour who was temporarily evacuated to Jordan for medical treatment during the Gaza war.",
      "url": "https://www.bbc.com/news/articles/c2084n1pyvdo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 19:38:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Is Israel’s government waging war on Al Jazeera and the media?",
      "description": "Critics say Israel's media laws aim to silence dissenting voices, undermining democracy and free speech.",
      "url": "https://www.aljazeera.com/news/2025/12/23/is-israels-government-waging-war-on-al-jazeera-and-the-media?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 18:25:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Jackson scores two goals as Senegal defeat Botswana at AFCON",
      "description": "Two goals in 18 minutes from forward Nicolas Jackson set the tone for Senegal's Group D win over Botswana at AFCON 2025.",
      "url": "https://www.aljazeera.com/sports/2025/12/23/jackson-scores-two-goals-as-senegal-defeat-botswana-at-afcon?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 18:00:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia and China pledge support for Venezuela as Trump ratchets up pressure on Maduro",
      "description": "Trump again called for Venezuela’s president to leave power and said the US would keep or sell the oil it had seized China and Russia have expressed support for Venezuela as it confronts a US blockade of sanctioned oil tankers, while Donald Trump continues to ramp up his pressure campaign on the South American country’s president, Nicolás Maduro. Amid reports of slowing activity at Venezuelan ports, the US president again called for Maduro to leave power, and reiterated that the US would keep or sell the oil it had seized off the coast of Venezuela in recent weeks. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/russia-china-support-venezuela-trump-pressure-maduro",
      "published": "Tue, 23 Dec 2025 02:52:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "In Israel, some Jews and Christians seek to build trust between their communities",
      "description": "Despite tensions between the Vatican and Israel's government over the Gaza war, some Jews and Christians living in Israel are trying to build trust between their communities.",
      "url": "https://www.npr.org/2025/12/23/nx-s1-5613384/some-jews-and-christians-in-israel-seek-to-build-trust-between-their-communities",
      "published": "Tue, 23 Dec 2025 17:00:02 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Peace talks to end the war in Ukraine continue in Florida",
      "description": "The latest on the negotiations to end Russia's war on Ukraine, as talks with representatives from Moscow, Kyiv and the Trump administration continue in Miami this week.",
      "url": "https://www.npr.org/2025/12/22/nx-s1-5649499/peace-talks-to-end-the-war-in-ukraine-continue-in-florida",
      "published": "Mon, 22 Dec 2025 04:45:16 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Germany resumes deportations to Syria for first time since 2011",
      "description": "Germany has deported a convicted criminal to Syria for the first time since the civil war began. The move comes after a new arrangement with Damascus to allow regular removals of offenders and security risks.",
      "url": "https://www.dw.com/en/germany-resumes-deportations-to-syria-for-first-time-since-2011/a-75287833?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 15:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump unveils new class of warship named after himself",
      "description": "The president said the new \"Trump class\" Navy vessels will be the largest in the history of the US. Trump wants to boost American shipbuilding as China expands its maritime fleet.",
      "url": "https://www.dw.com/en/trump-unveils-new-class-of-warship-named-after-himself/a-75276773?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 22 Dec 2025 23:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Sudan's prime minister takes his peace plan to the UN",
      "description": "In tonight's edition, Sudan's prime minister urged members of the United Nations Security Council to stand “on the right side of history\" as he laid out his plan to end the war in Sudan. Also, voters gear up to head to the polls in the Central African Republic for historic elections. And in Kenya, Christmas is a season rooted in faith, family, and food.",
      "url": "https://www.france24.com/en/tv-shows/eye-on-africa/20251223-sudan-s-prime-minister-takes-his-peace-plan-to-the-un",
      "published": "Tue, 23 Dec 2025 21:17:29 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "French lawmakers pass emergency budget bill to avert government shutdown",
      "description": "The French parliament has passed an emergency bill to keep the government running into 2026 until it can agree on a budget. Prime Minister Sébastien Lecornu's minority government has little room for manoeuvre, with budget battles already toppling three governments since President Emmanuel Macron lost his majority in a 2024 snap ‍election.",
      "url": "https://www.france24.com/en/live-news/20251223-french-national-assembly-passes-emergency-budget-bill-to-avert-government-shutdown",
      "published": "Tue, 23 Dec 2025 16:10:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "France: Government urges emergency legislation to avoid shutdown",
      "description": "Olivia Bizot has more.",
      "url": "https://www.france24.com/en/video/20251223-france-governement-urges-emergency-legislation-to-avoid-shutdown",
      "published": "Tue, 23 Dec 2025 15:12:09 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yemen’s sides agree to release 2,900 detainees in war's largest exchange",
      "description": "Yemen’s government and the Iran-backed Houthi rebels have agreed to release 2,900 detainees from the 11-year civil war",
      "url": "https://abcnews.go.com/International/wireStory/yemens-sides-agree-release-2900-detainees-wars-largest-128644604",
      "published": "Tue, 23 Dec 2025 09:37:46 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Starlink in the crosshairs: How Russia could attack Elon Musk's conquering of space",
      "description": "NATO-nation intelligence services believe Russia is developing a weapon to target Starlink satellites",
      "url": "https://abcnews.go.com/International/wireStory/starlink-crosshairs-russia-attack-elon-musks-conquering-space-128612017",
      "published": "Mon, 22 Dec 2025 02:40:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brown University students shaken as relief, anger collide after suspected shooter's death",
      "description": "Brown University community mourns the loss of Mukhammad Aziz Umurzokov and Ella Cook. Students recall the harrowing moments and share memories of those who died.",
      "url": "https://www.foxnews.com/us/brown-university-students-react-shooter-being-found",
      "published": "Tue, 23 Dec 2025 15:25:07 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Manhunt underway for 3 'dangerous' inmates who broke out of Georgia jail",
      "description": "Three dangerous inmates escaped from DeKalb County Jail near Atlanta Monday. Authorities warn residents to avoid approaching the possibly armed fugitives.",
      "url": "https://www.foxnews.com/us/manhunt-underway-3-dangerous-inmates-who-broke-out-georgia-jail",
      "published": "Mon, 22 Dec 2025 18:20:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brown University hires former US Attorney Zachary Cunha as possible campus shooting lawsuits loom",
      "description": "Brown University has retained former U.S. Attorney Zachary Cunha to coordinate with authorities as it faces potential legal action following the Dec. 13 campus shooting.",
      "url": "https://www.foxnews.com/us/brown-university-hires-former-us-attorney-zachary-cunha-possible-campus-shooting-lawsuits-loom",
      "published": "Mon, 22 Dec 2025 15:37:38 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Divided between two states, the town at the heart of America's abortion debate",
      "description": "The only abortion clinic in town is fighting an eviction notice and other efforts to shut it down.",
      "url": "https://www.bbc.com/news/articles/c93nwrzgypqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 00:07:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Call of Duty co-creator Vince Zampella dies in LA car crash",
      "description": "Influential game developer Vince Zampella, one of the creative minds behind the popular Call of Duty franchise, died after the Ferrari he was driving reportedly crashed into a concrete barrier in northern Los Angeles.",
      "url": "https://www.dw.com/en/call-of-duty-co-creator-vince-zampella-dies-in-la-car-crash/a-75277766?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 05:58:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Oklahoma teaching assistant fired after uproar over flunking Christian student who referenced Bible in essay",
      "description": "University of Oklahoma fires teaching assistant who gave student zero for citing Bible in paper, sparking viral debate over religious freedom.",
      "url": "https://www.foxnews.com/us/oklahoma-teaching-assistant-fired-after-uproar-over-flunking-christian-student-who-referenced-bible-essay",
      "published": "Tue, 23 Dec 2025 09:49:59 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Russia says Ukraine peace talks 'proceeding constructively,' as Kremlin launches deadly strike on Odesa",
      "description": "Peace talks between Russia and Ukraine reportedly proceed \"constructively\" in Florida even as deadly missile strike hits Odesa, killing eight people.",
      "url": "https://www.foxnews.com/world/russia-says-ukraine-peace-talks-proceeding-constructively-kremlin-launches-deadly-strike-odesa",
      "published": "Sun, 21 Dec 2025 07:08:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Why some U.S. oil companies aren't interested in returning to Venezuela",
      "description": "The Trump administration says it wants U.S. oil companies to return to Venezuela, but some don't desire to re-invest. Why would oil companies be against returning to a country with large oil reserves?",
      "url": "https://www.npr.org/2025/12/23/nx-s1-5649545/why-some-u-s-oil-companies-arent-interested-in-returning-to-venezuela",
      "published": "Tue, 23 Dec 2025 16:55:34 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Coast Guard pursues oil tanker Trump administration says evaded Venezuela blockade",
      "description": "The Trump administration continued its pressure campaign against Venezuela's president over the weekend, enforcing a blockade of sanctioned oil tankers traveling to and from the country.",
      "url": "https://www.npr.org/2025/12/22/nx-s1-5651313/coast-guard-pursues-oil-tanker-trump-administration-says-evaded-venezuela-blockade",
      "published": "Mon, 22 Dec 2025 06:50:16 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland PM 'sad' over Trump push for US control of island",
      "description": "Jens-Frederik Nielsen's remarks come after Donald Trump repeated his desire to have US control over Greenland. Trump argues that the territory, which is part of the Danish Kingdom, is essential to US national security.",
      "url": "https://www.dw.com/en/greenland-pm-sad-over-trump-push-for-us-control-of-island/a-75289082?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 18:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump: US has to have Greenland",
      "description": "Donald Trump has said the US \"has to have\" Greenland, claiming it needs the territory for national security.",
      "url": "https://news.sky.com/story/trump-us-has-to-have-greenland-13486627",
      "published": "Mon, 22 Dec 2025 10:31:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council hears of fading election prospects in Libya",
      "description": "The path to long-awaited elections in Libya is paved with complications but they can be overcome, the UN Special Representative for the country said on Friday in a briefing to the Security Council.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166646",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Security Council renews DR Congo peacekeeping mission amid renewed M23 offensives in the east",
      "description": "The UN Security Council on Friday unanimously extended the mandate of the UN peacekeeping mission in the Democratic Republic of the Congo (DRC) for another year, as fighting in the country’s east intensified amid renewed offensives by the M23 rebel group.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166643",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Major university cuts ties with US-sanctioned UN expert on Palestinian issues, watchdog says",
      "description": "Georgetown University reportedly cut ties with U.N. expert Francesca Albanese, who was sanctioned by the Trump administration in July 2025.",
      "url": "https://www.foxnews.com/us/major-university-cuts-ties-us-sanctioned-un-expert-palestinian-issues-watchdog-says",
      "published": "Tue, 23 Dec 2025 14:30:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Five dead after plane carrying child burns victim crashes in Texas",
      "description": "The Mexican Navy plane was transporting a child to the US on behalf of a charity which cares for burns victims.",
      "url": "https://www.bbc.com/news/articles/c1lr1yvqge5o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 08:58:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Pirate motorcyclists cruise Caracas to protest Trump",
      "description": "Motorcyclists dressed as pirates cruised Caracas to protest US President Donald Trump's Venezuelan oil tanker seizures.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/23/pirate-motorcyclists-cruise-caracas-to-protest-trump?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 16:42:12 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "China hits EU dairy industry with tariffs of up to 42.7%",
      "description": "Move made after first phase of anti-subsidy investigation widely seen as retaliation for bloc’s EV tariffs China will impose provisional duties of up to 42.7% on certain dairy products imported from the EU from Tuesday after concluding the first phase of an anti-subsidy investigation widely seen as retaliation for the bloc’s electric vehicle tariffs . The tariffs will range from 21.9% to 42.7% – although most companies will pay about 30% – and target products such as milk and cheese, including protected origin brands such as French roquefort and Italian gorgonzola. Continue reading...",
      "url": "https://www.theguardian.com/business/2025/dec/22/china-hits-eu-dairy-industry-with-tariffs",
      "published": "Mon, 22 Dec 2025 13:49:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Libya's military chief dies in plane crash in Turkey",
      "description": "Libya's military chief was returning home after attending meetings in Turkey. Four other people were on board.",
      "url": "https://www.dw.com/en/libya-s-military-chief-dies-in-plane-crash-in-turkey/a-75290406?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 20:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "AFCON: Lookman strike gives Nigeria winning start against Tanzania",
      "description": "Nigeria began their Africa Cup of Nations Group C campaign with three points on Tuesday as Ademola Lookman’s long-range effort settled a rain-soaked contest against Tanzania in Fes, easing the Super Eagles past stubborn opposition despite missed chances and a brief second-half scare.",
      "url": "https://www.france24.com/en/sport/20251223-afcon-lookman-strike-gives-nigeria-winning-start-against-tanzania",
      "published": "Tue, 23 Dec 2025 22:17:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Libyan army chief of staff found dead in plane wreckage, PM says",
      "description": "Libyan military chief Muhammad Ali Ahmad al Haddad and four others died in a plane crash in Turkey on Tuesday evening, Prime Minister Abdulhamid Dbeibah has confirmed. Turkey's air traffic controllers lost contact with a jet carrying the Libyan delegation that was heading home after a visit to Ankara, the Turkish interior minister said.",
      "url": "https://www.france24.com/en/africa/20251223-libyan-army-chief-of-staff-found-dead-in-plain-wreckage-pm-says",
      "published": "Tue, 23 Dec 2025 20:39:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Bus crash in Indonesia kills at least 15 people, official says",
      "description": "A bus carrying 34 people lost control on a toll road, struck a concrete barrier,",
      "url": "https://abcnews.go.com/International/wireStory/passenger-bus-crash-indonesia-kills-15-people-official-128608466",
      "published": "Sun, 21 Dec 2025 22:08:19 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine strikes oil terminal, planes and ships in an array of strikes inside Russia",
      "description": "Ukrainian forces say they have hit an oil terminal, a pipeline, two parked jet fighters, and two ships in a series of strikes on Russian soil",
      "url": "https://abcnews.go.com/International/wireStory/ukraine-strikes-oil-terminal-planes-ships-array-strikes-128619562",
      "published": "Mon, 22 Dec 2025 10:39:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Greta Thunberg arrested in London while supporting hunger-striking pro-Palestinian activists",
      "description": "Greta Thunberg has been arrested in central London while supporting pro-Palestinian activists on a hunger strike",
      "url": "https://abcnews.go.com/International/wireStory/greta-thunberg-arrested-london-supporting-hunger-striking-pro-128645184",
      "published": "Tue, 23 Dec 2025 09:29:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "South Sudan: UN condemns killing of staff member in Wau, calls for swift investigation",
      "description": "The United Nations on Friday condemned the killing of a civilian staff member serving with its peacekeeping mission in South Sudan (UNMISS), calling on the authorities to swiftly bring those responsible to justice.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166640",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Gaza famine pushed back, but millions still face hunger and malnutrition, UN says",
      "description": "Food security in Gaza has improved since the ceasefire declared in October, pushing back famine conditions, but the situation remains critical with more than three-quarters of the population still facing acute hunger and malnutrition, a new UN-backed analysis has found.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166638",
      "published": "Fri, 19 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ohio kids as young as 8 steal car, lead police on chase crash into home, worried about Santa, presents: police",
      "description": "An 11-year-old driving a stolen car led Ohio police on a chase that ended with a crash, with the suspects telling officers they learned to steal cars from YouTube.",
      "url": "https://www.foxnews.com/us/ohio-kids-young-8-steal-car-lead-police-chase-crash-home-worried-about-santa-presents-police",
      "published": "Mon, 22 Dec 2025 16:56:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Israeli hostages freed, Iran hit, ceasefire held — 2025 shattered idea that US was exiting the Middle East",
      "description": "Analysis reveals how American force, not retreat, reshaped the Middle East in 2025, from Gaza ceasefire to Iran's weakened position across the region.",
      "url": "https://www.foxnews.com/world/israeli-hostages-freed-iran-hit-ceasefire-held-2025-shattered-idea-us-exiting-middle-east",
      "published": "Tue, 23 Dec 2025 12:00:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Sahel states summit attracts unexpected visitors: young people.",
      "description": "The political and economic Sahel Summit is attracting an unusual group of attendees. Young people.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/23/sahel-states-summit-attracts-unexpected-visitors-young-people?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 17:53:55 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Another 130 kidnapped schoolchildren released in Nigeria",
      "description": "Presidential spokesperson says all those abducted from a Catholic school in Niger state last month are now free Nigerian authorities say they have secured the release of a further 130 schoolchildren kidnapped from a Catholic school in November, after 100 were freed earlier this month . “Another 130 abducted Niger state pupils released, none left in captivity,” presidential spokesperson Sunday Dare said on X, in a post accompanied by a photo of smiling children. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/21/more-kidnapped-schoolchildren-freed-in-nigeria",
      "published": "Sun, 21 Dec 2025 20:05:09 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "More than 400 influential women urge Iran to halt execution of female activist",
      "description": "Four Nobel laureates and several former heads of state are among the more than 400 prominent women who have signed a letter demanding the immediate release of Zahra Tabari, an Iranian engineer facing execution. The letter, organised by a London-based association, stated that Tabari faced \"execution solely for holding a banner bearing the words 'Woman, Resistance, Freedom'\".",
      "url": "https://www.france24.com/en/asia-pacific/20251223-more-than-400-influential-women-urge-iran-to-halt-execution-of-female-activist",
      "published": "Tue, 23 Dec 2025 15:56:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Bureaucratic mishap delayed gun license for accused Bondi Beach shooter in Australia",
      "description": "An Australian state leader says a man accused of killing 15 people at Sydney’s Bondi Beach faced a lengthy gun license delay due to bureaucracy, not suspicion",
      "url": "https://abcnews.go.com/International/wireStory/bureaucratic-mishap-delayed-gun-license-accused-bondi-beach-128641695",
      "published": "Tue, 23 Dec 2025 03:45:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "DR Congo: Displaced people in South Kivu close to ‘utter desperation’, WFP says",
      "description": "An estimated 500,000 people have been forced from their homes since fighting erupted in South Kivu province, Democratic Republic of Congo (DRC), at the beginning of December.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166657",
      "published": "Tue, 23 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Japan's former emperor turns 92 as heart condition stabilizes after health concerns",
      "description": "Japan’s beloved former Emperor Akihito is marking his 92nd birthday as his heart condition stabilizes, palace officials say, following health concerns earlier this year",
      "url": "https://abcnews.go.com/International/wireStory/japans-former-emperor-turns-92-heart-condition-stabilizes-128641423",
      "published": "Tue, 23 Dec 2025 04:14:51 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Billionaire trustees stay silent as Brown University faces mounting campus murder fallout",
      "description": "Brown University's powerful board of trustees, including Bank of America CEO, remains silent after campus murders. Boston Globe reports security failures.",
      "url": "https://www.foxnews.com/us/billionaire-trustees-stay-silent-brown-university-faces-mounting-campus-murder-fallout",
      "published": "Tue, 23 Dec 2025 06:00:32 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Cities across Europe revise Christmas traditions, triggering public backlash",
      "description": "Brussels faces backlash over modern nativity scene as European cities rethink Christmas traditions amid cultural debates. U.K. museum suggests Santa is \"too white.\"",
      "url": "https://www.foxnews.com/world/cities-across-europe-revise-christmas-traditions-triggering-public-backlash",
      "published": "Tue, 23 Dec 2025 10:35:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Israel calls out UN-backed Gaza famine report as biased, ignores aid flow and on-the-ground data",
      "description": "Israeli officials slam 'biased' U.N. food security report on Gaza, citing increased aid deliveries. Analysis reveals disputed famine claims lack evidence.",
      "url": "https://www.foxnews.com/world/israel-calls-out-un-backed-gaza-famine-report-biased-ignores-aid-flow-on-the-ground-data",
      "published": "Mon, 22 Dec 2025 14:35:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine loses embattled eastern town",
      "description": "The capture of Siversk brings Russia closer to the last remaining \"fortress belt\" cities still in Ukrainian hands in the Donetsk region.",
      "url": "https://www.bbc.com/news/articles/cr4d99p63y4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 18:53:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump unveils plans for 'Golden Fleet' battleships named after himself",
      "description": "The US president has vowed to revive American shipbuilding after lagging behind China in naval capacity.",
      "url": "https://www.bbc.com/news/articles/c2084nq2npjo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 00:36:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Trump travelled on Epstein's plane more than previously thought, prosecutor says",
      "description": "The US president has long denied any wrongdoing in relation to late convicted sex offender Jeffrey Epstein.",
      "url": "https://www.bbc.com/news/articles/c74xgp81pqgo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 21:56:51 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US economy grows at fastest pace in two years",
      "description": "Strong consumer spending helps the US economy grow at a faster rate than expected.",
      "url": "https://www.bbc.com/news/articles/c62n9ynzrdpo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 15:56:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump says US will keep or sell oil seized from Venezuela",
      "description": "The US president also says the US intends to keep the tankers it has intercepted off the coast of Venezuela.",
      "url": "https://www.bbc.com/news/articles/c87lnn09yj8o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 09:51:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Gunmen abduct 28 Muslim travellers in central Nigeria",
      "description": "The victims, including women and children, were ambushed on their way to a religious festival.",
      "url": "https://www.bbc.com/news/articles/czj0ll7ppewo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 14:10:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What Friday's underwhelming Epstein files release means for Trump and Maga",
      "description": "Conservative influencers were conspicuously silent following the latest release - but political danger remains for the president.",
      "url": "https://www.bbc.com/news/articles/cy95w0x9889o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 00:24:25 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The showers and baths keeping data centre tech cool",
      "description": "Finding greener ways to keep giant new data centres cool is a challenge.",
      "url": "https://www.bbc.com/news/articles/cp8zd176516o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 23 Dec 2025 00:04:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ros Atkins on… the oil tanker being pursued by the US",
      "description": "The BBC’s Analysis Editor Ros Atkins looks at what we know about the \"active pursuit\" of an oil tanker by the US Coast Guard off the coast of Venezuela.",
      "url": "https://www.bbc.com/news/videos/ce3w4x2v0xko?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 21:27:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's appointment of Greenland envoy sparks fresh row with Denmark",
      "description": "The BBC's diplomatic correspondent James Landale explains how Trump's appoinment of a special envoy to Greenland has shaken diplomatic with Denmark.",
      "url": "https://www.bbc.com/news/videos/cwywe5zw384o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 22 Dec 2025 18:52:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Belgium joins South Africa’s genocide case against Israel at ICJ",
      "description": "Other countries, including Brazil, Colombia, Ireland, Mexico, Spain and Turkiye, have already joined case in The Hague.",
      "url": "https://www.aljazeera.com/news/2025/12/23/belgium-joins-south-africas-genocide-case-against-israel-at-icj?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 21:11:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "How will Syria deal with its growing security challenges?",
      "description": "Renewed fighting between army and SDF highlights volatility.",
      "url": "https://www.aljazeera.com/video/inside-story/2025/12/23/how-will-syria-deal-with-its-growing-security-challenges?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 20:59:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela passes law enacting harsh penalties for supporters of US blockade",
      "description": "Government of President Nicolas Maduro denounces US seizure of oil tankers as illegal acts of piracy.",
      "url": "https://www.aljazeera.com/news/2025/12/23/venezuela-passes-law-enacting-harsh-penalties-for-supporters-of-us-blockade?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 20:53:49 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump administration to resume wage garnishment for student loan defaulters",
      "description": "Borrowers to receive wage garnishment notices starting January 7, Department of Education confirms.",
      "url": "https://www.aljazeera.com/economy/2025/12/23/trump-administration-to-resume-wage-garnishment-for-student-loan-defaulters?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 20:37:31 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Wasteful Nigeria edge past Tanzania to make winning start to AFCON 2025",
      "description": "Nigeria seal a 2-1 win against a plucky Tanzania to open their Africa Cup of Nations 2025 account with a win in Fez.",
      "url": "https://www.aljazeera.com/sports/2025/12/23/nigeria-beat-tanzania-to-make-winning-start-to-afcon-2025?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 20:13:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK police say comedian Russell Brand charged with two more sex offences",
      "description": "The 50-year-old comedian is already facing similar charges, including rape and sexual assault, involving four women.",
      "url": "https://www.aljazeera.com/news/2025/12/23/uk-police-say-comedian-russell-brand-charged-with-two-more-sex-offences?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 19:56:28 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazilian Supreme Court says Bolsonaro can leave prison to undergo surgery",
      "description": "Justice Alexandre de Moraes has approved a request for the ex-president to leave prison for hernia treatment.",
      "url": "https://www.aljazeera.com/news/2025/12/23/brazilian-supreme-court-says-bolsonaro-can-leave-prison-to-undergo-surgery?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 19:24:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK police drop probe into Bob Vylan’s chants about Israeli military",
      "description": "Police say there is 'insufficient evidence' to bring charges after investigating comments made at Glastonbury festival.",
      "url": "https://www.aljazeera.com/news/2025/12/23/uk-police-drop-probe-into-bob-vylans-chants-about-israeli-military?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 18:03:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Newly released Epstein files spotlight Trump’s past jet trips with Maxwell",
      "description": "Prosecutor's email claims Trump flew on Epstein's jet eight times in the 1990s, some with Ghislaine Maxwell on board.",
      "url": "https://www.aljazeera.com/news/2025/12/23/newly-released-epstein-files-spotlight-trumps-past-jet-trips-with-maxwell?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 17:52:59 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "People sheltering at Sudan displacement camp say they ’pray for peace’",
      "description": "Every day, dozens of displaced people, mostly women and children, are arriving at a camp near Kosti, Sudan.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/23/people-sheltering-at-sudan-displacement-camp-say-they-pray-for?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 17:36:38 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israeli forces demolish shops in raids near occupied East Jerusalem",
      "description": "Commercial premises among buildings facing demolition as military incursions intensify near Qalandiya and Kafr Aqab.",
      "url": "https://www.aljazeera.com/news/2025/12/23/israeli-forces-demolish-shops-in-raids-near-occupied-east-jerusalem?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 17:16:54 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel will never fully withdraw from Gaza, defence minister says",
      "description": "Israel Katz says military units will be established inside the Palestinian enclave, in contravention of truce agreement.",
      "url": "https://www.aljazeera.com/news/2025/12/23/israel-will-never-fully-withdraw-from-gaza-defence-minister-says?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 15:57:24 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israeli Defence Minister: ‘We will never leave Gaza’",
      "description": "Israeli Defence Minister Israel Katz said the Israeli military “will never leave Gaza”.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/23/israeli-defence-minister-we-will-never-leave?traffic_source=rss",
      "published": "Tue, 23 Dec 2025 15:27:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canada bill targeting refugees feared to signal new era of US-style border policy",
      "description": "Bill C-12 includes many changes around border security along with new ineligibility rules for refugee claimants Canada’s Liberal government is pushing through sweeping new legislation targeting refugees that observers fear will usher in a new era of US-style border policies, fueling xenophobia and the scapegoating of immigrants. Bill C-12, or Strengthening Canada’s Immigration System and Borders Act, includes many changes around border security along with new ineligibility rules for refugee claimants. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/23/canada-bill-refugees",
      "published": "Tue, 23 Dec 2025 13:24:41 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.5 - 42 km NNE of Goroka, Papua New Guinea",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - VI Time 2025-12-22 10:31:28 UTC 2025-12-22 10:31:28 UTC at epicenter Location 5.720°S 145.496°E Depth 110.18 km (68.46 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us6000rwgh",
      "published": "2025-12-23T10:56:00.234Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.9 - 5 km SE of San Ramon, CA",
      "description": "PAGER - GREEN ShakeMap - IV DYFI? - V Time 2025-12-21 02:31:54 UTC 2025-12-21 02:31:54 UTC at epicenter Location 37.747°N 121.946°W Depth 10.03 km (6.23 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283691",
      "published": "2025-12-23T14:21:36.532Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 4.0 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:56:09 UTC 2025-12-20 03:56:09 UTC at epicenter Location 37.744°N 121.953°W Depth 9.63 km (5.98 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283031",
      "published": "2025-12-23T04:30:22.632Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 3.8 - 5 km SSE of San Ramon, CA",
      "description": "ShakeMap - IV DYFI? - V Time 2025-12-20 03:49:28 UTC 2025-12-20 03:49:28 UTC at epicenter Location 37.743°N 121.954°W Depth 9.56 km (5.94 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/nc75283016",
      "published": "2025-12-22T17:36:16.470Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Palestinians says Israel is demolishing homes near Jerusalem, displacing hundreds",
      "description": "Palestinians say Israel has demolished hundreds of homes near Jerusalem, displacing hundreds of Palestinians as new Jewish settlements are greenlit in the West Bank.",
      "url": "https://www.npr.org/2025/12/23/nx-s1-5651920/palestinians-says-israel-is-demolishing-homes-near-jerusalem-displacing-hundreds",
      "published": "Tue, 23 Dec 2025 04:44:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "DOJ releases more Epstein files. And, immigration court 'no-shows' surged, NPR finds",
      "description": "The DOJ has released more files related to convicted sex offender Jeffrey Epstein. And, NPR finds a rise in the number of immigrants without legal status who aren't showing up to immigration court.",
      "url": "https://www.npr.org/2025/12/22/g-s1-103305/up-first-newsletter-us-venezuela-oil-tankers-epstein-files-immigration-court",
      "published": "Mon, 22 Dec 2025 07:50:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists say they have discovered 20 new species deep in the Pacific Ocean",
      "description": "Researchers retrieved reef monitoring devices that had been placed in deep coral reefs in Guam. The devices were placed up to 330 feet below the surface.",
      "url": "https://www.npr.org/2025/12/21/nx-s1-5650781/new-species-deep-pacific-ocean",
      "published": "Sun, 21 Dec 2025 17:23:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "UK: Russell Brand charged with two more sex offenses",
      "description": "British comedian Russell Brand has been charged with two more sex offenses, UK police said on Tuesday, in addition to existing charges.",
      "url": "https://www.dw.com/en/uk-russell-brand-charged-with-two-more-sex-offenses/a-75290095?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 17:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ryanair faces massive fine in Italy over 'abusive strategy'",
      "description": "Italy's competition authority AGCM claims the budget airline blocked payment methods and mass-deleted accounts to manipulate travel agencies and force them into partnerships. Ryanair has pledged to appeal the fine.",
      "url": "https://www.dw.com/en/ryanair-faces-massive-fine-in-italy-over-abusive-strategy/a-75282204?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 11:02:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "North Korea's Kim Jong Un, daughter open luxury resort",
      "description": "Five new hotels were opened in Samjiyon, near the Chinese border, with Kim Jong Un praising the \"rising status\" of North Korea's people.",
      "url": "https://www.dw.com/en/north-korea-s-kim-jong-un-daughter-open-luxury-resort/a-75280175?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 10:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Every 3rd food bank beneficiary is a child",
      "description": "Over 30% of people who regularly need support from a food bank in Germany are children, activists say. Meanwhile, German property prices have risen for a fourth straight quarter. DW has the latest.",
      "url": "https://www.dw.com/en/germany-news-every-3rd-food-bank-beneficiary-is-a-child/live-75279871?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 09:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "This is how Christmas is celebrated at the Vatican",
      "description": "This year, Pope Leo XIV will lead the Christmas celebrations at the Vatican for the first time. But the popular Christmas traditions at the heart of the Roman Catholic Church remain unchanged.",
      "url": "https://www.dw.com/en/this-is-how-christmas-is-celebrated-at-the-vatican/a-75189002?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 06:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US approve Novo Nordisk's Wegovy pill for weight loss",
      "description": "US regulators have approved using a pill form of the popular GLP-1 drug Wegovy for weight loss.",
      "url": "https://www.dw.com/en/us-approve-novo-nordisk-s-wegovy-pill-for-weight-loss/a-75277330?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 23 Dec 2025 03:59:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Brazil's Supreme Court allows Bolsonaro to leave prison for surgery on Christmas",
      "description": "Brazil's Supreme Court granted a request by ex-president Jair Bolsonaro to leave prison to undergo surgery on Christmas for a hernia. Bolsonaro is currently serving a 27-year sentence after being convicted of plotting a coup to remain in power.",
      "url": "https://www.france24.com/en/americas/20251223-brazil-s-supreme-court-allows-bolsonaro-to-leave-prison-for-surgery-on-christmas",
      "published": "Tue, 23 Dec 2025 20:17:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "What makes a hit song? How to keep it real in the age of AI",
      "description": "There's nothing more innately human than humming a tune. Especially when it's made by humans. But don't bother trying to see The Velvet Sundown in concert: the band doesn't exist. The sounds are produced with artificial intelligence.",
      "url": "https://www.france24.com/en/tv-shows/the-debate/20251223-what-makes-a-hit-song-how-to-keep-it-real-in-the-age-of-ai",
      "published": "Tue, 23 Dec 2025 18:30:16 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French Parliament approves Stopgap Bill: Budget bill moves to senate",
      "description": "Olivia Bizot has more.",
      "url": "https://www.france24.com/en/video/20251223-french-parliament-approves-stopgap-bill-budget-bill-moves-to-senate",
      "published": "Tue, 23 Dec 2025 16:28:42 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Carol of the Bells' also known as the Ukrainian Christmas anthem",
      "description": "Bryan Quinn tells us more about 'Carol of the Bells', the famous Ukrainian Christmas carol.",
      "url": "https://www.france24.com/en/video/20251223-carol-of-the-bells-also-known-as-the-ukrainian-christmas-anthem",
      "published": "Tue, 23 Dec 2025 16:26:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Africa Cup of Nations 2025: Senegal to face Botswana this afternoon",
      "description": "Selina Sykes is in Rabat, Marocco.",
      "url": "https://www.france24.com/en/video/20251223-africa-cup-of-nations-2025-senegal-to-face-botswana-this-afternoon",
      "published": "Tue, 23 Dec 2025 15:58:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France races to avoid US-style government shutdown after budget talks collapse",
      "description": "Clovis Casali gives us his analysis.",
      "url": "https://www.france24.com/en/video/20251223-france-races-to-avoid-us-style-government-shutdown-after-budget-talks-collapse",
      "published": "Tue, 23 Dec 2025 15:09:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Divisions Ripe at Turning Point USA’s AmericaFest Convention",
      "description": "Richard Johnson, Lecturer in US politics, is our guest.",
      "url": "https://www.france24.com/en/video/20251223-divisions-ripe-at-turning-point-usa-s-americafest-convention",
      "published": "Tue, 23 Dec 2025 15:06:03 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Bethlehem prepares for Christmas after two years of canceled celebrations",
      "description": "Christmas celebrations are back in Bethlehem after two years.",
      "url": "https://www.france24.com/en/video/20251223-bethlehem-prepapres-for-christmas-after-two-years-of-canceled-celebrations",
      "published": "Tue, 23 Dec 2025 14:57:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'No one is here to help us': Palestinians watch as Israeli diggers tear down homes in East Jerusalem",
      "description": "A balcony of onlookers stare as three diggers gnaw at the four-storey building that was a fixture of their daily view.",
      "url": "https://news.sky.com/story/no-one-is-here-to-help-us-palestinians-watch-on-as-israeli-diggers-tear-down-their-homes-in-east-jerusalem-13486867",
      "published": "Mon, 22 Dec 2025 21:18:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian general assassinated - here's why the timing appears significant",
      "description": "A Russian general being blown up on his own doorstep isn't a good look for Moscow, and it seems it's becoming increasingly common.",
      "url": "https://news.sky.com/story/timing-of-russian-generals-assassination-appears-significant-13486701",
      "published": "Mon, 22 Dec 2025 13:32:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Is the AI bubble about to burst? If so the consequences could be dire",
      "description": "The market seems to be content, for now at least, to keep betting big on AI.",
      "url": "https://news.sky.com/story/fears-grow-of-ai-bubble-and-here-are-the-pressure-points-that-could-burst-it-13486328",
      "published": "Sun, 21 Dec 2025 11:50:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "130 children and staff abducted from Nigerian school last month freed 'in time for Christmas'",
      "description": "The remaining 130 schoolchildren and staff abducted by gunmen from a Catholic school in Nigeria last month have been freed.",
      "url": "https://news.sky.com/story/130-children-and-staff-abducted-from-nigerian-school-last-month-freed-in-time-for-christmas-13486536",
      "published": "Sun, 21 Dec 2025 22:10:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US in 'active pursuit' of third vessel off Venezuelan coast, officials say",
      "description": "The US is in \"active pursuit\" of a third oil tanker near Venezuela in the Caribbean Sea, officials have said.",
      "url": "https://news.sky.com/story/us-in-active-pursuit-of-third-vessel-off-venezuelan-coast-officials-say-13486511",
      "published": "Sun, 21 Dec 2025 20:06:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Pope offers gentle critique of Vatican culture in Christmas greeting",
      "description": "Pope Leo XIV has urged Vatican cardinals to put their ambitions of power and personal interests aside and work instead on building communion",
      "url": "https://abcnews.go.com/International/wireStory/pope-offers-gentle-critique-vatican-culture-christmas-greeting-128614171",
      "published": "Mon, 22 Dec 2025 07:04:53 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Contact lost with private jet heading for Libya after takeoff from Turkey: Official",
      "description": "Turkey's interior minister says air traffic controllers lost contact with a private jet carrying Libya’s military chief home after a visit to Turkey",
      "url": "https://abcnews.go.com/International/wireStory/contact-lost-private-jet-heading-libya-after-takeoff-128658502",
      "published": "Tue, 23 Dec 2025 14:37:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Malaysian court rejects ex-prime minister’s bid to serve remainder of sentence under house arrest",
      "description": "A Malaysian court has rejected former Prime Minister Najib Razak’s bid to serve the rest of his graft sentence under house arrest",
      "url": "https://abcnews.go.com/International/wireStory/malaysian-court-rejects-prime-ministers-bid-serve-remainder-128608560",
      "published": "Mon, 22 Dec 2025 02:01:23 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Banksy unveils new art in London following speculation over murals",
      "description": "Banksy appears to confirm a new mural in London is his latest work",
      "url": "https://abcnews.go.com/International/wireStory/banksy-unveils-new-art-london-speculation-murals-depicting-128624045",
      "published": "Mon, 22 Dec 2025 13:02:22 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Somalia: Funding cuts impact assistance to millions affected by drought",
      "description": "Brutal slashes to aid budgets are hampering efforts to assist millions of people in Somalia affected by drought, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166654",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Synthetic drug market disrupted in Syria after regime change",
      "description": "Past geopolitical tensions related to the synthetic drug “captagon” are now being mitigated with the Syrian authorities’ commitment to dismantle illicit manufacturing, says the United Nations Office on Drugs and Crime (UNODC).",
      "url": "https://news.un.org/feed/view/en/story/2025/12/1166647",
      "published": "Mon, 22 Dec 2025 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "3 Georgia jail escapees allegedly force Lyft driver to Florida before capture by authorities",
      "description": "Three inmates escaped from DeKalb County jail Monday and were captured in Miami after allegedly forcing a Lyft driver to drive them to Florida at gunpoint.",
      "url": "https://www.foxnews.com/us/georgia-jail-escapees-allegedly-force-lyft-driver-florida-before-capture-authorities",
      "published": "Tue, 23 Dec 2025 16:02:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Repeat offender allegedly kills Ohio man just days after nonprofit pays his bail",
      "description": "The Bail Project paid $500 to release Ohio man from jail who then allegedly committed murder within days at Cleveland light rail station.",
      "url": "https://www.foxnews.com/us/repeat-offender-allegedly-kills-ohio-man-just-days-after-nonprofit-pays-his-bail",
      "published": "Tue, 23 Dec 2025 08:00:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Multiple people, including pregnant woman, struck by alleged drunk driver at Navajo Nation Christmas parade",
      "description": "An alleged drunk driver hit multiple people at a Christmas parade on Navajo Nation, killing at least one and injuring others, including a pregnant woman.",
      "url": "https://www.foxnews.com/us/multiple-people-including-pregnant-woman-struck-alleged-drunk-driver-navajo-nation-christmas-parade",
      "published": "Tue, 23 Dec 2025 05:32:53 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Iran executes man convicted of spying for Israeli intelligence",
      "description": "Iran executed a man convicted of spying for Israel's Mossad intelligence agency, accused of conducting over 200 spy missions across multiple cities, including Tehran.",
      "url": "https://www.foxnews.com/world/iran-executes-man-convicted-spying-israeli-intelligence",
      "published": "Sun, 21 Dec 2025 21:18:03 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}