{
  "last_updated": "2025-12-20T20:57:50.037524Z",
  "event_count": 80,
  "events": [
    {
      "title": "A key piece of Port Arthur-era gun reform remains unfinished. Could it have helped prevent the Bondi attack?",
      "description": "National register would have allowed police to better assess risk posed by alleged Bondi shooters before attack, expert says Victims of Bondi beach shooting Ten minutes of terror: how the Bondi mass shooting unfolded in real time – video A national firearms register, which would track weapons across the country in real time, was a priority for law enforcement and gun control advocates after the 1996 Port Athur massacre. But almost 30 years later, it remains unfinished. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/21/gun-law-reform-after-port-arthur-national-forearms-register-ntwnfb",
      "published": "Sat, 20 Dec 2025 19:00:36 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 49,
      "severity_level": "Critical"
    },
    {
      "title": "At least four people killed in mass stabbing in Taipei",
      "description": "Man, 27, from northern Taiwan reported to have fallen to his death in police chase after rampage through capital At least four people have died in a rare mass stabbing incident in central Taipei after an attacker used smoke grenades to cause chaos as he went on a violent rampage through Taiwan’s capital. Several people were also injured. The suspected assailant is among the dead after he fell from a building during a police chase through a busy shopping district on Friday evening. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/mass-stabbing-tapei",
      "published": "Fri, 19 Dec 2025 16:32:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 39,
      "severity_level": "Critical"
    },
    {
      "title": "When attacks unfold, what makes a person run towards danger?",
      "description": "Neuroscientists, psychologists and ‘have-a-go heroes’ themselves explain why it is about more than just instinct As a knife-wielding terrorist wearing a fake suicide belt caused panic on London Bridge in 2019, Darryn Frost remembers entering a state of intense focus. Having grabbed a decorative narwhal tusk from the wall of Fishmongers’ Hall, the formerly shy civil servant zoned in on the danger and ran towards it, helping pin the attacker to the ground. Continue reading...",
      "url": "https://www.theguardian.com/science/2025/dec/19/when-attacks-unfold-what-makes-a-person-run-towards-danger",
      "published": "Fri, 19 Dec 2025 17:12:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "Prime minister backs NSW premier’s call for a royal commission into the Bondi beach terror attack",
      "description": "Anthony Albanese said he would ‘support whatever action the NSW government takes’ Get our breaking news email , free app or daily news podcast Anthony Albanese has backed the NSW premier’s call for a state-based royal commission into last weekend’s terror attack at Bondi beach, after Chris Minns called for a full “comprehensive look” at the deadly shooting. Speaking to reporters on Saturday, Minns said the state needed a royal commission to investigate the mass shooting that killed 15 people. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/20/nsw-premier-announces-new-laws-banning-hate-speech-and-symbols-in-wake-of-bondi-beach-terror-attack",
      "published": "Sat, 20 Dec 2025 03:03:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "4 dead, 11 injured in Taiwan knife attack",
      "description": "Taiwan ordered sweeping security reforms after a knife attack killed three people and injured 11 in Taipei.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/4-dead-11-injured-in-taiwan-knife-attack?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 19:13:47 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "US plan for $1.6m hepatitis B vaccine study in Africa called ‘highly unethical’",
      "description": "Experts decry ‘neocolonialist’ Guinea-Bissau study after Trump administration changed advice for US babies The Trump administration has indicated that it will fund a $1.6m study on hepatitis B vaccination of newborns in the west African country of Guinea-Bissau, where nearly one in five adults live with the virus – a move that researchers call “highly unethical” and “extremely risky”. The news follows an official change in recommendations on hepatitis B vaccines at birth from the US Centers for Disease Control and Prevention (CDC), which called the shots an “individual” decision, despite decades of safe and effective vaccination and no evidence of harm. It is part of sweeping changes to childhood immunizations by the US health secretary, Robert F Kennedy Jr, which have global repercussions – including cutting funding for programs that bring vaccines to countries around the world. Continue reading...",
      "url": "https://www.theguardian.com/society/2025/dec/19/hepatitis-b-vaccine-study-guinea-bissau-rfk",
      "published": "Fri, 19 Dec 2025 16:34:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Colombian mercenaries in Sudan ‘recruited by UK-registered firms’",
      "description": "Exclusive Guardian investigation finds companies set up by people sanctioned by US hired Colombian fighters for Rapid Support Forces, widely suspected of war crimes in Sudan Close to Tottenham Hotspur’s shiny football stadium in London is a squat, nondescript block of flats. It holds a grim secret beyond the unremarkable beige brickwork – a cramped, second-floor apartment in the British capital, linked to murderous atrocities unfolding 3,000 miles south. The one-bedroom flat off north London’s Creighton Road is, according to UK government records, tied to a transnational network of companies involved in the mass recruitment of mercenaries to fight in Sudan alongside paramilitaries accused of myriad war crimes and genocide. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/19/colombian-mercenaries-sudan-rsf-us-sanctions-recruited-uk-registered-firms-investigation",
      "published": "Fri, 19 Dec 2025 06:00:55 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Seven Colombian soldiers killed in rebel drone attack on base near Venezuela",
      "description": "Colombia’s ELN guerrilla group used drones and explosives in Thursday night attack that also injured at least 30 soldiers Colombia’s ELN guerrilla group has attacked a military base near Venezuela with drones and explosives, killing seven soldiers and wounding 30. Founded in 1964 and inspired by the Cuban revolution, the ELN is the oldest surviving guerrilla group in the Americas, and controls key drug-producing regions of Colombia. Efforts to negotiate a peace settlement have repeatedly stalled. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/colombia-eln-guerrilla-group-attack-military-base",
      "published": "Fri, 19 Dec 2025 16:43:47 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "US intercepts second merchant vessel off coast of Venezuela in international waters",
      "description": "Move comes days after Trump announces ‘blockade’ of sanctioned oil tankers and US seizes tanker US forces on Saturday stopped a second merchant vessel off the coast of Venezuela in international waters, according to two US officials, the Associated Press reported. The move comes days after Donald Trump announced a “blockade” of all sanctioned oil tankers coming in to and out of the South American country and follows the seizure by US forces of an oil tanker off Venezuela’s coast on 10 December. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/20/us-second-merchant-vessel-venezuela",
      "published": "Sat, 20 Dec 2025 20:15:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "US pushes for ceasefire in Sudan’s civil war as Kordofan violence escalates",
      "description": "Top US diplomat warns all involved will face lasting condemnation as fighting escalates in strategic central region.",
      "url": "https://www.aljazeera.com/news/2025/12/20/us-pushes-for-ceasefire-in-sudans-civil-war-as-kordofan-violence-escalates?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 07:25:21 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Knife attacker kills three after smoke bombing Taiwan metro",
      "description": "The suspect's spree began at Taipei's main metro before he moved to another station nearby.",
      "url": "https://www.bbc.com/news/articles/cx251p7k23mo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 20:33:58 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "UNSC condemns Rwanda, M23 rebels for offensive in eastern DR Congo",
      "description": "Resolution urges Rwandan troops to withdraw from area of conflict that has killed hundreds, displaced tens of thousands.",
      "url": "https://www.aljazeera.com/news/2025/12/20/un-security-council-urges-rwanda-to-withdraw-troops-from-eastern-dr-congo?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 14:11:09 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran executes man accused of spying for Israel’s Mossad: State media",
      "description": "Aghil Keshavarz is the latest person put to death for espionage since June conflict with Israel.",
      "url": "https://www.aljazeera.com/news/2025/12/20/iran-executes-man-accused-of-spying-for-israels-mossad-state-media?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 09:20:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "US announces more than $10bn of arms sales to Taiwan",
      "description": "Package includes medium-range missiles, howitzers and drones, and has drawn an angry response from China The maps that show how China’s military is squeezing Taiwan The Trump administration has announced a massive package of arms sales to Taiwan valued at more than $10bn that includes medium-range missiles, howitzers and drones, drawing an angry response from China. The state department announced the sales late on Wednesday during a nationally televised address by president Donald Trump, who made scant mention of foreign policy issues and did not speak about China or Taiwan at all. US-Chinese tensions have ebbed and flowed during Trump’s second term, largely over trade and tariffs but also over China’s increasing aggressiveness toward Taiwan, which Beijing has said must unify with the People’s Republic of China. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/18/us-announces-more-than-10bn-of-arms-sales-to-taiwan",
      "published": "Thu, 18 Dec 2025 15:01:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Five key moments in the assault on the rights of women and girls in 2025",
      "description": "Since Trump’s second term began in January, global healthcare, especially for sexual and reproductive health, has been under constant attack This time last year, women’s rights organisations were bracing themselves for a second Trump term. Few were prepared for the chaos that would be unleashed in January. The volume and speed of executive orders coming out of the White House were seen as a deliberate tactic to overwhelm and create panic. In many ways it worked – there was confusion, anger and exhaustion as organisations scrambled to fill the gap left by the USAID freeze. But that was just the beginning. The US administration has been the key driver, supported by intense advocacy work by ultra-conservative groups using the moment to strengthen global ties with political allies. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/16/five-key-moments-in-the-assault-on-the-rights-of-women-and-girls-in-2025",
      "published": "Tue, 16 Dec 2025 12:00:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "US carries out 'massive' strike against IS in Syria",
      "description": "The US says it struck dozens of targets across Syria in response to last week's deadly Islamic State attack on US forces there.",
      "url": "https://www.bbc.com/news/articles/c5yq7zzw618o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 11:44:36 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Putin vows no more wars if West treats Russia with respect",
      "description": "Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\".",
      "url": "https://www.bbc.com/news/articles/cp89p082y2xo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 21:43:18 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Steve Rosenberg: Was Putin's response to my question about war in Europe an olive branch?",
      "description": "Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\".",
      "url": "https://www.bbc.com/news/articles/c5y9ed5d1r4o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 00:00:19 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump and top aides refuse to rule out war with Venezuela",
      "description": "President Nicolás Maduro orders Venezuelan navy to escort oil tankers after seizure by US forces What action is Trump taking against Venezuela’s oil industry? Donald Trump and his top advisers have refused to rule out the potential for open conflict with Venezuela as Nicolás Maduro urged his navy to escort oil tankers defying the largest US fleet deployed in the region in decades. In an interview broadcast on Friday morning, Donald Trump told NBC News that going to war with Maduro’s regime remains on the table. “I don’t rule it out, no,” he said in a phone interview with the network. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2025/dec/19/trump-venezuela-war",
      "published": "Fri, 19 Dec 2025 19:12:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Santas and elves rob Montreal grocery store to ‘give food to the needy’",
      "description": "Group called Robins des Ruelles later said in statement stunt was intended to highlight cost of living crisis Dressed in red suits and backed by masked elves, a group of Santas marched into a Montreal supermarket, loaded their bags with thousands of dollars worth of groceries and disappeared into the night. The bandit Santas later released a statement saying the food would be distributed to the needy, and saying the Robin Hood-style stunt was intended to highlight the spiralling cost of living crisis that has pushed basic necessities increasingly out of reach for ordinary Canadians. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/montreal-grocery-store-santas-elves-robbery",
      "published": "Fri, 19 Dec 2025 17:06:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Bangladesh newspaper staff recall 'gasping for air' as offices set ablaze",
      "description": "The fresh protests are sparked by the death of one of the leaders of protests that ousted ex-PM Sheikh Hasina.",
      "url": "https://www.bbc.com/news/articles/c2462r82864o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 10:54:05 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Russian attack on Ukraine’s Odesa kills at least 8 as peace talks lumber on",
      "description": "Strikes intensify as Ukraine also hits Russian assets and US-led peace talks begin in Miami.",
      "url": "https://www.aljazeera.com/news/2025/12/20/russian-attack-on-ukraines-odesa-kills-at-least-8-as-peace-talks-lumber-on?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 11:29:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "TikTok signs Trump-backed deal to avoid US ban",
      "description": "Joint venture will take over part of app’s US operations, including data protection, algorithm security and content moderation Business live – latest updates US politics live – latest updates TikTok has reached a deal to form a joint venture that will allow it to continue operating in the US, five years after Donald Trump threatened to ban the social media platform over privacy and national security concerns, a move that further strained relations with China. ByteDance, TikTok’s Chinese owner, has signed a deal with Larry Ellison’s Oracle, the private-equity group Silver Lake and Abu Dhabi’s MGX that will allow it to retain control of its core US operations. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/18/tiktok-signs-deal-us-entity-sale",
      "published": "Fri, 19 Dec 2025 11:31:56 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Lithium battery fire on truck shuts down Hume Highway in NSW due to health risk",
      "description": "Two-trailer carrying 15 tonnes of lithium ion batteries caught alight near Yass on Saturday morning, closing traffic in both directions Get our breaking news email , free app or daily news podcast A truck carrying 15 tonnes of lithium ion batteries has caught alight and closed traffic on a major New South Wales highway, with disruptions expected to last for days. The two-trailer truck was carrying about 50 batteries weighing 300kg each in its B-trailer, Fire and Rescue NSW said. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2025/dec/20/lithium-battery-fire-on-truck-shuts-down-hume-highway-in-nsw-due-to-health-risk",
      "published": "Sat, 20 Dec 2025 05:15:51 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Australian state plans to ban intifada chants after Bondi shooting",
      "description": "New South Wales will look at passing hate speech laws after Australia's deadliest shooting in almost 30 years.",
      "url": "https://www.bbc.com/news/articles/c14v23vppz8o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 07:20:49 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Tens of thousands flood streets for Bangladeshi activist’s funeral",
      "description": "Footage shows a massive crowd filling streets to mourn Sharif Osman Hadi, a leader of the 2024 student-led uprising.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/tens-of-thousands-flood-streets-for-bangladeshi-activists-funeral?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 14:14:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Morocco accused of ‘horrific’ abuse of detained gen Z protesters",
      "description": "As country prepares to host Africa Cup of Nations, families and rights groups tell of police brutality, with hundreds still held The arbitrary detention of hundreds of gen Z protesters in Morocco and alleged “horrific” beatings have been condemned by human rights groups, as the country prepares to host the Africa Cup of Nations on Sunday. A wave of youth-led demonstrations swept across Morocco in late September and early October – the biggest since the 2011 Arab spring – in protest at underfunded healthcare and education. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2025/dec/18/morocco-genz212-protests-police-mass-arrests-beatings-detentions-rights",
      "published": "Thu, 18 Dec 2025 06:00:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "EU agrees €90bn loan for Ukraine but without using Russian assets",
      "description": "EU leaders said the loan would be repayable only when Russia paid reparations for the war.",
      "url": "https://www.bbc.com/news/articles/c3e025vyppeo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 12:47:56 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US to strip alleged Bosnian war criminal of citizenship",
      "description": "Kemal Mrndzic did not reveal that he had been a guard at a camp where atrocities occurred when seeking US naturalisation, officials say.",
      "url": "https://www.bbc.com/news/articles/c2k422e7ykvo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 22:42:55 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "MSF urges Israel to let critical aid into Gaza as children freeze to death",
      "description": "At least 13 people in Gaza, including two-week-old and one-month-old babies, have died from winter weather.",
      "url": "https://www.aljazeera.com/news/2025/12/20/msf-urges-israel-to-let-critical-aid-into-gaza-as-children-freeze-to-death?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 10:19:29 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Netanyahu finally announces October 7 inquiry: Why are Israelis furious?",
      "description": "The Israeli prime minister will be heading the inquiry into his own government's failings ahead of the Hamas-led attack.",
      "url": "https://www.aljazeera.com/news/2025/12/20/netanyahu-finally-announces-october-7-inquiry-why-are-israelis-furious?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 08:37:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Africa in talks with Russia over men ‘tricked’ into fighting in Ukraine",
      "description": "Government says it received distress calls, as daughter of ex-president Jacob Zuma accused of luring men to frontline South Africa’s government is in talks with Russia to bring home 17 South African men fighting for Russia in Ukraine, after the men were allegedly tricked on to the frontlines of the war by a daughter of former South African president Jacob Zuma. Duduzile Zuma-Sambudla has been accused in multiple lawsuits of luring the 17 South African and two Botswanan men to Russia in July, by telling them they would be training as bodyguards for her father’s uMkhonto weSizwe political party or attending a personal development course. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/16/south-africa-russia-men-tricked-fighting-ukraine",
      "published": "Tue, 16 Dec 2025 09:08:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UK Foreign Office victim of cyber-attack in October, says Chris Bryant",
      "description": "Minister says risk to ‘any individual’ from cyber-attack is low and that it is still unclear who is responsible The UK’s Foreign, Commonwealth and Development Office was hacked in October, a minister has said. Chris Bryant, a trade minister in Keir Starmer’s government, told Sky News there was a low risk to “any individual” from the cyber-attack. Continue reading...",
      "url": "https://www.theguardian.com/technology/2025/dec/19/uk-foreign-office-victim-cyber-attack-october-",
      "published": "Fri, 19 Dec 2025 12:59:06 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "A swim for unity at Bondi beach, the scene of Sydney’s darkest day. But on land tensions fray",
      "description": "Jewish voices say an attack of this kind was entirely predictable given the surge in antisemitic attacks in Australia since 2023 The sun rises early at this time of year, hitting the south of the beach first before chasing the shadows north, the gradual retreat of the darkness to the light. Hanukah, the Jewish festival of lights, was being celebrated here on Sunday evening, when the darkness came brutally roaring back. Continue reading...",
      "url": "https://www.theguardian.com/news/ng-interactive/2025/dec/20/a-swim-for-unity-at-bondi-beach-the-scene-of-sydneys-darkest-day-but-on-land-tensions-fray",
      "published": "Fri, 19 Dec 2025 20:39:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US aerial bombardment strikes ‘ISIS thugs’ in Syria",
      "description": "The US military launched more than 70 strikes on alleged ISIL targets in Syria.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/us-aerial-bombardment-strikes-isis-thugs-in-syria?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 16:17:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Imran Khan and wife given further jail terms after state gift fraud case",
      "description": "Pakistan's former PM, who is already serving time in prison, plans to challenge the verdict.",
      "url": "https://www.bbc.com/news/articles/c62vx2pgl0eo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 10:32:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Israel launches new raids in Syria’s Quneitra, establishes checkpoints",
      "description": "Syrian state television denounces the Israeli incursion as another violation of the nation's sovereignty.",
      "url": "https://www.aljazeera.com/news/2025/12/20/israel-launches-fresh-raids-in-syrias-quneitra-establishes-checkpoints?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 15:16:01 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Ex-Pakistan PM Imran Khan, wife sentenced to 17 years in corruption case",
      "description": "Khan and his wife have denied accusations that they misrepresented the value of state gifts, including jewellery.",
      "url": "https://www.aljazeera.com/news/2025/12/20/ex-pakistan-pm-imran-khan-wife-sentenced-to-17-years-in-corruption-case?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 12:19:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Palestinians tell BBC they were sexually abused in Israeli prisons",
      "description": "Two men say they experienced the kind of abuse highlighted in recent reports on Israel's treatment of prisoners, which Israel denies.",
      "url": "https://www.bbc.com/news/articles/c8dy8r7lq0go?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 22:01:20 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘Matter of survival’: South Korean president urges public health cover for hair loss",
      "description": "Medical professionals and some in conservative circles feel argument of Lee Jae Myung may be a bit thin South Korean president Lee Jae Myung has instructed his government to consider extending public health insurance to cover hair-loss treatments, arguing that baldness has become a “matter of survival” rather than a cosmetic concern for young people. The proposal, which has since faced a backlash from medical professionals and conservative figures, was announced during a policy briefing on Tuesday and would expand coverage beyond the limited medical treatments currently available for certain types of hair loss. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/south-korean-president-urges-public-health-cover-hair-loss",
      "published": "Fri, 19 Dec 2025 10:39:27 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "‘I can’t think of a place more pristine’: 133,000 hectares of Chilean Patagonia preserved after local fundraising",
      "description": "Exclusive: Ancient forests and turquoise rivers of the Cochamó Valley protected from logging, damming and development A wild valley in Chilean Patagonia has been preserved for future generations and protected from logging, damming and unbridled development after a remarkable fundraising effort by local groups, the Guardian can reveal. The 133,000 hectares (328,000 acres) of pristine wilderness in the Cochamó Valley was bought for $63m (£47m) after a grassroots campaign led by the NGO Puelo Patagonia , and the title to the wildlands was officially handed over to the Chilean nonprofit Fundación Conserva Puchegüín on 9 December. Continue reading...",
      "url": "https://www.theguardian.com/world/2025/dec/19/i-cant-think-of-a-place-more-pristine-133000-hectares-of-chilean-patagonia-preserved-after-local-fundraising",
      "published": "Fri, 19 Dec 2025 09:00:01 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Survivors 'nervous and sceptical' about release of remaining Epstein files",
      "description": "US lawmakers who pushed for the documents to be made public have criticised the initial release as incomplete.",
      "url": "https://www.bbc.com/news/articles/c14vy02847vo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 20:33:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US seizes vessel off Venezuela's coast, officials say",
      "description": "The move comes after US President Donald Trump ordered a \"blockade\" of sanctioned oil tankers entering and leaving Venezuela.",
      "url": "https://www.bbc.com/news/articles/c0mpy1ynnzzo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 19:27:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Engineer becomes first wheelchair user to go to space",
      "description": "\"It was the coolest experience!\" said Michaela Benthaus after the 10-minute Blue Origin flight.",
      "url": "https://www.bbc.com/news/articles/c5y9z0g7lleo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 19:16:21 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Who and what are in the Epstein files?",
      "description": "High-profile figures, including Bill Clinton and Michael Jackson, can be seen in the long-awaited files.",
      "url": "https://www.bbc.com/news/articles/c8r38ne1x2mo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 20 Dec 2025 14:42:43 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tourists to face €2 fee to get near Rome's Trevi Fountain",
      "description": "Visitors who don't live in Rome will have to pay to view the Baroque monument up close from February.",
      "url": "https://www.bbc.com/news/articles/cp89p41gr06o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 20:05:52 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Charlie Kirk's widow Erika endorses JD Vance for president",
      "description": "Conservatives traded criticims at this year's annual Turning Point USA America Fest conference.",
      "url": "https://www.bbc.com/news/articles/cp84p722m3do?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 18:05:23 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French court rejects Shein website suspension over childlike sex dolls",
      "description": "The fast-fashion giant welcomed the judgement and said its priority remains protecting French consumers.",
      "url": "https://www.bbc.com/news/articles/c5y9x4pj54eo?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 15:49:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Norway's crown princess likely needs lung transplant, palace says",
      "description": "Mette-Marit has pulmonary fibrosis, a disease that stiffens the lungs, making it hard to breathe.",
      "url": "https://www.bbc.com/news/articles/cpq4p535347o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 15:33:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "German court jails man for drugging, raping and filming wife for years",
      "description": "The 61-year-old has been sentenced to eight-and-a-half years in prison after posting the videos online.",
      "url": "https://www.bbc.com/news/articles/cm21pxen1jno?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 17:40:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Removed Ben & Jerry's chair says Magnum aimed to 'smear' her",
      "description": "Anuradha Mittal was ejected from the board of the ice cream maker this week.",
      "url": "https://www.bbc.com/news/articles/cn98pzr8x79o?at_medium=RSS&at_campaign=rss",
      "published": "Fri, 19 Dec 2025 20:48:44 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US seizes second oil vessel off Venezuela coast, officials say",
      "description": "The incident marks the second time in recent weeks that the US has seized an oil tanker near Venezuela.",
      "url": "https://www.aljazeera.com/news/2025/12/20/us-seizes-second-oil-vessel-off-venezuela-coast-officials-say?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 20:26:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ekitike and Isak help Liverpool squeeze past nine-man Tottenham",
      "description": "Defending champions Liverpool win 2-1 at Tottenham to climb to fifth in the Premier League table.",
      "url": "https://www.aljazeera.com/sports/2025/12/20/ekitike-and-isak-help-liverpool-squeeze-past-nine-man-tottenham?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 20:19:58 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "‘Red Ribbon’ vigil for Palestinian prisoners held by Israel",
      "description": "Red ribbons and Palestinian flags were seen at aLondon vigil calling for the Israeli release of imprisoned Palestinians.",
      "url": "https://www.aljazeera.com/video/newsfeed/2025/12/20/red-ribbon-vigil-for-palestinian-prisoners-held-by-israel?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 20:16:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Why has signing the EU-Mercosur deal been delayed?",
      "description": "Sealing of deal postponed despite decades of preparation.",
      "url": "https://www.aljazeera.com/video/inside-story/2025/12/20/why-has-signing-the-eu-mercosur-deal-been-delayed?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 17:56:43 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Lebanon claims first phase of Hezbollah’s disarmament close to complete",
      "description": "The PM says the part of the plan on south of the Litani River is 'only days away from completion'.",
      "url": "https://www.aljazeera.com/news/2025/12/20/first-phase-of-hezbollahs-disarmament-close-to-complete-lebanons-salam?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 17:38:50 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON moves to 4-year cycle as new Africa Nations League created",
      "description": "On the eve of the 2025 AFCON, football's governing body in Africa create new four-year cycle and form a Nations League.",
      "url": "https://www.aljazeera.com/sports/2025/12/20/afcon-moves-to-4-year-cycle-as-new-africa-nations-league-created?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 16:42:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Tottenham vs Liverpool 1-2: Premier League – as it happened",
      "description": "All our updates, with post-match reaction and interviews, following our text commentary stream of the EPL game.",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/12/20/live-tottenham-vs-liverpool-premier-league?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 14:30:23 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uruguay’s FM on US claims to police Latin America and rising tensions",
      "description": "Mario Lubetkin on Washington’s revived sphere-of-influence doctrine, Venezuela, and China’s growing footprint.",
      "url": "https://www.aljazeera.com/video/talk-to-al-jazeera/2025/12/20/uruguays-fm-on-us-claims-to-police-latin-america-and-rising-tensions?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 09:04:57 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Islamic University of Gaza resumes classes on site amid Israeli destruction",
      "description": "Students return for in-person classes amid ruins as Palestinians fight to salvage education from systematic decimation.",
      "url": "https://www.aljazeera.com/news/2025/12/20/islamic-university-of-gaza-resumes-classes-on-site-amid-israeli-destruction?traffic_source=rss",
      "published": "Sat, 20 Dec 2025 08:56:35 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}