{
  "last_updated": "2026-01-19T08:35:42.860679Z",
  "event_count": 221,
  "events": [
    {
      "title": "Security Council LIVE: UN raises alarm over deadly Iran protests and ‘possible military strikes’",
      "description": "The UN Security Council is meeting in New York in emergency session on Iran, amid escalating concern over reports that hundreds have been killed during weeks of nationwide anti-government protests. The meeting was requested by the United States. Demonstrations that began in late December, fuelled by soaring inflation, rising food prices and the collapse of the national currency, triggered a deadly and widespread crackdown with thousands injured and detained, according to numerous firsthand accounts. The UN has called for independent investigations into all killings and warned against the possible use of the death penalty against protesters. Follow live coverage below, and UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166769",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 65,
      "severity_level": "Critical"
    },
    {
      "title": "15 years after Fukushima, Japan prepares to restart the world’s biggest nuclear plant",
      "description": "A return to nuclear power is at the heart of Japan’s energy policy but, in the wake of the 2011 disaster, residents’ fears about tsunamis, earthquakes and evacuation plans remain The activity around the Kashiwazaki-Kariwa nuclear power plant is reaching its peak: workers remove earth to expand the width of a main road, while lorries arrive at its heavily guarded entrance. A long perimeter fence is lined with countless coils of razor wire, and in a layby, a police patrol car monitors visitors to the beach – one of the few locations with a clear view of the reactors, framed by a snowy Mount Yoneyama. When all seven of its reactors are working, Kashiwazaki-Kariwa generates 8.2 gigawatts of electricity, enough to power millions of households. Occupying 4.2 sq km of land in Niigata prefecture on the Japan Sea coast, it is the biggest nuclear power plant in the world. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/japan-nuclear-plant-restart-kashiwazaki-kariwa-fukushima",
      "published": "Mon, 19 Jan 2026 01:46:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 57,
      "severity_level": "Critical"
    },
    {
      "title": "Chile declares 'state of catastrophe' as wildfires leave at least 18 dead",
      "description": "Chile's president warned the death toll cold rise in the Ñuble and Biobío regions.",
      "url": "https://www.bbc.com/news/articles/cz7ypw4rjrzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 03:30:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "‘A home left quieter, clothes still hanging in wardrobes’: emotional MPs pay tribute to Bondi terror attack victims",
      "description": "Anthony Albanese moves motion in parliament honouring courage of first responders and affirming right of Jewish Australians to live in peace Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Labor MP Josh Burns has recalled the fear that struck him the moment he learned of the Bondi terror attack and former attorney general Mark Dreyfus became visibly emotional during a condolence motion in federal parliament for victims of the shooting. Standing orders were suspended in parliament on Monday as the prime minister, Anthony Albanese, moved the condolence motion in memory of the 15 people who were killed when two gunmen, allegedly inspired by Islamic State, targeted a Hanukah event on 14 December at Sydney’s Bondi beach. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/bondi-terror-attack-politicians-parliament-condolence-motion-ntwnfb",
      "published": "Mon, 19 Jan 2026 04:13:12 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Chilean president declares state of catastrophe as wildfires kill at least 18",
      "description": "Fires blaze through 8,500 hectares, forcing 50,000 people to evacuate as firefighters struggle to extinguish flames Wildfires raging across central and southern Chile have killed at least 18 people, scorched thousands of hectares of forest and destroyed scores of homes, authorities said, as the South American country swelters under a heatwave. Chile’s president, Gabriel Boric, declared a state of catastrophe in the country’s central Biobío region and the neighbouring Ñuble region, about 500km (300 miles) south of Santiago, the capital. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chile-president-declares-state-of-catastrophe-as-wildfires-kill",
      "published": "Sun, 18 Jan 2026 20:16:02 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "Narrative war: Who killed thousands during Iran’s nationwide protests?",
      "description": "Iran accuses US and Israel of provoking unrest, opposition claims state forces responsible for majority of deaths.",
      "url": "https://www.aljazeera.com/news/2026/1/19/narrative-war-who-killed-thousands-during-irans-nationwide-protests?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 08:02:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "Labor and Coalition on track to achieve deal on hate speech laws",
      "description": "Negotiations between prime minister Anthony Albanese and opposition leader Sussan Ley are ‘constructive’, sources say Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A deal on new hate speech laws is increasingly likely after Sussan Ley’s shadow cabinet agreed to work with Labor to pass the legislation in a special parliamentary sitting in response to the Bondi beach massacre. The opposition leader met the prime minister, Anthony Albanese, on Monday to discuss a compromise after MPs returned to Canberra to mark the 14 December terrorist attack. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/labor-coalition-deal-hate-speech-laws-ley-albanese",
      "published": "Mon, 19 Jan 2026 04:59:25 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 38,
      "severity_level": "Critical"
    },
    {
      "title": "Kurdish forces risk turning to 'guerrilla' warfare as Syrian army advances",
      "description": "Kurdish-led forces withdrew from Syria's largest oil field on Sunday, according to a conflict monitor, as government troops expanded their control over vast areas in the country's north and east. As the Syrian army continues to advance into Kurdish-held territories, the Kurdish forces may resort to guerrilla warfare, potentially destabilizing the country, said Henri Barkey, Professor of International Relations at Lehigh University.",
      "url": "https://www.france24.com/en/kurdish-forces-risk-turning-to-guerrilla-warfare-as-syrian-army-advances",
      "published": "Sun, 18 Jan 2026 13:10:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief warns of a world in chaos as impunity and unpredictability spreads",
      "description": "In his final annual address outlining his priorities, UN Secretary-General António Guterres warned that the world is “brimming with conflict, impunity, inequality and unpredictability” – even as international cooperation is fraying at the moment it is most needed.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166772",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "Chile declares ‘state of catastrophe’ as wildfires kill at least 18",
      "description": "The wildfires force 50,000 people to flee, as President Gabriel Boric declares emergency.",
      "url": "https://www.aljazeera.com/gallery/2026/1/19/chile-declares-state-of-catastrophe-as-wildfires-kill-at-least-18?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 07:56:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "'State of catastrophe' in Chile as wildfires rage, killing at least 18",
      "description": "At least 18 people have been killed and 50,000 people have fled to safety after wildfires, as a \"state of catastrophe\" was declared in Chile.",
      "url": "https://news.sky.com/story/state-of-catastrophe-in-chile-as-deadly-wildfires-rage-13495867",
      "published": "Sun, 18 Jan 2026 15:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "'Experienced terrorist' with links to deadly ambush killed by US strike",
      "description": "An \"experienced terrorist leader\" with ties to al Qaeda has been killed in US strikes, after an Islamic State ambush last month left three Americans dead.",
      "url": "https://news.sky.com/story/experienced-terrorist-killed-by-us-strikes-in-syria-after-deadly-ambush-left-three-americans-dead-13495724",
      "published": "Sun, 18 Jan 2026 00:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 35,
      "severity_level": "Critical"
    },
    {
      "title": "US-based activist agency says it has verified 3,766 deaths from Iran protests",
      "description": "A U.S.-based activist agency reports at least 3,766 deaths during recent protests in Iran",
      "url": "https://abcnews.go.com/International/wireStory/us-based-activist-agency-verified-3766-deaths-iran-129330736",
      "published": "Sun, 18 Jan 2026 14:17:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Will AI kickstart a new age of nuclear power?",
      "description": "The rapidly expanding use of artificial intelligence worldwide is putting electrical grids under huge pressure and many believe that, to meet that need without contributing to the climate crisis, a full-scale expansion of nuclear energy is essential.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166768",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Police warn of ‘door-kicking challenge’ that can turn viral prank ‘from funny to fatal’",
      "description": "Authorities issued a warning as a door-kicking prank trend gains traction on social media. The dangerous challenge has led to shootings and arrests nationwide.",
      "url": "https://www.foxnews.com/us/police-warn-door-kicking-challenge-that-can-turn-viral-prank-from-funny-fatal",
      "published": "Sat, 17 Jan 2026 14:00:30 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 33,
      "severity_level": "Critical"
    },
    {
      "title": "Former Iranian prisoners reveal torture horrors as regime kills protesters on sight during crackdown",
      "description": "Three former political prisoners in Iran share harrowing accounts of detention abuse, warning the world about escalating violence during the current uprising.",
      "url": "https://www.foxnews.com/world/former-iranian-prisoners-reveal-torture-horrors-regime-kills-protesters-sight-during-crackdown",
      "published": "Sat, 17 Jan 2026 12:00:31 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of emergency after police officers killed by gangs",
      "description": "Guatemalan President Bernardo Arevalo declared a state of emergency on Sunday to strengthen the powers of the authorities against gangs, which in recent days have taken control of several prisons in the country and killed eight police officers. These attacks were in retaliation for a decision by the authorities to transfer criminal gang leaders to a high-security prison.",
      "url": "https://www.france24.com/en/americas/20260118-gang-guatemala-kill-seven-police-prison",
      "published": "Sun, 18 Jan 2026 23:22:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala declares state of siege after gang violence",
      "description": "Guatemala is in a state of emergency following a weekend of gang-related violence. Gang-affiliated inmates rioted in three prisons. Seven police officers were killed as authorities took action.",
      "url": "https://www.dw.com/en/guatemala-declares-state-of-siege-after-gang-violence/a-75557482?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 05:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Death toll in Karachi shopping plaza fire rises to 10 as search continues for missing",
      "description": "Officials say the death toll from a massive fire at a shopping plaza in Pakistan’s largest city, Karachi, has jumped to 10 after rescuers recovered four more bodies from the building during the search for dozens of people reported missing",
      "url": "https://abcnews.go.com/International/wireStory/death-toll-karachi-shopping-plaza-fire-rises-10-129339842",
      "published": "Mon, 19 Jan 2026 01:55:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Viral protest video against Iran’s supreme leader sparks copycat demonstrations worldwide",
      "description": "Viral video shows Iranian refugee lighting cigarette with burning photo of supreme leader, sparking global defiance movement amid Iran protests.",
      "url": "https://www.foxnews.com/world/viral-protest-video-against-irans-supreme-leader-sparks-copycat-demonstrations-worldwide",
      "published": "Sun, 18 Jan 2026 21:52:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "US strike eliminates al Qaeda operative connected to ISIS ambush that killed 3 Americans in Syria",
      "description": "U.S. forces killed an al Qaeda-affiliated leader allegedly linked to an ISIS attack that killed three Americans in Syria, as CENTCOM launched counterterrorism operations Jan. 16.",
      "url": "https://www.foxnews.com/world/us-strike-eliminates-al-qaeda-operative-connected-isis-ambush-killed-3-americans-syria",
      "published": "Sat, 17 Jan 2026 16:59:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Uganda’s president calls opponents 'terrorists' in victory speech",
      "description": "Yoweri Museveni wins seventh term but poll criticised by observers and rights groups over repression of opposition and internet blackout Uganda’s president, Yoweri Museveni, fresh from winning a seventh term in office at 81, said on Sunday that the opposition were “terrorists” who had tried to use violence to overturn the election results. Official results showed Museveni winning a landslide with 72% of the vote , but the poll was criticised by African election observers and rights groups due to the heavy repression of the opposition and an internet blackout. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/ugandas-president-calls-opponents-terrorists-in-victory-speech",
      "published": "Sun, 18 Jan 2026 17:17:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Wildfires race across Chile, leaving 18 dead and forcing thousands to flee",
      "description": "Authorities in Chile say that wildfires raging across central and southern areas of the country have left at least 18 people dead",
      "url": "https://abcnews.go.com/International/wireStory/wildfires-race-chile-leaving-18-dead-forcing-thousands-129331161",
      "published": "Sun, 18 Jan 2026 23:29:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Spain train crash live: At least 39 killed in high-speed collision",
      "description": "Dozens of people wounded in the crash in Cordoba province.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/19/spain-train-crash-live-at-least-39-killed-in-high-speed-collision?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 07:53:15 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Fears Iran's internet shutdown could lead to 'extreme digital isolation'",
      "description": "Internet monitor FilterWatch warns that authorities are trying to cut the country off from international connectivity.",
      "url": "https://www.bbc.com/news/articles/cg5gegrdq3go?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 11:09:29 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russia strikes 6 Ukrainian regions, killing at least 2",
      "description": "Dozens of people were wounded and at least two were killed in overnight Russian air attacks on Ukraine, according to the Ukrainian president. The attack comes as US and Ukrainian officials are set to meet in Miami.",
      "url": "https://www.dw.com/en/russia-strikes-6-ukrainian-regions-killing-at-least-2/a-75552564?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 12:55:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Russia plots major strike on Europe's largest nuclear plant power lines: source",
      "description": "Ukraine nuclear facilities face Russian attack threats as Moscow weighs strikes on power substations to force capitulation, officials say. Zaporizhzhia is a primary target.",
      "url": "https://www.foxnews.com/world/russia-threaten-ukraine-europe-nuclear-plant-winter-energy-war-escalates",
      "published": "Sun, 18 Jan 2026 19:21:19 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "‘We could see the glow and smell the smoke’: residents warned as fires burn south of Adelaide",
      "description": "Watch and act alert issued for Tooperang, Nangkita, Mount Jagged and Mosquito Hill as firefighters continue to battle blaze Get our breaking news email , free app or daily news podcast South Australian residents have described seeing the flames and smelling the smoke of a bushfire that has scorched hundreds of hectares and destroyed structures as emergency crews fight to control the blaze. The bushfire burning east of Mount Compass in the Fleurieu Peninsula, south of Adelaide, broke out about 4.30pm on Sunday. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/south-australia-adelaide-fires-bushfires-burn-smoke-warnings-residents-evacuated",
      "published": "Mon, 19 Jan 2026 06:18:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 25,
      "severity_level": "Critical"
    },
    {
      "title": "Guatemala’s president declares 30-day state of emergency after prison riots",
      "description": "President Bernardo Arevalo issues the order after at least seven police officers killed in riots and hostage-taking.",
      "url": "https://www.aljazeera.com/news/2026/1/19/guatemalas-president-declares-30-day-state-of-emergency-after-prison-riots?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 05:35:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Pakistan: At least 11 dead in Karachi mall fire",
      "description": "A mall in Pakistan’s Karachi was on fire for more than 24 hours. At least 11 people have been killed while 60 are still missing.",
      "url": "https://www.dw.com/en/pakistan-at-least-11-dead-in-karachi-mall-fire/a-75557903?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 07:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Death toll in Karachi mall fire rises to at least 14 in Pakistan",
      "description": "More than 50 people remain missing, with a police investigation under way to determine the cause of the fire.",
      "url": "https://www.aljazeera.com/news/2026/1/19/death-toll-in-karachi-mall-fire-rises-to-at-least-14-in-pakistan?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 08:08:04 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "‘Brazen’ political influence of rich laid bare as wealth of billionaires reaches $18.3tn, says Oxfam",
      "description": "Governments opting for oligarchy while brutally repressing protests over austerity and lack of jobs, charity report says The world saw a record number of billionaires created last year, with a collective wealth of $18.3tn (£13.7tn), while global efforts stalled in the fight against poverty and hunger. Oxfam’s annual survey of global inequality has revealed that the number of billionaires surpassed 3,000 for the first time during 2025. Since 2020, their collective wealth grew by 81%, or $8.2tn, which the charity claims would be enough to eradicate global poverty 26 times over. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/19/brazen-political-influence-rich-laid-bare-wealth-billionaires-inequality-poverty-instability-oxfam",
      "published": "Mon, 19 Jan 2026 00:01:08 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "China’s economy hit growth goal last year despite Trump trade war and property crisis",
      "description": "Economy weathered a fraught geopolitical landscape to reach 5% target but structural challenges at home ‘are not going away’, say experts Chinese authorities can say they hit their growth goals last year, but Donald Trump’s ongoing trade aggression, a slow-motion housing market collapse and unhappy consumers remain major challenges for the world’s second-largest economy. Data released on Monday showed the Chinese economy grew by 5% in 2025, steady on the year before and hitting the official target of “around” that pace. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/19/chinas-economy-hit-growth-goal-last-year-despite-trump-trade-war-and-property-crisis",
      "published": "Mon, 19 Jan 2026 06:26:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Amid Sudan’s humanitarian crisis, Chad shows ‘act of solidarity’",
      "description": "In war-torn Sudan, local communities say they don’t have enough settlements for the internally displaced, few solutions for women who have suffered sexual violence – and there’s a lack of aid available for people with disabilities.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166777",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "WFP warns Sudan food aid could run out in March",
      "description": "The World Food Programme (WFP) said on Thursday that it is struggling to keep emergency operations running in Sudan, where more than 1,000 days of war have pushed families to the brink.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166766",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Myanmar begins defence in landmark genocide case at UN World Court",
      "description": "Myanmar on Friday rejected allegations of genocide against the Rohingya minority, telling the International Court of Justice (ICJ) that the Gambia’s case rests on “unsubstantiated allegations,” as public hearings continued in a landmark case on the application of the Genocide Convention.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166782",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Dozens of dogs killed in fire at home of ‘breeder’ in Washington state, firefighters rescue 3 from flames",
      "description": "Fire officials in Washington state are investigating a deadly blaze that killed about 40 dogs at the home of a man who claimed to be dog breeder.",
      "url": "https://www.foxnews.com/us/dozens-dogs-killed-fire-home-breeder-washington-state-firefighters-rescue-3-from-flames",
      "published": "Sun, 18 Jan 2026 10:18:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Europe warns of 'dangerous downward spiral' after Trump threatens tariffs over Greenland",
      "description": "The eight European countries targeted by U_S_ President Donald Trump for a 10% tariff for opposing American control of Greenland have criticized the move in an unusually strong joint statement, warning that his threats “undermine transatlantic relation...",
      "url": "https://abcnews.go.com/International/wireStory/europe-warns-dangerous-downward-spiral-after-trump-threatens-129324725",
      "published": "Sun, 18 Jan 2026 11:13:54 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Game-changing international ocean treaty comes into force",
      "description": "Almost two decades in the making, an international agreement to protect and sustainably use marine life in international waters and the international seabed is due to come into force on Saturday, marking a major step forward in efforts to ensure the health of ocean ecosystems for decades to come.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166762",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: UN urges ‘maximum restraint’ to avert more death, wider escalation",
      "description": "As nationwide protests in Iran appear to ease after nearly three weeks of unrest and bloodshed, a senior UN official called on Thursday for action to prevent further escalation.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166773",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran’s supreme leader acknowledges thousands killed as Trump calls for new leadership: reports",
      "description": "Iran's supreme leader Khamenei reportedly acknowledges thousands died in recent protests for the first time, as death toll estimates reach over 3,000.",
      "url": "https://www.foxnews.com/world/irans-supreme-leader-acknowledges-thousands-killed-trump-calls-new-leadership",
      "published": "Sat, 17 Jan 2026 20:28:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Sydney Harbour shark attack: second incident in two days as police warn against swimming",
      "description": "Police praise fast actions and bravery of boy’s friends on Sunday as he faces ‘fight for his life’ in hospital Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A 12-year-old boy is in for the “fight of his life” after being attacked by a large shark in Sydney Harbour on Sunday afternoon, with police warning against people entering the water at nearby swimming spots. In a separate incident on Monday, a shark attacked an 11-year-old boy at Dee Why, in the city’s north. The shark left multiple bite marks on his board but the boy was unharmed. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/19/sydney-shark-attack-boy-nielsen-park-water-conditions",
      "published": "Mon, 19 Jan 2026 05:56:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Surging billionaire wealth leads to ‘dangerous’ political risks, Oxfam warns as Davos forum opens",
      "description": "The world’s billionaires grew richer than ever in 2025, charity Oxfam said on Monday, warning of “highly dangerous” political consequences as elites gather at the World Economic Forum in Davos, Switzerland. It said US President Donald Trump’s policies helped boost billionaire wealth 16.2 percent to $18.3 trillion in the first year of his second term.",
      "url": "https://www.france24.com/en/economy/20260119-billionaire-wealth-political-oxfam-davos-trump-musk",
      "published": "Mon, 19 Jan 2026 00:31:18 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iran's president says any attack on Supreme Leader Khamenei would be declaration of war",
      "description": "Iranian President Masoud Pezeshkian warned on Sunday that any attack on the country's supreme leader Ayatollah Ali Khamenei would be tantamount to war. US President Donald Trump had on Saturday described the ayatollah as \"a sick man\", saying it was \"time to look for new leadership in Iran\".",
      "url": "https://www.france24.com/en/asia-pacific/20260118-iran-s-president-says-any-attack-on-supreme-leader-khamenei-would-be-declaration-of-war",
      "published": "Sun, 18 Jan 2026 21:17:40 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Gang violence in Guatemala kills 7 police officers after inmates take over prisons",
      "description": "Suspected gang members in Guatemala’s capital have killed seven police officers",
      "url": "https://abcnews.go.com/International/wireStory/gang-violence-guatemala-kills-7-police-officers-after-129328139",
      "published": "Sun, 18 Jan 2026 18:33:29 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Iran supreme leader acknowledges thousands killed during recent protests",
      "description": "Ayatollah Ali Khamenei says some deaths were “inhuman” and “savage” but blames the US.",
      "url": "https://www.bbc.com/news/articles/ckglee733wno?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 20:14:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Netherlands ushers in Spring with National Tulip Day celebration",
      "description": "The Netherlands celebrated National Tulip Day on Saturday, marking the upcoming arrival of spring and the start of the tulip season. Dutch tulip growers arranged around 200,000 tulips in a vibrant display for visitors to pick from. The country is the world's largest producer and exporter of tulips.",
      "url": "https://www.france24.com/en/netherlands-ushers-in-spring-with-national-tulip-day-celebration",
      "published": "Sun, 18 Jan 2026 15:25:38 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran internet shutdown: activists warn of 'permanent' blackout",
      "description": "Iran is 10 days into an internet blackout, which rights groups say is intended to prevent further protests and conceal the regime's deadly crackdown. What happens now is unclear. Iranian digital activists are warning the blackout may become \"permanent,\" but local media report that the authorities are considering a gradual return to the internet.",
      "url": "https://www.france24.com/en/tv-shows/tech-24/20260118-iran-internet-shutdown-activists-warn-of-permanent-blackout",
      "published": "Sun, 18 Jan 2026 15:00:53 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Indonesian rescuers find plane wreckage in mountainous region",
      "description": "Indonesian rescuers have recovered wreckage from a missing plane believed to have crashed with 11 people on board",
      "url": "https://abcnews.go.com/International/wireStory/indonesian-rescuers-find-wreckage-plane-mountainous-region-129323471",
      "published": "Sun, 18 Jan 2026 00:48:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Gaza humanitarian crisis ‘far from being over,’ UN aid coordination office warns",
      "description": "Three months into the ceasefire in the Gaza Strip, the UN and partners have delivered tonnes of assistance items and carried out critical repairs, but this is only a temporary “Band-Aid” solution, a veteran aid worker has warned.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166784",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Factory explosion in China's Inner Mongolia region kills 2 and hospitalizes 66",
      "description": "An explosion at a factory in China's Inner Mongolia region has killed two people and left 66 others hospitalized",
      "url": "https://abcnews.go.com/International/wireStory/factory-explosion-chinas-mongolia-region-kills-2-hospitalizes-129325160",
      "published": "Sun, 18 Jan 2026 07:43:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "‘Night of deep pain’: Train crash in southern Spain leaves 39 dead",
      "description": "Emergency response teams deploy to assist victims following the high-speed train collision in southern Spain.",
      "url": "https://www.aljazeera.com/news/2026/1/18/two-high-speed-trains-collide-in-spain-killing?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 22:27:08 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "European leaders warn Trump's Greenland tariffs threaten 'dangerous downward spiral'",
      "description": "In a joint statement, leaders of eight countries said they stand in \"full solidarity\" with Denmark and Greenland. Denmark's Prime Minister Mette Frederiksen added: \"Europe will not be blackmailed.\"",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5681422/european-leaders-greenland-tariffs-downward-spiral",
      "published": "Sun, 18 Jan 2026 14:36:56 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Syrian government announces a ceasefire with the Kurdish-led Syrian Democratic Forces",
      "description": "Syria's new leaders, since toppling Bashar Assad in December 2024, have struggled to assert their full authority over the war-torn country.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5681406/syrian-government-ceasefire-kurdish-syrian-democratic-forces",
      "published": "Sun, 18 Jan 2026 13:39:48 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "High-speed train collision in southern Spain kills at least 39",
      "description": "At least 39 people were killed and several others injured when two trains collided in southern Spain on Sunday, Spanish ‌broadcaster RTVE reported ‍on Monday, citing police sources.",
      "url": "https://www.france24.com/en/europe/20260118-rail-accident-spain-trains-collide",
      "published": "Sun, 18 Jan 2026 22:23:39 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Man allegedly assaulted with flagpole by Minneapolis anti-ICE agitators in violent parking garage attack",
      "description": "Jake Lang, a pardoned Jan. 6 rioter, was also allegedly attacked during anti-ICE protests, Saturday, outside Minneapolis City Hall.",
      "url": "https://www.foxnews.com/us/man-allegedly-assaulted-flagpole-minneapolis-anti-ice-agitators-violent-parking-garage-attack",
      "published": "Sat, 17 Jan 2026 22:54:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Secretary-General on UN at 80: Humanity strongest when we stand as one",
      "description": "Powerful forces are lining up to undermine global cooperation, United Nations Secretary-General António Guterres warned at a landmark event in London on Saturday to commemorate the 80th anniversary of the General Assembly, but he urged that “humanity is strongest when we stand as one”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166783",
      "published": "Sat, 17 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "World News in Brief: Gaza education update, the General Assembly at 80, Venezuela’s humanitarian needs",
      "description": "More children in war-ravaged Gaza are now back in the classroom, the UN aid coordination office (OCHA) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166781",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "European leaders warn Trump tariffs over Greenland 'risk a dangerous downward spiral'",
      "description": "European leaders unite against Trump's tariff threats over Greenland acquisition, warning of damage to transatlantic relations as tensions escalate.",
      "url": "https://www.foxnews.com/world/european-leaders-warn-trump-tariffs-over-greenland-risk-dangerous-downward-spiral",
      "published": "Sun, 18 Jan 2026 09:46:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "A deadly fire swept through a nightclub in just 90 seconds. I got out",
      "description": "Twenty-two years before the Swiss ski resort fire, Gina escaped a near-identical disaster. Would you know what to do if it happened to you?",
      "url": "https://www.bbc.com/news/articles/czejykzg77po?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 00:08:10 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "DOJ says won’t investigate ICE agent’s fatal shooting of Renee Good",
      "description": "US Justice Department says no to probing the ICE agent, despite public outrage over Renee Good's shooting in Minnesota.",
      "url": "https://www.aljazeera.com/news/2026/1/19/doj-says-wont-investigate-ice-agents-fatal-shooting-of-renee-good?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 05:02:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US launches new retaliatory strike in Syria, killing leader tied to deadly Islamic State ambush",
      "description": "A third round of retaliatory strikes by the U.S. in Syria has resulted in the death of an Al-Qaeda-affiliated leader, said U.S. Central Command.",
      "url": "https://www.npr.org/2026/01/17/g-s1-106418/us-strike-syria-islamic-state-ambush",
      "published": "Sat, 17 Jan 2026 17:09:12 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Aid cuts push millions in West and Central Africa deeper into hunger",
      "description": "A staggering 55 million people across West and Central Africa are expected to suffer crisis levels of hunger, or worse, during the lean season from June to August as funding cuts to humanitarian operations continue amid rising violence and displacement.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166776",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "In Gaza, 800,000 people now live in dangerous locations prone to flooding",
      "description": "Fighting the harsh winter storms in Gaza, Amina stays awake at night, hitting the canvas of the tent above her head to prevent it from collapsing under the pooled water.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166770",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Myanmar’s Rohingya people called ‘Muslim dogs’ before attacks, ICJ hears",
      "description": "Hearings continued on Thursday at the UN’s top court into the Gambia’s claim that Myanmar committed genocide against the Rohingya people, with allegations that military officials incited violence through hate speech, calling the ethnic minority “Muslim dogs” who should be made “extinct”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166764",
      "published": "Thu, 15 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Yemen’s fragile calm unravels as hunger and aid restrictions deepen crisis",
      "description": "A fragile political calm in Yemen is fraying, with renewed instability and aid restrictions deepening hunger, illness and displacement for millions of civilians, senior UN officials warned the Security Council on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166761",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Grieving father says daughter’s death by illegal alien shows cost of sanctuary policies",
      "description": "A year after Katie Abraham was killed by an illegal immigrant, her father Joe faults Gov. JB Pritzker’s weak policies and backs DHS’s Operation Midway Blitz.",
      "url": "https://www.foxnews.com/us/grieving-father-says-daughters-death-illegal-alien-shows-cost-sanctuary-policies",
      "published": "Sun, 18 Jan 2026 17:50:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "‘Long Island Lolita’ survivor Mary Jo Buttafuoco says bullet in her head ‘will get me eventually’",
      "description": "From near-fatal shooting to addiction recovery, Mary Jo Buttafuoco's journey of survival and healing is told in a new biopic, \"I Am Mary Jo Buttafuoco.\"",
      "url": "https://www.foxnews.com/us/long-island-lolita-survivor-mary-jo-buttafuoco-bullet-head-will-get-me-eventually",
      "published": "Sun, 18 Jan 2026 14:00:50 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "US believes its power matters more than international law, UN chief tells BBC",
      "description": "António Guterres says Washington's \"clear conviction\" is that multilateral solutions are irrelevant.",
      "url": "https://www.bbc.com/news/articles/c4g0zx0llpzo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 06:17:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Factory explosion in China kills two, injures 84",
      "description": "The blast caused noticeable tremors in the area and sent large plumes of smoke into the sky.",
      "url": "https://www.bbc.com/news/articles/c5y2pg28lgjo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 00:53:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "8 fun facts about Dolly Parton for her 80th birthday",
      "description": "Dolly Parton is one of the world's most successful artists. Now 80, she has an eventful life to look back over. Here are some important and extraordinary facts about the country music icon.",
      "url": "https://www.dw.com/en/8-fun-facts-about-dolly-parton-for-her-80th-birthday/a-75503168?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 16:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "East Jerusalem: Forced shutdown of UN clinic signals escalating disregard for international law",
      "description": "The temporary closure of a UN-run health centre in East Jerusalem is the latest phase in “a pattern of deliberate disregard” for international law, the head of the UN agency that assists Palestine refugees, UNRWA, said on Wednesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166760",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "California man kills wife, teen daughter in murder-suicide: authorities",
      "description": "Los Angeles County shooting leaves three dead in apparent murder-suicide as 19-year-old daughter escapes gunfire unharmed, sheriff's deputies report.",
      "url": "https://www.foxnews.com/us/california-man-kills-wife-teen-daughter-murder-suicide-authorities",
      "published": "Sun, 18 Jan 2026 14:30:58 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Iran accused of killing 16,500 in sweeping ‘genocide’ crackdown: report",
      "description": "Supreme Leader Ayatollah Ali Khamenei acknowledges thousands killed in Iran protests as regime allegedly accelerates executions to more than eight per day.",
      "url": "https://www.foxnews.com/world/iran-accused-killing-16500-sweeping-genocide-crackdown-report",
      "published": "Sun, 18 Jan 2026 22:07:43 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Khamenei calls Trump a ‘criminal,’ blames him for deadly protests sweeping Iran",
      "description": "Iran's supreme leader accused President Donald Trump of orchestrating protests as tensions escalate. State radio broadcasts threats as thousands reported dead.",
      "url": "https://www.foxnews.com/world/khamenei-calls-trump-criminal-blames-him-deadly-protests-sweeping-iran",
      "published": "Sat, 17 Jan 2026 07:49:25 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "FAA warns about flying in Central, South America and eastern Pacific, citing possible ‘military activities’",
      "description": "The FAA issued a series of flight safety warnings for U.S. airlines flying over the eastern Pacific near Mexico, Central America and South America",
      "url": "https://www.foxnews.com/world/faa-warns-about-flying-central-south-america-eastern-pacific-citing-possible-military-activities",
      "published": "Sat, 17 Jan 2026 07:20:10 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Rare twins born in DRC raise cautious hope for endangered mountain gorillas",
      "description": "Virunga park ranger says babies are well cared for by mother Mafuko but high infant mortality makes first weeks critical It was noon by the time Jacques Katutu first saw the newborn mountain gorillas. Cradled in the arms of their mother, Mafuko, the tiny twins clung to her body for warmth in the forest clearing in Virunga national park, in eastern Democratic Republic of the Congo (DRC). Katutu, head of gorilla monitoring in Virunga, has seen dozens of newborns in his 15 years as a ranger. But, he tells the Guardian, even he was touched by the sight of the fragile infant males, who face serious obstacles if they are to become silverbacks one day. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/17/twin-baby-mountain-gorilla-virunga-drc-survival-conservation-aoe",
      "published": "Sat, 17 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "At least 39 dead in Spain train collision as rescuers search for more bodies",
      "description": "Spanish police said Monday that at least 39 people died in the a high-speed train collision Sunday in southern Spain and rescue efforts were continuing.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5681493/spain-train-derailment",
      "published": "Sun, 18 Jan 2026 19:58:40 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Death toll rises to 6 in a fire at a shopping plaza in Pakistan’s city of Karachi",
      "description": "Firefighters in Karachi are battling a blaze at a multistory shopping plaza that erupted overnight, killing six people, including a firefighter",
      "url": "https://abcnews.go.com/International/wireStory/death-toll-rises-6-fire-shopping-plaza-pakistans-129324832",
      "published": "Sun, 18 Jan 2026 07:45:59 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "Fourteen dead, dozens missing in massive Pakistan mall fire",
      "description": "The blaze at the Gul Plaza in Karachi raged for more than 24 hours before it was put out.",
      "url": "https://www.bbc.com/news/articles/c150pg5dvp2o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 05:22:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Aftermath of deadly train collision in southern Spain",
      "description": "Video shows the aftermath of a fatal rail accident in southern Spain, where a high-speed train derailed.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/aftermath-of-deadly-train-collision-in-southern-spain?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 07:31:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Greenland row: EU to hold emergency summit on Trump tariffs",
      "description": "EU leaders will meet in the coming days after President Donald Trump threatened tariffs on eight countries in a dispute over Greenland. Plus, France wants the bloc to use its so-called trade \"bazooka.\" Follow the latest.",
      "url": "https://www.dw.com/en/greenland-row-eu-to-hold-emergency-summit-on-trump-tariffs/live-75550031?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 13:39:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "How can Europe respond to Trump's tariff threats over Greenland?",
      "description": "FRANCE 24 Brussels correspondent Pierre Benazet talks about the closed-door crisis meeting between ambassadors from all 27 European Union members following US President Donald Trump's decision to slap tariffs on eight nations accused of opposing his efforts to annex the Danish autonomous territory of Greenland.",
      "url": "https://www.france24.com/en/how-can-europe-respond-to-trump-s-tariff-threats-over-greenland",
      "published": "Sun, 18 Jan 2026 17:55:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "The misunderstanding that may have triggered Trump's latest Greenland threat",
      "description": "Sir Keir Starmer had wanted this week to get on with his \"cost of living tour\" of the country to tap into voters' concerns in this all-important election year.",
      "url": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
      "published": "Sun, 18 Jan 2026 19:26:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Spanish official says authorities estimate more than 20 people were killed in high-speed train crash in southern Spain",
      "description": "Spanish official says authorities estimate more than 20 people were killed in high-speed train crash in southern Spain",
      "url": "https://abcnews.go.com/International/wireStory/spanish-official-authorities-estimate-20-people-killed-high-129335740",
      "published": "Sun, 18 Jan 2026 18:33:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "High-speed trains collide after one derails in southern Spain, killing at least 20",
      "description": "A senior official says authorities estimate that more than 20 people were killed in high-speed train crash in southern Spain",
      "url": "https://abcnews.go.com/International/wireStory/high-speed-trains-collide-after-derails-southern-spain-129334242",
      "published": "Sun, 18 Jan 2026 18:33:49 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Peacekeeping: Lacroix warns of rising threats to ‘blue helmets’ in Middle East",
      "description": "Peacekeeping operations in the Middle East are facing mounting security risks, funding pressures and political uncertainty, the head of UN peacekeeping warned on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166779",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Syria agrees ceasefire with Kurdish-led forces after two weeks of clashes",
      "description": "President Ahmed al-Sharaa said the deal would allow the Syrian state to reassert control over most areas.",
      "url": "https://www.bbc.com/news/articles/c4gwk37ewvwo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 22:25:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Fewer orphans globally, due to HIV medication provided by the U.S.",
      "description": "Until last year, the number of children orphaned because a parent died from AIDS, was plummeting. That's thanks to America's 20 year effort to get lifesaving HIV meds to millions in need. But last years upheaval in foreign aid funding is raising concern that more children will be at risk of losing a parent to the deadly virus.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5669408/fewer-orphans-globally-due-to-hiv-medication-provided-by-the-u-s",
      "published": "Sun, 18 Jan 2026 17:22:45 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "The UN is ‘worth fighting for’: General Assembly President",
      "description": "With the multilateral system under pressure and under attack, Member States must fight for the United Nations, the President of the General Assembly said on Wednesday, laying out her priorities for its resumed 80th session.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166763",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "US Pentagon orders troops to prepare for potential Minnesota deployment",
      "description": "Arctic specialist troops would join 3,000 federal immigration agents patrolling Minneapolis and St Paul amid protests.",
      "url": "https://www.aljazeera.com/news/2026/1/19/pentagon-orders-troops-to-prepare-for-potential-minnesota-deployment?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 02:46:16 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Spain: High-speed train crash leaves at least 39 dead",
      "description": "A high-speed train traveling from Malaga to Madrid derailed, crashing into an oncoming train in southern Andalusia. At least 39 people have died with dozens rushed to hospital with injuries. DW has the latest.",
      "url": "https://www.dw.com/en/spain-high-speed-train-crash-leaves-at-least-39-dead/live-75556054?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 00:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Syria's government says it has struck ceasefire deal with Kurdish-led forces",
      "description": "Damascus on Sunday announced a ceasefire deal with the Kurdish-led Syrian Democratic Forces (SDF) as Syrian troops continued a deadly advance through Kurdish-held territories in the country's northeast. The deal would see SDF forces merged into the government's defence and interior ministries.",
      "url": "https://www.france24.com/en/middle-east/20260118-syrian-government-says-it-has-struck-ceasefire-deal-with-kurdish-led-forces",
      "published": "Sun, 18 Jan 2026 17:12:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Viral video shows ICE agent telling agitators they're disrupting arrest of child sex offender in Minnesota",
      "description": "Viral video shows alleged interference with ICE operation targeting suspected child sex offender in Minnesota. Federal agents confronted by protesters.",
      "url": "https://www.foxnews.com/us/viral-video-shows-ice-agent-telling-agitators-theyre-disrupting-arrest-child-sex-offender-minnesota",
      "published": "Sun, 18 Jan 2026 22:34:48 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "ICE says 2 demonstrators were arrested in Minnesota for allegedly assaulting officers",
      "description": "Two protesters allegedly assaulted federal officers during anti-ICE demonstrations in Minnesota, leading to their arrests as clashes between protesters and officers continue.",
      "url": "https://www.foxnews.com/us/ice-says-2-demonstrators-were-arrested-minnesota-allegedly-assaulting-officers",
      "published": "Sun, 18 Jan 2026 21:49:57 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minneapolis posts anti-ICE video promoting 'peaceful protest' and unity",
      "description": "Minneapolis releases anti-ICE video promoting \"peaceful protest\" as tensions escalate. Federal agents face harassment while troops prepare for deployment.",
      "url": "https://www.foxnews.com/us/minneapolis-posts-anti-ice-video-promoting-peaceful-protest-unity",
      "published": "Sun, 18 Jan 2026 11:48:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Minnesota National Guard placed on standby to support law enforcement as protests turn violent",
      "description": "Minnesota National Guard members will wear yellow reflective vests to distinguish themselves from other law enforcement if activated during anti-ICE protests.",
      "url": "https://www.foxnews.com/us/minnesota-national-guard-placed-standby-support-law-enforcement-protests-turn-violent",
      "published": "Sat, 17 Jan 2026 18:21:24 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Trump announces escalating tariffs on Denmark and other European nations to force Greenland purchase deal",
      "description": "President Donald Trump threatens steep tariffs on European nations unless Denmark sells Greenland to the U.S., citing national defense and security.",
      "url": "https://www.foxnews.com/world/trump-announces-escalating-tariffs-denmark-other-european-nations-force-greenland-purchase-deal",
      "published": "Sat, 17 Jan 2026 11:51:32 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "'I want to show the world what Africa is': YouTube star brings joy and tears on tour",
      "description": "\"I love the love in Africa. The energy here is crazy,\" he says on his maiden tour of the continent.",
      "url": "https://www.bbc.com/news/articles/c5y5le7yl7po?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 00:21:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "China says GDP grew 5% in 2025, among weakest expansions in decades",
      "description": "The world's second-largest economy slowed to 4.5 percent growth in the final quarter, data shows.",
      "url": "https://www.aljazeera.com/economy/2026/1/19/china-says-economy-grew-5-in-2025?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 03:09:20 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Canada PM hails strategic partnership with China to adapt to ‘new global realities’",
      "description": "Mark Carney holds talks with Xi Jinping on rare Beijing trip as Canada seeks to diversify trade links away from US Business live – latest updates Canada’s prime minister, Mark Carney, has hailed a “new strategic partnership” with China as he held talks in Beijing with President Xi Jinping , the first visit by a Canadian leader in eight years. Addressing Xi in the Great Hall of the People, Carney said: “Together we can build on the best of what this relationship has been in the past to create a new one adapted to new global realities.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/china-canada-partnership-new-global-realities-carney-xi-jinping",
      "published": "Fri, 16 Jan 2026 09:37:10 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "United Nations leaders bemoan global turmoil as the General Assembly turns 80",
      "description": "On Saturday, the UNGA celebrated its 80th birthday in London. Speakers including U.N. Secretary-General António Guterres addressed global uncertainty during the second term of President Trump.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5678366/united-nations-general-assembly-80-london",
      "published": "Sun, 18 Jan 2026 16:11:13 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Germany: A push to reduce the number of federal states",
      "description": "Bavaria's State Premier Markus Söder wants to change Germany's political map, but his proposal to merge federal states is meeting with resistance.",
      "url": "https://www.dw.com/en/germany-a-push-to-reduce-the-number-of-federal-states/a-75541520?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 16:14:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Will Turkey export home-grown 'Islamic State' extremists?",
      "description": "Turkey is no longer just a transit country for one branch of the extremist \"Islamic State\" group. Experts say the group has become more professional in Turkey and could pose a danger domestically, and abroad.",
      "url": "https://www.dw.com/en/will-turkey-export-home-grown-islamic-state-extremists/a-75544113?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 06:35:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Trump’s tariff policies: Pressuring rivals and alienating allies",
      "description": "During his second term, President Donald Trump used tariffs not only to rebalance trade but to pressure both allies and rivals into aligning with his policies. While this approach has raised tensions, critics argue it’s damaging US relations and global standing.",
      "url": "https://www.france24.com/en/trump-s-tariff-policies-pressuring-rivals-and-alienating-allies",
      "published": "Sun, 18 Jan 2026 16:36:26 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Surgeon ex in Ohio dentist murders job hopped across country, dodged lawsuits after divorce",
      "description": "Ohio doctor faces murder charges in alleged killing of divorced wife and her husband. McKee worked across states before Columbus arrest in shocking case.",
      "url": "https://www.foxnews.com/us/surgeon-ex-ohio-dentist-murders-job-hopped-across-country-dodged-lawsuits-after-divorce",
      "published": "Sun, 18 Jan 2026 10:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Six countries confirm US invitations to Gaza peace board",
      "description": "Trump invites multiple countries, including Jordan, Greece and India, to join his \"Board of Peace\" for Gaza reconstruction and governance oversight.",
      "url": "https://www.foxnews.com/world/six-countries-confirm-us-invitations-gaza-peace-board",
      "published": "Sun, 18 Jan 2026 14:21:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "World Economic Forum invites Iranian foreign minister to Davos after regime slaughter of Iranian civilians",
      "description": "World Economic Forum is facing calls to exclude Iranian officials from Davos after the regime slaughtered thousands of its civilians, rights groups say.",
      "url": "https://www.foxnews.com/world/world-economic-forum-invites-iranian-foreign-minister-davos-after-regime-slaughter-iranian-civilians",
      "published": "Sun, 18 Jan 2026 12:04:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Protests explode in Greenland amid Trump takeover push: 'We are not interested in being Americans'",
      "description": "Thousands marched in Greenland wearing \"Make America Go Away\" hats, rejecting Trump's purchase demands and tariff threats saying, \"We are not interested in being Americans.\"",
      "url": "https://www.foxnews.com/world/protests-explode-greenland-amid-trump-takeover-push-we-not-interested-being-americans",
      "published": "Sat, 17 Jan 2026 18:16:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Lindsey Graham speaks against pending execution of 26-year-old Iranian protester: 'This regime must fall'",
      "description": "Sen. Lindsey Graham calls for Iranian regime change as 26-year-old protester Erfan Soltani faces possible execution despite President Donald Trump's threats.",
      "url": "https://www.foxnews.com/world/lindsey-graham-speaks-against-pending-execution-26-year-old-iranian-protester-this-regime-must-fall",
      "published": "Sat, 17 Jan 2026 13:39:12 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Gangland killing at a funeral shocks idyllic French island",
      "description": "Corsica is shaken by the shooting, which brings into stark relief one of the highest murder rates in France.",
      "url": "https://www.bbc.com/news/articles/c620nq38y6po?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 00:08:38 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria’s President al-Sharaa to meet SDF leader Abdi after ceasefire deal",
      "description": "Talks follow a truce that ended days of fighting and brought Syrian Democratic Forces under state control.",
      "url": "https://www.aljazeera.com/news/2026/1/19/syrias-president-al-sharaa-to-meet-sdf-leader-abdi-after-ceasefire-deal?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 07:46:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,425",
      "description": "These are the key developments from day 1,425 of Russia’s war on Ukraine.",
      "url": "https://www.aljazeera.com/news/2026/1/18/russia-ukraine-war-list-of-key-events-day-1425?traffic_source=rss",
      "published": "Sun, 18 Jan 2026 23:54:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Yoweri Museveni wins Ugandan election as opponent condemns ‘fake result’",
      "description": "Museveni’s opponent, Bobi Wine, alleges that members of polling staff were kidnapped and called for peaceful protests Yoweri Museveni, has won the Ugandan election and his seventh term with more than 70% of the vote, state election authorities have said, amid an internet shutdown and claims of fraud by his opponent. His opponent, a youthful musician known as Bobi Wine, condemned what he called “fake results” and alleged that members of polling staff were kidnapped, among other election irregularities. He called for peaceful protests to pressure the authorities to release what he called the “rightful results”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/17/yoweri-museveni-wins-ugandan-election-as-opponent-condemns-fake-result",
      "published": "Sat, 17 Jan 2026 17:20:15 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Brazil’s Bolsonaro finds novel way to reduce 27-year sentence: reading books",
      "description": "Former president convicted for coup plot to take advantage of law that knocks four days off jail term for each book read Jair Bolsonaro’s lawyers appear to have been reading up on the country’s penal code and have found a way to help their client reduce the 27-year prison sentence he received last year for plotting a coup: by reading books. There is only one problem: the former far-right Brazilian president has never been known as a bibliophile. “Sorry, I don’t have time to read,” Bolsonaro once declared. “It’s been three years since I read a book.” Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/brazil-jair-bolsonaro-reduce-sentence-reading-books",
      "published": "Fri, 16 Jan 2026 13:19:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korea sentences ex-president to five years in first martial law verdict",
      "description": "Yoon Suk Yeol’s conviction for obstructing own arrest separate from main trial that could lead to death penalty A South Korean court has sentenced former president Yoon Suk Yeol to five years in prison for mobilising presidential security forces to block his own arrest and abusing his powers. It is the first judicial ruling linked to the events surrounding his failed martial law declaration in December 2024. The ruling is separate from Yoon’s main insurrection trial, where prosecutors earlier this week sought the death penalty and a verdict is due next month. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/south-korea-sentences-ex-president-yoon-suk-yeol-five-years-first-martial-law-verdict",
      "published": "Fri, 16 Jan 2026 09:51:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "WEF: Donald Trump set to dominate Davos 2026",
      "description": "Weeks after attacking Venezuela, capturing its controversial leader, and reviving Greenland ambitions, the US president's presence in Davos is expected to raise the stakes at WEF's annual meeting.",
      "url": "https://www.dw.com/en/wef-donald-trump-set-to-dominate-davos-2026/a-75509182?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Mon, 19 Jan 2026 05:49:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Syria announces new ceasefire deal with Kurdish-led SDF",
      "description": "The deal follows advances by the Syrian military into northern and eastern areas previously under the control of Syrian Democratic Forces, or SDF. DW has the latest.",
      "url": "https://www.dw.com/en/syria-announces-new-ceasefire-deal-with-kurdish-led-sdf/live-75553804?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 17:07:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Austria: Eight people killed in three avalanches",
      "description": "Officials said fresh snowfall in the Austrian Alps is poorly bonded to older layers on the peaks, increasing the risk of repeated avalanches, and urged extreme caution.",
      "url": "https://www.dw.com/en/austria-eight-people-killed-in-three-avalanches/a-75551698?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 09:17:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Senegal beat Morocco 1-0 in chaotic AFCON 2025 final",
      "description": "A freak final, as Senegal players walk-off the pitch after Morocco were awarded a last-minute penalty. Brahim Diaz saw his attempt of a panenka saved, only for Pape Gueye to score the winning goal in extra time as Senegal lifted the trophy (1-0) for the second time.",
      "url": "https://www.france24.com/en/tv-shows/africa-cup-of-nations/20260118-senegal-beats-morocco-1-0-in-chaotic-afcon-2025-final",
      "published": "Sun, 18 Jan 2026 23:26:56 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ceasefire declared between Syrian government and Kurdish-led forces",
      "description": "A ceasefire has been declared between Syrian government troops and US-backed Kurdish-led forces, according to state media.",
      "url": "https://news.sky.com/story/syrian-army-seizes-oil-and-gas-fields-after-fighting-kurdish-led-forces-13495795",
      "published": "Sun, 18 Jan 2026 10:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "More than 200,000 homes without power in Russian-occupied Ukraine, official says",
      "description": "Moscow kept up its hammering of Ukraine’s energy grid in overnight attacks.",
      "url": "https://abcnews.go.com/International/wireStory/drone-strikes-cut-power-200000-homes-russian-occupied-129325842",
      "published": "Sun, 18 Jan 2026 10:09:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "UN rights chief bears witness to trauma and resilience in Sudan",
      "description": "Nearly three years of war have plunged Sudan “into an abyss of unimaginable dimensions” and human rights must be at the centre of efforts to end the fighting and build lasting peace, the UN High Commissioner for Human Rights said on Sunday in Nairobi.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166785",
      "published": "Sun, 18 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Democratic Socialists of America in NYC training thousands of activists to counter ICE: report",
      "description": "NYC's Democratic Socialists of America chapter reportedly plans to train 4,000 volunteers for \"rapid response\" against anticipated federal immigration enforcement operations.",
      "url": "https://www.foxnews.com/us/democratic-socialists-america-nyc-training-thousands-activists-counter-ice-report",
      "published": "Sun, 18 Jan 2026 13:14:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Professors were disciplined for vulgar posts after Charlie Kirk's assassination: Where are they now?",
      "description": "Professors fired for controversial posts about Charlie Kirk's assassination have been reinstated at their universities as the spring semester begins.",
      "url": "https://www.foxnews.com/us/professors-disciplined-vulgar-posts-after-charlie-kirk-assassination-where-are-they-now",
      "published": "Sun, 18 Jan 2026 08:00:35 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "One of Tyler Robinson's last meals as a free man may have been a steak dinner — medium rare",
      "description": "Tyler Robinson's potential last meal as a free man was traced to a Utah steakhouse before the Charlie Kirk shooting arrest, a restaurant owner told FBI investigators.",
      "url": "https://www.foxnews.com/us/one-tyler-robinson-last-meals-free-man-may-have-been-steak-dinner-medium-rare",
      "published": "Sat, 17 Jan 2026 16:00:03 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian regime elites allegedly move millions of dollars out of country amid sanctions",
      "description": "Treasury sanctions target Iran's shadow banking as Mojtaba Khamenei allegedly transferred $328 million overseas according to Treasury Department reports.",
      "url": "https://www.foxnews.com/world/iranian-regime-elites-allegedly-move-tens-millions-dollars-out-country-amid-sanctions",
      "published": "Sun, 18 Jan 2026 20:29:51 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ukrainian drone strikes leave hundreds of thousands without power across Russian-controlled area",
      "description": "Ukrainian drone strikes against Russian energy infrastructure left over 200,000 without power as both sides continue targeting electrical grids.",
      "url": "https://www.foxnews.com/world/ukrainian-drone-strikes-leave-hundreds-thousands-without-power-across-russian-controlled-area",
      "published": "Sun, 18 Jan 2026 14:07:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Argentina's bungled hunt for Hitler's right-hand man Martin Bormann revealed in declassified files",
      "description": "Files show Argentina's bungled hunt for Hitler's henchman Martin Bormann, marked by mistaken arrests and bureaucratic incompetence in the post-war era.",
      "url": "https://www.foxnews.com/world/argentinas-bungled-hunt-hitlers-right-hand-man-martin-bormann-revealed-declassified-files",
      "published": "Sun, 18 Jan 2026 06:00:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Why a Chinese ‘mega embassy’ is not such a worry for British spies",
      "description": "Politicians are raising the alarm, while MI5 quietly welcomes the prospect of Beijing’s new London facility While there has been no shortage of politicians eager to raise concerns about China’s proposed “mega embassy” near the Tower of London, the espionage community quietly takes a different view, arguing that concerns about the development are exaggerated and misplaced. The domestic Security Service, MI5, is already quietly welcoming the prospect of rationalising China’s seven diplomatic sites to one, but a more significant argument is that modern technology and the nature of the Chinese threat means that, in the words of one former British intelligence officer, “embassies are less and less relevant”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/18/chinese-mega-embassy-london-british-spies-mi5-analysis",
      "published": "Sun, 18 Jan 2026 09:19:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "European governments condemn Trump's tariff threats over Greenland",
      "description": "European governments blasted US President Donald Trump’s announcement that eight countries will face 10% tariff for opposing American control of Greenland beginning next month. Denmark, Norway, Sweden, France, Germany, the United Kingdom, the Netherlands and Finland are on Trump's list, though it was not immediately clear if the tariffs would impact the European Union as a bloc.",
      "url": "https://www.france24.com/en/european-governments-condemn-trump-s-tariff-threats-over-greenland",
      "published": "Sun, 18 Jan 2026 15:22:22 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "EU leaders to hold extraordinary summit on Trump’s Greenland tariffs ‘in coming days’",
      "description": "European Council President Antonio Costa on Sunday said EU leaders would meet in the coming days to discuss US President Donald Trump's tariffs threat against eight nations opposing US control of the autonomous Danish territory of Greenland. The Financial Times reported that Europe is considering €93 billion worth of retaliatory tariffs against the US. Read our blog to see how the day's events unfolded.",
      "url": "https://www.france24.com/en/europe/20260118-live-european-nations-greenland-trump-tariffs-threat",
      "published": "Sun, 18 Jan 2026 13:47:02 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Trump admin preparing 1,500 soldiers for potential Minnesota deployment",
      "description": "The Trump administration is reportedly preparing 1,500 troops for potential deployment in Minnesota amid anti-ICE protests in the Twin Cities.",
      "url": "https://www.foxnews.com/us/trump-admin-preparing-1500-soldiers-potential-minnesota-deployment-report",
      "published": "Sun, 18 Jan 2026 07:35:46 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "High-speed train crash in Spain kills at least 39",
      "description": "More than 400 passengers were on board the trains that derailed near the city of Córdoba, in Spain's worst rail crash in more than a decade.",
      "url": "https://www.bbc.com/news/articles/cedw6ylpynyo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 08:20:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Around 1,500 US soldiers on standby for deployment to Minneapolis, officials say",
      "description": "The troops are an option should Donald Trump decide to use them to quell anti-ICE protests in the city, an official tells CBS News.",
      "url": "https://www.bbc.com/news/articles/c74v0pxg2nvo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 20:30:16 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Trump administration says deporting college student trying to surprise family was a ‘mistake’",
      "description": "Any Lucía López Belloza was detained at Boston’s airport in November and flown to Honduras two days later US citizens and permanent residents: have you been racially profiled by ICE? The Trump administration apologized in court for a “mistake” in the deportation of a Massachusetts college student who was detained trying to fly home to surprise her family in Texas for Thanksgiving. But the administration still argued that the federal government error should not affect her immigration case. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/16/trump-administration-mistake-college-student-detained",
      "published": "Fri, 16 Jan 2026 20:59:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "CIA chief visits Maduro successor as Machado vows to become Venezuela’s president",
      "description": "John Ratcliffe meets Delcy Rodríguez in Caracas less than two weeks after his agents helped to oust her precedessor The CIA chief whose agents reputedly played a key role in abducting Nicolás Maduro has flown to Venezuela to meet his successor as the sidelined opposition leader, María Corina Machado, vowed she would become the country’s first elected female president. Machado’s comments were broadcast on Friday, a day after she handed her Nobel peace prize medal to Donald Trump in recognition of what she called a principled and decisive move against Maduro, whom US special forces snatched on 3 January. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/16/cia-chief-visits-maduro-successor-as-machado-vows-to-become-venezuelas-president",
      "published": "Fri, 16 Jan 2026 17:23:11 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "China expected to get London embassy go-ahead this week after years of wrangling",
      "description": "Decision expected on Monday or Tuesday, potentially smoothing relations before Keir Starmer’s visit to China Why Chinese ‘mega embassy’ is not such a worry for British spies A decision on China’s proposed mega embassy in London is expected on Monday or Tuesday, with Chinese officials and British diplomats in Beijing holding their breath in anticipation of the planning application finally being approved. The saga, which has been running since 2018, is widely expected to end with the British government giving the green light for construction. If it does, one group likely to be grateful is those who work in the British embassy’s dilapidated building in Beijing. The UK’s plans to redevelop its outpost in China’s capital have been blocked for years by the Chinese government because of the London embassy row. Continue reading...",
      "url": "https://www.theguardian.com/politics/2026/jan/19/china-expected-to-get-london-embassy-go-ahead-uk",
      "published": "Mon, 19 Jan 2026 06:00:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "In Los Angeles, Iranian-Americans march against government crackdown in Iran",
      "description": "Marchers gathered Sunday in downtown L.A. against the Iranian crackdown on the protests that have taken place over recent weeks.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5680263/in-los-angeles-iranian-americans-march-against-government-crackdown-in-iran",
      "published": "Sun, 18 Jan 2026 17:18:02 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Germany news: Syrian president puts planned visit on hold",
      "description": "President Ahmad al-Sharaa has postponed his visit to Berlin, for talks with Chancellor Friedrich Merz, due to the political situation in his country. The repatriation of Syrian refugees was high on the agenda.",
      "url": "https://www.dw.com/en/germany-news-syrian-president-puts-planned-visit-on-hold/live-75545809?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 19:22:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Hong Kong: Life sentence looms for media tycoon Jimmy Lai",
      "description": "With the last stage of Jimmy Lai's national security trial drawing to a close, Hong Kong's High Court is set to decide on the sentence for the pro-democracy tycoon. Will Lai get life in prison?",
      "url": "https://www.dw.com/en/hong-kong-life-sentence-looms-for-media-tycoon-jimmy-lai/a-75516554?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 16:15:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "US: Anti-ICE protesters clash with far-right group in Minneapolis",
      "description": "Right-wing influencer Jake Lang, who organized a pro-ICE rally, had announced that he intended to \"burn a Quran\" on the steps of City Hall. A much larger group of people chased him and his supporters off the scene.",
      "url": "https://www.dw.com/en/us-anti-ice-protesters-clash-with-far-right-group-in-minneapolis/a-75551272?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 03:46:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Texas couple labeled fake ‘Chip and Joanna Gaines’ admits $5M dream home renovation scam",
      "description": "Texas couple allegedly defrauded over 40 homeowners of nearly $5M through fake construction business promoted on social media. The Judges face federal charges.",
      "url": "https://www.foxnews.com/us/texas-couple-labeled-fake-chip-joanna-gaines-admits-5m-dream-home-renovation-scam",
      "published": "Sun, 18 Jan 2026 16:00:13 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Illegal migrant workers caught on camera leaping across rooftops to escape Border Patrol in California raid",
      "description": "Dramatic video captured alleged illegal immigrants fleeing across California rooftops as federal agents conducted an enforcement raid at a construction site.",
      "url": "https://www.foxnews.com/us/illegal-migrant-workers-caught-camera-leaping-across-rooftops-escape-border-patrol-california-raid",
      "published": "Sat, 17 Jan 2026 17:54:16 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "National Guard troops will likely remain in DC through 2026, official says",
      "description": "National Guard troops likely will have their ongoing deployment to Washington, D.C., extended until the end of 2026, a U.S. official told Fox News.",
      "url": "https://www.foxnews.com/us/national-guard-troops-likely-remain-dc-through-2026-official-says",
      "published": "Sat, 17 Jan 2026 13:28:23 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "'Europe won't be blackmailed,' Danish PM says in wake of Trump Greenland threats",
      "description": "Trump says he will impose new taxes on eight US allies in February if they oppose his proposed takeover of the autonomous Danish territory.",
      "url": "https://www.bbc.com/news/articles/ceqz0llpnyqo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 07:15:40 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Syrians celebrate ceasefire deal between government and SDF",
      "description": "Celebrations erupted in Syria after a ceasefire between the government and the Kurdish-led SDF halted deadly fighting.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/syrians-celebrate-ceasefire-deal-between-government-and-sdf?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 07:47:18 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "European leaders slam Trump’s tariff threats over Greenland",
      "description": "European countries targeted by Trump's latest tariffs say they are united on 'upholding our sovereignty'.",
      "url": "https://www.aljazeera.com/news/2026/1/19/dangerous-downward-spiral-european-leaders-slam-trumps-tariff-threat?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 03:15:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Fear and internet blackouts make communication difficult for Iranians",
      "description": "While fears of an imminent US operation in Iran have receded, tensions remain sky high as street protests continue and communication is difficult due to fear and internet blackouts.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5678516/fear-and-internet-blackouts-make-communication-difficult-for-iranians",
      "published": "Sun, 18 Jan 2026 17:15:11 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Port Assab becomes flashpoint for Ethiopia–Eritrea relations",
      "description": "Addis Ababa's renewed calls for sea access threaten an already fragile relationship with Eritrea, drawing anger from Asmara.",
      "url": "https://www.dw.com/en/port-assab-becomes-flashpoint-for-ethiopia-eritrea-relations/a-75453946?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 08:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Live: EU leaders to meet 'in coming days' to discuss US tariffs over Greenland",
      "description": "EU leaders will meet “in the coming days” to coordinate their response on Greenland following US President Donald Trump's threats of tariffs, European Council President Antonio Costa announced on Sunday. Trump has insisted he will settle for nothing less than ownership of Denmark's autonomous territory. Follow our liveblog for all the latest developments.",
      "url": "https://www.france24.com/en/europe/20260119-live-eu-leaders-to-meet-in-the-coming-days-to-discuss-us-tariffs-over-greenland",
      "published": "Mon, 19 Jan 2026 06:24:57 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "AFCON 2025: Senegal stun hosts Morocco to win chaotic final",
      "description": "Senegal shocked hosts Morocco to win the Africa Cup of Nations final 1-0 on Sunday, with Pape Gueye scoring in extra time after a chaotic finish. Morocco missed a stoppage-time penalty when Brahim Diaz’s chipped effort was easily saved by goalkeeper Edouard Mendy following lengthy protests and disorder.",
      "url": "https://www.france24.com/en/sport/20260118-afcon-2025-senegal-morocco",
      "published": "Sun, 18 Jan 2026 23:36:35 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "<a href=\"https://www.skysports.com/football/senegal-vs-morocco/live/526845\" target=\"_blank\">Senegal win Africa Cup of Nations after players storm off pitch during dramatic final</a>",
      "description": "No description available.",
      "url": "https://news.sky.com/story/africa-cup-of-nations-players-storm-off-pitch-in-protest-during-dramatic-final-13496010",
      "published": "Sun, 18 Jan 2026 21:48:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ugandan election a 'fraudulent affair', Bobi Wine's lawyer says - as protesters face violent crackdown",
      "description": "President Yoweri Museveni has extended his 40-year reign over Uganda by another five years.",
      "url": "https://news.sky.com/story/ugandan-election-a-fraudulent-affair-bobi-wines-lawyer-says-as-protesters-face-violent-crackdown-13495674",
      "published": "Sat, 17 Jan 2026 20:23:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Ukraine: Families in ‘survival mode’ amid Russian strikes and deadly cold",
      "description": "Families across Ukraine are in “constant survival mode” amid ongoing waves of Russian missile and drone strikes that have left blocks without power for days at a time, while temperatures plunge to deadly lows, the UN Children's Fund (UNICEF) said on Friday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166774",
      "published": "Fri, 16 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anti-ICE mob storms Minnesota church over pastor's alleged ties to immigration enforcement",
      "description": "Anti-ICE agitators disrupted worship at Cities Church in St. Paul, chanting inside the sanctuary after claiming one of the pastors was affiliated with ICE.",
      "url": "https://www.foxnews.com/us/anti-ice-mob-storms-minnesota-church-over-pastors-alleged-ties-immigration-enforcement",
      "published": "Sun, 18 Jan 2026 19:47:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Hackers target Iran state TV satellite transmission to broadcast exiled crown prince",
      "description": "Hackers have disrupted Iranian state television to air footage supporting the exiled crown prince",
      "url": "https://abcnews.go.com/International/wireStory/hackers-target-iran-state-tvs-satellite-transmission-broadcast-129340123",
      "published": "Mon, 19 Jan 2026 01:52:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "More countries confirm invites to Trump's Board of Peace for Gaza. $1 billion buys a permanent seat",
      "description": "At least four more countries say the United States has invited them to join President Donald Trump’s new “Board of Peace\" overseeing next steps for Gaza",
      "url": "https://abcnews.go.com/International/wireStory/countries-confirm-invites-trumps-board-peace-gaza-1-129329341",
      "published": "Sun, 18 Jan 2026 11:13:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US troops pull out of major Iraq airbase amid ongoing regional consolidation effort, progress against ISIS",
      "description": "The U.S. withdrawal of troops from Ain al-Asad Airbase was completed by Friday as part of regional consolidation following progress on ISIS as CENTCOM calls for \"teamwork.\"",
      "url": "https://www.foxnews.com/world/us-troops-pull-out-major-iraq-airbase-amid-ongoing-regional-consolidation-effort-progress-against-isis",
      "published": "Sat, 17 Jan 2026 15:54:58 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Paracetamol is safe in pregnancy, says study refuting Trump autism claims",
      "description": "Researchers say their gold-standard review should put an end to the debate over use of the common painkiller during pregnancy.",
      "url": "https://www.bbc.com/news/articles/c74vdgkw1kzo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 00:13:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Gaza board extended membership to cost $1 billion — reports",
      "description": "According to media reports, the Gaza \"Board of Peace\" draft charter requires members to contribute $1 billion in cash to extend their membership.",
      "url": "https://www.dw.com/en/gaza-board-extended-membership-to-cost-1-billion-reports/a-75553537?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 23:57:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Syrian army extends control in north, seizes gas, oil fields",
      "description": "The Syrian army continues to push against the Kurdish-led Syrian Democratic Forces (SDF), reportedly capturing major oil and gas fields in eastern Syria.",
      "url": "https://www.dw.com/en/syrian-army-extends-control-in-north-seizes-gas-oil-fields/a-75551958?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 12:03:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Unleashing Europe's most powerful trade weapon on the US was unthinkable - not anymore",
      "description": "The mood in Brussels is a mixture of determination and deep concern.",
      "url": "https://news.sky.com/story/greenland-crisis-unleashing-europes-most-powerful-trade-weapon-on-the-us-was-previously-unthinkable-not-anymore-13495977",
      "published": "Sun, 18 Jan 2026 19:24:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "US 'wants countries to pay $1bn to stay on Gaza peace board'",
      "description": "Donald Trump wants countries to pay $1bn to be permanent members of the US-backed Board of Peace, according to reports.",
      "url": "https://news.sky.com/story/us-wants-countries-to-pay-1bn-to-stay-on-gaza-peace-board-13495801",
      "published": "Sun, 18 Jan 2026 10:53:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "China reports its economy expanded at a 5% annual pace in 2025, buoyed by strong exports despite Trump's tariffs",
      "description": "China reports its economy expanded at a 5% annual pace in 2025, buoyed by strong exports despite Trump's tariffs",
      "url": "https://abcnews.go.com/International/wireStory/china-reports-economy-expanded-5-annual-pace-2025-129337938",
      "published": "Sun, 18 Jan 2026 22:09:21 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Taiwanese reporter accused of bribing military officers to leak information to China",
      "description": "A journalist in Taiwan has been detained on allegations of bribing army officers to provide military information to people from mainland China, as the self-ruled island cracks down on potential infiltration from China",
      "url": "https://abcnews.go.com/International/wireStory/taiwanese-reporter-accused-bribing-military-officers-leak-information-129322900",
      "published": "Sun, 18 Jan 2026 00:41:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela’s acting leader was once a DEA 'priority target': report",
      "description": "Venezuela's interim president Delcy Rodríguez was reportedly labeled a DEA \"priority target\" in 2022, appearing in intelligence files since at least 2018.",
      "url": "https://www.foxnews.com/world/venezuelas-acting-leader-once-dea-priority-target-report",
      "published": "Sun, 18 Jan 2026 11:33:16 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Race to populate the border between India and China",
      "description": "India said it would help create hundreds of \"vibrant villages\" along its border with China. Three years later, residents wonder where they are.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5620785/race-to-populate-the-border-between-india-and-china",
      "published": "Sun, 18 Jan 2026 17:22:37 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Local coaching success marks 'sea change' for the sport, expert says",
      "description": "As the 2025 Africa Cup of Nations nears its conclusion, with Morocco set to face Senegal in the final on Sunday, FRANCE 24 speaks to Leslie Koroma Sr., CEO of Africa Sports Ventures Group, to reflect on the tournament and its spotlight on local talent. Noting that all four semi-finalist teams were coached by locals, Koroma described this as a \"sea change\" for the sport, highlighting the growing emphasis on developing homegrown talent.",
      "url": "https://www.france24.com/en/afcon-2025-local-coaching-success-marks-sea-change-for-the-sport-expert-says",
      "published": "Sun, 18 Jan 2026 14:16:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Inequality and unease are rising as elite Davos event opens with Trump set to attend",
      "description": "The Swiss town of Davos hosts the annual meeting of elites from business, government and culture this week",
      "url": "https://abcnews.go.com/International/wireStory/inequality-unease-rising-elite-davos-event-opens-pro-129340318",
      "published": "Mon, 19 Jan 2026 02:23:58 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Syrian government seizes strategic town in Raqqa from Kurdish forces",
      "description": "Syrian government forces have entered Raqqa as part of their ongoing push against Kurdish-led forces in eastern Syria",
      "url": "https://abcnews.go.com/International/wireStory/syrian-government-seizes-strategic-town-raqqa-kurdish-forces-129324524",
      "published": "Sun, 18 Jan 2026 11:13:31 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "China's population falls for fourth straight year",
      "description": "Despite efforts to encourage young couples to have children, China's birth rate hit a record low.",
      "url": "https://www.bbc.com/news/articles/c79r7v7qr53o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 19 Jan 2026 07:12:01 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Israel pushes back on Trump's picks for executives on Gaza 'Board of Peace'",
      "description": "Israel says it is unhappy it was not consulted, and Palestinians have also been critical.",
      "url": "https://www.bbc.com/news/articles/cd0y453yd90o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 17:30:24 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Avalanches kill eight skiers in Austrian Alps",
      "description": "A number of people have died in the Alps over the past week, as heavy snowfall has hit the region.",
      "url": "https://www.bbc.com/news/articles/c3r1v7gqdp8o?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 14:31:57 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Nasa's mega Moon rocket arrives at launch pad for Artemis II mission",
      "description": "Final preparations now get underway for the first crewed mission to the Moon in more than 50 years.",
      "url": "https://www.bbc.com/news/articles/cly148lvyevo?at_medium=RSS&at_campaign=rss",
      "published": "Sun, 18 Jan 2026 01:22:46 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan leader extends 40-year rule after winning contested poll",
      "description": "President Yoweri Museveni wins a seventh term, as his main rival Bobi Wine decries \"fake results\".",
      "url": "https://www.bbc.com/news/articles/c2lgxxrxd52o?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 17:43:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japanese mayor apologises after calling staff 'human scum'",
      "description": "Yokohama mayor Takeharu Yamanaka admits using the terms \"idiot\" and \"human scum\" to disparage staff.",
      "url": "https://www.bbc.com/news/articles/czejwl2z80lo?at_medium=RSS&at_campaign=rss",
      "published": "Sat, 17 Jan 2026 08:08:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Video: Celebrations in Senegal after controversial AFCON final win",
      "description": "Senegalese fans have been celebrating their team’s controversial 1-0 extra-time victory in the AFCON final victory.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/19/video-celebrations-in-senegal-after-controversial-afcon-final-win?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 07:42:02 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "From Uganda to Cameroon, how Africa’s ‘leaders for life’ stay in power",
      "description": "Yoweri Museveni, Paul Biya, and other leaders use tactics including elections to cement their long rule, experts say.",
      "url": "https://www.aljazeera.com/news/2026/1/19/from-uganda-to-cameroon-how-africas-leaders-for-life-stay-in-power?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 07:08:48 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Clashes in Colombia between rival rebel groups kill 27 people",
      "description": "The two groups have been fighting for control of the Guaviare region of the Amazon.",
      "url": "https://www.aljazeera.com/news/2026/1/19/clashes-in-colombia-between-rival-rebel-groups-kill-27-people?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 06:54:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal stun hosts Morocco to win AFCON title",
      "description": "Senegal edge chaotic AFCON final as Gueye punishes penalty miss by Diaz to beat hosts Morocco 1-0 in extra time.",
      "url": "https://www.aljazeera.com/gallery/2026/1/19/senegal-stun-hosts-morocco-to-win-afcon-title?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 06:43:05 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Syria live: Government forces take control after heavy fighting with SDF",
      "description": "Syrian President Ahmed al-Sharaa plans to meet SDF chief Mazloum Abdi in Damascus on Monday.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/19/syria-live-government-forces-take-control-after-heavy-fighting-with-sdf?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 06:31:42 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Billionaires have more money and political power than ever, Oxfam says",
      "description": "Charity says superrich 4,000 times more likely to hold political power than others and own all social media companies.",
      "url": "https://www.aljazeera.com/news/2026/1/19/billionaires-have-more-money-and-political-power-than-ever-oxfam-says?traffic_source=rss",
      "published": "Mon, 19 Jan 2026 06:22:48 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Confidence runs high in London’s Little Morocco as Afcon glory beckons",
      "description": "Atlas Lions face Senegal in final of Africa Cup of Nations on Sunday and Moroccan diaspora scents victory London’s Little Morocco is brimming with pride and anticipation. The Moroccan diaspora in North Kensington is in no doubt that on Sunday the Atlas Lions will triumph against Senegal in the final of the Africa Cup of Nations. “There’s not just an excitement, it has completely taken over everything else,” said Souad Talsi, who runs the Al-Hasaniya Moroccan women’s centre at the base of 31-storey Trellick Tower, at the north end of Golborne Road. Continue reading...",
      "url": "https://www.theguardian.com/uk-news/2026/jan/17/afcon-little-morocco-london-confidence-high",
      "published": "Sat, 17 Jan 2026 13:00:28 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Hanson reveals ambition to turn One Nation into viable party of government after record poll showing – as it happened",
      "description": "This blog is now closed Labor and Coalition on track to achieve deal on hate speech laws Get our breaking news email , free app or daily news podcast Marles ‘confident about the future of Nato’ despite Trump pressure Continuing his media rounds, the deputy PM, Richard Marles , is pressed on the government’s response to Donald Trump ’s tariffs on some European nations, in a bid to take over Greenland. Nato has played a very important role and continues to be very strong. I’ve been to the last two Nato meetings representing Australia, and there is a definite sense of unity when you’re at Nato meetings. So I feel confident about the future of Nato. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/live/2026/jan/19/federal-parliament-returns-gun-control-measures-hate-speech-laws-anthony-albanese-labor-sussan-ley-coalition-greens-trump-board-for-peace-ntwnfb",
      "published": "Mon, 19 Jan 2026 06:29:38 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.0 - 295 km W of Bandon, Oregon",
      "description": "PAGER - GREEN ShakeMap - I DYFI? - IV Time 2026-01-16 03:25:52 UTC 2026-01-16 03:25:52 UTC at epicenter Location 43.543°N 128.009°W Depth 10.00 km (6.21 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rq0d",
      "published": "2026-01-19T04:32:27.458Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: Maduro's enforcer Cabello still central to power",
      "description": "The ousting of Venezuela's president raised hopes of change — but the politician now controlling the streets shows how little has really shifted.",
      "url": "https://www.npr.org/2026/01/18/nx-s1-5678974/venezuela-maduro-enforcer-cabello",
      "published": "Sun, 18 Jan 2026 06:00:00 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON: Senegal snatches football cup from hosts Morocco",
      "description": "Senegal's Pape Gueye scored the decisive point in the fourth minute of extra time, after a goalless game that was briefly interrupted with a Senegal walk-off.",
      "url": "https://www.dw.com/en/afcon-senegal-snatches-football-cup-from-hosts-morocco/a-75555184?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 22:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump's Greenland tariffs: What you need to know",
      "description": "Donald Trump's pursuit of Greenland now extends to new tariffs on countries considered NATO allies. But what would such tariffs mean for the European countries affected, how have they been received, and what happens now?",
      "url": "https://www.dw.com/en/trump-s-greenland-tariffs-what-you-need-to-know/a-75553538?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 14:48:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany's AfD receives millions in public funding",
      "description": "The right-wing extremist party Alternative for Germany (AfD) profits significantly from public funding. Is democracy in Germany funding its own downfall?",
      "url": "https://www.dw.com/en/germany-s-afd-receives-millions-in-public-funding/a-75533025?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Sun, 18 Jan 2026 06:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025: Morocco's dream ends as Senegal earn 2nd title in 5 years",
      "description": "Senegeal defeated Morocco in the AFCON final (1-0). Senegal players boycotted the game for 15 minutes over a penalty decision.",
      "url": "https://www.france24.com/en/tv-shows/sports/20260119-afcon-2025-morocco-s-dream-ends-as-senegal-earn-2nd-title-in-5-years",
      "published": "Mon, 19 Jan 2026 06:31:55 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portugal's centre-left Seguro to face far-right rival Ventura in presidential runoff",
      "description": "Portugal’s Socialist candidate António José Seguro won the first round of the presidential election and will face far-right rival André Ventura in a runoff for the presidency, near-complete results showed on Sunday. With 95 percent of the vote counted, Seguro led with 30.6 percent, ahead of Ventura with 24.2 percent.",
      "url": "https://www.france24.com/en/europe/20260119-portugal-socialist-far-right-presidential-runoff",
      "published": "Mon, 19 Jan 2026 05:08:50 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Senegal beats Morocco 1-0 in chaotic AFCON 2025 final",
      "description": "No description available.",
      "url": "https://www.france24.com/en/live-news/20260118-senegal-beats-morocco-1-0-in-chaotic-afcon-2025-final",
      "published": "Sun, 18 Jan 2026 21:59:48 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "AFCON 2025 comes to climactic close as hosts Morocco square off against Senegal",
      "description": "Morocco's Atlas Lions will face off against Senegal's Lions of Teranga in Rabat on Sunday night, where the host nation hopes to win its first Africa Cup of Nations title in half a century.",
      "url": "https://www.france24.com/en/africa/20260118-afcon-2025-comes-to-climactic-close-hosts-morocco-square-off-against-senegal-final",
      "published": "Sun, 18 Jan 2026 15:13:51 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Prominent' Chinese super-embassy sends 'certain message', US Speaker says",
      "description": "The Speaker of the US House of Representatives has said he wished America had been able to acquire the London site slated for a controversial Chinese \"super embassy\".",
      "url": "https://news.sky.com/story/prominent-chinese-super-embassy-sends-certain-message-us-speaker-mike-johnson-says-13495842",
      "published": "Sun, 18 Jan 2026 13:58:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Trump is not bluffing, Greenland situation is critical for Europe and NATO",
      "description": "\"The situation is critical…\" Those are the four words a top European diplomat chose when we discussed Donald Trump's position on Greenland.",
      "url": "https://news.sky.com/story/trump-is-not-bluffing-greenland-situation-is-critical-for-europe-and-nato-13495736",
      "published": "Sun, 18 Jan 2026 06:00:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's population falls again as births drop 17% a decade after policy ended",
      "description": "China's population continues to shrink",
      "url": "https://abcnews.go.com/International/wireStory/chinas-population-falls-births-drop-17-decade-after-129340027",
      "published": "Mon, 19 Jan 2026 01:54:13 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's president says election victory over young challenger shows his strength",
      "description": "Museveni took 71.6% of the vote while his closest challenger took 24.7%,",
      "url": "https://abcnews.go.com/International/wireStory/ugandas-president-strong-election-victory-youthful-challenger-taste-129325650",
      "published": "Sun, 18 Jan 2026 09:20:57 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Portugal's presidential election may deliver another gain for populists in Europe",
      "description": "Portugal's presidential election features a record 11 candidates, with a populist party leader poised for a potential breakthrough",
      "url": "https://abcnews.go.com/International/wireStory/portugals-presidential-election-deliver-gain-populists-europe-129323135",
      "published": "Sun, 18 Jan 2026 11:13:34 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Florida woman, 81, arrested in murder-for-hire plot after sharing plan with undercover detective, sheriff says",
      "description": "Florida woman, 81, allegedly tried to hire hitman to commit murder but met undercover officer instead. Elouise Leland was charged with solicitation to commit first-degree murder.",
      "url": "https://www.foxnews.com/us/florida-woman-arrested-murder-for-hire-plot-after-sharing-plan-undercover-detective-sheriff-says",
      "published": "Sun, 18 Jan 2026 13:55:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Woman wakes up with 8-foot python coiled on her chest while sleeping: 'Don't move'",
      "description": "A Brisbane woman calmly removed an 8-foot carpet python from her bedroom after waking to find the non-venomous snake on top of her chest Monday night.",
      "url": "https://www.foxnews.com/world/woman-wakes-up-8-foot-python-coiled-her-chest-while-sleeping-dont-move",
      "published": "Sat, 17 Jan 2026 23:11:47 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}