{
  "last_updated": "2026-01-14T14:54:02.146980Z",
  "event_count": 221,
  "events": [
    {
      "title": "Iran calls for fast trials of protesters despite Trump’s warning",
      "description": "Iran's judiciary chief on Wednesday called for fast-track trials for detained protesters, despite US President Donald Trump's threat of \"very strong action\" if the Islamic republic goes ahead with executions. It came as the verified death toll of people killed in a crackdown on protesters passed the 2,000 mark, according to rights groups based outside Iran. France24 International Affairs editor Kethevane Gorjestani tells us more.",
      "url": "https://www.france24.com/en/iran-calls-for-fast-trials-of-protesters-despite-trump-s-warning",
      "published": "Wed, 14 Jan 2026 11:47:44 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 47,
      "severity_level": "Critical"
    },
    {
      "title": "Security Council LIVE: Attacks against Ukrainian civilians unacceptable, unjustifiable and must stop, says UN",
      "description": "The UN Security Council is meeting in emergency session in New York over Russia’s ongoing deadly missile and drone strikes targeting Ukrainian civilians and energy infrastructure, as frigid winter conditions grip the war-torn country. Millions have been deprived of electricity, heating and water. The UN Secretary-General has called the stepped up attacks an unacceptable violation of international humanitarian law. Follow live below and find all our in-depth meetings coverage here. UN News app users can go here.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166743",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 45,
      "severity_level": "Critical"
    },
    {
      "title": "2025 was the third warmest year on record",
      "description": "Droughts, hurricanes and wildfires are becoming the new normal. Global temperatures have shattered records for more than a decade.",
      "url": "https://www.dw.com/en/2025-was-the-third-warmest-year-on-record/a-75491609?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 03:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 40,
      "severity_level": "Critical"
    },
    {
      "title": "Quarter of developing countries poorer than in 2019, World Bank finds",
      "description": "Global growth ‘downshifted’ since Covid pandemic and sub-Saharan Africa particularly affected, report says Business live – latest updates A quarter of countries in the developing world are poorer than they were in 2019 before the Covid pandemic, the World Bank has found. The Washington-based organisation said a large group of low-income countries, many in sub-Saharan Africa, had suffered a negative shock in the six years to the end of last year. Continue reading...",
      "url": "https://www.theguardian.com/business/2026/jan/13/developing-countries-poorer-world-bank-report",
      "published": "Tue, 13 Jan 2026 14:30:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 37,
      "severity_level": "Critical"
    },
    {
      "title": "Trump’s other Latin American feud: why Colombia’s Petro is not Maduro",
      "description": "Leftwing leader rallies his supporters as US president accuses him of drug trafficking and threatens military action A leftwing South American firebrand calls for his followers to rally in public squares nationwide to defend his country’s sovereignty and decry verbal attacks from Donald Trump. The US president accuses the leader of personally flooding American streets with illegal drugs and imposes sanctions against him and his wife. Threats of military action are followed by a phone conversation between the two leaders. One might imagine that this is a description of the buildup of tensions that led to the 3 January special forces raid on Caracas to capture the Venezuelan leader, Nicolás Maduro, and his wife, Cilia Flores, to face several criminal charges in New York. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/12/trump-latin-america-feud-colombia-gustavo-petro",
      "published": "Mon, 12 Jan 2026 12:07:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 36,
      "severity_level": "Critical"
    },
    {
      "title": "At least 22 killed as crane collapses on train in Thailand",
      "description": "Crane was working on a high-speed rail project when it collapsed and hit the passing train, causing it to derail and briefly catch fire At least 22 people in Thailand have been killed and scores injured after a crane collapsed onto a passenger train, derailing it on Wednesday, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars, with smoke rising from the wreckage of the train below. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths",
      "published": "Wed, 14 Jan 2026 06:24:46 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "Nigeria named epicenter of global killings of Christians over faith in 2025, report says",
      "description": "Christians killed in Nigeria reaches alarming levels as Open Doors reports 3,490 of 4,849 Christians murdered worldwide for their faith occurred in Nigeria.",
      "url": "https://www.foxnews.com/world/nigeria-named-epicenter-global-killings-christians-over-faith-2025-report-says",
      "published": "Tue, 13 Jan 2026 07:05:27 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 34,
      "severity_level": "Critical"
    },
    {
      "title": "No power or water and -19C: Kyiv seeks relief from Russian strikes and cold",
      "description": "Residents of Ukraine's capital talk about their difficulties keeping warm and enduring power outages, as Russian attacks deepen the energy crisis.",
      "url": "https://www.bbc.com/news/articles/cgm4w1g3dggo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 07:43:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "Global employment stable but decent jobs in short supply",
      "description": "Global unemployment remains stable, but progress toward decent work has stalled, according to a new report from the International Labour Organization (ILO), which warns that young people continue to struggle in a job market which risks being further undermined by AI and trade policy uncertainty.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166751",
      "published": "Wed, 14 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 31,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Ending famine, refugee solidarity in Kenya, Ukraine civilian casualties update",
      "description": "The head of the UN’s emergency food agency has urged world leaders on Monday to end “man-made famines” and conflicts that “drive hunger and desperation”.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166744",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 30,
      "severity_level": "Critical"
    },
    {
      "title": "Minnesota: Prosecutors reportedly resign over federal probe",
      "description": "Several state prosecutors have reportedly resigned over the lack of a civil rights investigation into the fatal shooting of a woman in Minneapolis by an ICE agent. The US Justice Department denies the two are linked.",
      "url": "https://www.dw.com/en/minnesota-prosecutors-reportedly-resign-over-federal-probe/a-75497230?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 02:52:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 29,
      "severity_level": "Critical"
    },
    {
      "title": "Two weeks on, questions linger over targeting and impact of US airstrikes in Nigeria",
      "description": "Very little information has been shared about strikes in Sokoto state Two weeks after the US carried out Christmas Day airstrikes in north-west Nigeria on what it described as Islamic State fighters, questions remain over the specific group that was targeted and the operation’s impact. In the aftermath of the strikes, Donald Trump said in a post on his Truth Social platform that “ISIS Terrorist Scum in Northwest Nigeria , who have been targeting and viciously killing, primarily, innocent Christians” were hit with “numerous perfect strikes”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/08/questions-targeting-impact-us-airstrikes-in-nigeria",
      "published": "Thu, 08 Jan 2026 05:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "Israel used white phosphorus widely in southern Lebanon, study finds",
      "description": "An investigation by open-source researcher Ahmad Baydoun highlights Israel's use of white phosphorus munitions during the recent conflict with Hezbollah in southern Lebanon between October 2023 and November 2024. Although not explicitly prohibited by international law, the use of white phosphorus is regulated as an incendiary weapon, and its use in densely populated areas is banned.",
      "url": "https://www.france24.com/en/tv-shows/the-observers/20260114-israel-used-white-phosphorus-widely-southern-lebanon-study",
      "published": "Wed, 14 Jan 2026 10:38:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 28,
      "severity_level": "Critical"
    },
    {
      "title": "US plan to exploit Venezuela’s oil could eat up 13% of carbon budget to keep 1.5C limit",
      "description": "Exclusive: ClimatePartner analysis shows how move would risk plunging Earth further into climate catastrophe US plans to exploit Venezuela’s oil reserves could by 2050 consume more than a tenth of the world’s remaining carbon budget to limit global heating to 1.5C, according to an exclusive analysis. The calculation highlights how any moves to further exploit the South American nation’s oil reserves – the largest in the world, at least on paper – would put increasing pressure on climate goals, and risk plunging the Earth further into climate catastrophe. Continue reading...",
      "url": "https://www.theguardian.com/environment/2026/jan/12/us-plan-to-exploit-venezuelas-oil-could-eat-up-13-of-carbon-budget-to-keep-15c-limit",
      "published": "Mon, 12 Jan 2026 17:38:19 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "Suspected Venezuelan gangster in Portland CBP attack tied to shooting at apartment complex: police",
      "description": "An alleged Venezuelan gang member's wife was linked to an earlier shooting before a federal confrontation that left both suspects wounded during a Portland traffic stop.",
      "url": "https://www.foxnews.com/us/suspected-venezuelan-gangster-portland-cbp-attack-tied-shooting-apartment-complex-police",
      "published": "Tue, 13 Jan 2026 19:36:06 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 27,
      "severity_level": "Critical"
    },
    {
      "title": "US launches wave of strikes in Somalia targeting ISIS, al-Shabab terror threats",
      "description": "U.S. Africa Command General Michael E. Langley warns of jihadi threat to homeland as airstrikes against al-Shabab and ISIS-Somalia intensify under Trump administration.",
      "url": "https://www.foxnews.com/world/us-launches-wave-strikes-somalia-targeting-isis-al-shabab-terror-threats",
      "published": "Tue, 13 Jan 2026 20:56:15 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 26,
      "severity_level": "Critical"
    },
    {
      "title": "Deadly train accident in Thailand",
      "description": "At least 30 people were killed when a construction crane collapsed onto a moving train in northeastern Thailand, at the site of a planned high-speed rail project intended to eventually link China with much of Southeast Asia, reports Delano D’Souza.",
      "url": "https://www.france24.com/en/video/20260114-deadly-train-accident-in-thailand",
      "published": "Wed, 14 Jan 2026 14:43:28 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Russia launches intense missile and drone assault on Ukraine",
      "description": "The mayor of Ukraine’s capital says Kyiv was targeted by overnight drone attacks that sparked a fire in an apartment building, coming just a day after Moscow launched nearly 300 drones along with 18 ballistic and seven cruise missiles across the country. Ukrainian officials accuse Russia of “weaponising winter” by deliberately striking energy infrastructure, leaving residents of the capital to endure intermittent power outages in freezing temperatures, as Ellen Gainsford reports.",
      "url": "https://www.france24.com/en/russia-launches-intense-missile-and-drone-assault-on-ukraine",
      "published": "Wed, 14 Jan 2026 11:42:46 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Hypothermia kills 5 as blockade hinders aid",
      "description": "Despite the ceasefire, conditions in Gaza remain perilous for many residents, with UNICEF reporting that more than 100 children have been killed by military action since the truce began. Large numbers of people are living in makeshift tent camps that offer little protection from harsh weather, while many buildings remain structurally unsafe following Israeli bombardments. On Tuesday, at least four people were killed when a wall collapsed onto their tent in Gaza. Ellen Gainsford reports.",
      "url": "https://www.france24.com/en/gaza-hypothermia-kills-5-as-blockade-hinders-aid",
      "published": "Wed, 14 Jan 2026 10:05:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "‘A torture that never stops’: Sri Lanka failing survivors of conflict sexual violence, UN says",
      "description": "Conflict-related sexual violence in Sri Lanka remains largely unaddressed more than 15 years after the end of the civil war, with survivors still denied justice, recognition and reparations, according to a new report by the UN human rights office, OHCHR, on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166755",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 24,
      "severity_level": "Critical"
    },
    {
      "title": "Trump administration ends temporary protected status for Somalis in US",
      "description": "Critics condemn ‘bigoted attack’ as Trump bids to revoke citizenship of naturalized immigrants convicted of fraud The Trump administration is terminating temporary protected status (TPS) for Somalis living in the United States, giving hundreds of people two months to leave the country or face deportation. The homeland security secretary, Kristi Noem , said in a statement that conditions in the east African country had improved sufficiently and that Somalis no longer qualified for the designation under federal law. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/13/trump-administration-ends-tps-somalia",
      "published": "Tue, 13 Jan 2026 22:59:07 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Carney heads to Beijing as Trump’s America First agenda forces Canada into trade rethink",
      "description": "Canada’s PM seeks to smooth over past ructions in relationship with China as trade war takes its toll During the final stretch of Canada’s spring election campaign, Mark Carney told a debate audience that China was the country’s “biggest geopolitical risk”. He pointed to its attempts to meddle in elections and its recent efforts to disrupt Canada’s Arctic claims. When Carney’s government plane touches down in Beijing this week, it will be the first time a Canadian prime minister has been welcomed in nearly a decade. The trip, undertaken amid the rupturing of global economic and political alliances , reflects a desire by Ottawa to mend a broken relationship with a global superpower that uses its vast and lucrative market to both woo and punish countries. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/12/carney-heads-to-beijing-as-trump-america-first-agenda-forces-canada-into-trade-rethink",
      "published": "Mon, 12 Jan 2026 09:39:42 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: A ceasefire that still kills children is not enough, says UNICEF",
      "description": "Airstrikes, drone attacks and hypothermia continue in Gaza despite the ceasefire, with more than 100 youngsters killed since early October, the UN Children’s Fund (UNICEF) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166750",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Gaza: Storms worsen already dire humanitarian situation, UN warns",
      "description": "The humanitarian crisis across the Gaza Strip remains extremely serious, with harsh winter weather threatening to reverse recent gains in aid delivery, the United Nations said on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166747",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "UN chief ‘shocked’ by reports of excessive force against protesters in Iran",
      "description": "The UN Secretary-General is shocked by reports of violence and excessive use of force by Iranian authorities against protesters across the country, urging restraint and the immediate restoration of communications as unrest enters its third week.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166739",
      "published": "Sun, 11 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Sudan war leaves millions hungry and displaced as health system nears collapse",
      "description": "Sudan’s protracted conflict has spiralled into one of the world’s most severe humanitarian crises, with hunger, displacement and the collapse of basic services exacting a daily toll on civilians.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166738",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 23,
      "severity_level": "Critical"
    },
    {
      "title": "Greetings from Acre, Israel, where an old fortress recalls the time of the Crusades",
      "description": "Far-Flung Postcards is a weekly series in which NPR's international team shares moments from their lives and work around the world.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5669671/acre-israel-knights-fortress",
      "published": "Wed, 14 Jan 2026 09:35:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "UN World Court begins landmark hearings on Rohingya genocide case against Myanmar",
      "description": "Public hearings opened on Monday at the International Court of Justice (ICJ) in a landmark case brought by the Gambia against Myanmar, alleging violations of the Genocide Convention over the military’s treatment of the Rohingya minority.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166746",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Multiple people killed after construction crane falls, derails train in Thailand",
      "description": "A deadly construction accident unfolded in northeastern Thailand when a crane collapsed onto a moving passenger train, officials said.",
      "url": "https://www.foxnews.com/world/multiple-people-killed-after-construction-crane-falls-derails-train-thailand",
      "published": "Wed, 14 Jan 2026 03:07:06 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 22,
      "severity_level": "Critical"
    },
    {
      "title": "Geoeconomic confrontation world’s top threat, global leaders say",
      "description": "World Economic Forum survey says economic tools used as geopolitical weapons the most pressing risk to global stability.",
      "url": "https://www.aljazeera.com/news/2026/1/14/geoeconomic-confrontation-worlds-top-threat-global-leaders-say?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:43:17 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran’s judiciary to speed up trials of accused in protests crackdown",
      "description": "Prosecutors say they are bringing capital charges of 'waging war against God' against 'rioters and saboteurs'.",
      "url": "https://www.aljazeera.com/news/2026/1/14/irans-judiciary-to-speed-up-trials-of-accused-in-protests-crackdown?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 10:40:06 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Attempt to overturn the Gambia’s ban on FGM heard by supreme court",
      "description": "Case brought by Muslim leaders and MP follows failed 2024 bid and seen as part of global anti-women’s rights backlash A group of religious leaders and an MP in the Gambia have launched efforts to overturn a ban on female genital mutilation at the country’s supreme court. The court case, due to resume this month, comes after two babies bled to death after undergoing FGM in the Gambia last year. Almameh Gibba, an MP and one of the plaintiffs, tabled a bill to decriminalise FGM that was rejected by the country’s parliament in 2024. Continue reading...",
      "url": "https://www.theguardian.com/global-development/2026/jan/09/the-gambia-female-genital-mutilation-fgm-supreme-court-case-overturn-ban",
      "published": "Fri, 09 Jan 2026 06:00:29 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Australia exposed Iranian asylum seeker to torture on Manus, UN says",
      "description": "United Nations says man experienced ‘serious violence’ in detention but Australia argues it did not control PNG facilities Get our breaking news email , free app or daily news podcast Australia exposed an Iranian asylum seeker to torture and ill-treatment during his years in detention, a UN committee has found, amounting to a breach of international obligations. On Wednesday evening, the UN committee against torture released its decision on the case of an asylum seeker who arrived on Christmas Island by boat in 2013 after fleeing Iran in fear of persecution. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/14/australia-exposed-iranian-asylum-seeker-to-torture-on-manus-un-says",
      "published": "Wed, 14 Jan 2026 09:10:32 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran updates: Tehran warns of fast trials, executions",
      "description": "The leader of Iran's judiciary has said there will be rapid trials and executions for those arrested in nationwide protests. Washington has threatened military action over the crackdown. DW has the latest.",
      "url": "https://www.dw.com/en/iran-updates-tehran-warns-of-fast-trials-executions/live-75498434?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 08:40:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "World News in Brief: Escalating fighting in Sudan, displacement in Syria’s Aleppo, $1.5 billion appeal for South Sudan",
      "description": "More civilians in Sudan continue to be killed and displaced as fighting escalates in multiple parts of the country, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166756",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran: ‘The killing of peaceful demonstrators must stop,’ UN rights chief says",
      "description": "As anti-government demonstrations continue across Iran, the UN human rights chief said on Tuesday that he was horrified at the mounting violence directed by security forces against protestors, with reports of hundreds killed and thousands arrested.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166752",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Iran regime opened fire with live ammunition on protesters, doctor says: ‘Shoot-to-kill’",
      "description": "Iranian protests that began Dec. 28 saw security forces shift to live ammunition by Jan. 8, with over 3,000 deaths estimated nationwide.",
      "url": "https://www.foxnews.com/world/iran-regime-opened-fire-live-ammunition-protesters-doctor-says-shoot-to-kill",
      "published": "Tue, 13 Jan 2026 18:57:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "Trump admin labels Muslim Brotherhood branches as terrorist organizations",
      "description": "The U.S. designates the Lebanese, Jordanian and Egyptian chapters of the Muslim Brotherhood as terrorist organizations, saying they pose risks to the U.S.",
      "url": "https://www.foxnews.com/world/trump-admin-labels-muslim-brotherhood-branches-terrorist-organizations",
      "published": "Tue, 13 Jan 2026 11:13:37 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 21,
      "severity_level": "Critical"
    },
    {
      "title": "At least 32 killed after crane collapses on train in Thailand",
      "description": "Sixty-four people were left injured, including a one-year-old and an 85-year-old.",
      "url": "https://www.bbc.com/news/articles/ceqz7v1507ro?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 13:30:31 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Venezuelan regime touts ‘mass release’ of political prisoners but many say repression continues",
      "description": "NGOs estimate that there are still close to 1,000 political prisoners in Venezuela despite claims by new leaders The United States has welcomed the release of US citizens by Venezuela , which has been freeing political prisoners in a process that NGOs describe as slow and opaque. Many in the country also warn that, despite efforts by the regime to appear more open after the seizure and rendition of Nicolás Maduro , repression continues, with residents still having their mobile phones searched by armed militias on the streets and afraid to engage in any form of public protest. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/14/venezuelan-political-prisoners-released",
      "published": "Wed, 14 Jan 2026 13:44:00 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Thailand: At least 29 dead as crane collapses onto train",
      "description": "At least 29 people were killed in Thailand on Wednesday morning after a crane fell onto a moving train travelling from Bangkok to northeastern Thailand. Authorities say more than 60 people are injured, including a one year old.",
      "url": "https://www.france24.com/en/video/20260114-thailand-at-least-29-dead-as-crane-collapses-onto-train-1",
      "published": "Wed, 14 Jan 2026 13:26:32 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Visitors flock to Siwa: Egypt's hidden oasis threatened by tourism",
      "description": "Until 1984, there was no road connecting the oasis of Siwa and its 8,000 Bedouin residents with the rest of Egypt. Lost deep in the desert near the Libyan border, the country's most remote oasis was long unknown to tourists. But over the past decade, videos of visitors floating in turquoise salt lakes, climbing the 13th-century citadel or wandering through palm groves have flooded social media.",
      "url": "https://www.france24.com/en/tv-shows/focus/20260114-visitors-flock-to-siwa-egypt-s-hidden-oasis-threatened-by-tourism",
      "published": "Wed, 14 Jan 2026 13:05:58 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Verifying protests and deaths in Iran - amid brutal crackdown and internet shutdown",
      "description": "Footage posted on social media on Wednesday shows protesters gathered on the streets of the city of Marvdasht in the southern Iranian Fars province, as a fire burns in the background.",
      "url": "https://news.sky.com/story/number-of-iranian-dead-passes-2000-as-protests-continue-13493859",
      "published": "Tue, 13 Jan 2026 16:19:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Beirut's Commodore Hotel, a haven for journalists during Lebanon's civil war, shuts down",
      "description": "Beirut’s Commodore Hotel, once a hub for foreign journalists during Lebanon’s civil war, has closed amid the country’s economic crisis",
      "url": "https://abcnews.go.com/International/wireStory/beiruts-commodore-hotel-haven-journalists-lebanons-civil-war-129192044",
      "published": "Wed, 14 Jan 2026 00:25:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine war: UN appeals for $2.3 billion to support aid teams’ ‘heroic work’",
      "description": "Amid ongoing and intensifying Russian attacks across Ukraine, the UN on Tuesday launched a $2.3 billion humanitarian appeal for 2026 to support 4.1 million of the country’s most vulnerable people.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166749",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "Ukraine: Deadly Russian strikes push civilians deeper into winter crisis",
      "description": "Ukraine has entered the new year under intensifying and deadly Russian attacks which have crippled energy systems and left millions without heating, electricity or water amid freezing temperatures, senior UN officials told the Security Council on Monday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166748",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 20,
      "severity_level": "Critical"
    },
    {
      "title": "UN’s Albanese: Israel treats storm-hit Palestinians of Gaza as ‘expendable’",
      "description": "Special rapporteur says Israel's nonresponse to the growing crisis reflects its attitude towards Palestinians.",
      "url": "https://www.aljazeera.com/news/2026/1/14/uns-albanese-israel-treats-storm-hit-palestinians-of-gaza-as?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 09:36:51 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Germany: Gelsenkirchen bank thieves used 'manipulated' door",
      "description": "Police say a manipulated emergency exit, that shouldn't open from the outside, gave thieves access in last month's major bank heist in Gelsenkirchen. They warned customers that investigations would likely take months.",
      "url": "https://www.dw.com/en/germany-gelsenkirchen-bank-thieves-used-manipulated-door/a-75489784?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 16:09:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Exclusive: 'International law has died' with Maduro's capture, Venezuela's attorney general says",
      "description": "In an exclusive interview with FRANCE 24, Venezuela's Attorney General Tarek William Saab condemned the January 3 capture of Nicolas Maduro by US special forces as \"an unprecedented event\" that violated the country's airspace and sovereignty. \"International law has died at this time,\" he declared.",
      "url": "https://www.france24.com/en/tv-shows/t%C3%AAte-%C3%A0-t%C3%AAte/20260114-exclusive-international-law-has-died-with-maduro-s-capture-venezuela-s-attorney-general-says",
      "published": "Wed, 14 Jan 2026 10:53:59 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 19,
      "severity_level": "High"
    },
    {
      "title": "Iran reportedly breaks diplomatic contact with US as tension grows",
      "description": "Contacts between Tehran and Washington cut off, as Iran shows no sign of heeding US warnings over protest crackdown.",
      "url": "https://www.aljazeera.com/news/2026/1/14/diplomatic-contact-reportedly-suspended-between-us-and-iran?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:07:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Some personnel ‘advised to leave’ US military base in Qatar",
      "description": "The report comes amid warnings from the US that ​it could intervene in protests currently taking place in Iran.",
      "url": "https://www.aljazeera.com/news/2026/1/14/some-personnel-advised-to-leave-us-military-base-in-qatar-report?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 11:57:14 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "China pressing European countries to bar Taiwan politicians or face crossing a ‘red line’",
      "description": "Exclusive: Chinese officials are using a ‘highly specific’ interpretation of EU rules to suggest Taiwanese figures should not be granted visas, officials say Chinese officials have been pushing “legal advice” on European countries, saying their own border laws require them to ban entry to Taiwanese politicians, according to more than half a dozen diplomats and officials familiar with the matter. The officials made demarches to European embassies in Beijing, or through local embassies directly to European governments in their capital cities, warning the European countries not to “trample on China’s red lines”, according to the European diplomats and ministries who spoke to the Guardian. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/china-europe-pressure-block-taiwanese-politicians-visas",
      "published": "Tue, 13 Jan 2026 01:26:23 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Coalition set to vote against Labor’s hate speech and gun laws in wake of Bondi terror attack",
      "description": "It comes after opposition leader Sussan Ley has spent weeks calling for better legislative protections to tackle antisemitism Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The Coalition is set to vote against Labor’s fast-tracked legislation introduced in the wake of the Bondi terror attack, despite the opposition leader, Sussan Ley, calling for urgent legislative action for weeks. Labor would be forced to rely on support from the Greens if the opposition does not support the bill next Tuesday , as Ley flagged reservations about the bill’s drafting and the inability of public servants to explain key provisions on hate speech and religious protection. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/14/senior-liberals-urge-colleagues-to-vote-against-labors-hate-speech-and-gun-laws-in-wake-of-bondi-terror-attack-ntwnfb",
      "published": "Wed, 14 Jan 2026 09:15:44 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iranians able to make some international calls as internet remains blocked amid protests",
      "description": "Iranians could make phone calls abroad after a communications blackout during a crackdown on anti-regime protests, but internet and text messaging remain restricted.",
      "url": "https://www.foxnews.com/world/iranians-able-make-some-international-calls-internet-remains-blocked-amid-protests",
      "published": "Tue, 13 Jan 2026 03:24:44 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 18,
      "severity_level": "High"
    },
    {
      "title": "Iran at geopolitical crossroads as protests pressure regime",
      "description": "The Islamic Republic is a key player in the Middle East, with close ties to Russia and China. As the regime in Tehran comes under fire, DW looks at Iran's place on the global stage.",
      "url": "https://www.dw.com/en/iran-at-geopolitical-crossroads-as-protests-pressure-regime/a-75492953?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 16:04:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Wildfires ravage Argentina’s Patagonia",
      "description": "In just nine days, wildfires have destroyed over 15,000 hectares of Argentina’s Patagonia, with hundreds of firefighters and volunteers continuing to battle the flames, reports Charlotte Lam.",
      "url": "https://www.france24.com/en/wildfires-ravage-argentina-s-patagonia",
      "published": "Wed, 14 Jan 2026 11:48:54 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Fact-finding mission urges Iran to end protest violence and restore internet",
      "description": "The UN-mandated independent human rights fact-finding mission on Iran has urged authorities to immediately restore internet access and halt the violent crackdown of the ongoing, nationwide protest.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166737",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Iran state TV acknowledges 'a lot of martyrs' as death toll surpasses 3,000: report",
      "description": "Iran state TV reportedly acknowledges 'martyrs' as death toll from ongoing anti-government protests reaches over 2,000, according to activist groups.",
      "url": "https://www.foxnews.com/world/iran-state-tv-acknowledges-a-lot-martyrs-death-toll-surpasses-3000-report",
      "published": "Tue, 13 Jan 2026 13:56:09 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 17,
      "severity_level": "High"
    },
    {
      "title": "Global temperatures dipped in 2025 but more heat records on way, scientists warn",
      "description": "The last three years were Earth's hottest on record, as humanity's carbon emissions continue to heat the planet.",
      "url": "https://www.bbc.com/news/articles/c5y5p9rzd4ko?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 03:44:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Funerals in Iran for civilians and security forces killed during protests",
      "description": "Iran has been holding funerals for security force members killed during protests and for civilians killed by ‘rioters’.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/funerals-in-iran-for-civilians-and-security-forces-killed-during-protests?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:36:13 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "At least 32 dead after crane falls on to train in Thailand",
      "description": "At least 32 people have been killed after a construction crane fell on top of a moving train in northeast Thailand, the regional governor said.",
      "url": "https://news.sky.com/story/at-least-12-dead-after-crane-falls-on-to-train-in-thailand-13494021",
      "published": "Wed, 14 Jan 2026 05:11:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Increase taxes on sugary drinks and alcohol to save lives, urges WHO",
      "description": "Beverages like sugary drinks and alcohol are too accessible and cost too little in most of the world – helping fuel obesity, diabetes, cancer and injury, the World Health Organization (WHO) warned on Tuesday.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166754",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Florida sheriff Grady Judd fires off warning to gangsters after 'Sex, Money, Murder' kingpin taken down",
      "description": "Gang leader Hernando Thompson convicted on 17 felony counts including racketeering, faces up to five life sentences in Florida \"Sex, Money, Murder\" case.",
      "url": "https://www.foxnews.com/us/florida-sheriff-grady-judd-fires-off-warning-gangsters-after-sex-money-murder-kingpin-taken-down",
      "published": "Tue, 13 Jan 2026 09:00:42 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 16,
      "severity_level": "High"
    },
    {
      "title": "Trump’s neo-con turn on Iran",
      "description": "As talk of nuclear threats gives way to promises of 'help', the Bush-era logic of regime change re-emerges.",
      "url": "https://www.aljazeera.com/opinions/2026/1/14/trumps-neo-con-turn-on-iran?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:48:45 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "France to launch Greenland consulate in ‘political signal’ to US",
      "description": "Washington's threats to seize the strategic island have sparked a crisis among NATO states.",
      "url": "https://www.aljazeera.com/news/2026/1/14/france-to-launch-greenland-consulate-in-political-signal-to-us?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 10:50:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Iranian ambassador summoned over country's response to protests",
      "description": "Yvette Cooper has confirmed the government has summoned the Iranian ambassador in a statement to the Commons.",
      "url": "https://news.sky.com/story/iranian-ambassador-summoned-over-countrys-response-to-protests-13493754",
      "published": "Tue, 13 Jan 2026 15:05:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Teachers union slams 'Trump regime,' claims ICE murdered Minneapolis agitator in message to supporters",
      "description": "Teachers union sends inflammatory message after ICE shooting, calling Trump administration a \"regime\" and characterizing activist's death as \"murder.\"",
      "url": "https://www.foxnews.com/us/teachers-union-slams-trump-regime-claims-ice-murdered-minneapolis-agitator-message-supporters",
      "published": "Wed, 14 Jan 2026 08:00:51 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Florida paraglider survives 500-foot plunge into ocean",
      "description": "A Florida paraglider miraculously survived a 500-foot plunge into ocean waters near Singer Island. Lifeguards and beachgoers rescued the uninjured man safely.",
      "url": "https://www.foxnews.com/us/florida-paraglider-survives-500-foot-plunge-ocean",
      "published": "Wed, 14 Jan 2026 07:59:11 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 15,
      "severity_level": "High"
    },
    {
      "title": "Trump vows 'very strong action' if Iran executes protesters",
      "description": "Relatives of an arrested protester tell BBC Persian he is due to be executed on Wednesday, as the death toll from demonstrations reportedly exceeds 2,400.",
      "url": "https://www.bbc.com/news/articles/cqj2qgw8w08o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 13:04:04 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Bowen: Authoritarian regimes die gradually then suddenly, but Iran is not there yet",
      "description": "The regime's opponents will hope for more pressure to accelerate the process, writes the BBC's international editor.",
      "url": "https://www.bbc.com/news/articles/cedwgn4pqv4o?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 16:47:26 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "They bought an abandoned 'ghost house' in the Japanese countryside",
      "description": "He'd spent years backpacking around the world, and Japanese traveler Daisuke Kajiyama was finally ready to return home to pursue his long-held dream of opening up a guesthouse.",
      "url": "https://www.cnn.com/travel/article/couple-turned-abandoned-japanese-home-into-guest-house/index.html",
      "published": "Mon, 10 Apr 2023 12:22:59 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "South Korean prosecutors demand death penalty for former president Yoon Suk Yeol",
      "description": "Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol",
      "published": "Wed, 14 Jan 2026 00:43:58 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "The death toll from a crackdown on protests in Iran jumps to over 2,500, activists say",
      "description": "The number of dead climbed to at least 2,571 early Wednesday, as reported by the U.S.-based Human Rights Activists News Agency, as Iranians made phone calls abroad for the first time in days.",
      "url": "https://www.npr.org/2026/01/14/g-s1-105949/death-toll-crackdown-protests-iran",
      "published": "Wed, 14 Jan 2026 05:12:32 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Dozens of people killed in ferry boat accident in northern Mali",
      "description": "Residents and local officials in northern Mali say a ferry boat trying to land at a Niger River town in the Timbuktu region hit stones and sank in an accident that left dozens of people dead",
      "url": "https://abcnews.go.com/International/wireStory/dozens-people-killed-ferry-boat-accident-northern-mali-129182553",
      "published": "Tue, 13 Jan 2026 16:49:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Fireworks-wielding agitators clash with federal agents outside Minneapolis federal building",
      "description": "Federal agents deployed tear gas and rubber bullets against Minneapolis protesters after snowballs were allegedly thrown at vehicles, authorities said.",
      "url": "https://www.foxnews.com/us/federal-agents-deploy-tear-gas-rubber-bullets-protesters-outside-minneapolis-federal-building",
      "published": "Tue, 13 Jan 2026 09:22:21 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Trump admin exit from UN, international organizations raises question of who’s next",
      "description": "U.S. officials say more international organizations could face future cuts after withdrawing from 66 groups, with U.N. agencies potentially targeted next.",
      "url": "https://www.foxnews.com/world/trump-admin-exit-from-un-international-organizations-raises-question-whos-next",
      "published": "Tue, 13 Jan 2026 12:39:00 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 14,
      "severity_level": "High"
    },
    {
      "title": "Workers at Chinese factory that produces Labubu toys are being exploited, says NGO",
      "description": "Exclusive: China Labor Watch says people aged 16-18 employed without required special protections A labour rights NGO says it has found evidence of worker exploitation in the supply chain of Labubus, the furry toys that took the world by storm last year and which are expected to continue to grow in popularity in 2026. Labubus, toothy gremlins made by the Chinese toy company Pop Mart, have become one of China’s hottest cultural exports. In the first half of 2025 alone, “the Monsters” line of toys, which includes Labubus, generated 4.8bn yuan (£511m) in sales for the Hong Kong-listed company. In August, Pop Mart’s chief executive, Wang Ning, said the company was on track to reach 20bn yuan in revenues in 2025. Continue reading...",
      "url": "https://www.theguardian.com/world/2026/jan/13/workers-at-chinese-factory-that-produces-labubu-toys-are-being-exploited-says-ngo",
      "published": "Tue, 13 Jan 2026 09:55:04 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "DW exclusive: Post-election violence in Tanzania's Mwanza",
      "description": "What happened in Tanzania during the unrest that followed the October election remains unclear. New evidence points to killings and grave human rights abuses by security forces in the second largest city, Mwanza.",
      "url": "https://www.dw.com/en/dw-exclusive-post-election-violence-in-tanzania-s-mwanza/a-75473767?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 10:34:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "No cows allowed at French agricutural show",
      "description": "Europe's largest agricultural show in Paris will go ahead without cows this year, following an outbreak of lumpy skin disease in France that raised concerns about potential contamination, reports Laurent Berstecher.",
      "url": "https://www.france24.com/en/no-cows-allowed-at-french-agricutural-show",
      "published": "Wed, 14 Jan 2026 11:45:14 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 13,
      "severity_level": "High"
    },
    {
      "title": "What are Trump’s military options for an attack on Iran?",
      "description": "Trump told Iranian protesters that 'help is on its way' in a Truth Social post.",
      "url": "https://www.aljazeera.com/news/2026/1/14/what-are-trumps-military-options-for-an-attack-on-iran?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:35:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Johns Hopkins professor on his recent visit to Iran amid anti-government protests",
      "description": "NPR's Steve Inskeep asks Youseph Yazdi, a professor at Johns Hopkins School of Medicine, about his recent visit to Iran, where thousands have been killed in anti-government protests.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5675784/johns-hopkins-professor-on-his-recent-visit-to-iran-amid-anti-government-protests",
      "published": "Wed, 14 Jan 2026 04:48:38 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Thailand: Dozens die as crane falls on passenger train",
      "description": "The train was travelling from Bangkok to northeast Thailand. At least 30 people have been killed in the accident.",
      "url": "https://www.dw.com/en/thailand-dozens-die-as-crane-falls-on-passenger-train/a-75497484?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 04:54:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Can EU exert more pressure on Iran with sanctions?",
      "description": "The European Union is contemplating more sanctions against Iran amid a deadly crackdown on anti-government protests that has killed thousands. But could the bloc apply more pressure on the Islamic Republic's regime?",
      "url": "https://www.dw.com/en/can-eu-exert-more-pressure-on-iran-with-sanctions/a-75484027?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 21:08:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Woman seen on video allegedly blocking Minnesota ICE operation with car as agitators surround agents",
      "description": "Video shows woman allegedly blocking ICE agents as Minnesota protests escalate against immigration enforcement. Federal officials report 60 agitators were charged in five days.",
      "url": "https://www.foxnews.com/us/woman-seen-video-allegedly-blocking-minnesota-ice-operation-car-agitators-surround-agents",
      "published": "Tue, 13 Jan 2026 18:03:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Trump envoy reportedly meets with exiled Iranian prince as regime faces protests",
      "description": "The Trump administration allegedly made the first high-level contact with the Iranian opposition amid intensifying nationwide anti-regime protests.",
      "url": "https://www.foxnews.com/world/trump-envoy-reportedly-meets-exiled-iranian-prince-regime-faces-protests",
      "published": "Tue, 13 Jan 2026 18:32:18 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Republican senator condemns alleged Syrian army abuses as ceasefire follows Aleppo fighting",
      "description": "US Senator demands accountability after alleged human rights violations by Syrian forces against Kurdish civilians in Aleppo amid ongoing conflict.",
      "url": "https://www.foxnews.com/world/republican-senator-condemns-alleged-syrian-army-abuses-ceasefire-follows-aleppo-fighting",
      "published": "Tue, 13 Jan 2026 17:29:02 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "Iranian student shot in head at close range amid protests, body buried along roadside",
      "description": "Iranian student Rubina Aminian was shot in the head at close range, joining thousands allegedly killed by government forces, according to Iran Human Rights, a Norway-based group.",
      "url": "https://www.foxnews.com/world/iranian-student-shot-head-close-range-amid-protests-body-buried-along-roadside",
      "published": "Tue, 13 Jan 2026 17:16:38 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 12,
      "severity_level": "High"
    },
    {
      "title": "These were the best and worst places for air quality in 2021, new report shows",
      "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
      "url": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
      "published": "Tue, 22 Mar 2022 16:43:47 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Film show: The Shakespearean drama tipped for Oscar success",
      "description": "Her performance as Shakespeare's wife in \"Hamnet\" won Jessie Buckley the best actress award at the Golden Globes. Our film critic Emma Jones tells us why Chloé Zhao's sensitive direction has made the film a serious contender in the upcoming Academy Awards.",
      "url": "https://www.france24.com/en/tv-shows/arts24/20260114-film-show-the-shakespearean-drama-tipped-for-oscar-success",
      "published": "Wed, 14 Jan 2026 14:48:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "Deaths outnumber births in France",
      "description": "Despite an increase in the number of women of childbearing age in France, the number giving birth is at a low. In 2025 there were more deaths than births which has some towns concerned that they are losing the number of residents. Eliza Herbert has this story from our colleagues at France 2 that looks at how to explain the demographic shift.",
      "url": "https://www.france24.com/en/deaths-outnumber-births-in-france",
      "published": "Wed, 14 Jan 2026 13:49:37 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "US opens new air defense operations cell at Qatar base that Iran targeted in retaliatory attack",
      "description": "U.S. opens new air defense cell at Al Udeid Air Base in Qatar amid Iran tensions, enhancing regional missile defense cooperation across Middle East.",
      "url": "https://www.foxnews.com/world/us-opens-new-air-defense-operations-cell-qatar-base-iran-targeted-retaliatory-attack",
      "published": "Tue, 13 Jan 2026 11:02:22 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 11,
      "severity_level": "High"
    },
    {
      "title": "BTS announces return with new world tour in 2026 and 2027",
      "description": "K-pop band to start tour in April after nearly four-year hiatus due to all seven members needing to complete South Korea’s mandatory military service The BTS comeback is upon us: the K-pop septet has announced a 2026-2027 world tour, kicking off in South Korea in April and running through to March 2027 with more than 70 dates across Asia, North America, South America, Australia and Europe. The tour marks the group’s first headline performances since their 2021–22 Permission to Dance on Stage tour. 9 April and 11-12 April – Goyang, South Korea 17-18 April – Tokyo 25-26 April – Tampa, Florida 2-3 May – El Paso, Texas 7 May and 9-10 May – Mexico City 16-17 May – Stanford, California 23-24 and 27 May – Las Vegas 12-13 June – Busan, South Korea 26-27 June – Madrid 1-2 July – Brussels 6-7 July – London 11-12 July – Munich 17-18 July – Paris 1-2 Aug – East Rutherford, New Jersey 5-6 Aug – Foxborough, Massachusetts 10-11 Aug – Baltimore 15-16 Aug – Arlington, Texas 22-23 Aug – Toronto 27-28 Aug – Chicago 1-2 Sept and 5-6 Sept – Los Angeles 2-3 Oct – Bogotá, Colombia 9-10 Oct – Lima, Peru 16-17 Oct – Santiago, Chile 23-24 Oct – Buenos Aires, Argentina 28 Oct and 30-31 Oct – São Paulo 19 Nov and 21-22 Nov – Kaohsiung, Taiwan 3 Dec and 5-6 Dec – Bangkok 12-13 Dec – Kuala Lumpur, Malaysia 17 Dec, 19-20 Dec and 22 Dec – Singapore 26-27 Dec – Jakarta 12-13 Feb – Melbourne, Australia 20-21 Feb – Sydney 4 March and 6-7 March – Hong Kong 13-14 March – Manila, Philippines Continue reading...",
      "url": "https://www.theguardian.com/music/2026/jan/14/bts-announces-return-with-new-world-tourm-includin-in-2026-and-2027",
      "published": "Wed, 14 Jan 2026 00:40:16 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Former Cyprus President George Vassiliou, who put the country on the path to EU membership, has died",
      "description": "Former Cypriot President George Vassiliou, a successful businessman who helped to energize his divided island’s economy and set it on the road to European Union membership, has died",
      "url": "https://abcnews.go.com/International/wireStory/former-cyprus-president-george-vassiliou-put-country-path-129193512",
      "published": "Wed, 14 Jan 2026 04:09:39 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 10,
      "severity_level": "High"
    },
    {
      "title": "Amateur stuns world's best to win A$1m in Melbourne",
      "description": "Amateur Jordan Smith is the shock winner of the Million Dollar One Point Slam at the Australian Open, beating reigning men's champion Jannik Sinner along the way.",
      "url": "https://www.bbc.com/sport/tennis/articles/ckgyl1ndw57o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 13:12:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "'Welcome to 2976' - North Africa's Amazigh people ring in the new year",
      "description": "The Amazigh calendar places them almost a thousand years ahead of much of the rest of the world.",
      "url": "https://www.bbc.com/news/articles/cj0nm44g361o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 00:37:02 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "The surreal facades of America's strip clubs",
      "description": "Some people travel the world in search of adventure, while others seek out natural wonders, cultural landmarks or culinary experiences. But French photographer François Prost was looking for something altogether different during his recent road trip across America: strip clubs.",
      "url": "https://www.cnn.com/style/article/francois-prost-gentlemens-club/index.html",
      "published": "Mon, 06 Mar 2023 14:13:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "US frackers were already facing a global oil supply glut. Trump’s Venezuelan dream could make it worse",
      "description": "Picture is as murky as a barrel of oil, with US companies in 2026 expecting their first production drop in four years US shale-oil producers were already contending with oil prices at four-year lows. News that they may soon face a significant competitor in their back yard probably wasn’t how frackers wanted to greet 2026. The US capture of Venezuela’s President Nicolás Maduro and his wife, Cilia Flores, hit the share prices of independent shale-oil producers, such as Diamondback Energy and Devon Energy, last week. Continue reading...",
      "url": "https://www.theguardian.com/us-news/2026/jan/12/us-oil-producers-global-supply-glut-venezuela",
      "published": "Mon, 12 Jan 2026 11:00:03 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Drones 'hunt' for Starlink users in Iran as internet blackout continues",
      "description": "PRESS REVIEW – Wednesday, January 14, 2026: In Iran, an internet blackout continues as Iranians try to reach the outside world. It's a similar story in Uganda, where the internet has been cut off ahead of presidential elections there. Also, in the UK, the UK Independence Party has submitted its new logo, which has angered many. Meanwhile, the countdown to the Africa Cup of Nations semi-finals continues. Finally, BTS announce their new world tour.",
      "url": "https://www.france24.com/en/tv-shows/press-review/20260114-drones-hunt-for-starlink-users-in-iran-as-internet-blackout-continues",
      "published": "Wed, 14 Jan 2026 10:24:43 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Iran protests spark regime survival question as exiled dissident says it feels like a ‘revolution’",
      "description": "Iran faces unprecedented protests as citizens unite around overthrowing the Islamic Republic, marking the most serious threat to the regime since 1979.",
      "url": "https://www.foxnews.com/world/iran-protests-spark-regime-survival-question-exiled-dissident-says-feels-like-revolution",
      "published": "Tue, 13 Jan 2026 06:52:23 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 9,
      "severity_level": "Medium"
    },
    {
      "title": "Only Trump can stop Putin, Polish president tells BBC",
      "description": "Europe should do everything it can to help the US president in his efforts to end the war in Ukraine, Karol Nawrocki said.",
      "url": "https://www.bbc.com/news/articles/c041de5gn02o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 05:58:07 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "US approves sale of Nvidia's advanced AI chips to China",
      "description": "Nvidia has been caught in a tug-of-war between the US and China as the countries compete for AI dominance.",
      "url": "https://www.bbc.com/news/articles/cg4erx1n04lo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 04:11:37 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Iran, Gaza and the politics of counting the dead",
      "description": "As Western media accepts death tolls from Iran at face value, Palestinian deaths in Gaza remain endlessly questioned.",
      "url": "https://www.aljazeera.com/opinions/2026/1/14/iran-gaza-and-the-politics-of-counting-the-dead?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 14:16:32 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia turning occupied Donbas into ‘huge military base to frighten Europe’",
      "description": "As the Ukraine war drags, Moscow is transforming the economy of the occupied Donbas region, residents and analysts say.",
      "url": "https://www.aljazeera.com/news/2026/1/14/russia-turning-occupied-donbas-into-huge-military-base-to-frighten-europe?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 13:04:27 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Who are the exiled Iranian groups backing US intervention?",
      "description": "Exiled Iranian opposition groups are encouraging demonstrators to take over state institutions amid protests in Iran.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/who-are-the-exiled-iranian-groups-backing-us-intervention?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 11:58:11 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Retail spending fell in March as consumers pull back",
      "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
      "url": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
      "published": "Fri, 14 Apr 2023 14:29:52 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Author Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death",
      "description": "Lawyers for Adichie and her husband serve Euracare hospital with legal notice after death of 21-month-old The Nigerian author Chimamanda Ngozi Adichie has accused a Lagos hospital of negligence after the death of one of her 21-month-old twin boys. Nkanu Nnamdi died on 6 January after a brief illness. He was one of twin boys born to Adichie and Ivara Esege, a doctor, in 2024 by surrogacy, eight years after the birth of their first child, a girl. Continue reading...",
      "url": "https://www.theguardian.com/books/2026/jan/12/chimamanda-ngozi-adichie-accuses-lagos-hospital-negligence-son-death",
      "published": "Mon, 12 Jan 2026 14:26:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Australian chapter of Islamist group Hizb ut-Tahrir has no plans to disband before Labor’s hate speech laws",
      "description": "Organisation singled out by home affairs minister as one that could be targeted by new laws targeting ‘hate groups’ Get our breaking news email , free app or daily news podcast The Australian chapter of the Islamist group Hizb ut-Tahrir has said it has no plan to disband before Labor’s hate speech legislation is brought to parliament, a day after the National Socialist Network (NSN) claimed it would do so . Hizb ut-Tahrir Australia and the neo-Nazi NSN, which are not associated with each other, were named by the home affairs minister, Tony Burke, on Saturday as organisations that could be targeted by proposed legislation to ban alleged “hate groups” after the Asio general director, Mike Burgess, raised concerns about both. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/australian-chapter-of-islamist-group-hizb-ut-tahrir-has-no-plans-to-disband-before-labors-hate-speech-laws",
      "published": "Wed, 14 Jan 2026 14:00:35 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Apprehension in Denmark ahead of talks about Greenland with Vance",
      "description": "Leaders from Denmark and Greenland will meet with top U.S. officials in Washington on Wednesday to try to find a way out of a crisis caused by President Trump repeated demands to annex Greenland.",
      "url": "https://www.npr.org/2026/01/13/nx-s1-5675921/apprehension-in-denmark-ahead-of-talks-about-greenland-with-vance",
      "published": "Tue, 13 Jan 2026 17:17:21 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Amid continued sectarian violence, Syrians face mass displacement",
      "description": "More than a year after the fall of Bashar al-Assad in Syria, many people living there are starting to rebuild their lives. However, sectarian violence has flared across Syria and according to the UN Office for the Coordination of Humanitarian Affairs, about 7 million people remain internally displaced. The violence has aggravated the humanitarian situation, as Dr Mohamed Alaa Ahmado, Programs Director at the NGO Mehad, tells FRANCE 24. Among the many challenges, he says, is the need for \"strengthening primary healthcare services\", \"food and non-food items\" and \"psychological support\".",
      "url": "https://www.france24.com/en/tv-shows/perspective/20260114-amid-continued-sectarian-violence-syrians-face-mass-displacement",
      "published": "Wed, 14 Jan 2026 14:17:01 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Trump says US control of Greenland ‘vital’ for Golden Dome",
      "description": "US control of Greenland is \"vital\" for the country's planned Golden Dome air and missile defence system, President Donald Trump said in a social media post on Wednesday. Trump's post came as Danish Defence Minister Troels Lund Poulsen sought to ease US concerns about security in Greenland, telling media that Denmark was boosting its military presence there.",
      "url": "https://www.france24.com/en/americas/20260114-trump-says-us-control-of-greenland-vital-for-golden-dome",
      "published": "Wed, 14 Jan 2026 13:18:21 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "France bans 10 British far-right activists for attacking migrant boats",
      "description": "The French interior ministry on Wednesday banned 10 members of the British far-right \"Raise the Colours\" group for searching and destroying small migrant boats in the English Channel and conducting propaganda activities. The individuals, who were not named, were prohibited from entering or residing in France.",
      "url": "https://www.france24.com/en/europe/20260114-france-bans-10-uk-far-right-activists-over-anti-migrant-actions",
      "published": "Wed, 14 Jan 2026 11:57:12 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "'It was war': Iranian woman who fled Tehran describes killings",
      "description": "\"It was war.\"",
      "url": "https://news.sky.com/story/everyone-was-being-shot-in-the-head-iranian-woman-who-fled-tehran-describes-killings-and-crackdown-13494160",
      "published": "Wed, 14 Jan 2026 11:25:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Russia is waging hybrid war on UK and Europe through 'disposable agents'",
      "description": "Russian spies are increasingly recruiting Ukrainians to carry out acts of sabotage in Europe to undermine NATO and attempt to turn public opinion against Ukraine, according to new research.",
      "url": "https://news.sky.com/story/how-russia-is-using-disposable-agents-to-sabotage-europe-13494007",
      "published": "Tue, 13 Jan 2026 22:43:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "2025 was Earth's third hottest year",
      "description": "Planet Earth has just lived through its third-warmest year on record, EU scientists said on Wednesday.",
      "url": "https://news.sky.com/story/2025-was-planets-third-hottest-year-on-record-13494078",
      "published": "Wed, 14 Jan 2026 08:41:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Activists say Iran has aired at least 97 coerced confessions from protesters, often after torture",
      "description": "Iranian state media has aired at least 97 confessions from protesters since Dec. 28, according to the Human Rights Activists News Agency",
      "url": "https://abcnews.go.com/International/wireStory/activists-iran-aired-97-coerced-confessions-protesters-after-129180897",
      "published": "Tue, 13 Jan 2026 21:45:27 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Virginia nanny testifies affair, alibi plan ended in bloodshed after love triangle tore apart affluent family",
      "description": "Brendan Banfield allegedly used fetish website to lure victim for elaborate murder plot that killed his wife and stranger in their Virginia home.",
      "url": "https://www.foxnews.com/us/virginia-nanny-testifies-affair-alibi-plan-ended-bloodshed-after-love-triangle-tore-apart-affluent-family",
      "published": "Wed, 14 Jan 2026 07:00:56 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Judge scolds alleged Gilgo Beach killer's defense, vows trial will begin ‘come hell or high water'",
      "description": "Judge warns alleged Gilgo Beach serial killer Rex Heuermann's lawyers that trial will start after Labor Day \"come hell or high water\" despite new motions.",
      "url": "https://www.foxnews.com/us/judge-scolds-alleged-gilgo-beach-killer-defense-vows-trial-begin-come-hell-high-water",
      "published": "Tue, 13 Jan 2026 17:28:10 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "College basketball player gunned down on Nashville freeway, police hunting for suspects",
      "description": "Tennessee basketball player Andre Bell, 20, was fatally shot on Nashville freeway while returning to Fisk University, police said. Suspect vehicle fled.",
      "url": "https://www.foxnews.com/us/college-basketball-player-gunned-nashville-freeway-police-hunting-suspects",
      "published": "Tue, 13 Jan 2026 15:58:25 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Afghan illegal immigrant who stabbed sister for being 'bad Muslim girl' arrested by ICE agents in New York",
      "description": "ICE arrested an Afghan illegal immigrant convicted of attempting to murder his teenage sister in 'honor' attack. Called her a 'bad Muslim girl' before stabbing her.",
      "url": "https://www.foxnews.com/us/afghan-illegal-immigrant-stabbed-sister-being-bad-muslim-girl-arrested-ice-agents-new-york",
      "published": "Tue, 13 Jan 2026 15:18:49 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Ohio dentist double murder: Fmr police chief reveals ‘multitude’ of reasons ex-husband allegedly killed couple",
      "description": "Former police chief reveals why Ohio dentist's ex-husband allegedly killed couple. Michael McKee charged with murdering Spencer and Monique Tepe.",
      "url": "https://www.foxnews.com/us/ohio-dentist-double-murder-fmr-police-chief-reveals-multitude-reasons-ex-husband-allegedly-killed-couple",
      "published": "Tue, 13 Jan 2026 08:00:26 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "South Korean prosecutor seeks death penalty for ex-President Yoon over martial law declaration: 'Self-coup'",
      "description": "An independent counsel demanded a death sentence for former South Korean President Yoon Suk Yeol on rebellion charges over his controversial martial law decree.",
      "url": "https://www.foxnews.com/world/south-korean-prosecutor-seeks-death-penalty-ex-president-yoon-over-martial-law-declaration-self-coup",
      "published": "Wed, 14 Jan 2026 03:29:11 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 8,
      "severity_level": "Medium"
    },
    {
      "title": "Randa Abdel-Fattah threatens defamation action against South Australian premier Peter Malinauskas",
      "description": "Prominent Palestinian author’s removal from Adelaide writers’ week lineup led to unprecedented turmoil culminating in cancellation of festival Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The South Australian premier, Peter Malinauskas, has received a legal notice from the Palestinian writer and academic at the heart of the Adelaide writers’ week maelstrom . On Wednesday, lawyers acting for Randa Abdel-Fattah served a formal concerns notice for defamation on the premier, suggesting the fallout from her cancellation from the 2026 event – which is itself is now cancelled – is far from over. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/14/randa-abdel-fattah-defamation-concerns-notice-peter-malinauskas-sa-premier",
      "published": "Wed, 14 Jan 2026 10:31:57 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Iranian regime targeting Starlink users in bid to squash leaking protest footage",
      "description": "Iran's internet blockade fails to stop protest footage leaks via Starlink as authorities reportedly kill at least 646 demonstrators in ongoing crackdown.",
      "url": "https://www.foxnews.com/world/iranian-regime-targeting-starlink-users-bid-squash-leaking-protest-footage",
      "published": "Tue, 13 Jan 2026 08:33:42 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 7,
      "severity_level": "Medium"
    },
    {
      "title": "Canada's Mark Carney faces delicate balancing act in China visit",
      "description": "The PM is seeking to deepen trade and repair ties with China after years of tense relations - without compromising national security or provoking the US.",
      "url": "https://www.bbc.com/news/articles/c98pj370mjjo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 00:00:15 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Why Somalia drew a line with the UAE",
      "description": "Annulment of UAE agreements marks a firm stand on sovereignty and national unity.",
      "url": "https://www.aljazeera.com/opinions/2026/1/14/why-somalia-drew-a-line-with-the-uae?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 14:18:07 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Reporter goes inside Aleppo tunnels dug by SDF fighters",
      "description": "Al Jazeera gained access to an extensive network of tunnels in the Sheikh Maqsoud area of Aleppo.",
      "url": "https://www.aljazeera.com/video/newsfeed/2026/1/14/reporter-goes-inside-aleppo-tunnels-dug-by-sdf-fighters?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 10:05:41 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color",
      "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
      "url": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
      "published": "Thu, 13 Apr 2023 21:13:04 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Uganda braces for tense election as Museveni seeks another win",
      "description": "President Museveni's supporters expect victory for the National Resistance Movement. Meanwhile, a youthful base frustrated by unemployment hopes whoever wins will heed their wishes for a better future.",
      "url": "https://www.dw.com/en/uganda-braces-for-tense-election-as-museveni-seeks-another-win/a-75481521?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 13:24:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Ugandan opposition leader campaigns in flak jacket",
      "description": "The Ugandan opposition leader known as Bobi Wine has been campaigning for president in a flak jacket and helmet as soldiers filled the streets of the capital, Kampala",
      "url": "https://abcnews.go.com/International/wireStory/ugandan-opposition-leader-campaigns-flak-jacket-129193195",
      "published": "Wed, 14 Jan 2026 02:38:24 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "China had a record $1.2 trillion trade surplus in 2025, as exports rose 6.6% in December",
      "description": "China has reported its trade surplus surged to a record of almost $1.2 trillion last year as exports to other countries made up for slowing shipments to the United States",
      "url": "https://abcnews.go.com/International/wireStory/china-record-12-trillion-trade-surplus-2025-exports-129189558",
      "published": "Wed, 14 Jan 2026 01:05:26 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Built on care and connection: How one Somali-British woman is strengthening diaspora communities",
      "description": "When her family moved from Somalia to London in the 1980s, Safia Jama watched women in her community help her mother navigate a new life in the UK — booking doctor’s appointments, enrolling children in school, and learning how to access everyday services in a new country.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166725",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "LA County eyes 'ICE-free zones' on government property despite $1B in federal funding at risk",
      "description": "Los Angeles County considers creating \"ICE-free zones\" to block federal immigration enforcement operations, risking over $1 billion in federal funding.",
      "url": "https://www.foxnews.com/us/la-county-eyes-ice-free-zones-government-property-despite-1b-federal-funding-risk",
      "published": "Tue, 13 Jan 2026 13:45:19 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Affluent Virginia suburb rocked as trial begins for ex-federal agent husband in nanny love-triangle murders",
      "description": "Former IRS agent accused of orchestrating double murder with Brazilian au pair to hide affair. Trial begins in shocking Virginia criminal case.",
      "url": "https://www.foxnews.com/us/affluent-virginia-suburb-rocked-trial-begins-ex-federal-agent-husband-nanny-love-triangle-murders",
      "published": "Tue, 13 Jan 2026 07:00:28 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Greenland's prime minister says 'we choose Denmark' over the US",
      "description": "Greenland's prime minister said if his territory had to choose between the United States and Denmark, it would choose Denmark, a report said.",
      "url": "https://www.foxnews.com/world/greenlands-prime-minister-says-we-choose-denmark-over-us",
      "published": "Tue, 13 Jan 2026 12:24:54 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 6,
      "severity_level": "Medium"
    },
    {
      "title": "Uganda election chief says he has had threats over results declaration",
      "description": "This follows comments by a presidential assistant that Bobi Wine would not be declared president, even if he wins.",
      "url": "https://www.bbc.com/news/articles/c62vd7542rno?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 12:04:30 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Dubai chocolate-inspired dessert takes S Korea by storm",
      "description": "Shops are selling hundreds of cookies within minutes as the frenzy sends prices of ingredients surging.",
      "url": "https://www.bbc.com/news/articles/c07xdv0mggzo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 06:41:03 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Palestinian students strike as Israel bans access to West Bank teachers",
      "description": "Israel limits the ability of teachers from the West Bank to travel to occupied East Jerusalem.",
      "url": "https://www.aljazeera.com/news/2026/1/14/palestinian-students-strike-as-israel-bans-access-to-west-bank-teachers?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:00:53 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Vance to meet Danish and Greenlandic officials in Washington on Wednesday",
      "description": "U.S. Vice President JD Vance will meet Denmark's foreign minister and his Greenlandic counterpart in Washington on Wednesday to discuss the Arctic island, at the center of a geopolitical storm.",
      "url": "https://www.npr.org/2026/01/14/g-s1-105936/vance-to-meet-danish-greenland-officials",
      "published": "Wed, 14 Jan 2026 01:33:10 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "As Iran's protests continue, Israelis and Palestinians watch closely",
      "description": "There is broad support for the protests among Israeli officials, but Palestinians say they hope the Iranian regime stays in place and the protests die down soon.",
      "url": "https://www.npr.org/2026/01/13/g-s1-105849/iran-protests-israel-palestinian-reaction",
      "published": "Tue, 13 Jan 2026 10:47:50 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Anything short of US control of Greenland 'unacceptable,' Donald Trump says",
      "description": "Donald Trump has again doubled down on threats to seize the autonomous territory. Foreign ministers from Denmark and Greenland are in Washington DC for talks on easing the tensions over the Arctic island. Follow DW.",
      "url": "https://www.dw.com/en/anything-short-of-us-control-of-greenland-unacceptable-donald-trump-says/live-75504607?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 14:00:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "US' JD Vance to host Greenland talks amid takeover threats",
      "description": "The foreign ministers of Denmark and Greenland are hoping to defuse tensions over the Arctic island in Washington talks. US President Donald Trump has doubled down on threats to seize the autonomous Danish territory.",
      "url": "https://www.dw.com/en/us-jd-vance-to-host-greenland-talks-amid-takeover-threats/a-75498027?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 08:25:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Contempt threat after Clintons refuse Epstein testimony",
      "description": "Bill and Hillary Clinton have refused to comply with a Congressional subpoena to testify in a Jeffrey Epstein probe and could face contempt charges.",
      "url": "https://www.dw.com/en/contempt-threat-after-clintons-refuse-epstein-testimony/a-75496671?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 20:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "In Haiti’s storm-hit south, food vouchers restore choice and dignity for families",
      "description": "Standing outside a colourfully painted building in southeastern Haiti, at the entrance to a bustling shop called Gods Will Depot where bags of food are stacked to the ceiling, Ketia surveys the large pile of groceries she has selected for her family: a big sack of flour, packages of spaghetti, boxed milk, some bars of soap.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166757",
      "published": "Tue, 13 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "DOJ says 'no basis' for civil rights investigation into Minneapolis ICE officer killing",
      "description": "The DOJ declined a civil rights probe into an ICE officer's killing of Renee Good in Minneapolis, breaking from past practices as the FBI investigation continues.",
      "url": "https://www.foxnews.com/us/justice-department-declines-civil-rights-investigation-minneapolis-ice-officer-killing",
      "published": "Tue, 13 Jan 2026 21:51:29 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Tennessee Highway Patrol debunks viral claims protester was struck by trooper's vehicle",
      "description": "Dashcam video reveals a Tennessee Highway Patrol trooper's encounter with a Memphis protester who appeared to fake being hit, debunking viral claims.",
      "url": "https://www.foxnews.com/us/tennessee-highway-patrol-debunks-viral-claims-protester-struck-trooper-vehicle",
      "published": "Tue, 13 Jan 2026 18:18:47 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 5,
      "severity_level": "Medium"
    },
    {
      "title": "Venezuela has freed some American citizens from prison, US official says",
      "description": "A US state department official did not confirm the identities or number of prisoners released, but called the move \"an important step in the right direction\".",
      "url": "https://www.bbc.com/news/articles/cqj2qg70px9o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 11:17:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Trump says control of Greenland ‘vital’ amid White House talks",
      "description": "Trump's comments come as Danish, Greenland diplomats meet with Vice President JD Vance and Secretary of State Marco.",
      "url": "https://www.aljazeera.com/news/liveblog/2026/1/14/live-trump-says-control-of-greenland-vital-ahead-of-white-house-meeting?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 14:01:30 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too",
      "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows.",
      "url": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
      "published": "Mon, 21 Mar 2022 19:54:24 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Former NSW Labor minister condemns Forestry Corporation after greater glider ‘den trees’ found at planned logging site",
      "description": "Bob Debus says operations at Glenbog state forest on south coast show native forest logging is untenable Get our breaking news email , free app or daily news podcast A former New South Wales Labor environment minister has called on the government to halt imminent logging in a forest on the state’s south coast, after citizen scientists recorded 102 trees that they say are home to endangered greater gliders. Bob Debus, who served as environment minister in the Carr and Iemma governments, also accused the NSW Forestry Corporation (NSWFC) of being found in breach of its own regulations so frequently that the “practice is essentially part of its business model”. Continue reading...",
      "url": "https://www.theguardian.com/australia-news/2026/jan/15/nsw-logging-halted-greater-glider-den-trees-found",
      "published": "Wed, 14 Jan 2026 14:00:39 GMT",
      "source": "The Guardian World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Germany: Unjustly jailed man gets €1.3 million compensation",
      "description": "The Bavarian state is to give over €1 million to a man who spent 13 years in jail on murder charges that were overturned. Prosecutors had previously called for him to pay for board and lodgings in jail after his release.",
      "url": "https://www.dw.com/en/germany-unjustly-jailed-man-gets-€1-3-million-compensation/a-75503038?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 12:20:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "US lauds freeing of American prisoners in Venezuela",
      "description": "The US State Department hailed Venezuela's interim government for releasing American prisoners, calling it a \"step in the right direction.\"",
      "url": "https://www.dw.com/en/us-lauds-freeing-of-american-prisoners-in-venezuela/a-75497232?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 02:23:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "The UK is expected to approve a 'mega' Chinese embassy in London despite objections",
      "description": "Britain’s government is expected to approve a large Chinese embassy near London’s financial district",
      "url": "https://abcnews.go.com/International/wireStory/uk-expected-approve-mega-chinese-embassy-london-despite-129192936",
      "published": "Wed, 14 Jan 2026 02:40:43 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "Venezuela: UN independent investigators call for immediate release of all political prisoners",
      "description": "More than 100 political prisoners have been released in Venezuela, the Government announced on Monday, just over a week after the seizure and rendition of President Nicolás Maduro in Caracas by the United States.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166745",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "As Iran weakens, questions grow over Mohammed bin Salman’s regional ambitions",
      "description": "Saudi Arabia asserts bold foreign policy as Iran weakens, reshaping Middle East power dynamics through strategic partnerships and regional realignments.",
      "url": "https://www.foxnews.com/world/saudi-arabia-recalibrates-foreign-policy-approach-middle-east-region-iran-weakens",
      "published": "Tue, 13 Jan 2026 07:00:07 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 4,
      "severity_level": "Low"
    },
    {
      "title": "China announces record $1tn trade surplus despite Trump tariffs",
      "description": "Beijing reported the largest-ever trade surplus at $1.19tn as China diversified its trade.",
      "url": "https://www.bbc.com/news/articles/c9wx1v84rzyo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 07:30:30 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Look of the Week: Blackpink headline Coachella in Korean hanboks",
      "description": "Bringing the second day of this year's Coachella to a close, K-Pop girl group Blackpink made history Saturday night when they became the first Asian act to ever headline the festival. To a crowd of, reportedly, over 125,000 people, Jennie, Jisoo, Lisa and Rosé used the ground-breaking moment to pay homage to Korean heritage by arriving onstage in hanboks: a traditional type of dress.",
      "url": "https://www.cnn.com/style/article/blackpink-coachella-2023-hanboks-lotw/index.html",
      "published": "Tue, 18 Apr 2023 15:39:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "How Playboy cut ties with Hugh Hefner to create a post-MeToo brand",
      "description": "Hugh Hefner launched Playboy Magazine 70 years ago this year. The first issue included a nude photograph of Marilyn Monroe, which he had purchased and published without her knowledge or consent.",
      "url": "https://www.cnn.com/style/article/playboy-the-conversation/index.html",
      "published": "Tue, 11 Apr 2023 07:10:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Hungary sets parliamentary election date",
      "description": "Hungary’s president announced on Tuesday that the next parliamentary election will be held on April 12th. Although the official campaign begins in a month, the race is already shaping up to be the most competitive in a generation, with polls showing a tight contest between current Prime Minister Viktor Orbán and his closest challenger. The election is being closely monitored for its potential implications for both Ukraine and the European Union, reports Monte Francis.",
      "url": "https://www.france24.com/en/hungary-sets-parliamentary-election-date",
      "published": "Wed, 14 Jan 2026 13:55:08 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Semifinals kicking off on Wednesday: Morocco VS Nigeria",
      "description": "The Africa Cup of Nations is reaching a thrilling stage, with the semifinals kicking off this Wednesday as Morocco faces Nigeria and Senegal takes on seven-time champion Egypt in a rematch of their 2021 final, reports sports editor Selina Sykes from Morocco.",
      "url": "https://www.france24.com/en/semifinals-kicking-off-on-wednesday-morocco-vs-nigeria",
      "published": "Wed, 14 Jan 2026 11:46:30 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Costa Rica's security director says plot to assassinate president uncovered",
      "description": "Costa Rican security officials have reported an alleged plot to assassinate President Rodrigo Chaves",
      "url": "https://abcnews.go.com/International/wireStory/costa-ricas-security-director-plot-assassinate-president-uncovered-129178953",
      "published": "Tue, 13 Jan 2026 15:25:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "‘Beyond GDP’ economists push for clearer metrics on wellbeing, sustainability",
      "description": "Top finance experts are meeting at UN Geneva this week to push for a radical shake up in the way economic growth is gauged, in response to concerns that GDP measurements provide little insight about progress on key sustainability targets that are vital to our survival.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166740",
      "published": "Mon, 12 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Secret room to be built at Chinese embassy near cable lines, sparking widespread espionage fears",
      "description": "Unredacted plans for China's new London embassy reveal secret underground chamber near cables, sparking espionage concerns among UK security experts.",
      "url": "https://www.foxnews.com/world/secret-room-built-chinese-embassy-near-cable-lines-sparking-widespread-espionage-fears",
      "published": "Tue, 13 Jan 2026 19:21:20 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 3,
      "severity_level": "Low"
    },
    {
      "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?",
      "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
      "url": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
      "published": "Sun, 20 Mar 2022 07:01:50 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Vance to meet Danish and Greenlandic officials in Washington as locals say Greenland is not for sale",
      "description": "U.S. Vice President JD Vance is meeting with Danish and Greenlandic officials in Washington on Wednesday as President Donald Trump insists on controlling Greenland",
      "url": "https://abcnews.go.com/International/wireStory/vance-meet-danish-greenlandic-officials-washington-locals-greenland-129192151",
      "published": "Wed, 14 Jan 2026 00:19:10 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Rio de Janeiro zoo animals treated to popsicles as city faces scorching weather",
      "description": "Animals at Rio de Janeiro’s BioParque zoo received popsicles and frozen treats Tuesday as the city faced another day of extreme heat during Brazil’s summer",
      "url": "https://abcnews.go.com/International/wireStory/rio-de-janeiro-zoo-animals-treated-popsicles-city-129184605",
      "published": "Tue, 13 Jan 2026 18:50:44 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 2,
      "severity_level": "Low"
    },
    {
      "title": "Greenlanders brace for summit that could shape the Arctic's future - and their own",
      "description": "US Vice President JD Vance will host Danish and Greenlandic foreign ministers for talks on Wednesday.",
      "url": "https://www.bbc.com/news/articles/cpqyn58v0dxo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 12:14:42 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LA to open ticket draw for 2028 Olympics - with seats starting at $28",
      "description": "If chosen via the draw, fans will be notified via email and will be given a time slot to purchase tickets in April.",
      "url": "https://www.bbc.com/news/articles/c5y47pyp906o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 10:11:45 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Russian doctors arrested after 9 babies die in maternity hospital",
      "description": "The newborns died during the long New Year holiday in a Siberian hospital.",
      "url": "https://www.bbc.com/news/articles/cx2wle7028ko?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 12:20:47 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "K-pop drum duet between Japan and South Korea's leaders caps off summit talks",
      "description": "Leaders of the two East Asian nations played drums to hits from BTS and KPop Demon Hunters.",
      "url": "https://www.bbc.com/news/articles/c0lx49z8ly6o?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 06:57:06 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Claudette Colvin, US civil rights pioneer, dies at 86",
      "description": "Colvin was arrested for refusing to give up her bus seat to a white person months before the famous case of Rosa Parks.",
      "url": "https://www.bbc.com/news/articles/c1dknn00v3eo?at_medium=RSS&at_campaign=rss",
      "published": "Tue, 13 Jan 2026 23:09:09 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Actor Kiefer Sutherland arrested over alleged assault of ride-share driver",
      "description": "Investigators arrested the actor, star of 24 and Designated Survivor, in Hollywood early on Monday morning.",
      "url": "https://www.bbc.com/news/articles/cql40ze5pkpo?at_medium=RSS&at_campaign=rss",
      "published": "Wed, 14 Jan 2026 03:54:50 GMT",
      "source": "BBC News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "LIVE: Senegal vs Egypt – AFCON 2025 semifinal",
      "description": "Follow the build up, analysis and live text commentary of the game for the first Africa Cup of Nations 2025 semifinal.",
      "url": "https://www.aljazeera.com/sports/liveblog/2026/1/14/live-senegal-vs-egypt-afcon-2025-semifinal?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 14:00:00 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Amateur Smith upsets Sinner to win ‘One Point Slam’ before Australian Open",
      "description": "Unknown Jordan Smith upstages a star-studded tennis field including No 1 Jannik Sinner to win a 1-million prize purse.",
      "url": "https://www.aljazeera.com/sports/2026/1/14/amateur-smith-upsets-sinner-to-win-one-point-slam-before-australian-open?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:48:25 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda, Elections & the Internet",
      "description": "Uganda has once again shut down the internet just before the elections.",
      "url": "https://www.aljazeera.com/video/africa-now/2026/1/14/uganda-elections-the-internet?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 12:00:44 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Adelaide Festival removing Palestinian author is an “act of censorship”",
      "description": "“Major institutions in Australia are facing significant pressure to silence Palestinian voices.”",
      "url": "https://www.aljazeera.com/video/quotable/2026/1/14/adelaide-festival-removing-palestinian-author-is-an-act-of?traffic_source=rss",
      "published": "Wed, 14 Jan 2026 11:39:33 +0000",
      "source": "Al Jazeera",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Markets digest bank earnings after recent turmoil",
      "description": "No description available.",
      "url": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
      "published": "Fri, 14 Apr 2023 20:00:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Still haven't filed your taxes? Here's what you need to know",
      "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022.",
      "url": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
      "published": "Fri, 14 Apr 2023 20:07:40 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Analysis: Fox News is about to enter the true No Spin Zone",
      "description": "This is it.",
      "url": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
      "published": "Fri, 14 Apr 2023 06:41:00 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Scientists identify secret ingredient in Leonardo da Vinci paintings",
      "description": "\"Old Masters\" such as Leonardo da Vinci, Sandro Botticelli and Rembrandt may have used proteins, especially egg yolk, in their oil paintings, according to a new study.",
      "url": "https://www.cnn.com/style/article/old-masters-da-vinci-egg-yolk-painting-scn/index.html",
      "published": "Thu, 30 Mar 2023 17:43:18 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'A definitive backslide.' Inside fashion's worrying runway trend",
      "description": "Now that the Fall-Winter 2023 catwalks have been disassembled, it's clear one trend was more pervasive than any collective penchant for ruffles, pleated skirts or tailored coats.",
      "url": "https://www.cnn.com/style/article/fashion-week-fall-winter-2023-size-diversity-skinny-wegovy/index.html",
      "published": "Thu, 06 Apr 2023 20:53:38 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Michael Jordan's 1998 NBA Finals sneakers sell for a record $2.2 million",
      "description": "In 1998, Michael Jordan laced up a pair of his iconic black and red Air Jordan 13s to bring home a Bulls victory during Game 2 of his final NBA championship — and now they are the most expensive sneakers ever to sell at auction. The game-winning sneakers sold for $2.2 million at Sotheby's in New York on Tuesday, smashing the sneaker auction record of $1.47 million, set in 2021 by a pair of Nike Air Ships that Jordan wore earlier in his career.",
      "url": "https://www.cnn.com/style/article/michael-jordan-sneakers-1998-finals-sothebys-auction-record/index.html",
      "published": "Wed, 12 Apr 2023 03:17:57 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Here's the real reason to turn on airplane mode when you fly",
      "description": "We all know the routine by heart: \"Please ensure your seats are in the upright position, tray tables stowed, window shades are up, laptops are stored in the overhead bins and electronic devices are set to flight mode.\"",
      "url": "https://www.cnn.com/travel/article/airplane-mode-reasons-why/index.html",
      "published": "Fri, 07 Apr 2023 12:52:23 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'I was up to my waist down a hippo's throat.' He survived, and here's his advice",
      "description": "Paul Templer was living his best life.",
      "url": "https://www.cnn.com/travel/article/hippo-attack-avoid-survive-paul-templer/index.html",
      "published": "Wed, 12 Apr 2023 12:44:43 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
      "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers.",
      "url": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
      "published": "Fri, 31 Mar 2023 04:25:31 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The most beautiful sections of China's Great Wall",
      "description": "Having lived in Beijing for almost 12 years, I've had plenty of time to travel widely in China.",
      "url": "https://www.cnn.com/travel/article/china-beautiful-great-wall-sections-cmd/index.html",
      "published": "Mon, 18 Sep 2023 02:57:08 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Sign up to our newsletter for a weekly roundup of travel news",
      "description": "No description available.",
      "url": "https://www.cnn.com/specials/travel-newsletter",
      "published": "Fri, 10 Dec 2021 18:58:28 GMT",
      "source": "CNN World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "M 6.4 - 245 km NNW of Tobelo, Indonesia",
      "description": "PAGER - GREEN ShakeMap - VI DYFI? - IV Time 2026-01-10 14:58:23 UTC 2026-01-10 14:58:23 UTC at epicenter Location 3.701°N 126.987°E Depth 31.00 km (19.26 mi)",
      "url": "https://earthquake.usgs.gov/earthquakes/eventpage/us7000rnwd",
      "published": "2026-01-11T15:23:25.372Z",
      "source": "USGS Earthquakes",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Former U.S. ambassador to Denmark talks about Trump's desire to take over Greenland",
      "description": "NPR's A Martinez asks Rufus Gifford, who served as U.S. ambassador to Denmark under the Obama administration, about President Trump's aspirations to take control of Greenland.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5674870/former-u-s-ambassador-to-denmark-talks-about-trumps-desire-to-take-over-greenland",
      "published": "Wed, 14 Jan 2026 04:48:08 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French far-right leader Marine Le Pen's appeal trial begins in Paris",
      "description": "Marine Le Pen, a French far-right leader, was back in court Tuesday to appeal an embezzlement conviction that could put her political ambitions at risk.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5676142/french-far-right-leader-marine-le-pens-appeal-trial-begins-in-paris",
      "published": "Wed, 14 Jan 2026 04:47:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A construction crane falls onto a moving train in Thailand, killing at least 30 people",
      "description": "The derailment, in northeastern Thailand, occurred on part of an ambitious planned high-speed rail project that will eventually connect China with much of Southeast Asia.",
      "url": "https://www.npr.org/2026/01/14/g-s1-105943/construction-crane-falls-onto-moving-train-thailand",
      "published": "Wed, 14 Jan 2026 02:57:35 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China's trade surplus surges 20% to a record $1.2 trillion, even with Trump's tariffs",
      "description": "China's trade surplus surged to a record of almost $1.2 trillion in 2025, the government said Wednesday, as exports to other countries made up for slowing shipments to the U.S. under President Donald Trump's onslaught of higher tariffs.",
      "url": "https://www.npr.org/2026/01/14/nx-s1-5677029/chinas-trade-surplus-surges-1-2-trillion-trump-tariffs",
      "published": "Wed, 14 Jan 2026 02:12:52 -0500",
      "source": "NPR World News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ukraine: Anti-corruption agencies target former PM",
      "description": "Ukraine's anti-corruption agency said it notified a party leader of its suspicion of offering bribes to politicians. It did not name them, but the blurred images it published clearly showed former PM Yulia Tymoshenko.",
      "url": "https://www.dw.com/en/ukraine-anti-corruption-agencies-target-former-pm/a-75502973?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 13:38:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Germany news: Reservist union head wants troops in Greenland",
      "description": "The president of the German Armed Forces' reservists says European troops should be sent to Greenland to block a US takeover of the territory. Meanwhile, heating bills are set to soar amid a harsh winter. DW has more.",
      "url": "https://www.dw.com/en/germany-news-reservist-union-head-wants-troops-in-greenland/live-75499952?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 10:01:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "US civil rights icon Claudette Colvin dies, aged 86",
      "description": "Claudette Colvin's refusal to give up her seat on a segregated bus in Alabama in 1955 was a key moment in the US civil rights movement. \"History had me glued to that seat,\" she later said.",
      "url": "https://www.dw.com/en/us-civil-rights-icon-claudette-colvin-dies-aged-86/a-75497632?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 06:29:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "China logs record trade surplus in 2025 amid Trump tariffs",
      "description": "China's trade has reached a \"new historical high\" in 2025 and Beijing plans to 'open more' in 2026 as Trump's tariffs force producers to push their products in alternative markets.",
      "url": "https://www.dw.com/en/china-logs-record-trade-surplus-in-2025-amid-trump-tariffs/a-75497456?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Wed, 14 Jan 2026 05:30:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Should EU leaders sit on Trump's 'Board of Peace' for Gaza?",
      "description": "The next phase of the US-sponsored Gaza peace plan involves setting up a \"Board of Peace.\" Trump wants to chair it and, even though it's been heavily criticized, Europeans also want a seat.",
      "url": "https://www.dw.com/en/should-eu-leaders-sit-on-trump-s-board-of-peace-for-gaza/a-75495127?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 20:28:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda: Crackdown, internet blackout ahead of vote",
      "description": "Uganda's authorities have shut down rights groups, arrested opponents and their supporters, now they've turned off the internet. After 40 years in office, President Yoweri Museveni has no intention of stepping down now.",
      "url": "https://www.dw.com/en/uganda-crackdown-internet-blackout-ahead-of-vote/a-75495205?maca=en-rss-en-all-1573-xml-mrss",
      "published": "Tue, 13 Jan 2026 17:42:00 GMT",
      "source": "Deutsche Welle",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "French bistros and cafés: Should they get UNESCO intangible heritage status?",
      "description": "In this edition of Entre Nous we dive into the bid to make France's bistros and cafés part of UNESCO's intangible cultural heritage list. We discuss how the bistrot got its name and how they are different from brasseries, bouillons and restaurants. We also discuss how alcohol consumption and wine's powerful lobby in France may represent a weakness for the bid, but also why these gathering places are needed more than ever.",
      "url": "https://www.france24.com/en/tv-shows/entre-nous/20260114-french-bistros-and-caf%C3%A9s-should-they-get-unesco-intangible-heritage-status",
      "published": "Wed, 14 Jan 2026 14:33:10 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "'Best African players': Morocco's coach expects spectacular AFCON semis",
      "description": "With Morocco, Senegal, Egypt and Nigeria in the Africa Cup of Nations semifinals, Morocco's coach Walid Regragui expects a gripping end to the tournament as all four teams are capable of winning the title.",
      "url": "https://www.france24.com/en/sport/20260114-best-african-players-morocco-s-coach-expects-spectacular-afcon-semis",
      "published": "Wed, 14 Jan 2026 11:07:25 GMT",
      "source": "France24",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Arrests after nine newborn babies die at the same hospital in early January",
      "description": "Two senior doctors at a hospital in southern Russia have been arrested after nine newborn babies died in just a few days earlier this month, investigators have said.",
      "url": "https://news.sky.com/story/russia-arrests-after-nine-newborn-babies-die-at-hospital-in-novokuznetsk-in-early-january-13494151",
      "published": "Wed, 14 Jan 2026 10:48:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Uganda's pop star politician aiming to end president's 40 years in power",
      "description": "Voters in Uganda face soldiers in the street as they prepare to go to the polls in an election that could see President Yoweri Museveni extend his decades in power.",
      "url": "https://news.sky.com/story/bobi-wine-ugandas-pop-star-politician-aiming-to-end-presidents-40-years-in-power-13494105",
      "published": "Wed, 14 Jan 2026 09:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Actor Kiefer Sutherland arrested after allegedly assaulting lift share driver",
      "description": "Actor Kiefer Sutherland has been arrested after allegedly assaulting a ride-share driver in Los Angeles, police said.",
      "url": "https://news.sky.com/story/emmy-award-winner-kiefer-sutherland-of-24-and-designated-survivor-fame-arrested-after-allegedly-assaulting-lift-share-driver-13494102",
      "published": "Wed, 14 Jan 2026 09:08:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Finishing touches being made to key part of &#163;3m Diana memorial revamp",
      "description": "A key part of the £3m revamp of Princess Diana's memorial playground is nearing completion in Germany.",
      "url": "https://news.sky.com/story/finishing-touches-being-made-to-key-part-of-1633m-diana-memorial-revamp-in-germany-13494157",
      "published": "Wed, 14 Jan 2026 11:17:00 +0000",
      "source": "Sky News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "EU targets Ukraine's military needs with massive new loan program plus billions in budget support",
      "description": "The European Union plans to allocate most of a new loan program to Ukraine's military needs over the next two years",
      "url": "https://abcnews.go.com/International/wireStory/eu-targets-ukraines-military-massive-new-loan-program-129199681",
      "published": "Wed, 14 Jan 2026 08:50:00 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Canadian Prime Minister Mark Carney arrives in Beijing for a landmark four-day visit to China",
      "description": "Canadian Prime Minister Mark Carney arrives in Beijing for a landmark four-day visit to China",
      "url": "https://abcnews.go.com/International/wireStory/canadian-prime-minister-mark-carney-arrives-beijing-landmark-129198253",
      "published": "Wed, 14 Jan 2026 08:17:55 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "France bans British far-right activists targeting migrant boats",
      "description": "Ten members of a British far-right group have been banned from entering France where they have been accused of destroying small boats used by migrants trying to reach the UK",
      "url": "https://abcnews.go.com/International/wireStory/france-bans-british-activists-targeting-migrant-boats-129196155",
      "published": "Wed, 14 Jan 2026 07:14:06 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japan's Takaichi plans to dissolve lower house to set up an early snap election",
      "description": "Japan's Prime Minister Sanae Takaichi plans to dissolve the lower house of Parliament soon for a snap election to seek the public's mandate for her policies",
      "url": "https://abcnews.go.com/International/wireStory/japans-takaichi-plans-dissolve-lower-house-set-early-129195029",
      "published": "Wed, 14 Jan 2026 08:01:37 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "The UK is watering down plans for mandatory digital ID cards after a backlash",
      "description": "The British government has scaled back plans for mandatory digital ID cards, initially proposed as a way of helping control immigration",
      "url": "https://abcnews.go.com/International/wireStory/uk-watering-plans-mandatory-digital-id-cards-after-129194786",
      "published": "Wed, 14 Jan 2026 04:31:09 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Serbians mark Orthodox Christian New Year according to old tradition",
      "description": "Nearly two weeks after celebrating New Year, many Serbians did it again on Tuesday evening, this time according to old Orthodox Christian tradition",
      "url": "https://abcnews.go.com/International/wireStory/serbians-mark-orthodox-christian-new-year-tradition-129194533",
      "published": "Wed, 14 Jan 2026 04:09:42 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Ugandan voters face soldiers in the street and internet shutdown before election",
      "description": "Ugandans are set to vote in an election for president and other leaders",
      "url": "https://abcnews.go.com/International/wireStory/ugandan-voters-face-soldiers-street-internet-shutdown-presidential-129193873",
      "published": "Wed, 14 Jan 2026 03:46:01 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "A construction crane falls on a passenger train in northeastern Thailand, killing at least 12 people",
      "description": "A construction crane has fallen on a passenger train in northeastern Thailand, killing at least 12 people",
      "url": "https://abcnews.go.com/International/wireStory/construction-crane-falls-passenger-train-northeastern-thailand-killing-129191335",
      "published": "Wed, 14 Jan 2026 01:06:07 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Construction crane falls on passenger train, kills 4",
      "description": "A construction crane falls on a passenger train in northeastern Thailand, killing at least 4",
      "url": "https://abcnews.go.com/International/wireStory/construction-crane-falls-passenger-train-northeastern-thailand-killing-129190943",
      "published": "Tue, 13 Jan 2026 23:48:18 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Japanese and South Korean leaders jam to K-pop hits at a summit",
      "description": "The Japanese and South Korean leaders agreed to deepen cooperation between their countries before they let loose with their own surprise cultural exchange in a surprise jam session drumming to K-pop hits",
      "url": "https://abcnews.go.com/International/wireStory/japanese-south-korean-leaders-jam-pop-hits-summit-129191298",
      "published": "Wed, 14 Jan 2026 01:05:41 -0500",
      "source": "ABC News International",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Amidst uncertainty, a helpline in Pakistan becomes a lifeline for Afghans",
      "description": "They ask heartbreaking questions: “What will happen to us?” “Is it true they will deport us?” “We don’t want to go back. How can I live in Afghanistan?” The words of Sumaiya, who staffs a helpline for refugees and asylum-seekers living in Pakistan but facing the eventuality of having to return to neighbouring Afghanistan.",
      "url": "https://news.un.org/feed/view/en/story/2026/01/1166741",
      "published": "Sat, 10 Jan 2026 12:00:00 +0000",
      "source": "UN News",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Supreme Court pins trans athlete's lawyer who won't define 'girl' and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/supreme-court-pins-trans-athletes-lawyer-who-wont-define-girl-more-top-headlines",
      "published": "Wed, 14 Jan 2026 07:20:09 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "SEE IT: Police guard Chicago home of surgeon ex charged in Ohio dentist double murder",
      "description": "Neighbor shocked to discover Ohio murder suspect lived floors away in luxury Chicago building. Michael McKee accused of killing dentist Spencer Tepe and wife, Monique Tepe.",
      "url": "https://www.foxnews.com/us/see-it-police-guard-chicago-home-surgeon-ex-charged-ohio-dentist-double-murder",
      "published": "Wed, 14 Jan 2026 06:00:15 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Family 'quickly believed' surgeon ex was involved in Ohio dentist couple's murder as co-worker details mishaps",
      "description": "Ex-husband of Ohio dentist allegedly kills her and new spouse in Columbus. Michael McKee charged with premeditated murder of Monique and Spencer Tepe.",
      "url": "https://www.foxnews.com/us/family-quickly-believed-surgeon-ex-was-involved-ohio-dentist-couples-murder-co-worker-details-mishaps",
      "published": "Tue, 13 Jan 2026 16:13:33 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Mississippi synagogue arson suspect's dad turns him in after laughing confession, FBI says",
      "description": "A man accused of a Mississippi synagogue arson confessed to his father, saying he \"finally got them,\" the FBI said. Stephen Pittman faces charges.",
      "url": "https://www.foxnews.com/us/mississippi-synagogue-arson-suspects-dad-turns-him-after-laughing-confession-fbi-says",
      "published": "Tue, 13 Jan 2026 07:32:52 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Supreme Court hears arguments over trans athletes in girls' sports and more top headlines",
      "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
      "url": "https://www.foxnews.com/us/supreme-court-hears-arguments-over-trans-athletes-girls-sports-more-top-headlines",
      "published": "Tue, 13 Jan 2026 07:19:01 -0500",
      "source": "Fox News US",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Some US military personnel told to leave Middle East bases, US official confirms",
      "description": "The U.S. has ordered some of its military personnel to depart from bases in the Middle East on Tuesday as tensions with Iran escalate.",
      "url": "https://www.foxnews.com/world/some-us-military-personnel-told-leave-middle-east-bases-us-official-confirms",
      "published": "Wed, 14 Jan 2026 09:31:59 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    },
    {
      "title": "Passengers baffled and confused after screams burst from beneath taxiing Air Canada plane",
      "description": "Passengers aboard a taxiing Air Canada flight were left shaken after muffled screams and banging were suddenly heard from beneath the cabin.",
      "url": "https://www.foxnews.com/world/passengers-baffled-confused-screams-burst-taxiing-air-canada-plane",
      "published": "Tue, 13 Jan 2026 22:03:13 -0500",
      "source": "Fox News World",
      "type": "rss",
      "severity_score": 1,
      "severity_level": "Low"
    }
  ]
}